{
  "word": "worm",
  "etymologies": [
    {
      "description": [
        "From Middle English worm, werm, wurm, wirm, from Old English wyrm (“worm, snake”), from Proto-Germanic *wurmiz, from Proto-Indo-European *wr̥mis, possibly from *wer- (“to turn”). Cognate with Dutch worm, West Frisian wjirm, German Wurm, Danish orm, Norwegian orm. Indo-European cognates include Latin vermis (“worm”), Lithuanian var̃mas (“insect, midge”), Albanian rrime (“rainworm”), Ancient Greek ῥόμος (rhómos, “woodworm”). First computer usage by John Brunner in his 1975 book The Shockwave Rider.",
        "Doublet of wyrm, which is a fairly recent borrowing directly from the Old English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "worm (plural worms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A generally tubular invertebrate of the annelid phylum; an earthworm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More loosely, any of various tubular invertebrates resembling annelids but not closely related to them, such as velvet worms, acorn worms, flatworms, or roundworms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A type of wingless \"dragon\", especially a gigantic sea serpent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy, science fiction) Either a mythical \"dragon\" (especially wingless), a gigantic sea serpent, or a creature that resembles a Mongolian death worm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contemptible or devious being.",
                  "examples": [
                    "Don't try to run away, you little worm!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A self-replicating program that propagates through a network.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A graphical representation of the total runs scored in an innings.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Anything helical, especially the thread of a screw.",
              "entries": [
                {
                  "meaning": "A spiral instrument or screw, often like a double corkscrew, used for drawing balls from firearms.",
                  "examples": []
                },
                {
                  "meaning": "The spiral wire of a corkscrew.",
                  "examples": []
                },
                {
                  "meaning": "(anatomy) A muscular band in the tongue of some animals, such as dogs; the lytta.",
                  "examples": []
                },
                {
                  "meaning": "The condensing tube of a still, often curved and wound to save space.",
                  "examples": []
                },
                {
                  "meaning": "A short revolving screw whose threads drive, or are driven by, a worm wheel or rack by gearing into its teeth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any creeping or crawling animal, such as a snake, snail, or caterpillar.",
                  "examples": [
                    "And when Paul had gathered a nomber of stickes, & laid them on the fyre, there came a viper out of the heat, and leapt on his hand. Now when the Barbarians sawe the worme hang on his hand, they said among them selues This man surely is a murtherer, whome, thogh he hathe escaped the sea, yet Vengeance hathe not suffred to liue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An internal tormentor; something that gnaws or afflicts one’s mind with remorse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A strip of linked tiles sharing parallel edges in a tiling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The lytta.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by definite article) A dance, or dance move, in which the dancer lies on the floor and undulates the body horizontally thereby moving forwards.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "worm (third-person singular simple present worms, present participle worming, simple past and past participle wormed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (one's way) with a crawling motion.",
                  "examples": [
                    "We wormed our way through the underbrush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with one's body dragging the ground.",
                  "examples": [
                    "Inch by inch I wormed along the secret passageway, flat to the ground, not once raising my head, hardly daring to pull a full breath […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To work one's way by artful or devious means.",
                  "examples": [
                    "When debates and fretting jealousy / Did worm and work within you more and more, / Your colour faded."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To work (one's way or oneself) (into) gradually or slowly; to insinuate.",
                  "examples": [
                    "He wormed his way into the organization."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often followed by out) To effect, remove, drive, draw, or the like, by slow and secret means.",
                  "examples": [
                    "They  […] find themselves wormed out of all power."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, in “worm out of”) To drag out of, to get information that someone is reluctant or unwilling to give (through artful or devious means or by pleading or asking repeatedly).",
                  "examples": [
                    "He nodded. \"Mum's the word, Mrs. Bunting! It'll all be in the last editions of the evening newspapers—it can't be kep' out. There'd be too much of a row if twas!\"  \"Are you going off to that public-house now?\" she asked.  \"I've got a awk'ard job—to try and worm something out of the barmaid.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To fill in the contlines of (a rope) before parcelling and serving.",
                  "examples": [
                    "Worm and parcel with the lay; turn and serve the other way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deworm (an animal).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut the worm, or lytta, from under the tongue of (a dog, etc.) for the purpose of checking a disposition to gnaw, and formerly supposed to guard against canine madness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean by means of a worm; to draw a wad or cartridge from, as a firearm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}