{
  "word": "comb",
  "etymologies": [
    {
      "description": [
        "From Middle English comb, from Old English camb (“comb”), from Proto-West Germanic *kamb, from Proto-Germanic *kambaz (“comb”), from Proto-Indo-European *ǵómbʰos (“tooth”). The verb is derived from the noun and displaced the older verb kemb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "comb (plural combs)",
          "definitionGroups": [
            {
              "group": "A toothed implement:",
              "entries": [
                {
                  "meaning": "A toothed implement for grooming the hair or (formerly) for keeping it in place.",
                  "examples": []
                },
                {
                  "meaning": "A machine used in separating choice cotton fibers from worsted cloth fibers.",
                  "examples": []
                },
                {
                  "meaning": "The toothed plate at the top and bottom of an escalator that prevents objects getting trapped between the moving stairs and fixed landings.",
                  "examples": []
                },
                {
                  "meaning": "A toothed tool used for chasing screws on work in a lathe; a chaser.",
                  "examples": []
                },
                {
                  "meaning": "The notched scale of a wire micrometer.",
                  "examples": []
                },
                {
                  "meaning": "The collector of an electrical machine, usually resembling a comb.",
                  "examples": []
                },
                {
                  "meaning": "A toothed plate used for creating wells in agar gels for electrophoresis.",
                  "examples": []
                },
                {
                  "meaning": "(weaving) A toothed wooden pick used to push the weft thread tightly against the previous pass of thread to create a tight weave.",
                  "examples": []
                },
                {
                  "meaning": "One of a pair of peculiar organs on the base of the abdomen in scorpions, with which they comb substrate.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A crest:",
              "entries": [
                {
                  "meaning": "A fleshy growth on the top of the head of some birds and reptiles; crest.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A crest (of metal, leather, etc) on a piece of armor, especially on a helmet.",
                  "examples": [
                    "The head-dress of the Horse Grenadiers consists of a peculiar leather helmet with a comb of bear's skin passing over it from ear to ear and a long scarlet  […]"
                  ]
                },
                {
                  "meaning": "The top part of a gun’s stock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure of hexagon cells made by bees for storing honey; honeycomb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The main body of a harmonica containing the air chambers and to which the reed plates are attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A former, commonly cone-shaped, used in hat manufacturing for hardening soft fibre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An old English measure of corn equal to the half quarter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The curling crest of a wave; a comber.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(algebraic geometry) A connected and reduced curve with irreducible components consisting of a smooth subcurve (called the handle) and one or more additional irreducible components (called teeth) that each intersect the handle in a single point that is unequal to the unique point of intersection for any of the other teeth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cornwall, mining, obsolete) A kind of vertical plate in a lode.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "comb (third-person singular simple present combs, present participle combing, simple past and past participle combed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, especially of hair or fur) To groom with a toothed implement, especially a comb.",
                  "examples": [
                    "I need to comb my hair before we leave the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate choice cotton fibers from worsted cloth fibers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To search thoroughly as if raking over an area with a comb.",
                  "examples": [
                    "Police combed the field for evidence after the assault."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, intransitive) To roll over, as the top or crest of a wave; to break with a white foam, as waves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(naval, transitive) To turn a vessel parallel to (the track of) (a torpedo) so as to reduce one's size as a target.",
                  "examples": [
                    "The aircraft split up so as to attack from different, preselected bearings, thus confusing the gunners and making it difficult for the ship to comb torpedo tracks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From combination."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "comb (plural combs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Abbreviation of combination..",
                  "examples": [
                    "Synonym: combo"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "comb (plural combs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of combe",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}