{
  "word": "grudge",
  "etymologies": [
    {
      "description": [
        "A variant of grutch (mid 15th-century, younger than begrudge), from Middle English grucchen (“to murmur, complain, feel envy, begrudge”), from Old French grouchier, groucier (“to murmur, grumble”), of Germanic origin, probably ultimately imitative.",
        "Akin to Middle High German grogezen (“to howl, wail”), German grocken (“to croak”). Compare also Old Norse krytja (“to murmur”), Old High German grunzen (“to grunt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grudge (plural grudges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Deep-seated and/or long-term animosity or ill will about something or someone, especially due to a past misdeed or mistreatment.",
                  "examples": [
                    "to have, hold, or bear a grudge against someone"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grudge (third-person singular simple present grudges, present participle grudging, simple past and past participle grudged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be unwilling to give or allow (someone something). [from 16th c.]",
                  "examples": [
                    "Wee shall finde our whole life so necessarily ioyned  with sorrow, that we ought rather delight (and take pleasure) in Gods louing chastisements, and admonitions, then any way murmure and grudge at our crosses, or tribulations :"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To grumble, complain; to be dissatisfied. [15th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To hold or harbour with malicious disposition or purpose; to cherish enviously.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}