{
  "word": "presentment",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman presentment, presentement, Middle French presentement, corresponding to present +‎ -ment."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "presentment (countable and uncountable, plural presentments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A statement made on oath by a jury. [from 15th c.]",
                  "examples": [
                    "In 1771, a grand jury presentment in Georgia revealed that \"Slaves are permitted to rent houses [...].\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The notice taken by a grand jury of any offence from their own knowledge or observation, without any bill of indictment laid before them.",
                  "examples": [
                    "the presentment of a nuisance, a libel, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical law) A formal complaint submitted to a bishop or archdeacon. [from 16th c.]",
                  "examples": [
                    "He recognised that there was general resentment of the oppressive conduct of the Forest officers, and made provision for regular inquiries into it, and for presentment of Forest offences to be made at the attachment courts, as a procedure preliminary to the Forest Eyre."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of presenting something for acceptance; now specifically, presenting something (e.g. a bill or cheque) for payment. [from 16th c.]",
                  "examples": [
                    "When online bill presentment, which removes all the paperwork, becomes widespread, says McKinsey's Stephenson, online banking will be far more compelling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) An artistic representation; a picture. [from 16th c.]",
                  "examples": [
                    "Noted among the who's-who in portraiture: Hopkinson's Secretary Hughes, Childe Hassam's Governor Alfred E. Smith, of New York, Edmund C. Tarbell's Mary at the Harpsichord, Lillian Westcott Hale's child portrait study of Brothers, Frank Benson's Girl in Blue Jacket, and Marion Boyd Allen's presentment of Anna Vaughn Hyatt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Presentation of a performance, as of a play or work of music. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The aspect or form in which something presents itself; appearance. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The official notice (formerly required to be given in court) of the surrender of a copyhold estate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}