{
  "word": "reservation",
  "etymologies": [
    {
      "description": [
        "From Middle French reservation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reservation (countable and uncountable, plural reservations)",
          "definitionGroups": [
            {
              "group": "The act of reserving, withholding or keeping back.",
              "entries": [
                {
                  "meaning": "The practice of reserving part of the consecrated bread of the Eucharist for the communion of the sick.",
                  "examples": []
                },
                {
                  "meaning": "The act of the pope to reserve to himself the right to nominate to certain benefices.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is withheld or kept back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) A limiting qualification regarding certainty; a doubt.",
                  "examples": [
                    "I have reservations about your intentions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A tract of land set apart by the US government for the use of a Native American people; Indian reservation (compare Canadian reserve).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An arrangement by which accommodation or transport arrangements are secured in advance.",
                  "examples": [
                    "I have a hotel reservation in the name of Mr Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) The area which separates opposing lanes of traffic on a divided motorway or dual carriageway; see also central reservation.",
                  "examples": [
                    "A vehicle crashed through the central reservation into the path of oncoming traffic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) The setting aside of a certain percentage of vacancies in government institutions for members of backward and underrepresented communities (defined primarily by caste and tribe).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, politics) A power of an overseeing authority to suspend legislation in the jurisdiction being overseen pending the approval of a higher authority. Such as a provincial/state governor reserving a bill passed by the state/provincial legislature from assent, pending approval of the federal government; or a federal bill passed by federal parliament being reserved by the viceroy pending approval by the crown.",
                  "examples": [
                    "Coordinate term: disallowance"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}