{
  "word": "infinite",
  "etymologies": [
    {
      "description": [
        "From Middle English infinite, from Old French infinit and Latin infīnītus, from in- (“not”) + fīnis (“end”) + the perfect passive participle ending -itus. Displaced native Old English unġeendodlīċ."
      ],
      "adjectives": [
        {
          "description": "infinite (comparative more infinite, superlative most infinite)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indefinably large, countlessly great; immense. [from 14th c.]",
                  "examples": [
                    "Whatever is finite, as finite, will admit of no comparative relation with infinity; for whatever is less than infinite is still infinitely distant from infinity; and lower than infinite distance the lowest or least cannot sink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Boundless, endless, without end or limits; innumerable. [from 15th c.]",
                  "examples": [
                    "Great is our Lord, and of great power; his understanding is infinite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with plural noun) Infinitely many. [from 15th c.]",
                  "examples": [
                    "Huxley's theory says that if you provide infinite monkeys with infinite typewriters, some monkey somewhere will eventually create a masterpiece – a play by Shakespeare, a Platonic dialogue, or an economic treatise by Adam Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Greater than any positive quantity or magnitude; limitless. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory, of a set) Having infinitely many elements.",
                  "examples": [
                    "For any infinite set, there is a 1-1 correspondence between it and at least one of its proper subsets. For example, there is a 1-1 correspondence between the set of natural numbers and the set of squares of natural numbers, which is a proper subset of the set of natural numbers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Not limited by person or number. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Capable of endless repetition; said of certain forms of the canon, also called perpetual fugues, constructed so that their ends lead to their beginnings.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "infinite (plural infinites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is infinite in nature.",
                  "examples": [
                    "Cautiously, Hobbes avoided asserting the equality of these infinites, and explicitly characterized the relation between them as non-inequality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A combo that can be used repeatedly without interruption.",
                  "examples": [
                    "[…]  prevents overpowered combos and infinites  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}