{
  "word": "planet",
  "etymologies": [
    {
      "description": [
        "From Middle English planete, from Old French planete, from Latin planeta, planetes, from Ancient Greek πλανήτης (planḗtēs, “wanderer”) (ellipsis of πλάνητες ἀστέρες (plánētes astéres, “wandering stars”).), from Ancient Greek πλανάω (planáō, “wander about, stray”), of unknown origin. Cognate with Latin pālor (“wander about, stray”), Old Norse flana (“to rush about”), and Norwegian flanta (“to wander about”). More at flaunt.",
        "Perhaps it is from a nasalized form of Proto-Indo-European *pleh₂- (“flat, broad”) on the notion of \"spread out\", \"but the semantics are highly problematic\", according to Beekes, who notes the similarity of meaning to πλάζω (plázō, “to make devious, repel, dissuade from the right path, bewilder”), but adds, \"it is hard to think of a formal connection\".",
        "So called because they have apparent motion, unlike the \"fixed\" stars. Originally including also the moon and sun but not the Earth; modern scientific sense of \"world that orbits a star\" is from 1630s in English. The Greek word is an enlarged form of πλάνης (plánēs, “who wanders around, wanderer”), also \"wandering star, planet\", in medicine \"unstable temperature.\""
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "planet (plural planets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical or astrology) Each of the seven major bodies which move relative to the fixed stars in the night sky—the Moon, Mercury, Venus, the Sun, Mars, Jupiter and Saturn. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A body which is massive enough to be in hydrostatic equilibrium (generally resulting in being an ellipsoid) but not enough to attain nuclear fusion and, in IAU usage, which directly orbits a star (or star cluster) and dominates the region of its orbit; specifically, in the case of the Solar system, the eight major bodies of Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. [from 2006]",
                  "examples": [
                    "Synonyms: wandering star, wanderstar",
                    "Hypernym: planemo (in IAU usage)",
                    "Hyponyms: binary planet, Blue Planet, carbide planet, carbon planet, classical planet, diamond planet, double planet, dual planet, dwarf planet (in non-IAU usage), exoplanet, extrasolar planet, free-floating planet (in non-IAU usage), gas giant, giant planet, hycean planet, ice giant, inferior planet, inner planet, interstellar planet (in non-IAU usage), major planet, mesoplanet, minor planet (in non-IAU usage), outer planet, Planet Earth, primary planet (in non-IAU usage), Red Planet, rogue planet (in non-IAU usage), satellite planet (in non-IAU usage), silicate planet, silicon planet, supergiant planet, superior planet, superplanet, terrestrial planet, water planet",
                    "Coordinate terms: brown dwarf, sub-brown dwarf"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "construed with the or this: synonym of Earth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}