{
  "word": "shuttle",
  "etymologies": [
    {
      "description": [
        "From a merger of two words:",
        "The name for a loom weaving instrument, recorded from 1338, is from a sense of being \"shot\" across the threads. The back-and-forth imagery inspired the extension to \"passenger trains\" in 1895, aircraft in 1942, and spacecraft in 1969, as well as older terms such as shuttlecock."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shuttle (plural shuttles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) A tool used to carry the woof back and forth between the warp threads on a loom.",
                  "examples": [
                    "Like shuttles through the loom, so swiftly glide",
                    "My feather'd hours, and all my hopes deride!."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sliding thread holder in a sewing machine, which carries the lower thread through a loop of the upper thread, to make a lock stitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A transport service (such as a bus or train) that goes back and forth between two or more places.",
                  "examples": [
                    "The shuttle bus runs to the airport on a half-hourly basis form the central station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such a transport vehicle; a shuttle bus; a space shuttle.",
                  "examples": [
                    "You're saying we take the parking shuttles, reinforce them with aluminum siding and then head to the gun store where our friend Andy plays some cowboy-movie, jump-on-the-wagon bullshit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any other item that moves repeatedly back and forth between two positions, possibly transporting something else with it between those points (such as, in chemistry, a molecular shuttle).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shuttlecock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shutter, as for a channel for molten metal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shuttle (third-person singular simple present shuttles, present participle shuttling, simple past and past participle shuttled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go back and forth between two places.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport by shuttle or by means of a shuttle service.",
                  "examples": [
                    "Synonym: chauffeur",
                    "Guests can be shuttled to a from the hotel for no extra cost."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}