{
  "word": "attack",
  "etymologies": [
    {
      "description": [
        "Borrowed from French attaque, derived from the verb attaquer, from Italian attaccare (“to join, attach”) (used in attaccare battaglia (“to join battle”)), from Frankish *stakka (“stick”). Doublet of attach. Displaced native Old English on rǣsan (“to attack”) and onrǣs (“an attack”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "attack (plural attacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attempt to cause damage, injury to, or death of opponent or enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attempt to detract from the worth or credibility of, a person, position, idea, object, or thing, by physical, verbal, emotional, or other assault.",
                  "examples": [
                    "They claimed the censorship of the article was an attack on free speech."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A time in which one attacks; the offence of a battle.",
                  "examples": [
                    "The army timed their attack to coincide with the local celebrations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, by extension) The beginning of active operations on anything.",
                  "examples": [
                    "Having washed the plates from dinner, I made an attack on the laundry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An attempt to exploit a vulnerability in a computer system.",
                  "examples": [
                    "birthday attack; denial-of-service attack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) Collectively, the bowlers of a cricket side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) Any contact with the ball other than a serve or block which sends the ball across the plane of the net.",
                  "examples": [
                    "Synonyms: hit, spike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lacrosse) The three attackmen on the field or all the attackmen of a team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The sudden onset of a disease or condition.",
                  "examples": [
                    "I've had an attack of the flu."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An active episode of a chronic or recurrent disease.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The onset of a musical note, particularly with respect to the strength (and duration) of that onset.",
                  "examples": [
                    "Antonyms: decay, release"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(audio) The amount of time it takes for the volume of an audio signal to go from zero to maximum level (e.g. an audio waveform representing a snare drum hit would feature a very fast attack, whereas that of a wave washing to shore would feature a slow attack).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "attack (third-person singular simple present attacks, present participle attacking, simple past and past participle attacked or (obsolete) attackt or (obsolete, dialectal) attackted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply violent force to someone or something.",
                  "examples": [
                    "This species of snake will only attack humans if it feels threatened."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To aggressively challenge a person, idea, etc., with words (particularly in newspaper headlines, because it typesets into less space than \"criticize\" or similar).",
                  "examples": [
                    "She published an article attacking the recent pay cuts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To begin to affect; to act upon injuriously or destructively; to begin to decompose or waste.",
                  "examples": [
                    "Hydrofluoric acid  […]  attacks the glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deal with something in a direct way; to set to work upon.",
                  "examples": [
                    "We’ll have dinner before we attack the biology homework.",
                    "I attacked the meal with a hearty appetite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cricket) To aim balls at the batsman’s wicket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket) To set a field, or bowl in a manner designed to get wickets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket) To bat aggressively, so as to score runs quickly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) To move forward in an active attempt to score a point, as opposed to trying not to concede.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) To accelerate quickly in an attempt to get ahead of the other riders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) (Of a chemical species) To approach a chemical species or bond in order to form a bond with it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}