{
  "word": "staff",
  "etymologies": [
    {
      "description": [
        "From Middle English staf, from Old English stæf, from Proto-West Germanic *stab, from Proto-Germanic *stabaz. Cognate with Dutch staf, German Stab, Swedish stav.",
        "Sense of \"group of military officers that assists a commander\" and similar meanings, attested from 1702, is influenced by or is even from German Stab."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "staff (countable and uncountable, plural staffs or staves or staff)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural staffs or staves) A long, straight, thick wooden rod or stick, especially one used to assist in walking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, plural staffs or staves) A series of horizontal lines on which musical notes are written; a stave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural staff or staffs) The employees of a business.",
                  "examples": [
                    "The company employed 10 new members of staff this month.",
                    "The company has taken on 1600 more highly-paid staff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A mixture of plaster and fibre used as a temporary exterior wall covering.W",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pole, stick, or wand borne as an ensign of authority; a badge of office.",
                  "examples": [
                    "a constable's staff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pole upon which a flag is supported and displayed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The rung of a ladder.",
                  "examples": [
                    "I ascend at one [ladder] of six hundred and thirty-nine staves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series of verses so disposed that, when it is concluded, the same order begins again; a stanza; a stave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) An arbor, as of a wheel or a pinion of a watch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surgery) The grooved director for the gorget, or knife, used in cutting for stone in the bladder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An establishment of officers in various departments attached to an army, to a section of an army, or to the commander of an army. The general's staff consists of those officers about his person who are employed in carrying his commands into execution.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, archaic) A form of token once used, in combination with a ticket, for safe train movements between two points on a single line.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "staff (third-person singular simple present staffs, present participle staffing, simple past and past participle staffed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply (a business, volunteer organization, etc.) with employees or staff members.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "staff",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of staph.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}