{
  "word": "straddle",
  "etymologies": [
    {
      "description": [
        "As a verb, attested since the 1560s. Most likely, an alteration of dialectal striddle. The noun is first attested in the 1610s."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "straddle (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Astride.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "straddle (plural straddles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A posture in which one straddles something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A pair or salvo of successive artillery shots falling both in front of and behind a target.",
                  "examples": [
                    "The first salvo fell short; the next was long; the third was a straddle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An investment strategy involving simultaneous trade with put and call options on the same security at the same strike price, giving a non-directional position sensitive to volatility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) A voluntary raise made prior to receiving cards by the first player after the blinds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A vertical mine-timber supporting a set.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "straddle (third-person singular simple present straddles, present participle straddling, simple past and past participle straddled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sit or stand with a leg on each side of something; to sit astride.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be on both sides of something; to have parts that are in different places, regions, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consider or favor two apparently opposite sides; to be noncommittal.",
                  "examples": [
                    "Wanting to please both sides, he straddled the issue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form a disorderly sprawl; to spread out irregularly.",
                  "examples": [
                    "This weed straddles the entire garden.",
                    "Conservation and Management of Straddling Fish Stocks and Highly Migratory Fish Stocks"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To fire successive artillery shots in front of and behind of a target, especially in order to determine its range (the term \"bracket\" is often used instead).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) To place a voluntary raise prior to receiving cards (only by the first player after the blinds).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stand with the ends staggered; said of the spokes of a wagon wheel where they join the hub.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economy) To execute a commodities market spread.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}