{
  "word": "endorse",
  "etymologies": [
    {
      "description": [
        "Alteration influenced by Medieval Latin indorsare of Middle English endosse, from Old French endosser (“to put on back”), from Latin dossum, alternative form of dorsum (“back”), from which also dorsal (“of the back”). That is, the ‘r’ was dropped in Latin dossum, which developed into Old French and then Middle English endosse, and then the ‘r’ was re-introduced into English via the Medieval Latin indorsare, which had retained the ‘r’. Note that the alternative spelling indorse also uses the initial ‘i’ from Latin (in-, rather than en-), but this form is now rare."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "endorse (plural endorses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A diminutive of the pale, usually appearing in pairs on either side of a pale.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "endorse (third-person singular simple present endorses, present participle endorsing, simple past and past participle endorsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To express support or approval, especially officially or publicly.",
                  "examples": [
                    "The president endorsed John Smith as senator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write one's signature on the back of a cheque, or other negotiable instrument, when transferring it to a third party, or cashing it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give an endorsement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) To report (a symptom); to describe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}