{
  "word": "spindle",
  "etymologies": [
    {
      "description": [
        "From Middle English spyndel, spindle, spyndylle, from Old English spindle, spindel, alteration of earlier spinel, spinil, spinl (“spindle”), from Proto-West Germanic *spinnilu (“spindle”), equivalent to spin +‎ -le. Cognate with Scots spindil, spinnell (“spindle”), Dutch spindel (\"spindle\"; < Middle Dutch spille, spinle), German Spindel (“spindle”), Danish spindel (“spindle”), Swedish spindel (“spindle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spindle (plural spindles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(spinning) A rod used for spinning and then winding natural fibres (especially wool), usually consisting of a shaft and a circular whorl positioned at either the upper or lower end of the shaft when suspended vertically from the forming thread.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rod which turns, or on which something turns.",
                  "examples": [
                    "the spindle of a vane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rotary axis of a machine tool or power tool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Certain of the species of the genus Euonymus, originally used for making the spindles used for spinning wool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An upright spike for holding paper documents by skewering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fusee of a watch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long and slender stalk resembling a spindle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A yarn measure containing, in cotton yarn, 15,120 yards; in linen yarn, 14,400 yards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A solid generated by the revolution of a curved line about its base or double ordinate or chord.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any marine univalve shell of the genus Tibia; a spindle stromb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any marine gastropod with a spindle-shaped shell formerly in one of the three invalid genera called Fusus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A cytoskeletal structure formed during mitosis",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(coastal New Jersey) a dragonfly, calque of Swedish slända (dragonfly/spindle), introduced by New Sweden settlers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A plastic container for packaging optical discs. Bulk blank CDs, DVDs, and BDs are often sold in such a package.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A muscle spindle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sleep spindle.",
                  "examples": [
                    "One of the fascinating characteristics of sleep spindles is that they are generated by the thalamic reticular nucleus, and do not occur in the presence of NE. In fact, LC neurons fall silent in the second preceding each spindle  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spindle (third-person singular simple present spindles, present participle spindling, simple past and past participle spindled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make into a long tapered shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take on a long tapered shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To impale on a device for holding paper documents.",
                  "examples": [
                    "Do not fold, spindle or mutilate this document."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}