{
  "word": "descry",
  "etymologies": [
    {
      "description": [
        "Middle English descrien, descriven in the 14th century already had the dual sense of \"to proclaim, announce, make known\" and \"to see, discern, discover\". On the one hand, the Middle English word is a loan Old French descrier (“to proclaim, announce, cry”), from des- + crier (“shout, cry”); in this case, the word is a  doublet of decry, which was loaned from the same French source in the 17th century.\nAlternatively, as suggested by the spelling descriven, the Middle English word may be a contraction of Old French descrire, descrivre (“to describe”), from Latin describere, and thus a doublet of describe (so Palmer 1890, attributing the view to Walter William Skeat), but modern dictionaries more often seem to prefer the view that there was a secondary, folk-etymological influence on descrien by descriven within\nMiddle English (so The Century Dictionary 1911).",
        "The semantic shift from \"announce\" to \"discern, detect\" is via \"to cry out on discovering something that has been looked for\".\nPalmer (1890) compares the etymology of Latin explorare \"to search a wood &c. with cries\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "descry (third-person singular simple present descries, present participle descrying, simple past and past participle descried) (literary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To announce a discovery: to disclose; to reveal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To see, especially from afar; to discover (a distant or obscure object) by the eye; to espy; to discern or detect.",
                  "examples": [
                    "Dimly through the mists they could descry the long arm of the mountains rising on their left."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}