{
  "word": "meagre",
  "etymologies": [
    {
      "description": [
        "From Middle French maigre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meagre (plural meagres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Argyrosomus regius, an edible fish of the family Sciaenidae.",
                  "examples": [
                    "Among more valuable species some of them are worth mentioning, especially littoral forms as: meagres and other croakers (Sciaenidae), grunters (Pomadasyidae), threadfins (Polynemidae), groupers (Serranidae), snappers (Lutjanidae) […] ."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English megre, borrowed from Anglo-Norman megre, Old French maigre, from Latin macer, macrum, from Proto-Indo-European *mh₂ḱrós. Cognate with Old English mæġer (“meagre, lean”), Dutch mager (“lean”), German mager (“lean”), Icelandic magur (“lean”)."
      ],
      "adjectives": [
        {
          "description": "meagre (comparative meagrer, superlative meagrest) (British spelling) (Canadian spelling, common)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having little flesh; lean; thin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deficient or inferior in amount, quality or extent",
                  "examples": [
                    "Nothing will grow in this meagre soil.",
                    "He was given a meagre piece of cake that he swallowed in one bite.",
                    "Synonyms: paltry, scanty, inadequate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(set theory) Of a set: such that, considered as a subset of a (usually larger) topological space, it is in a precise sense small or negligible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) Dry and harsh to the touch (e.g., as chalk).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "meagre (third-person singular simple present meagres, present participle meagring, simple past and past participle meagred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make lean.",
                  "examples": [
                    "I am meagred to a skeleton; my nose is broiled to flaming heat, and I am suffering the greatest inconvenience from the loss of my baggage which I fear the enemy have taken with my servant at Konigsberg."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}