{
  "word": "pot",
  "etymologies": [
    {
      "description": [
        "From Middle English pot, potte, from Old English pott (“pot”) and Old French pot (“pot”) (probably from Frankish *pott); both Old English and Frankish from Proto-Germanic *puttaz (“pot”), from Proto-Indo-European *budnós (“a type of vessel”).",
        "Cognate with Saterland Frisian Pot (“pot”), Dutch pot (“pot”), German Low German Pott (“pot”), German Pott (“pot”), Swedish potta (“chamber pot”), Icelandic pottur (“tub, pot”), Old Armenian պոյտն (poytn, “pot, earthen pot”). Also, Old Norse pottr (“pot, tub, basin”).",
        "The sense of ruin or deterioration was originally a general allusion to \"being chopped up and tossed in a (normally fiery) pot, like a piece of meat\" (i.e. to get wasted or done with (by someone)). The 'clean' slang term which was used in reference to toilet rooms and lavatories apparently derives from English chamberpots, although now usually encountered as potty in the context of children's toilet training."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pot (plural pots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat-bottomed vessel (usually metal) used for cooking food.",
                  "examples": [
                    "Synonyms: cookpot, cooking pot"
                  ]
                }
              ]
            },
            {
              "group": "Various similar open-topped vessels, particularly",
              "entries": [
                {
                  "meaning": "A vessel (usually earthenware) used with a seal for storing food, such as a honeypot.",
                  "examples": []
                },
                {
                  "meaning": "A vessel used for brewing or serving drinks: a coffeepot or teapot.",
                  "examples": []
                },
                {
                  "meaning": "A vessel used to hold soil for growing plants, particularly flowers: a flowerpot.",
                  "examples": []
                },
                {
                  "meaning": "(archaic except in fixed expressions) A vessel used for urination and defecation: a chamber pot; (figuratively, slang) a toilet; the lavatory.",
                  "examples": [
                    "Synonyms: can, chamber pot, potty, shitpot; see also Thesaurus:chamber pot",
                    "Shit or get off the pot."
                  ]
                },
                {
                  "meaning": "A crucible: a melting pot.",
                  "examples": []
                },
                {
                  "meaning": "A pot-shaped trap used for catching lobsters or other seafood: a lobster pot.",
                  "examples": [
                    "Synonyms: lobster pot, lobster trap"
                  ]
                },
                {
                  "meaning": "A pot-shaped metal or earthenware extension of a flue above the top of a chimney: a chimney pot.",
                  "examples": []
                },
                {
                  "meaning": "A perforated cask for draining sugar.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) An earthen or pewter cup or mug used for drinking liquor.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, Queensland, Victoria, Tasmania) A glass of beer in Australia whose size varies regionally but is typically around 10 fl oz (285 mL).",
                  "examples": [
                    "Synonyms: (New South Wales, Western Australia) middy, (South Australia) schooner"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic except in place names) Pothole, sinkhole, vertical cave.",
                  "examples": [
                    "Rowten Pot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow hole used in certain games played with marbles. The marbles placed in it are called potsies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Ruin or deterioration.",
                  "examples": [
                    "After his arrest, his prospects went to pot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any of various traditional units of volume notionally based on the capacity of a pot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An iron hat with a broad brim worn as a helmet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A pot-shaped non-conducting (usually ceramic) stand that supports an electrified rail while insulating it from the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling, poker) The money available to be won in a hand of poker or a round of other games of chance; (figuratively) any sum of money being used as an enticement.",
                  "examples": [
                    "Synonyms: kitty, pool",
                    "No one's interested. You need to sweeten the pot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, horse-racing, slang) A favorite: a heavily-backed horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Clipping of potbelly: a pot-shaped belly, a paunch.",
                  "examples": [
                    "Fabienne: I wish I had a pot.Butch: You were lookin' in the mirror and you wish you had some pot?Fabienne: A pot. A pot belly. Pot bellies are sexy.Butch: Well you should be happy, 'cause you do.Fabienne: Shut up, Fatso! I don't have a pot! I have a bit of a tummy, like Madonna when she did \"Lucky Star\". It's not the same thing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Clipping of potshot: a haphazard shot; an easy or cheap shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly East Midlands, Yorkshire) A plaster cast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Alternative form of pott: a former size of paper, 12.5 × 15 inches.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pot (third-person singular simple present pots, present participle potting, simple past and past participle potted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put (something) into a pot.",
                  "examples": [
                    "to pot a plant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To preserve by bottling or canning.",
                  "examples": [
                    "potted meat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, pool, billiards) To cause a ball to fall into a pocket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, pool, billiards) To be capable of being potted.",
                  "examples": [
                    "The black ball doesn't pot; the red is in the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoot with a firearm.",
                  "examples": [
                    "When hunted, it [the jaguar] takes refuge in trees, and this habit is well known to hunters, who pursue it with dogs and pot it when treed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To take a pot shot, or haphazard shot, with a firearm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To secure; gain; win; bag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) To send someone to gaol, expeditiously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, dialect, UK) To tipple; to drink.",
                  "examples": [
                    "It is less labour to plough than to pot it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drain (e.g. sugar of the molasses) in a perforated cask.",
                  "examples": [
                    "Too much temper likewise prevents the melasses from separating from the sugar when it is potted or put into the hogshead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain) To seat a person, usually a young child, on a potty or toilet, typically during toilet teaching.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly East Midlands) To apply a plaster cast to a broken limb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To catch (a fish, eel, etc) via a pot.",
                  "examples": [
                    "Potting Eels: Except for the mature neshaws, Vineyard eels were potted (caught by pots) in September and October.  […]  When eeling was good, each pot would catch 25 to 100 pounds of neshaws; some pots would be filled to capacity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby, transitive) To score (a drop goal).",
                  "examples": [
                    "With five minutes to go, Trevathan potted his second goal, and finally it was the fullback Taylor who scored."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Possibly a shortened form of Mexican Spanish potiguaya (“marijuana leaves”) or potaguaya (“cannabis leaves”) or potación de guaya (literally “drink of grief”), supposedly denoting a drink of wine or brandy in which marijuana buds were steeped, from pota +‎ de +‎ guaya (see guayar (“to lament”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pot (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Marijuana.",
                  "examples": [
                    "Synonyms: see Thesaurus:marijuana"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Clipping of potentiometer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pot (plural pots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, electronics) A simple electromechanical device used to control resistance or voltage (often to adjust sound volume) in an electronic device by rotating or sliding when manipulated by a human thumb, screwdriver, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pot (third-person singular simple present pots, present participle potting, simple past and past participle potted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, broadcasting) To fade volume in or out by means of a potentiometer.",
                  "examples": [
                    "While the announcer is talking, the select switch on the mixing board for the microphone input is selected, and the microphone is “potted up.”"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Clipping of potion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pot (plural pots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games) Clipping of potion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}