{
  "word": "republic",
  "etymologies": [
    {
      "description": [
        "From Middle French republique (“republic”), from Latin rēspūblicā, from rēs (“thing”) + pūblica (“public”); hence literally “the public thing”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "republic (plural republics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state where sovereignty rests with the people or their representatives, rather than with a monarch or emperor; a country with no monarchy.",
                  "examples": [
                    "The United States is a republic; the United Kingdom of Great Britain and Northern Ireland is a constitutional monarchy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A state, which may or may not be a monarchy, in which the executive and legislative branches of government are separate.",
                  "examples": [
                    "Republicanism is the political principle of the separation of the executive power (the administration) from the legislative; despotism is that of the autonomous execution by the state of laws which it has itself decreed. […] Therefore, we can say: the smaller the personnel of the government (the smaller the number of rulers), the greater is their representation and the more nearly the constitution approaches to the possibility of republicanism; thus the constitution may be expected by gradual reform finally to raise itself to republicanism […]. None of the ancient so-called \"republics\" knew this system, and they all finally and inevitably degenerated into despotism under the sovereignty of one, which is the most bearable of all forms of despotism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the subdivisions constituting Russia. See oblast.",
                  "examples": [
                    "The Republic of Udmurtia is west of the Permian Oblast."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}