{
  "word": "habitual",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Middle English habitual (“of one's inherent disposition”), from Medieval Latin habituālis (“customary; habitual”), from Latin habitus (“character; disposition; habit; physical or emotional condition; attire, dress”) + -ālis (suffix forming adjectives of relationship); analysable as habit +‎ -ual. Habitus is derived from habeō (“to have; to hold; to own; to possess”) (possibly ultimately from Proto-Indo-European *gʰeh₁bʰ- (“to grab, take”)) + -tus (suffix forming action nouns from verbs).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "habitual (comparative more habitual, superlative most habitual)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a habit; established as a habit; performed over and over again; recurrent, recurring.",
                  "examples": [
                    "Her habitual lying was the reason for my mistrust."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Regular or usual.",
                  "examples": [
                    "Synonyms: accustomed, customary",
                    "Professor Franklein took his habitual seat at the conference table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person or thing: engaging in some behaviour as a habit or regularly.",
                  "examples": [
                    "He’s a habitual chain-smoker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Pertaining to an action performed customarily, ordinarily, or usually.",
                  "examples": [
                    "Synonym: consuetudinal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "habitual (plural habituals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) One who does something habitually, such as a serial criminal offender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A construction representing something done habitually.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}