{
  "word": "muster",
  "etymologies": [
    {
      "description": [
        "From Middle English musteren, borrowed from Anglo-Norman mostrer, Middle French monstrer, moustrer (whence the noun monstre, which gave the English noun), from Latin mōnstrō (“to show”), from moneō (“to admonish”). Cognate with French montrer (“to show”), Italian mostrare (“to show”), Spanish mostrar (“to show”). See also monster."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "muster (plural musters)",
          "definitionGroups": [
            {
              "group": "Gathering.",
              "entries": [
                {
                  "meaning": "An assemblage or display; a gathering, collection of people or things. [from 14th c.]",
                  "examples": [
                    "She seems to hear the Repetition of his Mens Names with Admiration; and waits only to answer him with as false a Muster of Lovers."
                  ]
                },
                {
                  "meaning": "(military) An assembling or review of troops, as for parade, verification of numbers, inspection, exercise, or introduction into service. [from 15th c.]",
                  "examples": [
                    "To shorten his way and to hasten for the muster he takes a long lost road."
                  ]
                },
                {
                  "meaning": "The sum total of an army when assembled for review and inspection; the whole number of effective men in an army.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, New Zealand) A roundup of livestock for inspection, branding, drenching, shearing etc. [from 19th c.]",
                  "examples": [
                    "McGuire took the two of them out to Kidman's Bore on the Sylvester River where about two dozen stockmen from different stations had gathered to tend the muster along the edge of the Simpson Desert."
                  ]
                }
              ]
            },
            {
              "group": "Showing.",
              "entries": [
                {
                  "meaning": "(obsolete) Something shown for imitation; a pattern. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A sample of goods.",
                  "examples": [
                    "The beasts they saw here were hogs and little dogs, and they found some hens; here also they found a muster of cloves, ginger, and cinnamon; though the cinnamon was not of the best:  […]"
                  ]
                },
                {
                  "meaning": "(obsolete) An act of showing something; a display. [15th–17th c.]",
                  "examples": [
                    "Thus all things being condignely ordered, will an ill favoured impatiencie he waited, until the next morning he might make a muster of him selfe in the Iland  […]"
                  ]
                },
                {
                  "meaning": "A collection of peafowl. (not a term used in zoology)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "muster (third-person singular simple present musters, present participle mustering, simple past and past participle mustered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To show, exhibit. [15th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be gathered together for parade, inspection, exercise, or the like (especially of a military force); to come together as parts of a force or body. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To collect, call or assemble together, such as troops or a group for inspection, orders, display etc. [from 15th c.]",
                  "examples": [
                    "With the help of some low-end boosting, Dinklage musters a decent amount of kid-appropriate menace—although he never does explain his gift for finding chunks of ice shaped like pirate ships—but Romano and Leary mainly sound bored, droning through their lines as if they’re simultaneously texting the contractors building the additions on their houses funded by their fat sequel paychecks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To enroll (into service). [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, New Zealand) To gather or round up livestock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "muster (plural musters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of mustee",
                  "examples": [
                    "The next, the Quadroon, from the white and mulatto woman. The third descent, from a white and quadroon, is called a muster; from the fourth, between a white and a muster, springs the musteephinas and the fifth descent, viz. from a white and musteephina, is white by law, and of free birth; indeed the two latter classes are as white as a European."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}