{
  "word": "platoon",
  "etymologies": [
    {
      "description": [
        "From obsolete French plauton, variant of peloton, from Middle French pelote + -on. Doublet of peloton. Compare pellet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "platoon (plural platoons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A unit of thirty to forty soldiers typically commanded by a lieutenant and forming part of a company.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of self-driving vehicles travelling in a close convoy and communicating electronically with each other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education, historical) A group of children in the platoon grouping education system.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "platoon (third-person singular simple present platoons, present participle platooning, simple past and past participle platooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) To alternate starts with a teammate of opposite handedness, depending on the handedness of the opposing pitcher",
                  "examples": [
                    "Taylor has been hitting poorly against left-handers, and Morgan has been hitting poorly against right-handers, so they will platoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) To specialize in a particular position or playing style.",
                  "examples": [
                    "You must understand the rules of football in 1939. There was no platooning, so each man played both offense and defense."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of self-driving vehicles: to travel in a close convoy, each vehicle communicating electronically with the others.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}