{
  "word": "balloon",
  "etymologies": [
    {
      "description": [
        "1570, \"a game played with a large, inflated leather ball\" (possibly via Middle French ballon) from Italian pallone (“large ball”) from palla (“ball”), from Lombardic *palla. The Northern Italian form, balla (“ball shaped bundle”), today a doublet, likely derived from Old French balle, from Frankish *balla (“ball”), and may have influenced the spelling of this word. Both Germanic words are from Proto-Germanic *ballô (“ball”), *balluz, from Proto-Indo-European *bʰoln- (“bubble”), from Proto-Indo-European *bʰel- (“to blow, swell, inflate”). Akin to Old High German ballo, bal (“ball”), (German Ballen (“bale”); Ball \"ball\"). Doublet of ballon. More at ball."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "balloon (plural balloons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inflatable buoyant object, often (but not necessarily) round and flexible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such an object as a child’s toy or party decoration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Such an object designed to transport people or equipment through the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A sac inserted into part of the body for therapeutic reasons; such as angioplasty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A speech bubble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of glass cup, sometimes used for brandy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A ball or globe on the top of a pillar, church, etc.",
                  "examples": [
                    "the balloon of St. Paul's Cathedral in London"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A round vessel, usually with a short neck, to hold or receive whatever is distilled; a glass vessel of a spherical form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pyrotechnics) A bomb or shell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A game played with a large inflated ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engraving) The outline enclosing words represented as coming from the mouth of a pictured figure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A woman's breast.",
                  "examples": [
                    "Synonyms: see Thesaurus:breasts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A small container for illicit drugs made from a condom or the finger of a latex glove, etc.",
                  "examples": [
                    "And all I had to do in return was take a drive up to Ricardo's place on the way home and then a pretty edgy one back to Rondebosch with a balloon of coke sandwiched between two pairs of underpants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Synonym of balloon payment",
                  "examples": [
                    "The purpose of the balloon is to reduce the periodic payment required during the life of the financing period."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "balloon (third-person singular simple present balloons, present participle ballooning, simple past and past participle ballooned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To increase or expand rapidly.",
                  "examples": [
                    "His stomach ballooned from eating such a large meal.",
                    "Prices will balloon if we don't act quickly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go up or voyage in a balloon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take up in, or as if in, a balloon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inflate like a balloon.",
                  "examples": [
                    "A puff of wind from the open door caught and ballooned the scanties; off they sailed, out the window billowing into freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To strike (a ball) so that it flies high in the air.",
                  "examples": [
                    "After four minutes, leading goalscorer Haworth slid in but ballooned the ball over from six yards, and Hume then outran the defence to get to the by-line, but he could only hit his cross straight out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) Of an aircraft: to plunge alternately up and down.",
                  "examples": [
                    "Synonym: porpoise"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}