{
  "word": "starve",
  "etymologies": [
    {
      "description": [
        "From Middle English sterven, from Old English steorfan (“to die”), from Proto-Germanic *sterbaną (“to become stiff, die”), from Proto-Indo-European *(s)terp- (“to lose strength, become numb, be motionless”); or from Proto-Indo-European *sterbʰ- (“to become stiff”), from *ster- (“stiff”); or a conflation of the aforementioned. Cognate with Scots sterve (“to die, perish”), Saterland Frisian stjerwa (“to die”), West Frisian stjerre (“to die”), Dutch sterven (“to die”), German Low German starven (“to die”), German sterben (“to die”), Icelandic stirfinn (“peevish, froward”), Albanian shterp (“sterile, unproductive, barren land”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "starve (third-person singular simple present starves, present participle starving, simple past starved, past participle starved or (obsolete) starven)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To die; in later use especially to die slowly, waste away.",
                  "examples": [
                    "noble Britomart / Released her, that else was like to starve, / Through cruell knife that her deare heart did kerue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To die because of lack of food or of not eating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be very hungry.",
                  "examples": [
                    "Hey, ma, I'm starving! What's for dinner?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy, make capitulate or at least make suffer by deprivation, notably of food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deprive of nourishment or of some vital component.",
                  "examples": [
                    "The uncaring parents starved the child of love.",
                    "The patient's brain was starved of oxygen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deteriorate for want of any essential thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Britain, especially Yorkshire and Lancashire) To kill with cold; to (cause to) die from cold.",
                  "examples": [
                    "I was half starved waiting out in that wind."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}