{
  "word": "arizonite",
  "etymologies": [
    {
      "description": [
        "From Arizona +‎ -ite from its discovery in Arizona, USA, proposed by Chase Palmer in 1909."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "arizonite (usually uncountable, plural arizonites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) A titanate of iron, Fe2Ti3O9.",
                  "examples": [
                    "The close ratio of ferric oxide to titanic oxide, viz., 1:3·03, indicates that the mineral is really ferric metatitanate, Fe2O3.3TiO2 or Fe2Ti3O9. Moreover, the crystallographic determinations strengthen the view that this titanate of iron cannot be assigned to any known species, but is entirely new. I propose to name it Arizonite... There appears to be no authentic prior record of the occurrence in nature of a simple ferric metatitanate... Upon readjustment of the analytical data as cited by Rammelsberg, it appears that his mineral consists essentially of 60 per cent ferrous titanate (FeO.TiO2), ilmenite, and 40 per cent ferric titanate (Fe2O3.3TiO2), arizonite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical mineralogy, obsolete) A kind of iron-laden silver ore discovered during Arizona's silver rush in the 1870s.",
                  "examples": [
                    "Silver occurs, native, in various lodes... The Sumner lode produces a new combination of ore. The principal vein matter is micaceous iron, iodide of silver, gold, sulphurets of iron, and antimony. The name Arizonite has been given to it by Mr. H. G. Hanks, of San Francisco."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}