{
  "word": "disguise",
  "etymologies": [
    {
      "description": [
        "From Middle English disgisen, disguisen, borrowed from Old French desguiser (modern French déguiser), itself derived from des- (“dis-”) (from Latin dis-) + guise (“guise”) (from a Germanic source)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "disguise (countable and uncountable, plural disguises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Material (such as clothing, makeup, a wig) used to alter one’s visual appearance in order to hide one's identity or assume another.",
                  "examples": [
                    "A cape and moustache completed his disguise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The appearance of something on the outside which masks what’s beneath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or state of disguising, notably as a ploy.",
                  "examples": [
                    "Any disguise may expose soldiers to be deemed enemy spies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A change of behaviour resulting from intoxication, drunkenness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "disguise (third-person singular simple present disguises, present participle disguising, simple past and past participle disguised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To change the appearance of (a person or thing) so as to hide, or to assume an identity.",
                  "examples": [
                    "Spies often disguise themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To transform or disfigure, to change the appearance of in general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To avoid giving away or revealing (something secret); to hide by a false appearance.",
                  "examples": [
                    "He disguised his true intentions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To dress in newfangled or showy clothing, to deck out in new fashions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To dissemble, to talk or act falsely while concealing one’s thoughts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To affect or change by liquor; to intoxicate.",
                  "examples": [
                    "I have just left the right worshipful, and his myrmidons, about a sneaker or five gallons; the whole magistracy was pretty well disguised before I gave them the slip."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}