{
  "word": "bomb",
  "etymologies": [
    {
      "description": [
        "From French bombe, from Italian bomba, from Latin bombus (“a booming sound”), from Ancient Greek βόμβος (bómbos, “booming, humming, buzzing”), imitative of the sound itself. Doublet of bombe. Compare boom."
      ],
      "adjectives": [
        {
          "description": "bomb (comparative more bomb, superlative most bomb)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Great, awesome.",
                  "examples": [
                    "Have you tried the new tacos from that restaurant? They're pretty bomb!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bomb (plural bombs)",
          "definitionGroups": [
            {
              "group": "An explosive device used or intended as a weapon, (especially) one dropped from an aircraft.",
              "entries": [
                {
                  "meaning": "(dated, often with the) The atomic bomb.",
                  "examples": [
                    "During the Cold War, everyone worried about the bomb sometimes."
                  ]
                },
                {
                  "meaning": "(figurative) Events or conditions that have a speedy destructive effect.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) A mortar shell.",
                  "examples": []
                },
                {
                  "meaning": "(historical, archaic) Ellipsis of bomb ship.",
                  "examples": []
                },
                {
                  "meaning": "(colloquial) Any explosive charge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A failure; an unpopular commercial product.",
                  "examples": [
                    "box-office bomb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Australia, informal) A car in poor condition.",
                  "examples": [
                    "Synonyms: lemon, rustbucket"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, slang) A large amount of money.",
                  "examples": [
                    "Synonyms: fortune, packet, pretty penny",
                    "make a bomb",
                    "cost a bomb"
                  ]
                }
              ]
            },
            {
              "group": "(social) Something highly effective or attractive.",
              "entries": [
                {
                  "meaning": "(chiefly Britain, slang) A success; the bomb.",
                  "examples": [
                    "Our fabulous new crumpets have been selling like a bomb."
                  ]
                },
                {
                  "meaning": "(chiefly Britain, India, slang) A very attractive woman.",
                  "examples": [
                    "Synonym: bombshell"
                  ]
                },
                {
                  "meaning": "(often in combination) An action or statement that causes a strong reaction.",
                  "examples": [
                    "It was an ordinary speech, until the president dropped a bomb: he would be retiring for medical reasons.",
                    "Normally very controlled, he dropped the F-bomb and cursed the paparazzi."
                  ]
                },
                {
                  "meaning": "(American football, slang) A long forward pass.",
                  "examples": []
                },
                {
                  "meaning": "(rugby, soccer, slang) A high kick that sends the ball relatively straight up so players can get under it before it comes down.",
                  "examples": [
                    "Synonyms: garryowen, up and under"
                  ]
                },
                {
                  "meaning": "(basketball, slang) A throw into the basket from a considerable distance.",
                  "examples": [
                    "With five seconds remaining, Smith received the inbounds pass and launched a bomb that dropped through the net to give his team an 80-79 victory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cyclone whose central pressure drops at an average rate of at least one millibar per hour for at least 24 hours.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A heavy-walled container designed to permit chemical reactions under high pressure.",
                  "examples": [
                    "The process consisted in preparing the metal by metallothermic reduction of titanium tetrachloride with sodium metal in a steel bomb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A great booming noise; a hollow sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A woman’s breast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling) A professional wrestling throw in which an opponent is lifted and then slammed back-first down to the mat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A recreational drug ground up, wrapped, and swallowed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An act of jumping into water while keeping one's arms and legs tucked into the body, as in a squatting position, to maximize splashing.",
                  "examples": [
                    "Synonym: cannonball"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bomb (third-person singular simple present bombs, present participle bombing, simple past and past participle bombed)",
          "definitionGroups": [
            {
              "group": "(transitive, intransitive) To attack using one or more bombs; to bombard.",
              "entries": [
                {
                  "meaning": "(transitive, figuratively, often with with) To attack or annoy in the manner of a bombing.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(informal)",
              "entries": [
                {
                  "meaning": "To jump into water in a squatting position, with the arms wrapped around the legs.",
                  "examples": []
                },
                {
                  "meaning": "To add an excessive amount of chlorine to a pool when it has not been maintained properly.",
                  "examples": []
                },
                {
                  "meaning": "(especially with along, down, up etc.) To move at high speed.",
                  "examples": [
                    "I was bombing down the road on my motorbike."
                  ]
                }
              ]
            },
            {
              "group": "(slang)",
              "entries": [
                {
                  "meaning": "(reflexive) To make oneself drunk.",
                  "examples": [
                    "TED: The champagne you ordered, sir.MAN: No time for this. Leave it on ice.WIFE: But I want some now...MAN: There'll be plenty for you at the party, baby, you can bomb yourself all you want at the party."
                  ]
                },
                {
                  "meaning": "To cover an area in many graffiti tags.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, intransitive) To fail dismally.",
                  "examples": [
                    "So Hall quit the job, turned in the company car and went to Chicago, where as a stand-up comic he bombed several times before he was discovered by Nancy Wilson, who took him on the road — where he bombed again before a room of Republicans—and then to Los Angeles."
                  ]
                },
                {
                  "meaning": "(intransitive, computing) To crash.",
                  "examples": [
                    "When things weren't going Alison's way at work — some editor wanted something changed or her computer bombed again — she'd cuss and yell at whoever happened to be in the way."
                  ]
                },
                {
                  "meaning": "(transitive) To make a smelly mess in a toilet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To sound; to boom; to make a humming or buzzing sound.",
                  "examples": [
                    "What over-charged piece of melancholie / Is this, breakes in betweene my wishes thus, / With bombing sighs?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}