{
  "word": "spit",
  "etymologies": [
    {
      "description": [
        "The noun is from Middle English spit, spite, spete, spette, spyte, spytte (“rod on which meat is cooked; rod used as a torture instrument; short spear; point of a spear; spine in the fin of a fish; pointed object; dagger symbol; land projecting into the sea”), from Old English spitu (“rod on which meat is cooked; spit”), from Proto-Germanic *spitō (“rod; skewer; spike”), *spituz (“rod on which meat is cooked; stick”), from Proto-Indo-European *spid-, *spey- (“sharp; sharp stick”). The English word is cognate with Dutch spit, Low German Spitt (“pike, spear; spike; skewer; spit”), Danish spid, Swedish spett (“skewer; spit; type of crowbar”).",
        "The verb is derived from the noun, or from Middle English spiten (“to put on a spit; to impale”), from spit, spite: see above. The English word is cognate with Middle Dutch speten, spitten (modern Dutch speten), Middle Low German speten (Low German spitten, modern German spießen (“to skewer, to spear”), spissen (now dialectal)) and Danish spidde."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spit (plural spits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin metal or wooden rod on which meat is skewered for cooking, often over a fire.",
                  "examples": [
                    "Synonym: broach"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A generally low, narrow, pointed, usually sandy peninsula.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spit (third-person singular simple present spits, present participle spitting, simple past and past participle spitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To impale on a spit; to pierce with a sharp object.",
                  "examples": [
                    "to spit a loin of veal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use a spit to cook; to attend to food that is cooking on a spit.",
                  "examples": [
                    "She’s spitting the roast in the kitchen."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is from Middle English spē̆ten, spete (“to spit (blood, phlegm, saliva, venom, etc.); of a fire: to emit sparks”), from Old English spǣtan (“to spit; to squirt”); or from Middle English spit, spitte, spitten (“to spit (blood, phlegm, saliva, venom, etc.); of a fire: to emit sparks”), from Old English spittan, spyttan (“to spit”), both from Proto-Germanic, from Proto-Indo-European *sp(y)ēw, *spyū, ultimately imitative; compare Middle English spitelen (“to spit out, expectorate”) and English spew. The English word is cognate with Danish spytte (“to spit”), North Frisian spütte, Norwegian spytte (“to spit”), Swedish spotta (“to spit”), Old Norse spýta (Faroese spýta (“to spit”), Icelandic spýta (“to spit”)).",
        "The noun is derived from the verb; compare Danish spyt (“spit”), Middle English spit, spytte (“saliva, spittle, sputum”), spet (“saliva, spittle”), spē̆tel (“saliva, spittle”), North Frisian spiit."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spit (countable and uncountable, plural spits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Saliva, especially when expectorated.",
                  "examples": [
                    "Synonyms: expectoration, spittle",
                    "There was spit all over the washbasin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of spitting; specifically, a light fall of rain or snow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who exactly resembles someone else (usually in set phrases; see spitting image).",
                  "examples": [
                    "[…]  according to some of the elders of the village, young Philip was the “very spit” of his father, as they once remembered him  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Synonym of slam (“card game”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spit (third-person singular simple present spits, present participle spitting, simple past and past participle spat or spit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To evacuate (saliva or another substance) from the mouth, etc.",
                  "examples": [
                    "Synonym: expectorate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To emit or expel in a manner similar to evacuating saliva from the mouth.",
                  "examples": [
                    "a hot pan spitting droplets of fat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) To rain or snow slightly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To utter (something) violently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a spitting sound, like an angry cat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, hip-hop) To rap, to utter.",
                  "examples": [
                    "[…]  mutating into all-star line-ups of emcees spitting hot bars over familiar beats, then to a single crew spitting bars over familiar beats, then eventually to a single crew (or artist) spitting bars over unfamiliar beats."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, humorous) (in the form spitting) To spit facts; to tell the truth.",
                  "examples": [
                    "He's spitting for sure."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is from Middle Dutch speet, spit, Middle Low German spêdt, spit (Low German spit); the word is cognate with Dutch spit, North Frisian spatt, spet, West Frisian spit.",
        "The verb is from Middle English spitten (“to dig”), from Old English spittan (“to dig with a spade”), possibly from spitu (“rod on which meat is cooked; spit”); see further at etymology 1. The English word is cognate with Middle Dutch spetten, spitten (modern Dutch spitten), Middle Low German speten, spitten (Low German spitten), North Frisian spat, West Frisian spitte."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spit (plural spits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The depth to which the blade of a spade goes into the soil when it is used for digging; a layer of soil of the depth of a spade's blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount of soil that a spade holds; a spadeful.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spit (third-person singular simple present spits, present participle spitting, simple past and past participle spitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dialectal) To dig (something) using a spade; also, to turn (the soil) using a plough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dialectal) To plant (something) using a spade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dialectal) To dig, to spade.",
                  "examples": [
                    "Synonym: delve"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}