{
  "word": "rifle",
  "etymologies": [
    {
      "description": [
        "Originally short for “rifled gun”, referring to the spiral grooves inside the barrel. From Middle English riflen (“to rob, plunder, search through”), from Old French rifler (“to lightly scratch, scrape off, plunder”), from Old High German riffilōn (compare German riffeln (“to score, make grooves in, ripple”), archaic Dutch rijfelen (“to scrape”), Old English rifelan, riflian (“to wrinkle”)), frequentative of Proto-Germanic *rīfaną (compare Old Norse rífa (“to tear, break”)). More at rive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rifle (plural rifles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A firearm fired from the shoulder; improved range and accuracy is provided by a long, rifled barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, usually in the plural, dated) A rifleman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) An artillery piece with a rifled barrel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strip of wood covered with emery or a similar material, used for sharpening scythes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rifle (third-person singular simple present rifles, present participle rifling, simple past and past participle rifled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To quickly search through many items (such as papers, the contents of a drawer, a pile of clothing). (See also riffle[2])",
                  "examples": [
                    "She made a mess when she rifled through the stack of papers, looking for the title document."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To commit robbery or theft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To search with intent to steal; to ransack, pillage or plunder.",
                  "examples": [
                    "thine enemies  […] shall ransack and rifle all the things of Edom; and shall search out all thy hidden commodities, and carry them away at once"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strip of goods; to rob; to pillage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seize and bear away by force; to snatch away; to carry off.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add a spiral groove to a gun bore to make a fired bullet spin in flight in order to improve range and accuracy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a projectile, as a rifle bullet) to travel in a flat ballistic trajectory.",
                  "examples": [
                    "But a Norwegian player rifled off a point shot that sailed into the back of the net."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move in a flat ballistic trajectory (as a rifle bullet).",
                  "examples": [
                    "The ball rifled off the bat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To dispose of in a raffle.",
                  "examples": [
                    "If you like not that course but intend to be rid of her , rifle her at a tavern , where you may swallow down some fifty wiseacres ' sons and heirs to old tenements and common gardens , like so many raw yolks with muscadine to bedward Kate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To engage in a raffle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}