{
  "word": "shaft",
  "etymologies": [
    {
      "description": [
        "From Middle English schaft, from Old English sċeaft, from Proto-West Germanic *skaft, from Proto-Germanic *skaftaz. Cognate with Dutch schacht, German German Schaft, Swedish skaft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shaft (plural shafts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The entire body of a long weapon, such as an arrow.",
                  "examples": [
                    "His sleep, his meat, his drink, is him bereft, / That lean he wax, and dry as is a shaft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The long, narrow, central body of a spear, arrow, or javelin.",
                  "examples": [
                    "Her hand slipped off the javelin's shaft towards the spearpoint and that's why her score was lowered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything cast or thrown as a spear or javelin.",
                  "examples": [
                    "And the thunder, / Winged with red lightning and impetuous rage, / Perhaps hath spent his shafts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any long thin object, such as the handle of a tool, one of the poles between which an animal is harnessed to a vehicle, the driveshaft of a motorized vehicle with rear-wheel drive, an axle, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beam or ray of light.",
                  "examples": [
                    "Isn't that shaft of light from that opening in the cave beautiful?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The main axis of a feather.",
                  "examples": [
                    "I had no idea that they removed the feathers' shafts to make the pillows softer!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lacrosse) The long narrow body of a lacrosse stick.",
                  "examples": [
                    "Sarah, if you wear gloves your hands might not slip on your shaft and you can up your game, girl!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vertical or inclined passage sunk into the earth as part of a mine",
                  "examples": [
                    "Your grandfather used to work with a crane hauling ore out of the gold mine's shafts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vertical passage housing a lift or elevator; a liftshaft.",
                  "examples": [
                    "Darn it, my keys fell through the gap and into the elevator shaft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ventilation or heating conduit; an air duct.",
                  "examples": [
                    "Our parrot flew into the air duct and got stuck in the shaft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Any column or pillar, particularly the body of a column between its capital and pedestal.",
                  "examples": [
                    "Bid time and nature gently spare / The shaft we raise to thee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The main cylindrical part of the penis.",
                  "examples": [
                    "The female labia minora is homologous to the penis shaft skin of males."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The chamber of a blast furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A relatively small area of precipitation that an onlook can discern from the dry surrounding area.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shaft (third-person singular simple present shafts, present participle shafting, simple past and past participle shafted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To fuck over; to cause harm to, especially through deceit or treachery.",
                  "examples": [
                    "Synonyms: see Thesaurus:deceive",
                    "Your boss really shafted you by stealing your idea like that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip with a shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To fuck; to have sexual intercourse with.",
                  "examples": [
                    "Synonyms: see Thesaurus:copulate with",
                    "Turns out my roommate was shafting my girlfriend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}