{
  "word": "scoop",
  "etymologies": [
    {
      "description": [
        "From Middle English scope, schoupe, a borrowing from Middle Dutch scoep, scuep, schope, schoepe (“bucket for bailing water”) and Middle Dutch schoppe, scoppe, schuppe (\"a scoop, shovel\"; > Modern Dutch schop (“spade”)), from Proto-Germanic *skuppǭ, *skuppijǭ, from Proto-Indo-European *(s)kep- (“to cut, to scrape, to hack”)..",
        "Cognate with Old Frisian skuppe (“shovel”), Middle Low German schōpe (“scoop, shovel”), German Low German Schüppe, Schüpp (“shovel”), German Schüppe, Schippe (“shovel, spade”). Related to English shovel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scoop (plural scoops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any cup- or bowl-shaped tool, usually with a handle, used to lift and move loose or soft solid material.",
                  "examples": [
                    "She kept a scoop in the dog food.",
                    "an ice-cream scoop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount or volume of loose or solid material held by a particular scoop.",
                  "examples": [
                    "Use one scoop of coffee for each pot.",
                    "I'll have one scoop of chocolate ice-cream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of scooping, or taking with a scoop or ladle; a motion with a scoop, as in dipping or shovelling.",
                  "examples": [
                    "with a quick scoop, she fished the frog out of the pond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A story or fact; especially, news learned and reported before anyone else.",
                  "examples": [
                    "He listened carefully, in hopes of getting the scoop on the debate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) An opening in a hood/bonnet or other body panel to admit air, usually for cooling the engine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The digging attachment on a front-end loader.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place hollowed out; a basinlike cavity; a hollow.",
                  "examples": [
                    "Some had lain in the scoop of the rock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spoon-shaped surgical instrument, used in extracting certain substances or foreign bodies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A special spinal board used by emergency medical service staff that divides laterally to scoop up patients.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sweep; a stroke; a swoop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) The peak of a cap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pinball) A hole on the playfield that catches a ball, but eventually returns it to play in one way or another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) The raised end of a surfboard.",
                  "examples": [
                    "This brings the scoop into play as additional wetted surface and slows the board due to its fore-and-aft curvature"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A kind of floodlight with a reflector.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scoop (third-person singular simple present scoops, present participle scooping, simple past and past participle scooped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lift, move, or collect with a scoop or as though with a scoop.",
                  "examples": [
                    "He used both hands to scoop water and splash it on his face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make hollow; to dig out.",
                  "examples": [
                    "I tried scooping a hole in the sand with my fingers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To report on something, especially something worthy of a news article, before (someone else).",
                  "examples": [
                    "The paper across town scooped them on the City Hall scandal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, often with \"up\") To begin a vocal note slightly below the target pitch and then to slide up to the target pitch, especially in country music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MTE, slang) To pick (someone) up",
                  "examples": [
                    "You have a car. Can you come and scoop me?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}