{
  "word": "beset",
  "etymologies": [
    {
      "description": [
        "From Middle English besetten, bisetten, from Old English besettan (“to beset; set beside; set near; appoint; place; own; possess”), from Proto-Germanic *bisatjaną (“to set near; set around”), equivalent to be- +‎ set. Cognate with Saterland Frisian besätte (“to occupy”), West Frisian besette (“to occupy”), Dutch bezetten (“to sit in; occupy; fill”), German Low German besetten (“to occupy”), German besetzen (“to seize; occupy; garrison”), Danish besætte (“to occupy; obsess”), Swedish besätta (“to fill; occupy; beset”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "beset (third-person singular simple present besets, present participle besetting, simple past and past participle beset)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround or hem in.",
                  "examples": [
                    "Vegetatively it is the nearest to H. translucens with its oblong-lanceolate leaves, with the margins and keel beset with pellucid teeth, but it differs and is characterised by the greyish-black quadrantly positioned globose flowers;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes figurative) To attack or assail, especially from all sides.",
                  "examples": [
                    "“Nay, for matter o’ that, he never doth any mischief,” said the woman; “but to be sure it is necessary he should keep some arms for his own safety; for his house hath been beset more than once; and it is not many nights ago that we thought we heard thieves about it  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To decorate something with jewels etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Of a ship, to get trapped by ice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}