{
  "word": "wilderness",
  "etymologies": [
    {
      "description": [
        "From Middle English wildernes, wildernesse (“uninhabited, uncultivated, or wild territory; desolate land; desert; (figuratively) depopulated or devastated place; state of devastation or ruin; human experience and life”) [and other forms], and then either:",
        "Wilddēor is derived from wilde (“savage, wild”) (ultimately either from Proto-Indo-European *wel-, *welw- (“hair, wool; ear of corn, grass; forest”), or *gʷʰel- (“wild”)) + dēor (“beast, wild animal”) (ultimately from Proto-Indo-European *dʰwes- (“to breathe; breath; soul, spirit; creature”)).",
        "The English word is cognate with Danish vildnis (“wilderness”), German Wildernis, Wildnis (“wilderness”), Middle Dutch wildernisse (“wilderness”) (modern Dutch wildernis (“wilderness”)), Middle Low German wildernisse (“wilderness”) (German Low German Wildernis (“wilderness”)), Saterland Frisian Wüüldernis (“wilderness”), West Frisian wyldernis (“wilderness”).",
        "Sense 3.3 (“situation of disfavour or lack of recognition”) is a reference to Numbers 14:32–33 in the Bible (King James Version; spelling modernized): “But as for you, your carcasses, they shall fall in this wilderness. And your children shall wander in the wilderness forty years, and bear your whoredoms, until your carcasses be wasted in the wilderness.”"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wilderness (countable and uncountable, plural wildernesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Uncultivated and unsettled land in its natural state inhabited by wild animals and with vegetation growing wild; (countable) a tract of such land; a waste or wild.",
                  "examples": [
                    "Synonyms: (chiefly Australia) bushland, (obsolete) wasteness, (obsolete) wastness, wildland, wilds"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(countable) A place other than land (for example, the air or sea) that is uncared for, and therefore devoted to disorder or wildness.",
                  "examples": []
                },
                {
                  "meaning": "(countable, horticulture) An ornamental part of a garden or park cultivated with trees and often a maze to evoke a natural wilderness.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, obsolete) Unrefinedness; wildness.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, figuratively)",
              "entries": [
                {
                  "meaning": "Chiefly followed by of: a bewildering flock or throng; a large, often jumbled, collection of things.",
                  "examples": []
                },
                {
                  "meaning": "A place or situation that is bewildering and in which one may get lost.",
                  "examples": []
                },
                {
                  "meaning": "Often preceded by in the: a situation of disfavour or lack of recognition; (specifically, politics) of a politician, political party, etc.: a situation of being out of office.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}