{
  "word": "pop",
  "etymologies": [
    {
      "description": [
        "From Middle English pop, poppe (“a blow; strike; buffet”) (> Middle English poppen (“to strike; thrust”, verb)), of onomatopoeic origin – used to describe the sound, or short, sharp actions. The physics sense is part of a facetious sequence \"snap, crackle, pop\", after the mascots of Rice Krispies cereal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pop (countable and uncountable, plural pops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A loud, sharp sound, as of a cork coming out of a bottle.",
                  "examples": [
                    "Listen to the pop of a champagne cork."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, regional, Midwestern US, Canada, Inland North, Britain) An effervescent or fizzy drink, most frequently nonalcoholic; soda pop.",
                  "examples": [
                    "Lunch was sandwiches and a bottle of pop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, regional, Midwestern US, Inland North, Canada) A bottle, can, or serving of effervescent or fizzy drink, most frequently nonalcoholic; a soda pop.",
                  "examples": [
                    "Go in the store and buy us three pops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pop shot: a quick, possibly unaimed, shot with a firearm.",
                  "examples": [
                    "The man with the gun took a pop at the rabbit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, in the phrase \"a pop\") A quantity dispensed; a portion; apiece.",
                  "examples": [
                    "They cost 50 pence a pop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that stands out or is distinctive to the mind or senses.",
                  "examples": [
                    "a white dress with a pop of red",
                    "a pop of vanilla flavour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The removal of a data item from the top of a stack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bird, the European redwing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The sixth derivative of the position vector with respect to time (after velocity, acceleration, jerk, jounce, crackle), i.e. the rate of change of crackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A pistol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, mostly in plural) A small, immature peanut, boiled as a snack.",
                  "examples": [
                    "Immature peanuts, called \"pops,\" are often included when the peanuts are boiled at home  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Clipping of freeze pop.",
                  "examples": [
                    "2017,  Kenny Attaway,  Black Cream: A Handful of Sky & a Pocketful of Confetti‎[1]:Although they go by many names across the world freezer pop, ice-pole, pop stick icy-pole ice pop, tip top and ice candy but in the hoods of America they are known and respected as Freeze Pops. The pops are made by freezing flavored liquid such as sugar water, Kool-Aid or some form of fruit juice or purée inside a plastic tube - at least the kinds we ate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pop (third-person singular simple present pops, present participle popping, simple past and past participle popped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a pop, or sharp, quick sound.",
                  "examples": [
                    "The muskets popped away on all sides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To burst (something) with a popping sound.",
                  "examples": [
                    "The boy with the pin popped the balloon.",
                    "This corn pops well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, with in, out, upon, etc.) To enter, or issue forth, with a quick, sudden movement; to move from place to place suddenly; to dart.",
                  "examples": [
                    "A rabbit popped out of the hole."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, Australia) To place (something) (somewhere); to move or position (something) with a short movement.",
                  "examples": [
                    "Just pop it in the fridge for now.",
                    "He popped his head around the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, UK, Canada, Australia, often with over, round, along, etc.) To make a short trip or visit.",
                  "examples": [
                    "I'm just popping round to the newsagent.",
                    "I'll pop by your place later today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stand out; to be distinctive to the senses.",
                  "examples": [
                    "This colour really pops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit (something or someone).",
                  "examples": [
                    "He popped me on the nose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To shoot (usually somebody) with a firearm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, vulgar, slang) To ejaculate; to orgasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To remove (a data item) from the top of a stack.",
                  "examples": [
                    "Once the callee (the called function) terminates, it cleans the stack that it has been locally using and pops the next value stored on top of the stack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To give birth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To pawn (something) (to raise money).",
                  "examples": [
                    "I had to pop my watch to see me through until pay-day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To swallow or consume (especially a tablet of a drug, sometimes extended to other small items such as sweets or candy).",
                  "examples": [
                    "We were drinking beer and popping pills — some really strong downers. I could hardly walk and I had no idea what I was saying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To perform (a move or stunt) while riding a board or vehicle.",
                  "examples": [
                    "Huck spun along the beams and joists, making me gulp when she popped a wheelie or swerved past a gaping hole..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of the ears) To undergo equalization of pressure when the Eustachian tubes open.",
                  "examples": [
                    "My ears popped as the aeroplane began to ascend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) To perform the popping style of dance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To arrest.",
                  "examples": [
                    "He's on probation. We can pop him right now for gang association."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From papa or poppa."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pop (plural pops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, endearing) One's father.",
                  "examples": [
                    "My pop used to tell me to do my homework every night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Clipping of popular."
      ],
      "adjectives": [
        {
          "description": "pop (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used attributively in set phrases) Popular.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pop (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pop music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From colloquial Russian поп (pop) and Попъ (Pop), from Old Church Slavonic попъ (popŭ), from Byzantine Greek παπᾶς (papâs) (see pope). Doublet of pope."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pop (plural pops)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Russian Orthodoxy, uncommon) A Russian Orthodox priest; a parson.",
                  "examples": [
                    "There was at that time in the house of the Consul a Pop (or Russian Priest) named Iwan Afanassich."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}