{
  "word": "harlequin",
  "etymologies": [
    {
      "description": [
        "From earlier Harlicken, from Middle French Harlequin (in Italian Arlecchino, the name of a popular servant character in commedia dell'arte plays), from Old French Harlequin, Halequin, Herlequin, Hellequin, Hierlekin, Hellekin (a demon, malevolent spirit), probably of Germanic origin, connected to the Old English figure of Herla Cyning (“King Herla”, a mythical figure identified with Woden) or possibly to Old Frisian helle kin, Old English helle cyn, Old Norse heljar kyn (“the kindred of Hell”). Related to Middle English Hurlewain (“a mischievous sprite or goblin”)."
      ],
      "adjectives": [
        {
          "description": "harlequin (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Brightly colored, especially in a pattern like that of a harlequin clown's clothes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a greenish-chartreuse color.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "harlequin (plural harlequins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pantomime fool, typically dressed in colorful checkered clothes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A greenish-chartreuse color.",
                  "examples": [
                    "harlequin:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A harlequin duck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various riodinid butterflies of the genera Taxila and Praetaxila.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "harlequin (third-person singular simple present harlequins, present participle harlequining, simple past and past participle harlequined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove or conjure away, as if by a harlequin's trick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make sport by playing ludicrous tricks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}