{
  "word": "box",
  "etymologies": [
    {
      "description": [
        "From Middle English box (“container, box, cup”), from Old English box (“box-tree; box, case”), from Proto-West Germanic *buhs (“box tree; thing made from boxwood; box”), either from Latin buxus (“box tree; thing made from boxwood”), buxum (“box tree; boxwood”) (possibly from πύξος (púxos, “box tree; boxwood”)); or from Late Latin buxis (“box”), Latin pyxis (“small box for medicines or toiletries”) (from Ancient Greek πυξίς (puxís, “box or tablet made of boxwood; box; cylinder”), from πύξος (púxos) + -ῐς (-is, “suffix forming feminine nouns”)). Doublet of pyx.",
        "If the latter derivation is correct, the word is cognate with Middle Dutch bosse, busse (“jar; tin; round box”) (modern Dutch bos (“wood, forest”), bus (“container, box; bushing of a wheel”)), Old High German buhsa (Middle High German buhse, bühse, modern German Büchse (“box; can”)), Swedish hjulbössa (“wheel-box”).",
        "The humorous plural form boxen is from box + -en, by analogy with oxen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "box (plural boxes or (nonstandard, computing, humorous) boxen)",
          "definitionGroups": [
            {
              "group": "Senses relating to a three-dimensional object or space.",
              "entries": [
                {
                  "meaning": "A cuboid space; a cuboid container, often with a hinged lid.",
                  "examples": [
                    "Synonyms: case, package"
                  ]
                },
                {
                  "meaning": "A cuboid container and its contents; as much as fills such a container.",
                  "examples": [
                    "Synonym: boxful",
                    "a box of books"
                  ]
                },
                {
                  "meaning": "A compartment (as a drawer) of an item of furniture used for storage, such as a cupboard, a shelf, etc.",
                  "examples": []
                },
                {
                  "meaning": "A compartment or receptacle for receiving items.",
                  "examples": [
                    "post box  post office box"
                  ]
                },
                {
                  "meaning": "A numbered receptacle at a newspaper office for anonymous replies to advertisements; see also box number.",
                  "examples": []
                },
                {
                  "meaning": "A compartment to sit inside in an auditorium, courtroom, theatre, or other building.",
                  "examples": [
                    "Synonym: loge"
                  ]
                },
                {
                  "meaning": "The driver's seat on a horse-drawn coach.",
                  "examples": [
                    "Synonym: box seat"
                  ]
                },
                {
                  "meaning": "A small rectangular shelter.",
                  "examples": [
                    "Synonyms: shelter, booth",
                    "sentry-box"
                  ]
                },
                {
                  "meaning": "Short for horsebox (“container for transporting horses”).",
                  "examples": []
                },
                {
                  "meaning": "(automotive) Short for gearbox.",
                  "examples": []
                },
                {
                  "meaning": "(rail transport) Short for signal box.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) A predicament or trap.",
                  "examples": [
                    "I’m really in a box now."
                  ]
                },
                {
                  "meaning": "(slang) A prison cell.",
                  "examples": [
                    "Synonym: hole"
                  ]
                },
                {
                  "meaning": "(slang) A cell used for solitary confinement.",
                  "examples": [
                    "Synonym: hole"
                  ]
                },
                {
                  "meaning": "(euphemistic) A coffin.",
                  "examples": []
                },
                {
                  "meaning": "(slang) Preceded by the: television.",
                  "examples": [
                    "Synonyms: (Britain) telly, tube, TV"
                  ]
                },
                {
                  "meaning": "(slang, vulgar) The vagina.",
                  "examples": [
                    "Synonyms: see Thesaurus:vagina"
                  ]
                },
                {
                  "meaning": "(computing, slang) A computer, or the case in which it is housed.",
                  "examples": [
                    "Synonyms: computer, machine; see also Thesaurus:computer",
                    "a UNIX box"
                  ]
                },
                {
                  "meaning": "(slang) A gym dedicated to the CrossFit exercise program.",
                  "examples": []
                },
                {
                  "meaning": "(cricket) A hard protector for the genitals worn inside the underpants by a batsman or close fielder.",
                  "examples": [
                    "Synonym: (US) cup"
                  ]
                },
                {
                  "meaning": "(cricket) Synonym of gully (“a certain fielding position”)",
                  "examples": []
                },
                {
                  "meaning": "(engineering) A cylindrical casing around the axle of a wheel, a bearing, a gland, etc.",
                  "examples": []
                },
                {
                  "meaning": "(fencing) A device used in electric fencing to detect whether a weapon has struck an opponent, which connects to a fencer's weapon by a spool and body wire. It uses lights and sound to notify a hit, with different coloured lights for on target and off target hits.",
                  "examples": []
                },
                {
                  "meaning": "(dated) A small country house.",
                  "examples": [
                    "“I dare say the sheriff, or the mayor and corporation, or some of those sort of people, would give him money enough, for the use of it, to run him up a mighty pretty neat little box somewhere near Richmond.”"
                  ]
                },
                {
                  "meaning": "(colloquial, chiefly Southern US) A stringed instrument with a soundbox, especially a guitar. [from 20th c.]",
                  "examples": [
                    "So Tea Cake took the guitar and played himself. He was glad of the chance because he hadn't had his hand on a box since he put his in the pawn shop to get some money to hire a car for Janie soon after he met her."
                  ]
                }
              ]
            },
            {
              "group": "Senses relating to a two-dimensional object or space",
              "entries": [
                {
                  "meaning": "A rectangle: an oblong or a square.",
                  "examples": [
                    "Place a tick in the box.",
                    "This text would stand out better if we put it in a coloured box."
                  ]
                },
                {
                  "meaning": "(baseball) The rectangle in which the batter stands.",
                  "examples": []
                },
                {
                  "meaning": "(genetics) One of two specific regions in a promoter.",
                  "examples": []
                },
                {
                  "meaning": "(juggling) A pattern usually performed with three balls where the movements of the balls make a boxlike shape.",
                  "examples": []
                },
                {
                  "meaning": "(lacrosse, informal) Short for box lacrosse (“indoor form of lacrosse”).",
                  "examples": []
                },
                {
                  "meaning": "(soccer) The penalty area.",
                  "examples": []
                },
                {
                  "meaning": "(aviation) A diamond-shaped flying formation consisting of four aircraft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "box (third-person singular simple present boxes, present participle boxing, simple past and past participle boxed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place inside a box; to pack in one or more boxes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Usually followed by in: to surround and enclose in a way that restricts movement; to corner, to hem in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mix two containers of paint of similar colour to ensure that the color is identical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, agriculture) To make an incision or hole in (a tree) for the purpose of procuring the sap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, architecture) To enclose with boarding, lathing, etc., so as to conceal (for example, pipes) or to bring to a required form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, engineering) To furnish (for example, the axle of a wheel) with a box.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, graphic design, printing) To enclose (images, text, etc.) in a box.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, object-oriented programming) To place a value of a primitive type into a corresponding object.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English box (“box tree; boxwood”), from Old English box (“box tree”), from Proto-West Germanic *buhs (“box tree; thing made from boxwood”), from Latin buxus (“box tree; thing made from boxwood”), buxum (“box tree; boxwood”), possibly from πύξος (púxos, “box tree; boxwood”). Identical to etymology 1; the wood and container senses have existed in parallel since the word's origin in Latin and Ancient Greek."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "box (plural boxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various evergreen shrubs or trees of genus Buxus, especiallycommon box, European box, or boxwood (Buxus sempervirens) which is often used for making hedges and topiary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wood from a box tree: boxwood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, slang) A musical instrument, especially one made from boxwood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) An evergreen tree of the genus Lophostemon (for example, box scrub, Brisbane box, brush box, pink box, or Queensland box, Lophostemon confertus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Various species of Eucalyptus trees are popularly called various kinds of boxes, on the basis of the nature of their wood, bark, or appearance for example, the drooping (Eucalyptus bicolor), shiny-leaved (Eucalyptus tereticornis), black, or ironbark box trees.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English box (“a blow; a stroke with a weapon”); further origin uncertain. The following etymologies have been suggested:",
        "The verb is from Middle English boxen (“to beat or whip (an animal)”), which is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "box (plural boxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blow with the fist.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "box (third-person singular simple present boxes, present participle boxing, simple past and past participle boxed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike with the fists; to punch.",
                  "examples": [
                    "box someone’s ears",
                    "Leave this place before I box you!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, boxing) To fight against (a person) in a boxing match.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative, boxing) To participate in boxing; to be a boxer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin bōx, from Ancient Greek βῶξ (bôx, “box (marine fish)”), from βοῦς (boûs, “ox”) + ὤψ (ṓps, “eye, view”), a reference to the large size of the fish's eyes relative to its body."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "box (plural boxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A Mediterranean food fish of the genus Boops, which is a variety of sea bream; a bogue or oxeye.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}