{
  "word": "anathema",
  "etymologies": [
    {
      "description": [
        "Borrowed from Late Latin anathema (“curse, person cursed, offering”), itself a borrowing from Ancient Greek ἀνάθεμα (anáthema, “something dedicated, especially dedicated to eternal damnation”), from ἀνατίθημι (anatíthēmi, “I set upon, offer as a votive gift”), from ἀνά (aná, “upon”) + τίθημι (títhēmi, “I put, place”). The Ancient Greek term was influenced by Hebrew חרם‎ (herem), leading to the sense of \"accursed,\" especially in Ecclesiastical writers."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anathema (plural anathemas or anathemata)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical, historical) A ban or curse pronounced with religious solemnity by ecclesiastical authority, often accompanied by excommunication; something denounced as accursed. [from early 17th c.]",
                  "examples": [
                    "Synonyms: ban, curse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Something which is vehemently disliked by somebody.",
                  "examples": [
                    "Synonym: bête noire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) An imprecation; a curse; a malediction.",
                  "examples": [
                    "I trembled at his ringing wealth",
                    "Of manifold anathemas  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) Any person or thing anathematized, or cursed by ecclesiastical authority to unending punishment. [from 1520s]",
                  "examples": [
                    "Ἆνάθεμα, accurẛed, חרם, which the Septuagint renders Anathema, ẛignifies Perẛons or Things devoted to Deẛtruction and Extermination. The Jewiẛh Nation were now an Anathema, deẛtin'd to Deẛtruction. St. Paul to expreẛs his Affection to them, ẛays, he could wiẛh to ẛave them from it, to become an Anathema and be deẛtroy'd himẛelf."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}