{
  "word": "reward",
  "etymologies": [
    {
      "description": [
        "From Middle English reward, rewarde, from Old French reward (“reward”) (compare Old French regard, whence modern French regard, and also English regard through Middle French), from rewarder (“to reward”) (compare Old French reguarder), from re- + warder (“to guard, keep”) (compare Old French guarder); the Anglo-Norman forms are derived from Old Northern French variants of Old French, ultimately of Germanic (Frankish) origin. Compare regard, warden, guard. See more below.",
        "Mostly displaced Old English mēd, whence Modern English meed. Displaced Old English lēan and edlēan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reward (plural rewards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something of value given in return for an act.",
                  "examples": [
                    "For catching the thief, you'll get a nice reward.",
                    "Synonyms: payment, recompense, tithing, meed",
                    "Antonym: punishment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prize promised for a certain deed or catch",
                  "examples": [
                    "The rewards for bringing in badly wanted criminals are printed on 'dead or alive' posters.",
                    "Synonym: bounty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of an action, whether good or bad.",
                  "examples": [
                    "Is this the reward I get for telling the truth: to be put in jail?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rewarden, from Anglo-Norman rewarder (“to reward”), from re- + warder (“to guard, keep”), from Old Northern French [Term?], from Frankish *wardōn (“to guard, keep”), from Proto-Germanic *wardōną (“to guard, defend”), from Proto-Indo-European *wer- (“to cover, shelter, defend, guard, shut”). Cognate with Old Saxon wardōn (“to guard, provide for, protect”), Old English weardian (“to guard”), Old High German wartēn (“to watch, keep, look after”). More at ward.",
        "Displaced Old English lēanian. In this sense, displaced Old English ġieldan, whence Modern English yield."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "reward (third-person singular simple present rewards, present participle rewarding, simple past and past participle rewarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a reward to or for.",
                  "examples": [
                    "Why are you rewarding the child for misbehaving?",
                    "Why are you rewarding that bad behaviour?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To recompense.",
                  "examples": [
                    "Decorations are meant to reward the most meritous acts and services."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To give (something) as a reward.",
                  "examples": [
                    "Thou hast rewarded me good, whereas I have rewarded thee evil."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}