{
  "word": "supine",
  "etymologies": [
    {
      "description": [
        "The adjective is borrowed from Latin supīnus, from *sup- (see sub (“under”)) + -īnus (“of, pertaining to”). The word is cognate with Catalan supí, Italian supino, Old French sovin, Middle French souvin, Anglo-Norman supin, Old Occitan sobin, sopin, Portuguese supino, Spanish supino. Partly displaced Old English upweard (“upward, supine”), whence Modern English upward.",
        "The noun is from Late Middle English supin (“supine of a Latin verb”) or Middle French supin (“(grammar) supine”), from Latin supīnum, (ellipsis of supīnum verbum (“supine verb”)), from supīnus; further etymology above."
      ],
      "adjectives": [
        {
          "description": "supine (comparative more supine, superlative most supine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lying on its back.",
                  "examples": [
                    "Synonym: reclined",
                    "Antonyms: prone, prostrate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of the hand, forearm or foot) turned facing toward the body; with the thumb outward or the big toe upward.",
                  "examples": [
                    "when one is washing one’s face, the hand is in the supine position; and then the forearm is also in the supine position; when the foot is resting on the outer side of the sole, it is in the supine position"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Reluctant to take action due to indifference or moral weakness; apathetic or passive towards something.",
                  "examples": [
                    "Synonyms: passive, peaceful, lazy, lethargic, listless"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, now poetic) Inclining or leaning backward; inclined, sloping.",
                  "examples": [
                    "Synonyms: inclined, sloping"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "supine (plural supines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, also attributively) In Latin and other languages: a type of verbal noun used in the ablative and accusative cases, which shares the same stem as the passive participle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, also attributively) In Swedish, Faroese, Icelandic and Old Norse: a verb form that combines with an inflection of ha/hafa/hava to form the present perfect and pluperfect tenses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, also attributively) (obsolete terminology) The 'to'-prefixed infinitive in English or other Germanic languages, so named because the infinitive was regarded as a verbal noun and the 'to'-prefixed form of it was seen as the dative form of the verbal noun; the full infinitive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}