{
  "word": "snithe",
  "etymologies": [
    {
      "description": [
        "From Middle English snithen, from Old English snīþan (“to cut, make an incision, cut off, lance or amputate, cut up or to pieces, cut so as to kill, slay an animal, hew down, cut stone, hew, cut hair, cut corn, reap, mow”), from Proto-West Germanic *snīþan, from Proto-Germanic *snīþaną (“to cut”), from Proto-Indo-European *sneyt- (“to cut”).",
        "Cognate with Saterland Frisian sniede (“to cut”), West Frisian snije (“to cut”), Dutch snijden (“to cut, carve, intersect”), Low German snieden (“to cut”), German schneiden (“to cut, trim, slice”), Swedish snida (“to carve, engrave”), Icelandic sníða (“to trim, tailor”). Related to snide."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "snithe (third-person singular simple present snithes, present participle snithing, simple past snithed or snothe, past participle snithed or snithen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now chiefly dialectal, Northern England) To cut; to make an incision; to cut off; to lance or amputate; to cut up; to cut so as to kill; to slay an animal; to hew; to cut stone; to cut hair; to cut corn; to reap; to mow.",
                  "examples": [
                    "Snithe a piece off with thy knife."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English snithe (“cutting, sharp”), from snithen (“to cut”), see above."
      ],
      "adjectives": [
        {
          "description": "snithe (comparative more snithe, superlative most snithe)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sharp; cutting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of wind or weather) Cold, piercing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variation of sny."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "snithe (third-person singular simple present snithes, present participle snithing, simple past and past participle snithed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of sny (abound, swarm, teem, be infested). [17th century]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}