{
  "word": "lantern",
  "etymologies": [
    {
      "description": [
        "Middle English lanterne (13th century), via Old French lanterne from Latin lanterna (“lantern”), itself a corruption of Ancient Greek λαμπτήρ (lamptḗr, “torch”) (see lamp, λάμπω (lámpō)) by influence of Latin lucerna (“lamp”). The spelling lanthorn was current during the 16th to 19th centuries and originates with a folk etymology associating the word with the use of horn as translucent cover. For the verb, compare French lanterner to hang at the lamppost. Displaced native Old English lēohtfæt (literally “light-container”)."
      ],
      "adjectives": [
        {
          "description": "lantern (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a facial feature, large and squarish in shape as an old-fashioned lantern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lantern (plural lanterns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A case of translucent or transparent material made to protect a flame, or light, used to illuminate its surroundings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) Especially, a metal casing with lens used to illuminate a stage (e.g. spotlight, floodlight).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) An open structure of light material set upon a roof, to give light and air to the interior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A cage or open chamber of rich architecture, open below into the building or tower which it crowns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A smaller and secondary cupola crowning a larger one, for ornament, or to admit light.",
                  "examples": [
                    "the lantern of the cupola of the Capitol at Washington, or that of the Florence cathedral"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A lantern pinion or trundle wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(steam engines) A kind of cage inserted in a stuffing box and surrounding a piston rod, to separate the packing into two parts and form a chamber between for the reception of steam, etc.; a lantern brass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A light formerly used as a signal by a railway guard or conductor at night.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) A perforated barrel to form a core upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Aristotle's lantern",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lantern (third-person singular simple present lanterns, present participle lanterning, simple past and past participle lanterned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with a lantern.",
                  "examples": [
                    "to lantern a lighthouse"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}