{
  "word": "sky",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English ski, skie, sky (“firmament, heavens, sky; cloud; cloud of mist or vapour; fog, mist; (astrology) certain configuration of the heavens; (astronomy) sphere of the celestial realm; (physiology) cloudiness, smoky residue (for example, in urine)”) [and other forms], from Old Norse ský (“cloud”), from Proto-Germanic *skiwją (“cloud; sky”), from *skiwô (“cloud; cloud cover, haze; sky”) (whence Old English sċēo (“cloud”) and Middle English skew (“air; sky; (rare) cloud”)), from Proto-Indo-European *(s)kewH- (“to cover; to conceal, hide”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sky (plural skies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The atmosphere above a given point, especially as visible from the surface of the Earth as the place where the sun, moon, stars, and clouds are seen.",
                  "examples": [
                    "Synonyms: blue, firmament, heaven, (chiefly Scotland) lift, (literary or poetic, archaic) welkin",
                    "That year, a meteor fell from the sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "With a descriptive word: the part of the sky which can be seen from a specific place or at a specific time; its climate, condition, etc.",
                  "examples": [
                    "I lay back under a warm Texas sky.",
                    "We’re not sure how long the cloudy skies will last."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly literary and poetic, archaic) Usually preceded by the: the abode of God or the gods, angels, the souls of deceased people, etc.; heaven; also, powers emanating from heaven.",
                  "examples": [
                    "This mortal has incurred the wrath of the skies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of sky blue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, theoretical physics) The set of all lightlike lines (or directions) passing through a given point in space-time.",
                  "examples": [
                    "Synonym: celestial sphere"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, informal, rare) In an art gallery: the upper rows of pictures that cannot easily be seen; also, the place where such pictures are hung.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A cloud. [13th–16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sky (third-person singular simple present skies, present participle skying, simple past and past participle skied or skyed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(informal) To drink (a beverage) from a container without one's lips touching the container.",
                  "examples": []
                },
                {
                  "meaning": "(informal, dated) To hang (a picture on exhibition) near the top of a wall, where it cannot easily be seen; (by extension) to put (something) in an undesirable place.",
                  "examples": [
                    "Antonym: floor"
                  ]
                },
                {
                  "meaning": "(slang, dated) To toss (something) upwards; specifically, to flip (a coin).",
                  "examples": []
                },
                {
                  "meaning": "(sports)",
                  "examples": []
                },
                {
                  "meaning": "To clear (a high jump bar, hurdle, etc.) by a large margin.",
                  "examples": []
                },
                {
                  "meaning": "(ball games) To hit, kick, or throw (a ball) extremely high.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To raise (the price of an item on auction, or the level of the bids generally) by bidding high.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To move quickly, as if by flying; to fly; also, to escape, to flee (especially by airplane).",
                  "examples": []
                },
                {
                  "meaning": "(sports)",
                  "examples": []
                },
                {
                  "meaning": "(ball games) To hit, kick, or throw a ball extremely high.",
                  "examples": []
                },
                {
                  "meaning": "(rowing) To raise an oar too high above the water.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}