{
  "word": "transference",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "transference (countable and uncountable, plural transferences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of conveying from one place to another; the act of transferring or the fact of being transferred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) The process by which emotions and desires, originally associated with one person, such as a parent, are unconsciously shifted to another.",
                  "examples": [
                    "Furthermore, although probably few analysts still believe that transference occurs only in the context of the psycho- analytic situation, many hold that this phenomenon pertains only to object relationships. I submit, however, that the char- acteristic features of transference can be observed in other situations as well, especially in the area of learned skills.6 Thus, speaking a language with a foreign accent is one of the most striking everyday examples of transference. In the tradi- tional concept of transference, one person (the analysand) behaves toward another (the analyst) as if the latter were someone else, previously familiar to him; and the subject is usually unaware of the actual manifestations of his own trans- ferred behavior. In exactly the same way, persons who speak English (or any other language) with a foreign accent treat English as if it were their mother tongue; and they are usually unaware of the actual manifestations of their transferred be- havior. Such persons think of themselves as speaking unac- cented English: they cannot hear their own distortions of the language when they speak. Only when their accent is pointed out to them, or, better, only when they hear their recorded voices played back to them, do they recognize their linguistic transferences. These are striking parallels not only between the stereotyped behavioral acts due to previous habit, but also between the necessity for auxiliary channels of information outside the person's own self for recognizing the effects of these habits. This view of transference rests on empirical observations concerning the basic human tendency to general- ize experiences.＊"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}