{
  "word": "jabber",
  "etymologies": [
    {
      "description": [
        "From Middle English jaberen, javeren, chaveren (“to chatter, babble”), dissimilated forms of jablen, chavelen (“to jabber”), from Middle English chavel (\"jaw\"; > modern English jowl). Equivalent to jowl +‎ -er (iterative suffix)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jabber (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rapid or incoherent talk, with indistinct utterance; gibberish.",
                  "examples": [
                    "And, is there less Probability in my Account of the Houyhnhnms or Yahoos, when it is manifest as to the latter, there are so many Thousands even in this City, who only differ from their Brother Brutes in Houyhnhnmland, because they use a Sort of a Jabber, and do not go naked."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jabber (third-person singular simple present jabbers, present participle jabbering, simple past and past participle jabbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk rapidly, indistinctly, or unintelligibly; to utter gibberish or nonsense.",
                  "examples": [
                    "Allanson made some sound in his throat, as if attempting to speak, but his tongue refused its office, and he only jabbered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter rapidly or indistinctly; to gabble.",
                  "examples": [
                    "He wept very little, but when he wept he howled aloud, and jabbered wild abuse, threats and recriminations through the wet torrent of his howling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From jab +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jabber (plural jabbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who or that which jabs.",
                  "examples": [
                    "Have the boys box, one jabbing and the other practicing the methods of boxing a jabber."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) One who administers a hypodermic injection, especially of a COVID-19 vaccine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of hand-operated corn planter.",
                  "examples": [
                    "The jabber was the most popular hand-operated corn planter ever devised.  […]  Inset shows jaws closed for jabbing (left) and open for depositing kernels (right)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}