{
  "word": "loft",
  "etymologies": [
    {
      "description": [
        "From Middle English lofte (“air, sky, upper region, loft”), from Old English loft, (doublet of native Old English lyft) of North Germanic origin, from Old Norse lopt (“upper chamber, attic, region of sky, air”), from Proto-Germanic *luftuz (“air, sky”).",
        "Akin to Scots lift (“air; sky; firmament”), Dutch lucht (“air”), German Luft (“air”), Old English lyft (“air”). More at lift, aloft."
      ],
      "adjectives": [
        {
          "description": "loft (comparative more loft, superlative most loft)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) lofty; proud; haughty",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "loft (plural lofts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, except in derivatives) air, the air; the sky, the heavens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attic or similar space (often used for storage) in the roof of a house or other building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) The thickness of a soft object when not under pressure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gallery or raised apartment in a church, hall, etc.",
                  "examples": [
                    "an organ loft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The pitch or slope of the face of a golf club (tending to drive the ball upward).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A floor or room placed above another.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "loft (third-person singular simple present lofts, present participle lofting, simple past and past participle lofted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To propel high into the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fly or travel through the air, as though propelled",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) To throw the ball erroneously through the air instead of releasing it on the lane's surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with a loft space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise (a bed) on tall supports so that the space beneath can be used for something else.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}