{
  "word": "mutter",
  "etymologies": [
    {
      "description": [
        "From Middle English muteren, moteren, of imitative origin. Compare Low German mustern, musseln (“to whisper”), German muttern (“to mutter; whisper”), Old Norse muðla (“to murmur”). Compare also Latin muttīre, mutīre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mutter (plural mutters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A repressed or obscure utterance; an instance of muttering.",
                  "examples": [
                    "The prisoners were docile, and accepted their lot with barely a mutter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mutter (third-person singular simple present mutters, present participle muttering, simple past and past participle muttered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To utter words, especially complaints or angry expressions, indistinctly or with a low voice and lips partly closed; to say under one's breath.",
                  "examples": [
                    "You could hear the students mutter as they were served sodden spaghetti, yet again, in the cafeteria.",
                    "The beggar muttered words of thanks, as passersby dropped coins in his cup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To speak softly and incoherently, or with imperfect articulations.",
                  "examples": [
                    "The asylum inmate muttered some doggerel about chains and pains to himself, over and over."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a sound with a low, rumbling noise.",
                  "examples": [
                    "April could hear the delivery van's engine muttering in the driveway."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Hindi मटर (maṭar)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mutter",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Indian cuisine) Peas.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}