{
  "word": "habitude",
  "etymologies": [
    {
      "description": [
        "From Middle English habitude, from Middle French habitude, from Latin habitūdō (“condition, plight, habit, appearance”), from habeō (“I have, hold, keep”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "habitude (countable and uncountable, plural habitudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) The essential character of one's being or existence; native or normal constitution; mental or moral constitution; bodily condition; native temperament.",
                  "examples": [
                    "His real habitude gave life and grace To appertainings and to ornament."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Habitual disposition; normal or characteristic mode of behaviour, whether from habit or from nature",
                  "examples": [
                    "An habitude of commanding his passions in order to his health."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Behaviour or manner of existence in relation to something else; relation; respect.",
                  "examples": [
                    "Proportion ... signifies the habitude or relation of one quantity to another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In full habitude: fully, wholly, entirely; in all respects.",
                  "examples": [
                    "Although I believe not the report in full habitude."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) habitual association; familiar relation; acquaintance; familiarity; intimacy; association; intercourse.",
                  "examples": [
                    "The discourse of some with whom I have had some habitudes since my coming home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) an associate; an acquaintance; someone with whom one is familiar.",
                  "examples": [
                    "La Corneus and Sallyes were the only habitudes we had."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Habit; custom; usage.",
                  "examples": [
                    "Which  […]  by long habitude, are thought rather vertue than vice among them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, chemistry, in the plural) The various ways in which one substance reacts with another; chemical reaction.",
                  "examples": [
                    "Most authors who have had occasion to describe naphthaline, have noticed its habitudes with sulphuric acid."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}