{
  "word": "pedestal",
  "etymologies": [
    {
      "description": [
        "From Middle French piédestal, from Italian piedistallo (pie \"foot\" di \"of\" stallo \"stand\") \"footstand\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pedestal (plural pedestals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The base or foot of a column, statue, vase, lamp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A place of reverence or honor.",
                  "examples": [
                    "He has put his mother on a pedestal. You can't say a word against her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A casting secured to the frame of a truck of a railcar and forming a jaw for holding a journal box.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(machining) A pillow block; a low housing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge building) An iron socket, or support, for the foot of a brace at the end of a truss where it rests on a pier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(steam heating) a pedestal coil, group of connected straight pipes arranged side by side and one above another, used in a radiator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) A ground-level housing for a passive connection point for underground cables.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) The measured value when no input signal is given.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The central part of the cockpit, between the pilots, where various controls are located.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tough protuberant pad covering a dromedary's sternum, which, when the camel lies down, causes the abdomen to be slightly above the hot ground.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pedestal (third-person singular simple present pedestals, present participle pedestaling, simple past and past participle pedestaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set or support on (or as if on) a pedestal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}