{
  "word": "toil",
  "etymologies": [
    {
      "description": [
        "From Middle English toilen, toylen, apparently a conflation of Anglo-Norman toiller (“to agitate, stir up, entangle”) (compare Old Northern French tooillier, tooullier (“to agitate, stir”); of unknown origin), and Middle English tilyen, telien, teolien, tolen, tolien, tulien (“to till, work, labour”), from Old English tilian, telian, teolian, tiolian (“to exert oneself, toil, work, make, generate, strive after, try, endeavor, procure, obtain, gain, provide, tend, cherish, cultivate, till, plough, trade, traffic, aim at, aspire to, treat, cure”) (compare Middle Dutch tuylen, teulen (“to till, work, labour”)), from Proto-Germanic *tilōną (“to strive, reach for, aim for, hurry”). Cognate with Scots tulyie (“to quarrel, flite, contend”).",
        "An alternate etymology derives Middle English toilen, toylen directly from Middle Dutch tuylen, teulen (“to work, labour, till”), from tuyl (\"agriculture, labour, toil\"; > Modern Dutch tuil (“toil; work”)). Cognate with Old Frisian teula (“to labour, toil”), teule (“labour, work”), Dutch tuil (“toil, labour”). Compare also Dutch telen (“to grow; raise; cultivate, till”). More at till."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toil (countable and uncountable, plural toils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Labour, work, especially of a grueling nature.",
                  "examples": [
                    "Synonyms: derve, drudgery, swink, sweat; see also Thesaurus:drudgery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Trouble, strife.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A net or snare; any thread, web, or string spread for taking prey.",
                  "examples": [
                    "She had waited overlong, and now it was like that Ailie would escape her toils."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "toil (third-person singular simple present toils, present participle toiling, simple past and past participle toiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To labour; work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To struggle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work (something); often with out.",
                  "examples": [
                    "places well toiled and husbanded"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To weary through excessive labour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}