{
  "word": "counterpoint",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English [Term?], from Middle French contrepoint, from Medieval Latin contrāpūnctum. Equivalent to counter- +‎ point."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "counterpoint (countable and uncountable, plural counterpoints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A melody added to an existing one, especially one added to provide harmony whilst each retains its simultaneous identity; a composition consisting of such contrapuntal melodies.",
                  "examples": [
                    "I noticed  […]  that when a very cheesy synthesized violin sound plays in counterpoint with a real violin, it can quite convincingly seem as if two violins are playing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any similar contrasting element in a work of art.",
                  "examples": [
                    "As counterpoints to the glamorous looks of 1980s models such as Chistie Brinkley and Heidi Klum, heroin chic looks such as Kate Moss were thin to the point of anorectic gauntness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opposite point.",
                  "examples": [
                    "[…]  Priests; who affecting in them selves and their followers a certein Angelical puritie, fell sodainly to the very counterpoint of justifying bestialitie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "counterpoint (third-person singular simple present counterpoints, present participle counterpointing, simple past and past participle counterpointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compose or arrange such music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To serve as an opposing point against.",
                  "examples": [
                    "[…]  the dominant discourse on theory and method in the study of religions remains stuck on the debate about reductionism, which is in turn bent on representing the debate about theory and method in the study of religions as a choice between an unscientific phenomenology or an unsympathetic positivism (for phenomenology the idea that explanation is always 'bad' is perfectly counterpointed by the idea that religion is always 'good')."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old French contrepointe, a corruption of coultepointe, from Latin culcita puncta, i.e. a stitched pillow or cover. See quilt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "counterpoint (plural counterpoints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of counterpane.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}