{
  "word": "catch",
  "etymologies": [
    {
      "description": [
        "From Middle English cacchen, from Anglo-Norman cachier, variant of Old French chacier, from Late Latin captiāre, from Latin captāre, frequentative of capere. Akin to Modern French chasser (from Old French chacier) and Spanish cazar, and thus a doublet of chase. Displaced Middle English fangen (\"to catch\"; > Modern English fang (verb)), from Old English fōn (“to seize, take”); Middle English lacchen (\"to catch\" and heavily displaced Modern English latch), from Old English læċċan.",
        "The verb became irregular, possibly under the influence of the semantically similar latch (from Old English læċċan) whose past tense was lahte, lauhte, laught (Old English læhte) until becoming regularised in Modern English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "catch (countable and uncountable, plural catches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act of seizing or capturing.",
                  "examples": [
                    "The catch of the perpetrator was the product of a year of police work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act of catching an object in motion, especially a ball.",
                  "examples": [
                    "The player made an impressive catch.",
                    "Nice catch!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The act of noticing, understanding or hearing.",
                  "examples": [
                    "Good catch. I never would have remembered that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The game of catching a ball.",
                  "examples": [
                    "The kids love to play catch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something which is captured or caught.",
                  "examples": [
                    "The fishermen took pictures of their catch.",
                    "The catch amounted to five tons of swordfish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, colloquial, by extension) A find, in particular a boyfriend or girlfriend or prospective spouse.",
                  "examples": [
                    "Did you see his latest catch?",
                    "He's a good catch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A stopping mechanism, especially a clasp which stops something from opening.",
                  "examples": [
                    "She installed a sturdy catch to keep her cabinets closed tight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A hesitation in voice, caused by strong emotion.",
                  "examples": [
                    "There was a catch in his voice when he spoke his father's name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, sometimes noun adjunct) A concealed difficulty, especially in a deal or negotiation.",
                  "examples": [
                    "It sounds like a great idea, but what's the catch?",
                    "Be careful, that's a catch question."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A crick; a sudden muscle pain during unaccustomed positioning when the muscle is in use.",
                  "examples": [
                    "I bent over to see under the table and got a catch in my side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A fragment of music or poetry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A state of readiness to capture or seize; an ambush.",
                  "examples": [
                    "The common and the canon law  […]  lie at catch, and wait advantages one against another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, agriculture) A crop which has germinated and begun to grow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A type of strong boat, usually having two masts; a ketch.",
                  "examples": [
                    "Fourteene miles Northward from the river Powhatan, is the river Pamaunke, which is navigable 60 or 70 myles, but with Catches and small Barkes 30 or 40 myles farther."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) A type of humorous round in which the voices gradually catch up with one another; usually sung by men and often having bawdy lyrics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, music) The refrain; a line or lines of a song which are repeated from verse to verse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, cricket, baseball) The act of catching a hit ball before it reaches the ground, resulting in an out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, cricket) A player in respect of his catching ability; particularly one who catches well.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, rowing) The first contact of an oar with the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, phonetics) A stoppage of breath, resembling a slight cough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Passing opportunities seized; snatches.",
                  "examples": [
                    "the way it has been writ in, by catches, and many long intervals of interruption"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slight remembrance; a trace.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "catch (third-person singular simple present catches, present participle catching, simple past and past participle caught)",
          "definitionGroups": [
            {
              "group": "(heading) To capture, overtake.",
              "entries": [
                {
                  "meaning": "(transitive) To capture or snare (someone or something which would rather escape). [from 13thc.]",
                  "examples": [
                    "I hope I catch a fish.",
                    "He ran but we caught him at the exit.",
                    "The police caught the robber at a nearby casino."
                  ]
                },
                {
                  "meaning": "(transitive) To entrap or trip up a person; to deceive. [from 14thc.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive, figuratively, dated) To marry or enter into a similar relationship with.",
                  "examples": [
                    "The public […] said that Miss Bogardus was a suffragist because she had never caught a man; that she wanted something, but it wasn't the vote."
                  ]
                },
                {
                  "meaning": "(transitive) To reach (someone) with a strike, blow, weapon etc. [from 16thc.]",
                  "examples": [
                    "If he catches you on the chin, you'll be on the mat."
                  ]
                },
                {
                  "meaning": "(transitive) To overtake or catch up to; to be in time for. [from 17thc.]",
                  "examples": [
                    "If you leave now you might catch him.",
                    "I would love to have dinner but I have to catch a plane."
                  ]
                },
                {
                  "meaning": "(transitive) To unpleasantly discover unexpectedly; to unpleasantly surprise (someone doing something). [from 17thc.]",
                  "examples": [
                    "He was caught on video robbing the bank.",
                    "He was caught in the act of stealing a biscuit."
                  ]
                },
                {
                  "meaning": "(transitive) To travel by means of. [from 19thc.]",
                  "examples": [
                    "catch the bus"
                  ]
                },
                {
                  "meaning": "(transitive, rare) To become pregnant. (Only in past tense or as participle.) [from 19thc.]",
                  "examples": [
                    "Had Nancy got caught with a child? If so she would destroy her parent's dreams for her."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To seize hold of.",
              "entries": [
                {
                  "meaning": "(transitive, dated) To grab, seize, take hold of. [from 13thc.]",
                  "examples": [
                    "I caught her by the arm and turned her to face me."
                  ]
                },
                {
                  "meaning": "(transitive) To take or replenish something necessary, such as breath or sleep. [from 14thc.]",
                  "examples": [
                    "I have to stop for a moment and catch my breath",
                    "I caught some Z's on the train."
                  ]
                },
                {
                  "meaning": "(transitive) To grip or entangle. [from 17thc.]",
                  "examples": [
                    "My leg was caught in a tree-root."
                  ]
                },
                {
                  "meaning": "(intransitive) To be held back or impeded.",
                  "examples": [
                    "Be careful your dress doesn't catch on that knob.",
                    "His voice caught when he came to his father's name."
                  ]
                },
                {
                  "meaning": "(intransitive) To engage with some mechanism; to stick, to succeed in interacting with something or initiating some process.",
                  "examples": [
                    "Push it in until it catches.",
                    "The engine finally caught and roared to life."
                  ]
                },
                {
                  "meaning": "(transitive) To have something be held back or impeded.",
                  "examples": [
                    "I caught my heel on the threshold."
                  ]
                },
                {
                  "meaning": "(intransitive) To make a grasping or snatching motion (at). [from 17thc.]",
                  "examples": [
                    "He caught at the railing as he fell."
                  ]
                },
                {
                  "meaning": "(transitive) Of fire, to spread or be conveyed to. [from 18thc.]",
                  "examples": [
                    "The fire spread slowly until it caught the eaves of the barn."
                  ]
                },
                {
                  "meaning": "(transitive, rowing) To grip (the water) with one's oars at the beginning of the stroke. [from 19thc.]",
                  "examples": [
                    "Stop gathering, in that gradual fashion, and catch the water sharply and decisively."
                  ]
                },
                {
                  "meaning": "(intransitive, agriculture) To germinate and set down roots. [from 19thc.]",
                  "examples": [
                    "The seeds caught and grew."
                  ]
                },
                {
                  "meaning": "(transitive, surfing) To contact a wave in such a way that one can ride it back to shore.",
                  "examples": [
                    "If you are surfing a wave through the rocks, make sure you have a clear route before catching the wave."
                  ]
                },
                {
                  "meaning": "(transitive, computing) To handle an exception. [from 20thc.]",
                  "examples": [
                    "When the program catches an exception, this is recorded in the log file."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To intercept.",
              "entries": [
                {
                  "meaning": "(transitive) To seize or intercept an object moving through the air (or, sometimes, some other medium). [from 16thc.]",
                  "examples": [
                    "I will throw you the ball, and you catch it.",
                    "Watch me catch this raisin in my mouth."
                  ]
                },
                {
                  "meaning": "(transitive, now rare) To seize (an opportunity) when it occurs. [from 16thc.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive, cricket) To end a player's innings by catching a hit ball before the first bounce. [from 18thc.]",
                  "examples": [
                    "Townsend hit 29 before he was caught by Wilson."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, baseball) To play (a specific period of time) as the catcher. [from 19thc.]",
                  "examples": [
                    "He caught the last three innings."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To receive (by being in the way).",
              "entries": [
                {
                  "meaning": "(transitive) To be the victim of (something unpleasant, painful etc.). [from 13thc.]",
                  "examples": [
                    "You're going to catch a beating if they find out."
                  ]
                },
                {
                  "meaning": "(transitive) To be touched or affected by (something) through exposure. [from 13thc.]",
                  "examples": [
                    "The sunlight caught the leaves and the trees turned to gold.",
                    "Her hair was caught by the light breeze."
                  ]
                },
                {
                  "meaning": "(transitive) To become infected by (an illness). [from 16thc.]",
                  "examples": [
                    "Everyone seems to be catching the flu this week."
                  ]
                },
                {
                  "meaning": "(intransitive) To spread by infection or similar means.",
                  "examples": [
                    "Does the sedition catch from man to man?"
                  ]
                },
                {
                  "meaning": "(transitive, intransitive) To receive or be affected by (wind, water, fire etc.). [from 18thc.]",
                  "examples": [
                    "The bucket catches water from the downspout.",
                    "The trees caught quickly in the dry wind."
                  ]
                },
                {
                  "meaning": "(transitive) To acquire, as though by infection; to take on through sympathy or infection. [from 16thc.]",
                  "examples": [
                    "She finally caught the mood of the occasion.",
                    "And the next thing I knew, I had caught feelings for her."
                  ]
                },
                {
                  "meaning": "(transitive) To be hit by something.",
                  "examples": [
                    "He caught a bullet in the back of the head last year."
                  ]
                },
                {
                  "meaning": "(intransitive) To serve well or poorly for catching, especially for catching fish.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To get pregnant.",
                  "examples": [
                    "Well, if you didn't catch this time, we'll have more fun trying again until you do."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To take in with one's senses or intellect.",
              "entries": [
                {
                  "meaning": "(transitive) To grasp mentally: perceive and understand. [from 16thc.]",
                  "examples": [
                    "Did you catch his name?",
                    "Did you catch the way she looked at him?"
                  ]
                },
                {
                  "meaning": "(transitive, informal) To take in; to watch or listen to (an entertainment). [from 20thc.]",
                  "examples": [
                    "I have some free time tonight so I think I'll catch a movie."
                  ]
                },
                {
                  "meaning": "(transitive) To reproduce or echo a spirit or idea faithfully. [from 17thc.]",
                  "examples": [
                    "You've really caught his determination in this sketch."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To seize attention, interest.",
              "entries": [
                {
                  "meaning": "(transitive) To charm or entrance. [from 14thc.]",
                  "examples": [
                    "No, a far more natural beauty caught him."
                  ]
                },
                {
                  "meaning": "(transitive) To attract and hold (a faculty or organ of sense). [from 17thc.]",
                  "examples": [
                    "He managed to catch her attention.",
                    "The enormous scarf did catch my eye."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}