{
  "word": "piecemeal",
  "etymologies": [
    {
      "description": [
        "From Middle English pecemele, from pece (“piece”) + mele (from Old English mǣlum (“at a time”), dative plural form of mǣl (“time, measure”), taking the place of Old English styċċemǣlum (“in pieces, bit by bit, piecemeal; to pieces, to bits; here and there, in different places; little by little, by degrees, gradually”); equivalent to piece +‎ -meal."
      ],
      "adjectives": [
        {
          "description": "piecemeal (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made or done in pieces or one stage at a time.",
                  "examples": [
                    "Synonyms: stepwise; see also Thesaurus:gradual"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "piecemeal (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Piece by piece; in small amounts, stages, or degrees.",
                  "examples": [
                    "It’s as bad as selling a man a horse with half a dozen latent vices and watching him discover them piecemeal in the course of the hunting season."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Into pieces or parts.",
                  "examples": [
                    "A few years ago also there was the case of Kate Webster, who at Richmond murdered her mistress, and, fiend-like, cut the body up piecemeal, and tried to dispose of it in various ways by small portions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "piecemeal (plural piecemeals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fragment; a scrap.",
                  "examples": [
                    "Thus the world Is all to piecemeals cut"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "piecemeal (third-person singular simple present piecemeals, present participle piecemealing, simple past and past participle piecemealed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide or distribute piecemeal; dismember.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}