{
  "word": "dynamite",
  "etymologies": [
    {
      "description": [
        "Coined by Alfred Nobel in 1867. Ultimately from Ancient Greek δύναμις (dúnamis, “power”)  +‎ -ite, most likely under the influence of dynamo or dynamic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dynamite (usually uncountable, plural dynamites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A class of explosives made from nitroglycerine in an absorbent medium such as kieselguhr, used in mining and blasting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, proscribed) A stick of trinitrotoluene (TNT).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, slang, uncountable) Anything exceptionally dangerous, exciting or wonderful.",
                  "examples": [
                    "That girl was dynamite. Dark hair with killer blue eyes, bronze skin, and an exquisite full-figured body.",
                    "He warned us: \"That issue about what's been happening at that factory, is political dynamite. Keep the lid on it.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A strong drug, in particular heroin, cocaine or potent marijuana.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dynamite (third-person singular simple present dynamites, present participle dynamiting, simple past and past participle dynamited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To blow up with dynamite or other high explosive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To dismantle or destroy.",
                  "examples": [
                    "Even the successful battle in the last century to overturn the court’s infamous Plessy vs. Ferguson “separate but equal” doctrine wasn’t a frontal assault that dynamited precedent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of brakes) To apply maximum pressure to very quickly.",
                  "examples": [
                    "dynamite the brakes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of brakes) To lock up from being invoked too suddenly.",
                  "examples": [
                    "the brakes will dynamite"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}