{
  "word": "feature",
  "etymologies": [
    {
      "description": [
        "From Middle English feture, from Anglo-Norman feture, from Old French faiture, from Latin factūra, from Latin factus, from Latin faciō (“do, make”), ultimately from Proto-Indo-European *dʰeh₁- (“to put, place, set”). Doublet of facture."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "feature (plural features)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One's structure or make-up: form, shape, bodily proportions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An important or main item.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(media) A long, prominent article or item in the media, or the department that creates them; frequently used technically to distinguish content from news.",
              "entries": [
                {
                  "meaning": "(film) Ellipsis of feature film.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the physical constituents of the face (eyes, nose, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A beneficial capability of a piece of software.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cast or structure of anything, or of any part of a thing, as of a landscape, a picture, a treaty, or an essay; any marked peculiarity or characteristic.",
                  "examples": [
                    "Synonyms: see Thesaurus:characteristic",
                    "one of the features of the landscape"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) Something discerned from physical evidence that helps define, identify, characterize, and interpret an archeological site.",
                  "examples": [
                    "A feature of many Central Texas prehistoric archeological sites is a low spreading pile of stones called a rock midden. Other features at these sites may include small hearths."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) Characteristic forms or shapes of parts. For example, a hole, boss, slot, cut, chamfer, or fillet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics, machine learning) An individual measurable property or characteristic of a phenomenon being observed; the input of a model.",
                  "examples": [
                    "Coordinate term: (output) parameter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The act of being featured in a piece of music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The elements into which linguistic units can be broken down.",
                  "examples": [
                    "Hyponyms: gender, number, person, tense"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "feature (third-person singular simple present features, present participle featuring, simple past and past participle featured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ascribe the greatest importance to something within a certain context.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To star, to contain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To appear, to make an appearance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To have features resembling.",
                  "examples": [
                    "More than his talents, Roger grudged him his looks, the brown eyes, golden hair, and oval face, which made people say how Johnny Weir featured his mother."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}