{
  "word": "library",
  "etymologies": [
    {
      "description": [
        "Middle English librarie, from Anglo-Norman librarie, from Old French librairie, from Latin librarium (“bookcase, chest for books”), from librarius (“concerning books”), from liber (“the inner bark of trees; paper, parchment, book”), probably derived from a Proto-Indo-European base *leub(ʰ)- (“to strip, to peel”). Displaced native Middle English bochous, bokhus (literally “book house”), from Old English bōchūs.",
        "Romance cognates often mean “bookshop” instead: French librairie, Italian libreria, Spanish librería, Romanian librărie and Portuguese livraria. This is a relatively recent innovation (16th century in French), which ended up displacing the earlier sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "library (plural libraries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An institution which holds books and/or other forms of media for use by the public or qualified people often lending them out, as well as providing various other services for its users.",
                  "examples": [
                    "Synonym: (nonstandard) bookhouse",
                    "Coordinate terms: bookshop, bookstore"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any institution that lends out its goods for use by the public or a community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection of books or other forms of stored information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An equivalent collection of analogous information in a non-printed form, e.g. record library.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A room dedicated to storing books.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A collection of software routines that provide functionality to be incorporated into or used by a computer program.",
                  "examples": [
                    "Coordinate term: framework"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A collection of DNA material from a single organism or relative to a single disease.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The deck or draw pile.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}