{
  "word": "tog",
  "etymologies": [
    {
      "description": [
        "Shortened from earlier togman (“cloak, loose coat”), from Middle English tog, toge, togue, from Old French togue, from Latin toga (“cloak, mantle”) (compare the doublets toga and toge). It started being used by thieves and vagabonds with the noun togman, which was an old slang word for \"cloak\". By the 1700s the noun \"tog\" was used as a short form for \"togman\", and it was being used for \"coat\", and before 1800 the word started to mean \"clothing\". The verb \"tog\" came out after a short period of time and became a popular word which meant to dress up. The unit of thermal resistance was coined in the 1940s after the clo, a unit of thermal insulation of clothing, which was itself derived from clothes."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tog (plural togs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cloak.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A coat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of thermal resistance, being ten times the temperature difference (in °C) between the two surfaces of a material when the flow of heat is equal to one watt per square metre",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tog (third-person singular simple present togs, present participle togging, simple past and past participle togged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dress (often with up or out).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [
        {
          "description": "tog (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(knitting) Abbreviation of together.",
                  "examples": [
                    "Row 1 (Right side): Slip 1, K1, K2 tog, YO, K 10, (K2 tog, YO) twice, K3."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}