{
  "word": "salmon",
  "etymologies": [
    {
      "description": [
        "From Middle English samoun, samon, saumon, from Anglo-Norman saumon, from Old French saumon, from Latin salmō, salmōn-. Displaced native Middle English lax, from Old English leax. The unpronounced l was later inserted to make the word appear closer to its Latin root (compare words like debt, indict, receipt, island for the same spelling Latinizations)."
      ],
      "adjectives": [
        {
          "description": "salmon (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a pale pinkish-orange colour.",
                  "examples": [
                    "Smiley and Guillam perched disconsolately beneath it, on a bench of salmon velvet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "salmon (plural salmon or salmons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of several species of fish, typically of the Salmoninae subfamily, brownish above with silvery sides and delicate pinkish-orange flesh; they ascend rivers to spawn.",
                  "examples": [
                    "grilled salmon",
                    "salmon paté",
                    "salmon steak",
                    "Synonyms: lax, lox"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meal or dish made from this fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural salmons) A pale pinkish-orange colour, the colour of cooked salmon.",
                  "examples": [
                    "Synonym: salmon pink",
                    "salmon:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The upper bricks in a kiln which receive the least heat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) snout (tobacco; from salmon and trout)",
                  "examples": [
                    "Got any salmon?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "salmon (third-person singular simple present salmons, present participle salmoning, simple past and past participle salmoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To ride a bicycle the wrong way down a one-way street.",
                  "examples": [
                    "Some cities discourage salmoning with clever signage, like this in London: \"If you can read this you are biking the wrong way.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}