{
  "word": "tropology",
  "etymologies": [
    {
      "description": [
        "From Late Latin tropologia, from Late Greek τροπολογία (tropología), equivalent to trope + -ology."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tropology (countable and uncountable, plural tropologies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) The use of a trope (metaphor or figure of speech).",
                  "examples": [
                    "But she is not right to claim this is because \"rhetoric\" must necessarily be \"in the Nietzschean sense that all language is founded in tropology.\"37 Since when has tropology been in conflict with theology? Tropology and rhetoric thrive in the works of both Calvin and Calvino, and tropology is the very lifeblood of The Pilgrim's Progress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theology, philosophy) The interpretation of scripture or other work in order to educe moral or figurative meaning; a treatise of such interpretation.",
                  "examples": [
                    "A similar story can be told for White's tropology. Tropology also is something that “the mind brings” to (past) reality and that is not part of the past itself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A recurring motif or metaphor, a trope; an interplay of tropes.",
                  "examples": [
                    "These essays, in other words, endeavor to read the literary, cultural, and political implications of the tropologies of sexuality that are put into play once the field of sexuality becomes charged by the widespread availability of a \"homosexual\" identity, and they explore the determining relation between \"homosexuality\" and \"identity\" as both have been constructed in modern Euro-American societies."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}