{
  "word": "umbrella",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian ombrella, umbrella (“parasol, sunshade”), dim. of ombra (“shade”) (or from a Late Latin or Medieval Latin umbrella), from Latin umbra (“shadow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "umbrella (plural umbrellas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cloth-covered frame used for protection against rain or sun.",
                  "examples": [
                    "Quick, grab that umbrella before you get rained on!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Generally, anything that provides protection.",
                  "examples": [
                    "The fighters provide a defensive air umbrella over the battle group."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that covers a wide range of concepts, purposes, groups, etc.",
                  "examples": [
                    "The test facility was established under the umbrella of the company's quality program."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The main body of a jellyfish, excluding the tentacles.",
                  "examples": [
                    "Jellyfish are composed of more than 90% water and most of their umbrella mass is made up of gelatinous material."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography, television) An umbrella-shaped reflector with a white or silvery inner surface, used to diffuse a nearby light.",
                  "examples": [
                    "Using umbrellas for shooting a wedding party is ok, but not necessary."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "umbrella (third-person singular simple present umbrellas, present participle umbrellaing, simple past and past participle umbrellaed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or protect, as if by an umbrella.",
                  "examples": [
                    "Experts with saws and ladders came and lopped off the lower branches. This sent the tree's growth rushing violently to her head in a lush overhanging which umbrellaed the House of All Sorts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form the dome shape of an open umbrella.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move like a jellyfish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}