{
  "word": "remain",
  "etymologies": [
    {
      "description": [
        "From Middle English remainen, from Old French remain-, stressed stem of remanoir, from Latin remaneō, maneō, from Proto-Indo-European *men- (“to stay”).",
        "Displaced native Middle English beliven, bliven (“to remain”) (from Old English belīfan (“to remain, stay”)) due to confluence with related Middle English beleven (“to leave behind”), with which it merged. More at beleave and belive."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "remain (plural remains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) That which is left; relic; remainder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) That which is left of a human being after the life is gone; relics; a dead body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Posthumous works or productions, especially literary works.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) State of remaining; stay.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "remain (third-person singular simple present remains, present participle remaining, simple past and past participle remained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stay after others or other parts have been removed or otherwise disappeared.",
                  "examples": [
                    "After three rounds of interviews, only 5 candidates remained.",
                    "I like to make more than enough food if I have people round for dinner, so I can eat my way through what remains in the following days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) To be left after a number or quantity has been subtracted or cut off; to be left as not included or comprised.",
                  "examples": [
                    "If you divide 20 apples between three people, each gets six and two remain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To continue unchanged in place, form, or condition, or undiminished in quantity; to abide; to stay; to endure; to last.",
                  "examples": [
                    "That […] remains to be proved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To await; to be left to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) To continue in a state of being.",
                  "examples": [
                    "There was no food in the house, so I had to remain hungry.",
                    "The light remained red for two full minutes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}