{
  "word": "cutoff",
  "etymologies": [
    {
      "description": [
        "cut +‎ off"
      ],
      "adjectives": [
        {
          "description": "cutoff (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Constituting a limit or ending.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, medicine) Designating a score or value demarcating the presence (or absence) of a disease, condition, or similar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cutoff (plural cutoffs)",
          "definitionGroups": [
            {
              "group": "The point at which something terminates or to which it is limited.",
              "entries": [
                {
                  "meaning": "(medicine) A cutoff point (cutoff value, threshold value, cutpoint): the amount set by an operational definition as the transition point between states in a discretization or dichotomization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road, path or channel that provides a shorter or quicker path; a shortcut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device that stops the flow of a current.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for saving steam by regulating its admission to the cylinder (see quotation at cut-off).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cessation in a flow or activity.",
                  "examples": [
                    "If the treatment is approved, a script is written. If the script is approved, it goes into production. But this is usually a long and painful process. A cutoff can take place (and often does) at any step along the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The player who acts directly before the player on the button pre-flop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion, chiefly in the plural) Shorts made by cutting off the legs from trousers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A horizontal line separating sections of the page.",
                  "examples": [
                    "Light-face type, cutoffs, borders and rules are the universal plan. No black body matter and almost no black headlines appear."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}