{
  "word": "trammel",
  "etymologies": [
    {
      "description": [
        "From Middle English trameyle, from Old French tramail (“net for catching fish”), from Late Latin tremaculum. See Italian tramaglio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trammel (plural trammels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whatever impedes activity, progress, or freedom, such as a net or shackle.",
                  "examples": [
                    "[They] disclaim the trammels of any sordid contract."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fishing net that has large mesh at the edges and smaller mesh in the middle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of net for catching birds, fishes, or other prey.",
                  "examples": [
                    "The tuck carrieth a like fashion , save that it is narrower meshed , and ( therefore scarce lawful ) with a long bunt in the midst : the trammel differeth not much from the shape of this bunt, and serveth to such use as the wear and haking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of rings or other hanging devices, attached to a transverse bar suspended over a fire, used to hang cooking pots etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A net for confining a woman's hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of shackle used for regulating the motions of a horse and making it amble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) An instrument for drawing ellipses, one part of which consists of a cross with two grooves at right angles to each other, the other being a beam carrying two pins (which slide in those grooves), and also the describing pencil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beam compass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trammel (third-person singular simple present trammels, present participle (UK) trammelling or (US) trammeling, simple past and past participle (UK) trammelled or (US) trammeled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To entangle, as in a net.",
                  "examples": [
                    "the scarce-snatched hours",
                    "Which deepening pain left to his lordliest powers: —",
                    "Heaven lost through spider-trammelled prison-bars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confine; to hamper; to shackle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}