{
  "word": "loath",
  "etymologies": [
    {
      "description": [
        "From Middle English lōth (“loath; averse, hateful”), from Old English lāð, lāþ (“evil; loathsome”), or Old Norse leið, leiðr (“uncomfortable; tired”) from Proto-Germanic *laiþaz (“loath; hostile; sad, sorry”), ultimately from Proto-Indo-European *h₂leyt- (“to do something abhorrent or hateful”).",
        "The word is cognate with Danish led (“disgusting, loathsome; nasty”), Dutch leed (“sad; (Belgium) angry”), French laid (“ugly; morally corrupt”), Icelandic leiður (“annoyed, vexed; sad; (archaic or poetic) annoying, wearisome”), Italian laido (“filthy, foul; obscene”), Old Frisian leed, Old High German leid (Middle High German leit, modern German leid (“uncomfortable”), Leid (“grief, sorrow, woe; affliction, suffering; harm, injury; wrong”)), Old Saxon lêð, lēth (“evil person or thing”), Swedish led (“bored; tired; (archaic) disgusting, loathsome; evil”)."
      ],
      "adjectives": [
        {
          "description": "loath (comparative loather, superlative loathest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Averse, disinclined; reluctant, unwilling.",
                  "examples": [
                    "I was loath to return to the office without the Henderson file."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Angry, hostile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Loathsome, unpleasant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "loath (third-person singular simple present loaths, present participle loathing, simple past and past participle loathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of loathe",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}