{
  "word": "beam",
  "etymologies": [
    {
      "description": [
        "From Middle English beem, from Old English bēam (“tree, cross, gallows, column, pillar, wood, beam, splint, post, stock, rafter, piece of wood”), from Proto-West Germanic *baum, from Proto-Germanic *baumaz (“tree, beam, balk”), from Proto-Indo-European *bʰew- (“to grow, swell”). Cognate with West Frisian beam (“tree”), Saterland Frisian Boom (“tree”), Dutch boom (“tree”), German Low German Boom (“tree”), German Baum (“tree”), Luxembourgish Bam (“tree”), Albanian bimë (“a plant”). Doublet of boom.",
        "The original English meaning of beam (\"tree\") is preserved is some compound words such as quickbeam.",
        "The verb is from Middle English bemen, from Old English bēamian (“to shine, to cast forth rays or beams of light”), from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "beam (plural beams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large piece of timber or iron long in proportion to its thickness, and prepared for use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the principal horizontal structural members, usually of steel, timber, or concrete, of a building; one of the transverse members of a ship's frame on which the decks are laid — supported at the sides by knees in wooden ships and by stringers in steel ones.",
                  "examples": [
                    "Lucie opened the door: and what do you think there was inside the hill?—a nice clean kitchen with a flagged floor and wooden beams—just like any other farm kitchen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The maximum width of a vessel (note that a vessel with a beam of 15 foot can also be said to be 15 foot abeam).",
                  "examples": [
                    "Synonym: breadth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The direction across a vessel, perpendicular to fore-and-aft.",
                  "examples": [
                    "As the vessel passes a landmark, the landmark is said to be abeam. Once the vessel has passed the landmark, it falls abaft the beam, then it gradually falls astern."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The crossbar of a mechanical balance, from the ends of which the scales are suspended.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The principal stem of the antler of a deer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) The pole of a carriage or chariot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) A cylinder of wood, making part of a loom, on which weavers wind the warp before weaving and the cylinder on which the cloth is rolled, as it is woven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The straight part or shank of an anchor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The central bar of a plow, to which the handles and colter are secured, and to the end of which are attached the oxen or horses that draw it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In steam engines, a heavy iron lever having an oscillating motion on a central axis, one end of which is connected with the piston rod from which it receives motion, and the other with the crank of the wheel shaft.",
                  "examples": [
                    "Synonyms: working beam, walking beam"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ray or collection of approximately parallel rays emitted from the sun or other luminous body.",
                  "examples": [
                    "a beam of light",
                    "a beam of energy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A ray; a gleam.",
                  "examples": [
                    "a beam of hope, or of comfort"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the long feathers in the wing of a hawk.",
                  "examples": [
                    "Synonym: beam feather"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A horizontal bar which connects the stems of two or more notes to group them and to indicate metric value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(railway) An elevated rectangular dirt pile used to cheaply build an elevated portion of a railway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics) Ellipsis of balance beam.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beam (third-person singular simple present beams, present participle beaming, simple past and past participle beamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To emit beams of light; to shine; to radiate.",
                  "examples": [
                    "to beam forth light"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To smile broadly or especially cheerfully.",
                  "examples": [
                    "to beam with pride"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish or supply with beams.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give the appearance of beams to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, science fiction) To transmit matter or information via a high-tech wireless mechanism.",
                  "examples": [
                    "Beam me up, Scotty; there's no intelligent life down here.",
                    "The injured crewmembers were immediately beamed to sickbay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To transmit, especially by direct wireless means such as infrared.",
                  "examples": [
                    "To beam a file using the File Transfer Protocol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, currying) To stretch something (for example, an animal hide) on a beam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, weaving) To put (something) on a beam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To connect (musical notes) with a beam, or thick line, in music notation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}