{
  "word": "side",
  "etymologies": [
    {
      "description": [
        "From Middle English side, from Old English sīde (“side, flank”), from Proto-Germanic *sīdǭ (“side, flank, edge, shore”), from Proto-Indo-European *sēy- (“to send, throw, drop, sow, deposit”). Cognate with Saterland Frisian Siede (“side”), West Frisian side (“side”), Dutch zijde, zij (“side”), German Low German Sied (“side”), German Seite (“side”), Danish and Norwegian side (“side”), Swedish sida (“side”)."
      ],
      "adjectives": [
        {
          "description": "side (comparative more side, superlative most side)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being on the left or right, or toward the left or right; lateral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indirect; oblique; incidental.",
                  "examples": [
                    "a side issue; a side view or remark"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "side (countable and uncountable, plural sides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bounding straight edge of a two-dimensional shape.",
                  "examples": [
                    "A square has four sides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flat surface of a three-dimensional object; a face.",
                  "examples": [
                    "A cube has six sides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One half (left or right, top or bottom, front or back, etc.) of something or someone.",
                  "examples": [
                    "Which side of the tray shall I put it on?  The patient was bleeding on the right side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A region in a specified position with respect to something.",
                  "examples": [
                    "Meet me on the north side of the monument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The portion of the human torso usually covered by the arms when they are not raised; the areas on the left and right between the belly or chest and the back.",
                  "examples": [
                    "I generally sleep on my side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One surface of a sheet of paper (used instead of \"page\", which can mean one or both surfaces.)",
                  "examples": [
                    "John wrote 15 sides for his essay!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One possible aspect of a concept, person, or thing.",
                  "examples": [
                    "Look on the bright side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One set of competitors in a game.",
                  "examples": [
                    "Which side has kick-off?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, Ireland) A sports team.",
                  "examples": [
                    "Initially, the English, Welsh, Scots and Irish unions refused to send national sides, preferring instead to send touring sides like the Barbarians, the Penguins, the Co-Optimists, the Wolfhounds, Crawshays Welsh, and the Public School Wanderers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of morris dancers who perform together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group having a particular allegiance in a conflict or competition.",
                  "examples": [
                    "In the Second World War, the Italians were on the side of the Germans until Italy switched sides in 1943."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A recorded piece of music; a record, especially in jazz.",
                  "examples": [
                    "But Bechet chafed under even the loose discipline of the Ellington group, and left. Through these years he wandered, making only a few sides, at the moment when jazz records were beginning to flood onto the market."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, billiards, snooker, pool) Sidespin; english",
                  "examples": [
                    "He had to put a bit of side on to hit the pink ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, Ireland, dated) A television channel, usually as opposed to the one currently being watched (from when there were only two channels).",
                  "examples": [
                    "I just want to see what's on the other side — James said there was a good film on tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) A dish that accompanies the main course; a side dish.",
                  "examples": [
                    "Do you want a side of cole-slaw with that?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line of descent traced through a particular parent, as distinguished from that traced through another.",
                  "examples": [
                    "his mother's side of the family"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The batters faced in an inning by a particular pitcher.",
                  "examples": [
                    "Clayton Kershaw struck out the side in the 6th inning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated, uncountable) An unjustified air of self-importance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(drama) A written monologue or part of a scene to be read by an actor at an audition.",
                  "examples": [
                    "Some directors use full scripts (book); others use “sides,” which consist of one or two words of the cue and the subsequent full speech of the individual actor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, slang) A man who prefers not to engage in anal sex during same-sex sexual activity.",
                  "examples": [
                    "My boyfriend and I are both sides; we prefer to do oral and other stuff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, obsolete) A root.",
                  "examples": [
                    "And 9 is said to be the Square, 27 the Cube of 3, which is call'd the Side of 9 and 27, &c."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "side (third-person singular simple present sides, present participle siding, simple past and past participle sided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ally oneself, be in an alliance, usually with \"with\" or rarely \"in with\"",
                  "examples": [
                    "Which will you side with, good or evil?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lean on one side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To be or stand at the side of; to be on the side toward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To suit; to pair; to match.",
                  "examples": [
                    "He had ſure read more , and carried more about him , in his excellent Memory , than any Man I ever knew , my Lord Falkland only excepted , who I think ſided him"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, shipbuilding) To work (a timber or rib) to a certain thickness by trimming the sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish with a siding.",
                  "examples": [
                    "to side a house"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To provide with, as a side or accompaniment.",
                  "examples": [
                    "Entrees are sided with a generous portion of vegetables, and some include little surprises  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English side, syde, syd, from Old English sīd (“wide, broad, spacious, ample, extensive, vast, far-reaching”), from Proto-West Germanic *sīd, from Proto-Germanic *sīdaz (“drooping, hanging, low, excessive, extra”), from Proto-Indo-European *sēy- (“to send, throw, drop, sow, deposit”). Cognate with obsolete Dutch zijd (“wide, vast”), Low German sied (“low”), Swedish sid (“long, hanging down”), Icelandic síður (“low hanging, long”)."
      ],
      "adjectives": [
        {
          "description": "side (comparative more side, superlative most side)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK archaic, dialectal, Northern England, Scotland) Wide; large; long, pendulous, hanging low, trailing; far-reaching.",
                  "examples": [
                    "But when he perceaved that the sayd Pryest could not pourge himself of the foresayd crime he prively payed him his quarters wages before hande and suffered hym to departe without farther tryall of the sayd cryme: and now he jetteth in london wyth side gown and sarcenet typet as good a virgin priest as the best."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Far; distant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "side (comparative more side, superlative most side)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Widely; wide; far.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "side (third-person singular simple present sides, present participle siding, simple past and past participle sided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clear, tidy or sort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}