{
  "word": "reflect",
  "etymologies": [
    {
      "description": [
        "From Old French reflecter (“to bend back, turn back”), from Latin reflectō (“I reflect”), from re- (“again”) + flectō (“I bend, I curve”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "reflect (third-person singular simple present reflects, present participle reflecting, simple past and past participle reflected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bend back (light, etc.) from a surface.",
                  "examples": [
                    "A mirror reflects the light that shines on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be bent back (light, etc.) from a surface.",
                  "examples": [
                    "The moonlight reflected from the surface of water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mirror, or show the image of something.",
                  "examples": [
                    "The shop window reflected his image as he walked past."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be mirrored.",
                  "examples": [
                    "His image reflected from the shop window as he walked past."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree with; to closely follow.",
                  "examples": [
                    "Entries in English dictionaries aim to reflect common usage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give evidence of someone's or something's character etc.",
                  "examples": [
                    "The team's victory reflects the Captain's abilities.",
                    "The teacher's ability reflects well on the school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To think seriously; to ponder or consider.",
                  "examples": [
                    "People do that sort of thing every day, without ever stopping to reflect on the consequences."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}