{
  "word": "pickup",
  "etymologies": [
    {
      "description": [
        "From pick +‎ up."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pickup (countable and uncountable, plural pickups)",
          "definitionGroups": [
            {
              "group": "An electronic device for detecting sound, vibration, etc., such as one fitted to an electric guitar or record player.",
              "entries": [
                {
                  "meaning": "In a record player, an electromagnetic component that converts the needle vibrations into an electrical signal.",
                  "examples": [
                    "Synonym: phono cartridge"
                  ]
                },
                {
                  "meaning": "Electromagnetic coil receiver of metal string oscillations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) Ellipsis of pickup truck.",
                  "examples": [
                    "Franklin is beside himself, revving up the engine in the pickup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually attributive) Impromptu or ad hoc, especially of sports games and teams made up of randomly selected players.",
                  "examples": [
                    "Rather than join a basketball league, James decided to play pickup.",
                    "At lunch we had a game of pickup hockey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of approaching someone and engaging in romantic flirtation and courting with the intent to pursue romance, a date, or a sexual encounter.",
                  "examples": [
                    "Hey, thanks for the drink, but if this is a pickup, I'm not interested.",
                    "Coordinate terms: pick-up line, pick-up joint, pickup artist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person successfully approached in this manner for romance or sex.",
                  "examples": [
                    "Audball's latest pickup didn't seem to care where they were, or anything at all about alimony, palimony, or child support  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) In various games, the fielding or hitting of a ball just after it strikes the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) An item that can be picked up by the player, conferring some benefit or effect; a power-up.",
                  "examples": [
                    "Every step of the way you come across absolutely loads of aliens, pick-ups and new and weird obstacles to overcome."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, politics) The act of a challenging party or candidate winning an electoral district held by an incumbent party or candidate.",
                  "examples": [
                    "Coordinate term: gain",
                    "The returns from the election show Apple Party candidate Jane Doe has made a pickup in the district of City West defeating Orange Party Incumbent Joe Smith"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of answering a telephone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A relatively minor shot filmed or recorded after the fact to augment previous footage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of collecting and taking away something or someone, usually in a vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A time during which passengers, such as school children, are picked up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The rate at which a motor vehicle picks up speed.",
                  "examples": [
                    "The Willys-Overland won't be the fastest car on the road or have the best pickup, but it will have a top speed of eighty miles per hour, and its makers are confident that no car in its class will excel it in economy of fuel and upkeep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The condition of being picked up, or taken up; adoption by some entity.",
                  "examples": [
                    "Newsweek gave it a big write-up, as did many trade journals, including, [sic] Editor and Publisher. And our articles get pickup as far west as the Tombstone Epitaph in Arizona."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pickup",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of pick up.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}