{
  "word": "scour",
  "etymologies": [
    {
      "description": [
        "From Middle English scǒuren (“to polish, scour; to clean; to beat, whip”), from Middle Dutch scuren, schuren (“to clean; to polish”) or Middle Low German schǖren, of uncertain origin but probably from Old French escurer, from Medieval Latin scūrō, escūrō, excūrō (“to clean off”), from ex- (“prefix meaning ‘thoroughly’”) + cūrō (“to arrange, see to, take care of”), from cūra (“care, concern”) (from Proto-Indo-European *kʷeys- (“to heed”)) + -ō.",
        "The word is cognate with Danish skure, Middle High German schüren, schiuren (modern German scheuern (“to scour, scrub; to chafe”)), Norwegian skura (“to scrub”), Swedish skura, Catalan escurar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scour (countable and uncountable, plural scours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The removal of sediment caused by swiftly moving water.",
                  "examples": [
                    "Bridge scour may scoop out scour holes and compromise the integrity of the structure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place scoured out by running water, as in the bed of a stream below a waterfall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where wool is washed to remove grease and impurities prior to processing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scour (third-person singular simple present scours, present participle scouring, simple past and past participle scoured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean, polish, or wash (something) by rubbing and scrubbing it vigorously, frequently with an abrasive or cleaning agent.",
                  "examples": [
                    "He scoured the burnt food from the pan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove debris and dirt (from something) by purging; to sweep along or off by a current of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, veterinary medicine) To clear the digestive tract (of an animal) by administering medication that induces defecation or vomiting; to purge.",
                  "examples": [
                    "to scour a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, veterinary medicine) To (cause livestock to) suffer from diarrhoea or dysentery.",
                  "examples": [
                    "If a lamb is scouring, do not delay treatment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete) To cleanse (something) without rubbing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English scǒuren, scure, skoure (“to move quickly; to travel around in search of enemies”), from scǒur (“attack, conflict; pang of emotional suffering”), from Old Norse skýra (“to rush in”) and skúr (“a shower; a shower of missiles”), perhaps influenced by the verb scǒuren: see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "scour (third-person singular simple present scours, present participle scouring, simple past and past participle scoured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To search an area thoroughly.",
                  "examples": [
                    "They scoured the scene of the crime for clues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To run with speed; to scurry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To move swiftly over; to brush along.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}