{
  "word": "goal",
  "etymologies": [
    {
      "description": [
        "From Middle English gol (“boundary, limit”), from Old English gāl (“obstacle, barrier, marker”), suggested by its derivatives Old English gǣlan (“to hinder, delay, impede, keep in suspense, linger, hesitate, dupe”), and hyġegǣls (“hesitating, slow, sluggish”), hyġegǣlsa (“slow one, sluggish one”). Possibly cognate with Lithuanian gãlas (“end”), Latvian gals (“end”), Old Prussian gallan (“death”), Albanian ngalem (“to be limping, lame, paralyzed”), ngel (“to remain, linger, hesitate, get stuck”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "goal (plural goals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A result that one is attempting to achieve.",
                  "examples": [
                    "My lifelong goal is to get into a Hollywood movie.",
                    "She failed in her goal to become captain of the team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) In many sports, an area into which the players attempt to put an object.",
                  "examples": [
                    "fans behind the goal",
                    "play in goal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The act of placing the object into the goal.",
                  "examples": [
                    "miss a goal",
                    "concede a goal",
                    "let in a goal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A point scored in a game as a result of placing the object into the goal.",
                  "examples": [
                    "score a goal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A noun or noun phrase that receives the action of a verb. The subject of a passive verb or the direct object of an active verb. Also called a patient, target, or undergoer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "goal (third-person singular simple present goals, present participle goaling, simple past and past participle goaled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Gaelic football, Australian rules football) To score a goal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}