{
  "word": "portal",
  "etymologies": [
    {
      "description": [
        "From Middle English portal, porttol, from Old French portal and Medieval Latin portāle, from porta."
      ],
      "adjectives": [
        {
          "description": "portal (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Of or relating to a porta, especially the porta of the liver.",
                  "examples": [
                    "the portal vein"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "portal (plural portals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entrance, entry point, or means of entry.",
                  "examples": [
                    "The local library, a portal of knowledge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A website or page that acts as an entrance to other websites or pages on the Internet.",
                  "examples": [
                    "The new medical portal has dozens of topical categories containing links to hundreds of sites."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A short vein that carries blood into the liver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction and fantasy) A magical or technological doorway leading to another location, period in time or dimension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A lesser gate, where there are two of different dimensions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) Formerly, a small square corner in a room separated from the rest of an apartment by wainscoting, forming a short passage to another apartment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grandiose and often lavish entrance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge-building) The space, at one end, between opposite trusses when these are terminated by inclined braces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prayer book or breviary; a portass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "portal (third-person singular simple present portals, present participle portaling or portalling, simple past and past participle portaled or portalled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction, fantasy) To use a portal (magical or technological doorway).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}