{
  "word": "help",
  "etymologies": [
    {
      "description": [
        "From Middle English help, from Old English help (“help, aid, assistance, relief”), from Proto-Germanic *helpō (“help”), *hilpiz, *hulpiz, from Proto-Indo-European *ḱelb-, *ḱelp- (“to help”).",
        "Cognate with Saterland Frisian Hälpe (“help”), West Frisian help (“help”), Dutch hulp (“help”), Low German Hülp (“help”), German Hilfe (“help, aid, assistance”), Danish hjælp (“help”), Swedish hjälp (“help”), Norwegian hjelp (“help”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "help (usually uncountable, plural helps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Action given to provide assistance; aid.",
                  "examples": [
                    "I need some help with my homework."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something or someone which provides assistance with a task.",
                  "examples": [
                    "He was a great help to me when I was moving house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Documentation provided with computer software, etc. and accessed using the computer.",
                  "examples": [
                    "I can't find anything in the help about rotating an image."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A study aid.",
                  "examples": [
                    "I've printed out a list of math helps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually uncountable) One or more people employed to help in the maintenance of a house or the operation of a farm or enterprise.",
                  "examples": [
                    "The help is coming round this morning to clean.",
                    "Most of the hired help is seasonal, for the harvest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Correction of deficits, as by psychological counseling or medication or social support or remedial training.",
                  "examples": [
                    "His suicide attempts were a cry for help.",
                    "He really needs help in handling customer complaints.",
                    "“He’s a real road-rager.” / “Yup, he really needs help, maybe anger management.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English helpen, from Old English helpan (“to help, aid, assist, benefit, relieve, cure”), from Proto-West Germanic *helpan, Proto-Germanic *helpaną (“to help”), from Proto-Indo-European *ḱelb-, *ḱelp- (“to help”).",
        "Cognate with West Frisian helpe (“to help”), Dutch helpen (“to help”), Low German helpen, hölpen (“to help”), German helfen (“to help”), Danish hjælpe (“to help”), Norwegian hjelpe (“to help”), Lithuanian šelpti (“to help, support”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "help (third-person singular simple present helps, present participle helping, simple past helped or (archaic) holp, past participle helped or (archaic) holpen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide assistance to (someone or something).",
                  "examples": [
                    "He helped his grandfather cook breakfast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assist (a person) in getting something, especially food or drink at table; used with to.",
                  "examples": [
                    "It is polite to help your guests to food before serving yourself.",
                    "Help yourself to whatever's in the fridge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contribute in some way to.",
                  "examples": [
                    "The white paint on the walls helps make the room look brighter.",
                    "If you want to get a job, it helps to have some prior experience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To provide assistance.",
                  "examples": [
                    "She was struggling with the groceries, so I offered to help.",
                    "Please, help!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To avoid; to prevent; to refrain from; to restrain (oneself). Usually used in nonassertive contexts with can.",
                  "examples": [
                    "We couldn’t help noticing that you were late.",
                    "We couldn’t help but notice that you were late.",
                    "She’s trying not to smile, but she can’t help herself.",
                    "Can I help it if I'm so beautiful?",
                    "Can I help it that I fell in love with you?",
                    "Are they going to beat us? Not if I can help it!",
                    "She never does more than she can help."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hong Kong) To do something on the behalf of someone.",
                  "examples": [
                    "Can you help me buy some groceries?Underlying meaning is “Can you go do the groceries for me?”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}