{
  "word": "review",
  "etymologies": [
    {
      "description": [
        "From Middle English revewe, reveue, from Old French reveüe, revue (Modern French: revue), feminine form of reveü, past participle of reveoir (French: revoir), from Latin revideō, from re- +videō (“see, observe”) (English: video). Equivalent to re- +‎ view. Compare retrospect. Doublet of revue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "review (plural reviews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A second or subsequent reading of a text or artifact in an attempt to gain new insights.",
                  "examples": [
                    "I need to make a review of the book before I can understand it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An account intended as a critical evaluation of a text or a piece of work.",
                  "examples": [
                    "The newspaper review was full of praise for the play."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A judicial reassessment of a case or an event.",
                  "examples": [
                    "The victims demanded a full judicial review of the case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stage show made up of topical sketches etc.",
                  "examples": [
                    "Synonym: revue",
                    "The Cambridge Footlights Review launched many Monty Python faces."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A survey of the available items or material.",
                  "examples": [
                    "The magazine contained a review of Paris restaurants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A periodical which makes a survey of the arts or some other field.",
                  "examples": [
                    "The Times Literary Review is published in London."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A military inspection or display for the benefit of superiors or VIPs.",
                  "examples": [
                    "The troops assembled for a review by the Queen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forensic inspection to assess compliance with regulations or some code.",
                  "examples": [
                    "The regulators demanded a review against NYSE practices."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "review (third-person singular simple present reviews, present participle reviewing, simple past and past participle reviewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To survey; to look broadly over.",
                  "examples": [
                    "Before I tackle the question directly, I must briefly review historical approaches to the problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write a critical evaluation of a new art work etc.; to write a review.",
                  "examples": [
                    "The critic reviews every new play in London."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To look back over in order to correct or edit; to revise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, Canada) To look over again (something previously written or learned), especially in preparation for an examination.",
                  "examples": [
                    "Synonym: (UK, Australia, New Zealand) revise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To view or see again; to look back on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To retrace; to go over again.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}