{
  "word": "candidate",
  "etymologies": [
    {
      "description": [
        "From Latin candidātus (“a person who is standing for public office”), from candidus (“dazzling white, shining, clear”) + -ātus (an adjectival suffix), in reference to Roman candidates wearing bleached white togas as a symbol of purity at a public forum. Equivalent to candid +‎ -ate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "candidate (plural candidates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is running in an election.",
                  "examples": [
                    "Smith announced he was the party's candidate for the next election."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is applying for a job.",
                  "examples": [
                    "All candidates who miss the deadline or make a spelling mistake in their applications are automatically rejected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A participant in an examination.",
                  "examples": [
                    "Candidates must remain silent for the entirety of the exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something or somebody that may be suitable.",
                  "examples": [
                    "After being presented with various suitors, she decided none of the candidates were the kind of man she was looking for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A gene which may play a role in a given disease.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "candidate (third-person singular simple present candidates, present participle candidating, simple past and past participle candidated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) To stand as a candidate for an office, especially a religious one.",
                  "examples": [
                    "The matter of candidating for a pulpit is not a matter of difference between congregations and Rabbis, but between Rabbis themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard, chiefly in jargon and non-native speakers' English) To make or name (something) a candidate (for use, for study as a next project, for investigation as a possible cause of something, etc).",
                  "examples": [
                    "Performance comparison of solar energy conversion candidated for SPS. (From  NASA, Lyndon B. Johnson Space Center, Houston 1977.)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}