{
  "word": "smear",
  "etymologies": [
    {
      "description": [
        "From Middle English smeren, smerien, from Old English smerian, smyrian, smierwan (“to anoint or rub with grease, oil, etc.”), from Proto-West Germanic *smirwijan, from Proto-Germanic *smirwijaną.",
        "Cognate with Saterland Frisian smeere, Dutch smeren, Low German smeren, German schmieren."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smear (countable and uncountable, plural smears)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mark made by smearing.",
                  "examples": [
                    "Synonym: streak",
                    "This detergent cleans windows without leaving smears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A false or unsupported, malicious statement intended to injure a person's reputation.",
                  "examples": [
                    "Synonyms: calumny, slander, slur, mudslinging"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A preparation to be examined under a microscope, made by spreading a thin layer of a substance (such as blood, bacterial culture) on a slide.",
                  "examples": [
                    "Synonym: squash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A Pap smear (screening test for cervical cancer).",
                  "examples": [
                    "Synonyms: cervical smear, Pap test",
                    "I'm going to the doctor's this afternoon for a smear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio, television, uncountable) Any of various forms of distortion that make a signal harder to see or hear.",
                  "examples": [
                    "In television terms, a certain amount of smear, ringing, and anticipatory overshoot are indigenous to VSB transmission."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A maneuver in which the shoe is placed onto the holdless rock, and the friction from the shoe keeps it in contact",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A rough glissando in jazz music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "smear (third-person singular simple present smears, present participle smearing, simple past and past participle smeared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spread (a substance, especially one that colours or is dirty) across a surface by rubbing.",
                  "examples": [
                    "Synonyms: apply, daub, plaster, spread",
                    "The artist smeared paint over the canvas in broad strokes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover (a surface with a layer of some substance) by rubbing.",
                  "examples": [
                    "Synonyms: bedaub, coat, cover, daub, layer, plaster",
                    "She smeared her lips with lipstick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make something dirty.",
                  "examples": [
                    "Synonyms: besmirch, dirty, soil, sully"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (of a substance, etc.) To make a surface dirty by covering it.",
                  "examples": [
                    "a rust spot smearing the back of the sink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To damage someone's reputation by slandering, misrepresenting, or otherwise making false accusations about them, their statements, or their actions.",
                  "examples": [
                    "Synonyms: badmouth, besmirch, defame, sully, vilify",
                    "The opposition party attempted to smear the candidate by spreading incorrect and unverifiable rumors about their personal behavior."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to be messy or not clear by rubbing and spreading it.",
                  "examples": [
                    "Synonyms: blur, smudge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become messy or not clear by being spread.",
                  "examples": [
                    "Synonym: smudge",
                    "The paint is still wet — don't touch it or it will smear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write or draw (something) by spreading a substance on a surface.",
                  "examples": [
                    "ciphers smeared on the windows of condemned shops"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to be a particular colour by covering with a substance.",
                  "examples": [
                    "small wooden dolls smeared red as though with blood"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rub (a body part, etc.) across a surface.",
                  "examples": [
                    "With the lazy appetite of a calf mooning over a salt lick, he smeared his sizable nose against her face,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to remove (a substance) from a surface by rubbing.",
                  "examples": [
                    "The boatman rowed short and hard  […] , only pausing at moments swiftly to smear the sweat from his face with an old rag he kept on the bench beside him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) To climb without using footholds, using the friction from the shoe to stay on the wall.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}