{
  "word": "lateral",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin laterālis (“belonging to the side”), from latus (“the side or flank”) +‎ -ālis (“-al”, adjectival suffix)."
      ],
      "adjectives": [
        {
          "description": "lateral (comparative more lateral, superlative most lateral)",
          "definitionGroups": [
            {
              "group": "To the side; of or pertaining to the side.",
              "entries": [
                {
                  "meaning": "(anatomy, zootomy) Situated on one side or other of the body or of an organ, especially in the region furthest from the median plane.",
                  "examples": [
                    "The medial side of the knee faces the other knee, while the outer side of the knee is lateral.",
                    "A fish senses changes in hydrodynamic pressure with its lateral line.",
                    "Antonym: medial"
                  ]
                },
                {
                  "meaning": "(pathology) Affecting the side or sides of the body, or confined to one side of the body.",
                  "examples": []
                },
                {
                  "meaning": "(physics) Acting or placed at right angles to a line of motion or strain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) Non-linear or unconventional, as in, lateral thinking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics, phonology) (of a consonant, especially the English clear l) Pertaining to speech sounds generated by partially blocking the egress of the airstream with the tongue, leaving space on one or both sides of the occlusion for air passage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lateral (plural laterals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object, such as a passage or a protrusion, that is situated on the side of something else.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A sound produced through lateral pronunciation (such as /l/ in lateral).",
                  "examples": [
                    "Coordinate terms: approximant, fricative, nasal, trill, plosive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A lateral pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) An employee hired for a position at the same organizational level or salary as their previous position.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lateral (third-person singular simple present laterals, present participle lateralling or lateraling, simple past and past participle lateralled or lateraled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move (oneself or something) in a lateral direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) To execute a lateral pass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}