{
  "word": "swivel",
  "etymologies": [
    {
      "description": [
        "From Middle English swyvel, swivel, from a derivative of Old English swīfan (“to revolve”), + -el, an instrumental suffix, equivalent to swive +‎ -el."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swivel (countable and uncountable, plural swivels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical) A piece, such as a ring or hook, attached to another piece by a pin, in such a manner as to permit rotation about the pin as an axis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A small piece of ordnance, turning on a point or swivel; called also swivel gun.",
                  "examples": [
                    "[The settlement] was entirely surrounded by a broad unfordable marsh or swamp, which prevented all communication, except by private paths under water, known only to the rebels, and before which Baron had placed loaded swivels  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Strength of mind or character that enables one to overcome adversity; confidence; force of will.",
                  "examples": [
                    "Bob ain't got no swivel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of swivelling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) A rotating of the hips.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A small, usually ball- or barrel-shaped device used in angling to connect sections of fishing lines, consisting of two rings linked via a thrust bearing pivot joint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swivel (third-person singular simple present swivels, present participle swiveling or swivelling, simple past and past participle swiveled or swivelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To swing or turn, as on a pin or pivot.",
                  "examples": [
                    "As expected, Swansea began the game with some patient passing and the first chance fell to striker Michu in the fourth minute when he controlled a cross by Jonjo Shelvey and swivelled in the penalty box, only to fire over the bar."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}