{
  "word": "partner",
  "etymologies": [
    {
      "description": [
        "From Middle English partener, partiner, alteration (due to Middle English part) of Middle English parcener, from Old French parçonier, parçonneour (“joint heir”) from parçon (“partition”), from Latin partītiōnem, singular accusative of partītiō (“portion”). The word may also represent Old French part tenour (“part holder”). Compare also Middle English partifere (“partner”), partifelewe (“partner”). Doublet of parcener."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "partner (plural partners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Either of a pair of people or things that belong together.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Someone who is associated with another in a common activity or interest.",
              "entries": [
                {
                  "meaning": "A member of a business or law partnership.",
                  "examples": [
                    "He Suſpends on theſe Reaſons, that Thomas Rue had granted a general Diſcharge to Adam Muſhet, who was his Conjunct, and correus debendi, after the alleadged Service, which Diſcharged Muſhet, and conſequently Houstoun his Partner."
                  ]
                },
                {
                  "meaning": "A spouse or other person with whom one shares a domestic, romantic or sexual bond.",
                  "examples": []
                },
                {
                  "meaning": "Someone with whom one dances in a two-person dance.",
                  "examples": [
                    "He tried to persuade Cicely to stay away from the ball-room for a fourth dance. […] But she said she must go back, and when they joined the crowd again her partner was haled off with a frightened look to the royal circle, […]."
                  ]
                },
                {
                  "meaning": "Someone with whom one plays on the same side in a game, such as card games or doubles tennis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) One of the pieces of wood comprising the framework which strengthens the deck of a wooden ship around the holes through which the mast and other fittings pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Jamaica) A group financial arrangement in which each member contributes a set amount of money over a set period.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "partner (third-person singular simple present partners, present participle partnering, simple past and past participle partnered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To join as a partner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, often with with) To work or perform as a partner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}