{
  "word": "thew",
  "etymologies": [
    {
      "description": [
        "From Middle English theu, thew (“way of behaving towards others, bearing, manners; habit, practice; good manners, courtesy; characteristic act; characteristic, trait; custom, tradition; established rule, ordinance; injunction; moral character; (in the plural) set of moral principles, morals; moral quality, virtue or vice; might, power, strength”)  [and other forms]  (often in the plural form theus, thewes), from Old English þēaw (“general practice of a community, custom, usage; mode of conduct, behaviour, manner; (in the plural) customs, virtue”) [and other forms], from Proto-West Germanic *þauw, from Proto-West Germanic *þawwaz (“custom; habit”); further etymology uncertain, tentatively identified by the Etymologisches Wörterbuch des Althochdeutschen (Etymological Dictionary of Old High German) as a reflex of an s-less variant of Proto-Indo-European *(s)tāu-, *(s)te- (“to stand; to place”), from *steh₂- (“to stand (up)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thew (plural thews)",
          "definitionGroups": [
            {
              "group": "(archaic, chiefly in the plural, also figuratively)",
              "entries": [
                {
                  "meaning": "An attractive physical attribute; also, physical, mental, or moral strength or vigour.",
                  "examples": []
                },
                {
                  "meaning": "An aspect of the body which indicates physical strength; hence, muscle and/or sinew; muscular development.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete, chiefly in the plural)",
              "entries": [
                {
                  "meaning": "A way of behaving; hence, a characteristic, a trait.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) A good characteristic or habit; a virtue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English theuen, thewe (“to instruct in morals or values; to teach, train”) [and other forms], from theu, thew (noun) (see etymology 1) + -en (suffix forming the infinitives of verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "thew (third-person singular simple present thews, present participle thewing, simple past and past participle thewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To instruct (someone) in morals or values; also (more generally) to chastise or discipline (someone); to teach or train (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}