{
  "word": "chisel",
  "etymologies": [
    {
      "description": [
        "From Middle English chisel, chesel, from Old Northern French chisel, cisel, from cisoir (with a change in suffix), from Late Latin cīsōrium (“cutting tool”), from Latin caedere (“cut”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chisel (plural chisels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cutting tool used to remove parts of stone, wood or metal by pushing or pounding the back when the sharp edge is against the material. It consists of a slim, oblong block of metal with a sharp wedge or bevel formed on one end and sometimes a handle at the other end.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chisel (third-person singular simple present chisels, present participle chiseling or chiselling, simple past and past participle chiseled or chiselled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a chisel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work something with a chisel.",
                  "examples": [
                    "She chiselled a sculpture out of the block of wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, informal) To cheat, to get something from (someone) by cheating.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English chisel, chesil, from Old English ċeosol, ċeosel, ċysel, ċisel, ċisil (“gravel, sand”), from Proto-West Germanic *kisil (“small stone, pebble”). See also chessom."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chisel (usually uncountable, plural chisels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Gravel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Coarse flour; bran; the coarser part of bran or flour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}