{
  "word": "courage",
  "etymologies": [
    {
      "description": [
        "From Middle English corage, from Old French corage (French courage), from Vulgar Latin *corāticum, from Latin cor (“heart”). Distantly related to cardiac (“of the heart”), which is from Greek, but from the same Proto-Indo-European root. Displaced Middle English elne, ellen, from Old English ellen (“courage, valor”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "courage (usually uncountable, plural courages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of being confident, not afraid or easily intimidated, but without being incautious or inconsiderate.",
                  "examples": [
                    "It takes a lot of courage to be successful in business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to overcome one's fear, do or live things which one finds frightening.",
                  "examples": [
                    "He plucked up the courage to tell her how he felt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to maintain one's will or intent despite either the experience of fear, frailty, or frustration; or the occurrence of adversity, difficulty, defeat or reversal.  Moral fortitude.",
                  "examples": [
                    "“Courage is not simply one of the virtues but the form of every virtue at the testing point, which means at the point of highest reality.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "courage (third-person singular simple present courages, present participle couraging, simple past and past participle couraged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To encourage. [15th–17th c.]",
                  "examples": [
                    "Paul writeth unto Timothy, to instruct him, to teach him, to exhort, to courage him, to stir him up,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}