{
  "word": "nanny",
  "etymologies": [
    {
      "description": [
        "(1795) It has often been assumed that the English term was originally a widespread child's word for \"female adult other than mother\" (compare Greek νάννα (nánna, “aunt”), nanna). See also Welsh nain (“grandmother”).",
        "On the other hand, according to recent research of the Dutch historical linguists Hans Beelen and Nicoline van der Sijs (published in Onze Taal, September 2018), on which see also etymologiebank.nl, in Dutch), the term nanny (and the British colloquial nan for \"grandmother\") may actually be eponymous, viz. being originally an affective form (i.e. a hypocoristic) of the popular female name Anne.  The Dutch statesman and scientist Constantijn Huygens Jr. made the following observation during one of his many sojourns in England (noted in his Journaal, dated 13 December 1692): \"Yesterday I received 10lb of chocolate again, from niece Becker, and she had Nanny, her maid, bringing me the money that she had owed me\" (Gisteren kreegh 10 ℔ choccolate wederom van nicht Becker, en had Nanny, haer meidt, geweest om mij 't geldt, dat van haer hebben most, te brengen). Beelen and van der Sijs therefore assumed that \"since many female domestic servants were named \"Nan\" or \"Nanny\", the name became a sobriquet for the profession of \"maid, childminder\" in the 18th century\". (\"Omdat veel vrouwelijke huisbedienden in het Engels de voornaam Nan of Nanny hadden, verschoof de betekenis in de achttiende eeuw naar die van een beroepsaanduiding: ‘meid, kindermeisje’\")"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nanny (plural nannies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A child's nurse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A grandmother.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) A godmother.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A female goat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nanny (third-person singular simple present nannies, present participle nannying, simple past and past participle nannied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To serve as a nanny.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, derogatory) To treat like a nanny's charges; to coddle. [from mid-20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}