{
  "word": "air",
  "etymologies": [
    {
      "description": [
        "From Middle English aire, from Old French air, from Latin āēr, from Ancient Greek ἀήρ (aḗr). Displaced native Old English lyft. More at lift, loft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "air (countable and uncountable, plural airs)",
          "definitionGroups": [
            {
              "group": "(uncountable, meteorology) The substance constituting Earth's atmosphere, particularly:",
              "entries": [
                {
                  "meaning": "(historical, philosophy, alchemy) understood as one of the four elements of the ancient Greeks and Romans.",
                  "examples": []
                },
                {
                  "meaning": "(historical, medicine) understood as a particular local substance with supposed effects on human health.",
                  "examples": [
                    "Jeeves: Foreign travel often liberates emotions best kept in check, sir. The air of North America is notoriously stimulating in this regard, as witness the regrettable behavior of its inhabitants in 1776.B. Wooster: Hm? What happened in 1776, Jeeves?Jeeves: I prefer not to dwell on it, if it's convenient to you, sir."
                  ]
                },
                {
                  "meaning": "(physics) understood as a gaseous mixture of nitrogen, oxygen, and various trace gases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with the) The apparently open space above the ground which this substance fills, (historical) formerly thought to be limited by the firmament but (meteorology) now considered to be surrounded by the near vacuum of outer space.",
                  "examples": [
                    "The flock of birds took to the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breeze; a gentle wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feeling or sense.",
                  "examples": [
                    "to give it an air of artistry and sophistication"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sense of poise, graciousness, or quality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Pretension; snobbishness; pretence that one is better than others.",
                  "examples": [
                    "putting on airs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A song, especially a solo; an aria.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Nothing; absence of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) An air conditioner or the processed air it produces.",
                  "examples": [
                    "Could you turn on the air?",
                    "Hey, did you mean to leave the airs on all week while you were on vacation?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, chemistry) Any specific gas.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snowboarding, skateboarding, motor sports) A jump in which one becomes airborne.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A television or radio signal; (by extension) media broadcasts in general.",
                  "examples": [
                    "“These members need air cover in the media.” Paid media is the admission ticket to enter the big-time Washington stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Publicity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "air (third-person singular simple present airs, present participle airing, simple past and past participle aired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bring (something) into contact with the air, so as to freshen or dry it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To let fresh air into a room or a building, to ventilate.",
                  "examples": [
                    "It's getting quite stuffy in this room: let's open the windows and air it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To discuss varying viewpoints on a given topic.",
                  "examples": [
                    "Thus, in spite of all opposition, the rural and urban assemblies retained the germ of local government, and in spite of the dual control, as the result of which much of their influence was nullified, they did have a certain value in airing abuses and suggesting improvements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To broadcast (a television show etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be broadcast.",
                  "examples": [
                    "This game show first aired in the 1990s and is still going today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, MLE, slang) To ignore (a person).",
                  "examples": [
                    "Why is this girl airing me?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "air",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pronunciation spelling of are.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}