{
  "word": "clever",
  "etymologies": [
    {
      "description": [
        "From East Anglian dialectal English cliver (“expert at seizing”), from Middle English cliver (“tenacious”), perhaps from Old English *clifer, clibbor (“clinging”), or perhaps from East Frisian (compare Saterland Frisian kluftich), or dialectal Norwegian klover (“ready, skillful”); possibly influenced by Old English clifer (“claw, hand”). Related to cleave. Perhaps influenced by Welsh celfydd (“talented, dexterous, expert”)."
      ],
      "adjectives": [
        {
          "description": "clever (comparative cleverer or more clever, superlative cleverest or most clever)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nimble with hands or body; skillful; adept.",
                  "examples": [
                    "The Highland men, they're clever men  At handling sword and shield,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Quick to understand, learn, and devise or apply ideas; intelligent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mentally quick and resourceful.",
                  "examples": [
                    "A simple but clever trick to solve the problem.",
                    "clever like a fox"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Skilled at achieving what one wants, especially via unusual methods.",
                  "examples": [
                    "With a clever lawyer, she could easily be acquitted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Smart, intelligent, or witty; mentally quick or sharp.",
                  "examples": [
                    "Be good, sweet maid, and let who will be clever;  Do noble things, not dream them all day long:  And so make life, death, and that vast forever / One grand, sweet song."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of objects or actions) Showing inventiveness or originality; witty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anthropology, of an Aboriginal Australian) Possessing magical abilities.",
                  "examples": [
                    "When a clever man is out hunting and comes across the tracks of, say, a kangaroo, he follows them along and talks to the footprints all the time for the purpose of injecting magic into the animal which made them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fit; suitable; having propriety.",
                  "examples": [
                    "I can't but think 'twould sound more clever,  To me and to my heirs forever."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Well-shaped; handsome.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) Good-natured; obliging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial) Fit and healthy; free from fatigue or illness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}