{
  "word": "rooster",
  "etymologies": [
    {
      "description": [
        "roost +‎ -er. In the regions where it is used, displaced cock through taboo avoidance."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rooster (plural roosters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, Kent, Australia, New Zealand) A male domestic chicken (Gallus gallus domesticus) or other gallinaceous bird.",
                  "examples": [
                    "Their other dish  […]  contain'd a number of roast fowls—half a dozen, we suppose, & all roosters at this season no doubt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bird or bat which roosts or is roosting.",
                  "examples": [
                    "The more leisured flight of the roosters [sc. starlings] was in contrast to the steady procession of the migrants."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, obsolete slang) An informer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, obsolete slang) A violent or disorderly person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A powerful, prideful, or pompous person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, originally US slang, now chiefly New Zealand) A man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional US, historical) A wild violet, when used in a children's game based on cockfighting.",
                  "examples": [
                    "In April they played Hens and Roosters, yoking their wild white and blue violets to see which would get its head pulled off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete US slang) Legislation solely devised to benefit the legislators proposing it.",
                  "examples": [
                    "American demoralisation... has carried rooster into the halls of republican legislation, where it indicates a bill or proposed law which will remunerate the legislators."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}