{
  "word": "luster",
  "etymologies": [
    {
      "description": [
        "From Middle French lustre, from Old Italian lustro, from Latin lustrō (“I brighten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "luster (countable and uncountable, plural lusters) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Shine, polish or sparkle.",
                  "examples": [
                    "He polished the brass doorknob to a high luster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figurative) Brilliance, attractiveness or splendor.",
                  "examples": [
                    "After so many years in the same field, the job had lost its luster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Refinement, polish or quality.",
                  "examples": [
                    "He spoke with all the lustre a seasoned enthusiast should have."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A candlestick, chandelier, girandole, etc. generally of an ornamental character.",
                  "examples": [
                    "Each mortal has his pleasure: none deny",
                    "Scarsdale his bottle, Darty his ham-pie;",
                    "Ridotta sips and dances, till she see",
                    "The doubling lustres dance as fast as she;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A substance that imparts lustre to a surface, such as plumbago or a glaze.",
                  "examples": [
                    "Chinese themes are equally recognisable in the star-shaped and hexagonal tiles with either moulded relief or lustre-painted decoration, sometimes surrounded by an inscription border  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lusterware.",
                  "examples": [
                    "The whole place was covered with fragments of pottery, mostly very rough, and difficult to identify as to date. Two small lustre shards belong to the ninth or tenth century and a green glaze resembles the output of the kilns found by Sir Aurel Stein on the coast of Makran."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fabric of wool and cotton with a lustrous surface, used for women's dresses.",
                  "examples": [
                    "Mrs. McLash was dressed for travelling. She wore a black lustre skirt that just exposed her broken button-boots  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "luster (third-person singular simple present lusters, present participle lustering, simple past and past participle lustered) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gleam, have luster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give luster, distinguish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a coating or other treatment to impart physical luster.",
                  "examples": [
                    "Peter and Mania found a pensione whose view was of chestnut woods and a horizon looped by peaks lustred with last winter's snow, distant in time as well as space."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English lustre, from Latin lustrum, from Old Latin *loustrom, of uncertain origin. More at lustrum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "luster (plural lusters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of lustrum: A five-year period, especially (historical) in Roman contexts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From lust +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "luster (plural lusters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who lusts or is inflamed with lust.",
                  "examples": [
                    "Neither fornicators, nor those who serve idols, nor adulterers, nor effeminate, nor the lusters after mankind  […]  shall obtain the kingdom of God."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}