{
  "word": "easement",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman aisement, easement, eisement, esament, esement, and Middle French aisement (“comfort, convenience, ease, facility, opportunity; a benefit, relief; a right to use land, a thing, etc.; a privy”), from aisier (“to put at ease; to facilitate”) + -ment (“-ment, suffix forming nouns, usually the action or state resulting from verbs”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "easement (countable and uncountable, plural easements)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An interest in land which grants the legal right to use another person's real property (real estate), generally in order to cross a part of the property or to gain access to something on the property (right of way).",
                  "examples": [
                    "The power company has an easement to put their electricity poles along the edge of this land."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) An element such as a baseboard, handrail, etc., that is curved instead of abruptly changing direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Easing; relief; assistance; support.",
                  "examples": [
                    "But now, thought I, if this ſin is not unto death, then it is pardonable; therefore from this I have encouragement to come to God by Chriſt for mercy; to conſider the promiſe of forgiveneſs, as that which ſtands with open arms to receive me, as well as others. This therefore was a great eaſement to my mind; to wit, that my ſin was pardonable, that it was not the ſin unto death,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, euphemistic) The act of relieving oneself: defecating or urinating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(model railroading) Transition spiral curve track between a straight or tangent track and a circular curved track of a certain radius or selected radius.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Gratification.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}