{
  "word": "volunteer",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French voluntaire, from Latin voluntārius (“willing, voluntary”); or from voluntary +‎ -eer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "volunteer (plural volunteers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who enters into, or offers themself for, any service of their own free will, especially when done without pay.",
                  "examples": [
                    "The volunteers at the nature reserve meet up ever other Sunday to help its upkeep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) One who enters into military service voluntarily (but who, when in service, is subject to discipline and regulations like other soldiers), as opposed to a conscript.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A voluntary member of the organized militia of a country, as distinguished from a regular or member of the standing army.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A person who acts out of their own will without a legal obligation, such as a donor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, agriculture) A plant that grows spontaneously, without being cultivated on purpose; see volunteer plant in Wikipedia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A native or resident of the American state of Tennessee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "volunteer (third-person singular simple present volunteers, present participle volunteering, simple past and past participle volunteered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To enlist oneself as a volunteer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To do or offer to do something voluntarily.",
                  "examples": [
                    "to volunteer for doing the dishes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To offer, usually unprompted.",
                  "examples": [
                    "to volunteer an explanation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To offer the services of (someone else) to do something.",
                  "examples": [
                    "My sister volunteered me to do the dishes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, botany) To grow without human sowing or intentional cultivation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}