{
  "word": "braze",
  "etymologies": [
    {
      "description": [
        "From Middle English brasen, from Old English brasian, bræsian (“to cover with brass”), from bræs (“brass”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "braze (third-person singular simple present brazes, present participle brazing, simple past and past participle brazed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with brass, or as with brass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "1580s, \"to expose to the action of fire\", perhaps from French braser (“to solder, weld”), though the sense evolution is difficult to explain. Perhaps the English word is older, being unrecorded in Middle English but borrowed from Old French braser (“to burn”), which fits the meaning more closely. Old French braser derives from Old Norse brasa (“to braze, harden with fire”). Also possible is that the Middle English and English words were borrowed directly from Old Norse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "braze (plural brazes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of small charcoal used for roasting ore.",
                  "examples": [
                    "Roasting the ores is done with the charcoal braze (or fine charcoal from the charring) in heaps of thirty feet width, fifty-feet length and twenty feet height, containing 3,200 tons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "braze (third-person singular simple present brazes, present participle brazing, simple past and past participle brazed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join two metal pieces, without melting them, using heat and diffusion of a jointing alloy of capillary thickness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To burn or temper in fire.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}