{
  "word": "brain",
  "etymologies": [
    {
      "description": [
        "From Middle English brayn, brain, from Old English bræġn (“brain”), from Proto-West Germanic *bragn, from Proto-Germanic *bragną (“brain”), from Proto-Indo-European *mregʰnom (“skull, brain”), from Proto-Indo-European *mregʰ- (“marrow, sinciput”) + *-mn̥ (“nominal suffix”).",
        "Cognate with Scots braine, brane (“brain”), North Frisian brayen, brein (“brain”), Saterland Frisian Brainge (“brain”), West Frisian brein (“brain”), Dutch brein (“brain”), Low German Brägen, Bregen (“brain”) (whence German Bregen (“animal brain”)), Ancient Greek βρεχμός (brekhmós, “front part of the skull, top of the head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brain (countable and uncountable, plural brains)",
          "definitionGroups": [
            {
              "group": "The control center of the central nervous system of an animal located in the skull which is responsible for perception, cognition, attention, memory, emotion, and action.",
              "entries": [
                {
                  "meaning": "A part of the brain, especially associated with particular mental functions, abilities, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(informal) An intelligent person.",
              "entries": [
                {
                  "meaning": "(plural only) A person who provides the intelligence required for something.",
                  "examples": [
                    "He is the brains behind the scheme."
                  ]
                }
              ]
            },
            {
              "group": "(in the plural) Intellect.",
              "entries": [
                {
                  "meaning": "(in the singular) An intellectual or mental capacity.",
                  "examples": [
                    "Gerald always acts like he doesn't have a brain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By analogy with a human brain, the part of a machine or computer that performs calculations.",
                  "examples": [
                    "The computer's brain is capable of millions of calculations a second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar, uncountable) Oral sex.",
                  "examples": [
                    "You said I got brain from your dame in the range",
                    "In the passing lane",
                    "But you really ain't got no proof"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, slang) Mind.",
                  "examples": [
                    "I have too much on my brain today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loose compartment of a backpack that straps on over the top opening.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brain (third-person singular simple present brains, present participle braining, simple past and past participle brained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dash out the brains of; to kill by smashing the skull.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To strike (someone) on the head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To destroy; to put an end to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To conceive in the mind; to understand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}