{
  "word": "exposition",
  "etymologies": [
    {
      "description": [
        "From Middle English exposicioun, from Old French esposicion, from Latin expositiō, from expōnere (“to put forth”). The sense meaning \"exhibition\" is a later semantic loan from French exposition."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "exposition (countable and uncountable, plural expositions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The action of exposing something to something, such as skin to the sunlight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(authorship) The act or process of declaring or describing something through either speech or writing; the portions and aspects of a piece of writing that exist mainly to describe the setting, characters and other non-plot elements.",
                  "examples": [
                    "This essay has too much exposition in it.",
                    "My reviewer said she couldn't picture the setting for my story, so I'm improving the exposition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of expulsion, or being expelled, from a place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An exhibition, especially of goods, artwork or cultural displays to the public.",
                  "examples": [
                    "The first prototype was unveiled at an exposition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(authorship)  An essay or speech in which any topic is discussed in detail.",
                  "examples": [
                    "I turned my research into an exposition on the traditional music of Borneo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(authorship)  An opening section in fiction, in which background information about the characters, events or setting is conveyed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The opening section of a movement in sonata form; the opening section of a fugue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The abandonment of an unwanted child.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}