{
  "word": "pulse",
  "etymologies": [
    {
      "description": [
        "From Late Middle English pulse, Middle English pous, pouse (“regular beat of arteries, pulse; heartbeat; place on the body where a pulse is detectable; beat (of a musical instrument); energy, vitality”) [and other forms], from Anglo-Norman puls, pous, pus, and Middle French pouls, poulz, pous [and other forms], Old French pous, pulz (“regular beat of arteries; place on the body where a pulse is detectable”) (modern French pouls), and from their etymon Latin pulsus (“beat, impulse, pulse, stroke; regular beat of arteries or the heart”), from pellō (“to drive, impel, propel, push; to banish, eject, expel; to set in motion; to strike”) (ultimately from Proto-Indo-European *pel- (“to beat, strike; to drive; to push, thrust”)) + -sus (a variant of -tus (suffix forming action nouns from verbs))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pulse (plural pulses)",
          "definitionGroups": [
            {
              "group": "(physiology)",
              "entries": [
                {
                  "meaning": "A normally regular beat felt when arteries near the skin (for example, at the neck or wrist) are depressed, caused by the heart pumping blood through them.",
                  "examples": []
                },
                {
                  "meaning": "The nature or rate of this beat as an indication of a person's health.",
                  "examples": [
                    "Her pulse was thready and weak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A beat or throb; also, a repeated sequence of such beats or throbs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The focus of energy or vigour of an activity, place, or thing; also, the feeling of bustle, busyness, or energy in a place; the heartbeat.",
                  "examples": [
                    "You can really feel the pulse of the city in this district."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly biology, chemistry) An (increased) amount of a substance (such as a drug or an isotopic label) given over a short time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking, chiefly attributively) A setting on a food processor which causes it to work in a series of short bursts rather than continuously, in order to break up ingredients without liquidizing them; also, a use of this setting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, prosody) The beat or tactus of a piece of music or verse; also, a repeated sequence of such beats.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(physics)",
              "entries": [
                {
                  "meaning": "A brief burst of electromagnetic energy, such as light, radio waves, etc.",
                  "examples": []
                },
                {
                  "meaning": "Synonym of autosoliton (“a stable solitary localized structure that arises in nonlinear spatially extended dissipative systems due to mechanisms of self-organization”)",
                  "examples": []
                },
                {
                  "meaning": "(also electronics) A brief increase in the strength of an electrical signal; an impulse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English pulse, Middle English pulsen (“to pulse, throb”), from Latin pulsāre, the present active infinitive of pulsō (“to push; to beat, batter, hammer, strike; to knock on; to pulsate; (figuratively) to drive or urge on, impel; to move; to agitate, disquiet, disturb”), the frequentative of pellō (“to drive, impel, propel, push; to banish, eject, expel; to set in motion; to strike”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pulse (third-person singular simple present pulses, present participle pulsing, simple past and past participle pulsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To emit or impel (something) in pulses or waves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly biology, chemistry) To give to (something, especially a cell culture) an (increased) amount of a substance, such as a drug or an isotopic label, over a short time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cooking) To operate a food processor on (some ingredient) in short bursts, to break it up without liquidizing it.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, electronics, physics)",
              "entries": [
                {
                  "meaning": "To apply an electric current or signal that varies in strength to (something).",
                  "examples": []
                },
                {
                  "meaning": "To manipulate (an electric current, electromagnetic wave, etc.) so that it is emitted in pulses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly figuratively and literary) To expand and contract repeatedly, like an artery when blood is flowing though it, or the heart; to beat, to throb, to vibrate, to pulsate.",
                  "examples": [
                    "Synonym: undulate",
                    "Hot blood pulsed through my veins as I grew angrier.",
                    "The streets were dark, and all that could be seen was light pulsing from the disco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) Of an activity, place, or thing: to bustle with energy and liveliness; to pulsate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English puls (“(collectively) seeds of a leguminous plant used as food; leguminous plants collectively; a species of leguminous plant”), Early Middle English pols (in compounds), possibly from Anglo-Norman pus, puz, Middle French pouls, pols, pous, and Old French pous, pou (“gruel, mash, porridge”) (perhaps in the sense of a gruel made from pulses), or directly from their etymon Latin puls (“meal (coarse-ground edible part of various grains); porridge”), probably from Ancient Greek πόλτος (póltos, “porridge made from flour”), from Proto-Indo-European *pel- (“dust; flour”) (perhaps by extension from *pel- (“to beat, strike; to drive; to push, thrust”), in the sense of something beaten)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pulse (countable and uncountable, plural pulses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Annual leguminous plants (such as beans, lentils, and peas) yielding grains or seeds used as food for humans or animals; (countable) such a plant; a legume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Edible grains or seeds from leguminous plants, especially in a mature, dry condition; (countable) a specific kind of such a grain or seed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}