{
  "word": "browse",
  "etymologies": [
    {
      "description": [
        "Middle English browsen, from Old French brouster, broster (“to nibble off buds, sprouts, and bark; browse”), from brost (“a sprout, shoot, bud”), from a Germanic source, perhaps Frankish *brust (“shoot, bud”), from Proto-Germanic *brustiz (“bud, shoot”), from Proto-Indo-European *bʰrews- (“to swell, sprout”). Cognate with Bavarian Bross, Brosst (“a bud”), Old Saxon brustian (“to sprout”). Doublet of brut, breast, and brush."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "browse (countable and uncountable, plural browses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Young shoots and twigs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Fodder for cattle and other animals.",
                  "examples": [
                    "Also, when planting to provide a source of browse for wintering deer and elk, protect seedlings from browsing during the first several years; an electric fence enclosure can offer effective protection."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) That which one browses through; something to read.",
                  "examples": [
                    "Here he buried himself in a close-printed, thickish volume which had been his chosen browse for some time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "browse (third-person singular simple present browses, present participle browsing, simple past and past participle browsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To scan, to casually look through in order to find items of interest, especially without knowledge of what to look for beforehand.",
                  "examples": [
                    "I'm just browsing around.",
                    "I stopped in several bookstores to browse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move about while sampling, such as with food or products on display.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To navigate through hyperlinked documents on a computer, usually with a browser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an animal) To move about while eating parts of plants, especially plants other than pasture, such as shrubs or trees.",
                  "examples": [
                    "Also, when planting to provide a source of browse for wintering deer and elk, protect seedlings from browsing during the first several years; an electric fence enclosure can offer effective protection."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To feed on, as pasture; to pasture on; to graze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}