{
  "word": "park",
  "etymologies": [
    {
      "description": [
        "From Middle English park, from Old French parc (“livestock pen”), from Medieval Latin parcus, parricus, from Frankish *parrik (“enclosure, pen”), from Proto-Germanic *parrukaz (“enclosure, fence”). Cognate with Dutch perk (“enclosure; flowerbed”), Old High German pfarrih, pferrih (“enclosure, pen”), Old English pearroc (“enclosure”) (whence modern English paddock), Old Norse parrak, parak (“enclosure, pen; distress, anxiety”), Icelandic parraka (“to keep pent in, under restraint and coercion”). More at parrock, paddock."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "park (plural parks)",
          "definitionGroups": [
            {
              "group": "An area of land set aside for environment preservation or recreation.",
              "entries": [
                {
                  "meaning": "A tract of ground kept in its natural state, about or adjacent to a residence, such as for the preservation of game, for walking, riding, or the like.",
                  "examples": [
                    "While in the park I sing, the listening deer / Attend my passion, and forget to fear."
                  ]
                },
                {
                  "meaning": "A piece of ground in or near a city or town, enclosed and kept for ornament and recreation.",
                  "examples": [
                    "Hyde Park in London;  Central Park in New York"
                  ]
                },
                {
                  "meaning": "An enclosed parcel of land stocked with animals for hunting, which one may have by prescription or royal grant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A wide, flat-bottomed valley in a mountainous region.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An area used for specific purposes.",
              "entries": [
                {
                  "meaning": "An open space occupied by or reserved for vehicles, matériel or stores.",
                  "examples": [
                    "a wagon park;   an artillery park"
                  ]
                },
                {
                  "meaning": "A partially enclosed basin in which oysters are grown.",
                  "examples": []
                },
                {
                  "meaning": "An area zoned for a particular (industrial or commercial) purpose.",
                  "examples": [
                    "business park;  industrial park;  science park"
                  ]
                },
                {
                  "meaning": "An area on which a sporting match is played; (soccer) a pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) An inventory of matériel.",
                  "examples": [
                    "A country's tank park or artillery park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, colloquial) A space in which to leave a car; a parking space.",
                  "examples": [
                    "We got to the 9th Ward and as luck would have it I found a park for my bro′s car right out the front."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "park (third-person singular simple present parks, present participle parking, simple past and past participle parked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring (something such as a vehicle) to a halt or store in a specified place.",
                  "examples": [
                    "You can park the car in front of the house.",
                    "I parked the drive heads of my hard disk before travelling with my laptop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To defer (a matter) until a later date.",
                  "examples": [
                    "Let's park that until next week's meeting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring together in a park, or compact body.",
                  "examples": [
                    "to park artillery, wagons, automobiles, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose in a park, or as in a park.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To hit a home run; to hit the ball out of the park.",
                  "examples": [
                    "He really parked that one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To engage in romantic or sexual activities inside a nonmoving vehicle that was driven to a suitable spot for that purpose.",
                  "examples": [
                    "They stopped at a romantic overlook, shut off the engine, and parked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, sometimes reflexive) To sit, recline, or put, especially in a manner suggesting an intent to remain for some time.",
                  "examples": [
                    "He came in and parked himself in our living room.",
                    "Park your bags in the hall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, finance) To invest money temporarily in an investment instrument considered to relatively free of risk, especially while awaiting other opportunities.",
                  "examples": [
                    "We decided to park our money in a safe, stable, low-yield bond fund until market conditions improve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To register a domain name, but make no use of it (See domain parking)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, oyster culture) To enclose in a park, or partially enclosed basin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To promenade or drive in a park.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated, of horses) To display style or gait on a park drive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}