{
  "word": "saint",
  "etymologies": [
    {
      "description": [
        "From Middle English saint, seint, sainct, seinct, sanct, senct, partly from Old English sanct (“saint”) and confluence with Old French saint, seinte (Modern French saint); both from Latin sanctus (“holy, consecrated”, in Late Latin as a noun, “a saint”), past participle of sancire (“to render sacred, make holy”), akin to sacer (“holy, sacred”). Displaced native Middle English halwe (“saint”) from Old English hālga (“saint, holy one”) (> Modern English hallow (“saint”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "saint (plural saints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person whom a church or another religious group has officially recognised as especially holy or godly; one eminent for piety and virtue.",
                  "examples": [
                    "Kateri Tekakwitha was proclaimed a saint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, by extension) A person with positive qualities; one who does good.",
                  "examples": [
                    "Dorothy Day was a living saint.",
                    "Thanks for looking after the house while I'm away. You're a saint!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the blessed in heaven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A holy object.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English saynten, seinten, sonten, partly from Anglo-Norman saintir and partly from the noun Middle English seint, seynt (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "saint (third-person singular simple present saints, present participle sainting, simple past and past participle sainted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To canonize, to formally recognize someone as a saint.",
                  "examples": [
                    "Many wish to see Pope John Paul II sainted immediately."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the pattern of naming various places for Saints from religion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}