{
  "word": "cruise",
  "etymologies": [
    {
      "description": [
        "Borrowed from Dutch kruisen (“cross, sail around”), from kruis (“cross”), from Middle Dutch cruce, from Latin crux."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cruise (plural cruises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sea or lake voyage, especially one taken for pleasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) Portion of aircraft travel at a constant airspeed and altitude between ascent and descent phases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, informal) A period spent in the Marine Corps.",
                  "examples": [
                    "I ended my cruise of four years in the Marine Corps at the first Officers' Training Camp for enlisted men at Quantico  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A car enthusiasts' event where they drive their vehicles in a group. See Cruising (driving).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cruise (third-person singular simple present cruises, present participle cruising, simple past and past participle cruised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sail about, especially for pleasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel at constant speed for maximum operating efficiency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move about an area leisurely in the hope of discovering something, or looking for custom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, forestry) To inspect (forest land) for the purpose of estimating the quantity of lumber it will yield.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, colloquial) To actively seek a romantic partner or casual sexual partner by moving about a particular area; to troll.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, child development) To walk while holding on to an object (stage in development of ambulation, typically occurring at 10 months).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sports) To win easily and convincingly.",
                  "examples": [
                    "Germany cruised to a World Cup victory over the short-handed Australians."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take part in a cruise (car enthusiasts' event where they drive their vehicles in a group).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cruise (plural cruises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small cup; cruse.",
                  "examples": [
                    "And she said, As the Lord thy God liveth, I have not a cake, but an handful of meal in a barrel, and a little oil in a cruse: and, behold, I am gathering two sticks, that I may go in and dress it for me and my son, that we may eat it, and die."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}