{
  "word": "fruit",
  "etymologies": [
    {
      "description": [
        "From Middle English fruyt, frut (“fruits and vegetables”), from Old French fruit (“produce, fruits and vegetables”), from Latin fructus (“enjoyment, proceeds, profits, produce, income”) and frūx (“crop, produce, fruit”) (compare Latin fruor (“have the benefit of, to use, to enjoy”)), from Proto-Indo-European *bʰruHg- (“to make use of, to have enjoyment of”). Cognate with English brook (“to bear, tolerate”) and German brauchen (“to need”). Displaced native Old English wæstm."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fruit (countable and uncountable, plural fruits) (see Usage notes for discussion of plural)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) In general, a product of plant growth useful to man or animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, a sweet and/or sour, edible part of a plant that resembles seed-bearing fruit (see next sense), even if it does not develop from a floral ovary; also used in a technically imprecise sense for some sweet or sweetish vegetables, such as the petioles of rhubarb, that resemble a true fruit or are used in cookery as if they were a fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(botany) A product of fertilization in a plant, specifically:",
              "entries": [
                {
                  "meaning": "The seed-bearing part of a plant, often edible, colourful and fragrant, produced from a floral ovary after fertilization.",
                  "examples": []
                },
                {
                  "meaning": "The spores of cryptogams and their accessory organs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An end result, effect, or consequence; advantageous or disadvantageous result.",
                  "examples": [
                    "His long nights in the office eventually bore fruit when his business boomed and he was given a raise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) Of, belonging to, related to, or having fruit or its characteristics; (of living things) producing or consuming fruit.",
                  "examples": [
                    "fresh-squeezed fruit juice",
                    "a fruit salad",
                    "an artificial fruit flavor",
                    "a fruit tree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, colloquial, derogatory) A homosexual man; (derogatory, figurative) an effeminate man. [from 1900]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Offspring from a sexual union.",
                  "examples": [
                    "The litter was the fruit of the union between our whippet and their terrier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A crazy person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fruit (third-person singular simple present fruits, present participle fruiting, simple past and past participle fruited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce fruit, seeds, or spores.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}