{
  "word": "town",
  "etymologies": [
    {
      "description": [
        "From Middle English toun, from Old English tūn (“enclosure, garden”), from Proto-Germanic *tūną (“fence”) (compare West Frisian tún, Dutch tuin (“garden”), German Zaun, Danish, Swedish and Norwegian tun), from Gaulish dūnom (“hill, hillfort”), from Proto-Celtic *dūnom (compare archaic Welsh din (“hill”), Irish dún (“fortress”)), from Proto-Indo-European *dewh₂- (“to finish, come full circle”). Doublet of dun. See also -ton and tine (“to enclose”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "town (countable and uncountable, plural towns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A settlement; an area with residential districts, shops and amenities, and its own local government; especially one larger than a village and smaller than a city, historically enclosed by a fence or walls, with total populations ranging from several hundred to more than a hundred thousand (as of the early 21st century)",
                  "examples": [
                    "This town is really dangerous because these youngsters have Beretta handguns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any more urbanized centre than the place of reference.",
                  "examples": [
                    "I'll be in Yonkers, then I'm driving into town to see the Knicks at the Garden tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical) A rural settlement in which a market was held at least once a week.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The residents (as opposed to gown: the students, faculty, etc.) of a community which is the site of a university.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Used to refer to a town or similar entity under discussion.",
                  "examples": [
                    "Call me when you get to town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A major city, especially one where the speaker is located.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A municipal organization, such as a corporation, defined by the laws of the entity of which it is a part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An enclosure which surrounded the mere homestead or dwelling of the lord of the manor; by extension, the whole of the land which constituted the domain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Scotland, dialect, obsolete) A farm or farmstead; also, a court or farmyard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(England, traditional, also Town, in phrases such as 'in town' or 'to town') London, especially central London.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}