{
  "word": "sling",
  "etymologies": [
    {
      "description": [
        "From Middle English slynge (noun), slyngen (verb), probably from Old Norse slyngja, slyngva (“to hurl”), from Proto-Germanic *slingwaną (“to worm, twist”) or compare Old English slingan (“to wind, twist”), from the same source.",
        "Compare German schlingen (“to swing, wind, twist”), Danish and Norwegian slynge), from Proto-Indo-European *slenk (“to turn, twist”) (compare Welsh llyngyr (“worms, maggots”), Lithuanian sliñkti (“to crawl like a snake”), Latvian slìkt (“to sink”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sling (plural slings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weapon) An instrument for throwing stones or other missiles, consisting of a short strap with two strings fastened to its ends, or with a string fastened to one end and a light stick to the other.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of hanging bandage put around the neck, in which a wounded arm or hand is supported.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loop of cloth, worn around the neck, for supporting a baby or other such load.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loop of rope, or a rope or chain with hooks, for suspending a barrel, bale, or other heavy object, in hoisting or lowering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strap attached to a firearm, for suspending it from the shoulder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, chiefly in the plural) A band of rope or iron for securing a yard to a mast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or motion of hurling as with a sling; a throw; figuratively, a stroke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A loop of rope or fabric tape used for various purposes: e.g. as part of a runner, or providing extra protection when abseiling or belaying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drink composed of a spirit (usually gin) and water sweetened.",
                  "examples": [
                    "gin sling",
                    "a Singapore sling"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sling (third-person singular simple present slings, present participle slinging, simple past and past participle slung or slang)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To throw with a circular or arcing motion.",
                  "examples": [
                    "Everyone could sling stones at an hairbreadth, and not miss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To throw with a sling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To pass a rope around (a cask, gun, etc.) preparatory to attaching a hoisting or lowering tackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To sell, peddle, or distribute (often illicitly, e.g. drugs, sex, etc.).",
                  "examples": [
                    "Synonyms: slang, flog, flip"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From a shortening of spiderling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sling (plural slings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A young or infant spider, such as one raised in captivity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}