{
  "word": "flame",
  "etymologies": [
    {
      "description": [
        "From Middle English flawme, blend of Old French flame and flambe, flamble, the first from Latin flamma, the second from Latin flammula, diminutive of flamma, both from pre-Latin *fladma; Proto-Italic *flagmā, ultimately from Proto-Indo-European *bʰel- (“to shimmer, gleam, shine”). Displaced native Old English līeġ."
      ],
      "adjectives": [
        {
          "description": "flame (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a brilliant reddish orange-gold colour, like that of a flame.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "flame (countable and uncountable, plural flames)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The visible part of fire; a stream of burning vapour or gas, emitting light and heat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A romantic partner or lover in a usually short-lived but passionate affair.",
                  "examples": [
                    "Synonyms: see Thesaurus:lover"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, somewhat dated) An aggressively insulting criticism or remark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(color) A brilliant reddish orange-gold fiery colour. flame:",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, chiefly lutherie) The contrasting light and dark figure seen in wood used for stringed instrument making; the curl.",
                  "examples": [
                    "The cello has a two-piece back with a beautiful narrow flame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Burning zeal, passion, imagination, excitement, or anger.",
                  "examples": [
                    "Till charming Florio, born to conquer, came And touch'd the fair one with an equal flame"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flame (third-person singular simple present flames, present participle flaming, simple past and past participle flamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce flames; to burn with a flame or blaze.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To burst forth like flame; to break out in violence of passion; to be kindled with zeal or ardour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, transitive, intransitive) To post a destructively critical or abusive message (to somebody).",
                  "examples": [
                    "I flamed him for spamming in my favourite newsgroup."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}