{
  "word": "gig",
  "etymologies": [
    {
      "description": [
        "The etymology of the noun is unknown, but compare Old French gigue (“a fiddle”). The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gig (plural gigs) (informal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Originally (music), a performing engagement by a musician or musical group; (by extension, film, television, theater) a job or role for a performer.",
                  "examples": [
                    "I caught one of the Rolling Stones’ first gigs in Richmond.",
                    "Hey, when are we gonna get that hotel gig again?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any job, especially one that is freelance or temporary, or done on an on-demand basis.",
                  "examples": [
                    "I had this gig as a file clerk but it wasn’t my style so I left.",
                    "That guy’s got a great gig over at the bike shop. He hardly works all day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military) A demerit received for some infraction of a military deportment or dress code.",
                  "examples": [
                    "I received gigs for having buttons of my uniform undone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gig (third-person singular simple present gigs, present participle gigging, simple past and past participle gigged) (informal)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(music) To play (a musical instrument) at a gig.",
                  "examples": []
                },
                {
                  "meaning": "(US, military) To impose a demerit (on someone) for an infraction of a military deportment or dress code.",
                  "examples": [
                    "His sergeant gigged him for an unmade bunk."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(film, music, television, theater) To engage in a musical performance, act in a theatre production, etc.",
                  "examples": [
                    "The Rolling Stones were gigging around Richmond at the time."
                  ]
                },
                {
                  "meaning": "(by extension) To work at any job, especially one that is freelance or temporary, or done on an on-demand basis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Sense 1 is a clipping of gigabyte, while sense 2 is a clipping of giga- (prefix multiplying the unit to which it is attached by one billion)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gig (plural gig or gigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, computing) Clipping of gigabyte (“one billion (1,000,000,000) bytes”).",
                  "examples": [
                    "This picture is almost a gig; don’t you want to resize it?",
                    "My new computer has over 500 gigs of hard drive space."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly sciences) Any unit of measurement having the SI prefix giga-.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Middle English gigg, gigge, gygge (“spinning object; a top”); further origin uncertain, possibly:",
        "Senses 2–4 are thought to derive from sense 1 (“whipping-top”), but their exact relationship is unclear.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gig (plural gigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A top which is made to spin by tying a piece of string around it and then throwing it so that the string unwinds rapidly; a whipping-top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, school slang (Eton College), archaic or dialectal) A person with an odd appearance; also, a foolish person.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to enjoyment.",
              "entries": [
                {
                  "meaning": "(slang, archaic or Britain, dialectal) Fun; frolics.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A fanciful impulse; a whim; also, a joke.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Senses relating to vehicles.",
              "entries": [
                {
                  "meaning": "(nautical)",
                  "examples": []
                },
                {
                  "meaning": "A small, narrow, open boat carried in a larger ship, and used for transportation between the ship and the shore, another vessel, etc.",
                  "examples": []
                },
                {
                  "meaning": "(Southern England, by extension) A similar rowing boat or sailboat, especially one used for racing; specifically, a six-oared sea rowing boat commonly found in Cornwall and the Isles of Scilly.",
                  "examples": []
                },
                {
                  "meaning": "(road transport, historical) A two-wheeled carriage drawn by a single horse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gig (third-person singular simple present gigs, present participle gigging, simple past and past participle gigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a joke, often condescendingly, at the expense of (someone); to make fun of.",
                  "examples": [
                    "His older cousin was just gigging him about being in love with that girl from school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Sometimes followed by it: to ride in a gig (“a two-wheeled carriage drawn by a single horse”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gig, gigge, gegge, possibly either:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gig (plural gigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A frivolous, playful, or wanton young woman; a giglet or giglot.",
                  "examples": [
                    "Synonym: fizgig"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from a clipping of fishgig, fizgig, possibly from Spanish fisga (“harpoon”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gig (plural gigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) Synonym of fishgig or fizgig (“a spear with a barb on the end of it, used for catching fish, frogs, or other small animals”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gig (third-person singular simple present gigs, present participle gigging, simple past and past participle gigged) (fishing)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spear (fish, etc.) with a gig or fizgig.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To catch or fish with a gig or fizgig.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}