{
  "word": "buckler",
  "etymologies": [
    {
      "description": [
        "From Middle English bukler, bokler, bokeler, bokeleer, from Old French bocler, boucler, bucler, (French bouclier) from Vulgar Latin *bucculārius (“bossed”), from Latin buccula (“boss”). Merged with buckle +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buckler (plural bucklers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who buckles something.",
                  "examples": [
                    "Bucklers will be assigned to buckle up drivers in the morning and make sure they stay buckled up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of shield, of various shapes and sizes, held in the hand or worn on the arm (usually the left), for protecting the front of the body. In the sword and buckler play of the Middle Ages in England, the buckler was a small shield, used not to cover the body but to stop or parry blows.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A shield resembling the Roman scutum. In modern usage, a smaller variety of shield is usually implied by this term.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) One of the large, bony, external plates found on many ganoid fishes.",
                  "examples": [
                    "Most zeids have spiny projections or bucklers at the dorsal- and anal-fin bases and bony plates on the ventral surface of the abdomen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The anterior segment of the shell of a trilobite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A block of wood or plate of iron made to fit a hawse hole, or the circular opening in a half-port, to prevent water from entering when the vessel pitches.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buckler (third-person singular simple present bucklers, present participle bucklering, simple past and past participle bucklered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To shield; to defend.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}