{
  "word": "loggerhead",
  "etymologies": [
    {
      "description": [
        "From logger (“(dialectal) heavy wooden block secured to a horse's leg to prevent it from straying”) +‎ head. Logger was apparently coined because its sound connotes a clumsy, heavy object; compare log (“trunk of a dead tree; bulky piece of wood”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "loggerhead (plural loggerheads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A stupid person; a blockhead, a dolt.",
                  "examples": [
                    "Synonyms: see Thesaurus:idiot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal tool consisting of a long rod with a bulbous end that is made hot in a fire, then plunged into some material (such as pitch or a liquid) to melt or heat it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A post on a whaling boat used to secure the harpoon rope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midlands, dialectal, often in the plural) A thistle-like flowering plant of the genus Centaurea, particularly the common knapweed (Centaurea nigra).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Used as the name of various animals with large heads.",
              "entries": [
                {
                  "meaning": "The loggerhead duck or Falkland steamer duck (Tachyeres brachypterus; formerly Tachyeres cinereus), a species of steamer duck endemic to the Falkland Islands.",
                  "examples": [
                    "Synonym: logger duck"
                  ]
                },
                {
                  "meaning": "The loggerhead kingbird (Tyrannus caudifasciatus), a bird endemic to the Caribbean and West Indies.",
                  "examples": []
                },
                {
                  "meaning": "The rufous-tailed flycatcher (Myiarchus validus), a bird endemic to Jamaica.",
                  "examples": []
                },
                {
                  "meaning": "The loggerhead shrike (Lanius ludovicianus), a bird endemic to North America.",
                  "examples": []
                },
                {
                  "meaning": "The loggerhead musk turtle (Sternotherus minor), a large-headed turtle endemic to the United States.",
                  "examples": []
                },
                {
                  "meaning": "The loggerhead sea turtle or loggerhead turtle (Caretta caretta), an oceanic turtle found throughout the world.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}