{
  "word": "extension",
  "etymologies": [
    {
      "description": [
        "From Middle English extensioun, from Old French estension, from Latin extensiō, extensiōnem."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "extension (countable and uncountable, plural extensions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of extending; a stretching out; enlargement in length, breadth, or time; an increase",
                  "examples": [
                    "Next month the house is undergoing an extension.",
                    "Due to the unforeseen circumstances, you are allowed an extension of two weeks to complete the task."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being extended",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That property of a body by which it occupies a portion of space (or time, e.g. \"spatiotemporal extension\")",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a building that has been extended from the original",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(semantics) Capacity of a concept or general term to include a greater or smaller number of objects; — correlative of intension.",
                  "examples": [
                    "In addition to concepts and conceptual senses, Frege holds that there are extensions of concepts. Frege calls an extension of a concept a ‘course of values’. A course of values is determined by the value that the concept has for each of its arguments. Thus, the course of values for the concept __ is a dog records that its value for the argument Zermela is the True and for Socrates is the False, and so on. If two concepts have the same values for every argument, then their courses of values are the same. Thus, courses of values are extensional."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, semantics) semantic widening, broadening of meaning",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(banking, finance) A written engagement on the part of a creditor, allowing a debtor further time to pay a debt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The operation of stretching a broken bone so as to bring the fragments into the same straight line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weightlifting) An exercise in which an arm or leg is straightened against resistance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) A simple offensive action, consisting of extending the weapon arm forward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(telecommunications) A numerical code used to specify a specific telephone in a telecommunication network.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A file extension.",
                  "examples": [
                    "Files with the .txt extension usually contain text."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An optional software component that adds functionality to an application.",
                  "examples": [
                    "a browser extension"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) The set of tuples of values that, used as arguments, satisfy the predicate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A kind of derivative morpheme applied to verbs in Bantu languages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) University programs that are targeted at the broader (usually adults) community whose participants are not full-time enrolled students.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}