{
  "word": "retrograde",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Middle English retrograd, retrograde (“of a planet: appearing to move in a direction opposite to the order of the zodiac signs, retrograde; unfortunate”), from Middle French retrograde and Old French retrograde (“of a celestial object: appearing to move backwards; moving backwards; reverse; palindromic; opposed to change”) (modern French rétrograde), and from their etymon Latin retrōgradus (“of a celestial object: appearing to move backwards”) (compare Late Latin retrōgradus (“reverse; palindromic”)), from retrō (“back, backwards; behind; before, formerly”) + gradus (“pace, step”). Retrō is derived from re- (prefix meaning ‘back, backwards’) + *-trō (probably from intrō (“to enter, go into”)); gradus is ultimately from Proto-Indo-European *gʰredʰ- (“to go; to walk”).",
        "The adverb and noun are derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "retrograde (comparative more retrograde, superlative most retrograde)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Directed or moving backwards in relation to the normal or previous direction of travel; retreating.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Reverting to an inferior or less developed state; declining, regressing.",
              "entries": [
                {
                  "meaning": "(zoology) Of an animal: appearing to regress to a less developed form during its lifetime.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Of the order of something: inverse, reverse.",
              "entries": [
                {
                  "meaning": "(music) Having a passage of music played backwards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of ideas or a person: opposing social reform, favouring the maintenance of the status quo; conservative.",
                  "examples": [
                    "Synonyms: reactionary, traditionalist",
                    "Antonyms: liberal, progressist, reformist",
                    "retrograde ideas, morals, etc."
                  ]
                }
              ]
            },
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "Involving a return to or a retracing of a previous course of travel.",
                  "examples": []
                },
                {
                  "meaning": "Counterproductive to a desired outcome; contradictory, contrary.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(astronomy)",
              "entries": [
                {
                  "meaning": "Of a celestial body orbiting another: in the opposite direction to the orbited body's spin.",
                  "examples": [
                    "Antonyms: direct, prograde"
                  ]
                },
                {
                  "meaning": "(also astrology) Of a celestial body: seeming to move across the sky in the opposite direction from its ordinary movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Of a metamorphic change: resulting from a decrease in pressure or temperature.",
                  "examples": [
                    "Antonym: prograde"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Of amnesia: relating to the period leading up to the episode which caused it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetry, archaic) Of verse: reading the same forwards or backwards; palindromic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "retrograde (comparative more retrograde, superlative most retrograde)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a reverse direction; backwards.",
                  "examples": [
                    "Synonym: retrogradely"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "retrograde (plural retrogrades)",
          "definitionGroups": [
            {
              "group": "A movement backwards or opposite to the intended or normal motion.",
              "entries": [
                {
                  "meaning": "(astrology) The apparent movement of a planet across the sky in the opposite direction from its ordinary movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who opposes social reform, favouring the maintenance of the status quo; a conservative.",
                  "examples": [
                    "Synonyms: (both chiefly US, informal) mossback, mossyback, reactionary, traditionalist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) One who reneges on an agreement, or switches loyalties; a rebel, a renegade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The reversal of a melody so that what is played first in the original melody is played last, and what is played last in the original melody is played first.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French retrograder (“to (cause to) go back, return; to (cause to) move backwards; of a celestial object: to show retrograde motion; to date to an earlier period”) (modern French rétrograder), and from its etymon Latin retrōgradī, the present active infinitive of retrōgradior (“to go or step back or backwards; of a celestial object: to show retrograde motion”) (compare Late Latin retrogradare, retrogradari, retrogredere), from retrō (“back, backwards; behind; before, formerly”) + gradior (“to step, walk; to advance, go”) (ultimately from Proto-Indo-European *gʰredʰ- (“to go; to walk”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "retrograde (third-person singular simple present retrogrades, present participle retrograding, simple past and past participle retrograded)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(geography) To cause (a land feature such as a coastline or waterfall) to undergo retrogradation, that is, to travel in the direction of the land or upstream due to erosion.",
                  "examples": []
                },
                {
                  "meaning": "(geology) To change (minerals, rocks, etc.) metamorphically through a decrease in pressure or temperature.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To cause (someone or something) to revert to an inferior or less developed state.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To revert to an inferior or less developed state; to decline, to regress.",
                  "examples": []
                },
                {
                  "meaning": "(astrology, astronomy) Of a celestial body, especially a planet: to show retrogradation; to seem to move across the sky in the opposite direction from its ordinary movement.",
                  "examples": []
                },
                {
                  "meaning": "(geography) Of a land feature: to travel in the direction of the land or upstream due to erosion.",
                  "examples": []
                },
                {
                  "meaning": "(military) To retreat or withdraw from a position.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To move backwards; to recede.",
                  "examples": []
                },
                {
                  "meaning": "Of the telling of an incident, etc.: to move to an earlier time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}