{
  "word": "proffer",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English profre (“act of offering or presenting a gift; offer of something; challenge; sacrifice; act of petitioning or requesting; petition, request; proposal, suggestion; idea, thought; attempt, effort; appearance; (law) payment to the Exchequer by a sheriff or other officer of estimated revenue due to the monarch”) [and other forms], and then:",
        "The verb is derived from Late Middle English prouffer, prouffre, Middle English profren, profer, proffere (“to offer, propose; to deliver, hand over, present; to take up; to volunteer; to dedicate; to attempt, try; to risk; to challenge; to provide; to ask, invite; to proceed, start; to grant; to argue”) [and other forms], from Anglo-Norman profrer, proferer, profferer, proffrir, propherer, proufrir, and Old French proferir, proffrir, profrir (“to offer, propose; to present; to volunteer”), variants of Anglo-Norman puroffrir and Middle French poroffrir, paroffrir, Old French poroffrir, paroffrir, porofrir, from por-, pur- (prefix meaning ‘to go through’ or having an intensifying effect) + offrir, ofrir (“to offer”) (modern French offrir (“to offer; to give as a gift; to open oneself up to (someone)”)). Offrir is derived from Vulgar Latin *offerīre, from Latin offerre, present active infinitive of offerō (“to offer, present; to exhibit, show; to expose; to cause, inflict; to consecrate, dedicate; to sacrifice”) (from ob- (prefix meaning ‘against; towards’) + ferō (“to bear, carry; to support; to endure; to bring forth; to put in motion; to move forward”) (ultimately from Proto-Indo-European *bʰer- (“to bear, carry”)))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "proffer (plural proffers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An offer made; something proposed for acceptance by another; a tender.",
                  "examples": [
                    "Synonym: proposition"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An attempt, an essay.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "proffer (third-person singular simple present proffers, present participle proffering, simple past and past participle proffered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To offer for acceptance; to propose to give; to make a tender of.",
                  "examples": [
                    "to proffer friendship, a gift, or services"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To attempt or essay of one's own accord; to undertake or propose to undertake.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}