{
  "word": "generation",
  "etymologies": [
    {
      "description": [
        "From Middle English generacioun, from Anglo-Norman generacioun, Middle French generacion, and their source, Latin generātiō, from generāre, present active infinitive of generō (“to beget, generate”). Compare generate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "generation (countable and uncountable, plural generations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of creating something or bringing something into being; production, creation. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of creating a living creature or organism; procreation. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now US, dialectal) Race, family; breed. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single step or stage in the succession of natural descent; a rank or degree in genealogy, the members of a family from the same parents, considered as a single unit. [from 14th c.]",
                  "examples": [
                    "This is the book of the generations of Adam - Genesis 5:1",
                    "Ye shall remain there [in Babylon] many years, and for a long season, namely, seven generations - Baruch 6:3",
                    "All generations and ages of the Christian church - Richard Hooker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Descendants, progeny; offspring. [15th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The average amount of time needed for children to grow up and have children of their own, generally considered to be a period of around thirty years, used as a measure of time. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set stage in the development of computing or of a specific technology. [from 20th c.]",
                  "examples": [
                    "The first-generation iPhone was released in June 2007 and was an instant blockbuster success."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The formation or production of any geometrical magnitude, as a line, a surface, a solid, by the motion, in accordance with a mathematical law, of a point or a magnitude, by the motion of a point, of a surface by a line, a sphere by a semicircle, etc.",
                  "examples": [
                    "the generation of a line or curve"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people born in a specific range of years and whose members can relate culturally to one another.",
                  "examples": [
                    "Generation X grew up in the eighties, whereas the generation known as the millennials grew up in the nineties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A version of a form of pop culture which differs from later or earlier versions.",
                  "examples": [
                    "People sometimes dispute which generation of Star Trek is best, including the original and The Next Generation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A copy of a recording made from an earlier copy and thus further degraded in quality.",
                  "examples": [
                    "With one-inch C format or half-inch Betacam used in the component mode, quality loss through additional generations is not such a problem. In this situation, it would be usual to make the necessary alterations while re-recording onto a third generation master  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}