{
  "word": "flare",
  "etymologies": [
    {
      "description": [
        "Origin unknown, first recorded in the mid 16th century, probably related to Latin flagrō (“I burn”). Norwegian flara (“to blaze; to flaunt in gaudy attire”) has a similar meaning, but the English word predates it.  Possibly related to Middle High German vlederen (“to flutter”), represented by modern German flattern.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flare (plural flares)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden bright light.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A source of brightly burning light or intense heat.",
              "entries": [
                {
                  "meaning": "A type of pyrotechnic that produces a brilliant light without an explosion, used to attract attention in an emergency, to illuminate an area, or as a decoy.",
                  "examples": [
                    "Flares were used to steer the traffic away from the accident.",
                    "The flares attracted the heat-seeking missiles.",
                    "Hyponyms: Bengal light, fusee, parachute flare, Very light"
                  ]
                },
                {
                  "meaning": "(oil industry) A flame produced by a burn-off of waste gas (flare gas) from a flare tower (or flare stack), typically at an oil refinery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A sudden eruption or outbreak; a flare-up.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A widening of an object with an otherwise roughly constant width.",
              "entries": [
                {
                  "meaning": "(nautical) The increase in width of most ship hulls with increasing height above the waterline.",
                  "examples": [
                    "Antonym: tumblehome"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Bell-bottom trousers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The transition from downward flight to level flight just before landing.",
                  "examples": [
                    "The captain executed the flare perfectly, and we lightly touched down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A low fly ball that is hit in the region between the infielders and the outfielders.",
                  "examples": [
                    "Synonyms: blooper, Texas leaguer",
                    "Jones hits a little flare to left that falls for a single."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A route run by the running back, releasing toward the sideline and then slightly arcing upfield looking for a short pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) Short for lens flare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inflammation such as of tendons (tendonitis) or joints (osteoarthritis).",
                  "examples": [
                    "Synonym: flare-up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breakdance move of someone helicoptering his torso on alternating arms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flare (third-person singular simple present flares, present participle flaring, simple past and past participle flared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to burn; in particular, to burn off excess gas (flare gas).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause inflammation; to inflame.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To open outward in shape.",
                  "examples": [
                    "The cat flared its nostrils while sniffing at the air. (transitive)",
                    "The cat’s nostrils flared when it sniffed at the air. (intransitive)",
                    "The building flared from the third through the seventh floors to occupy the airspace over the entrance plaza. (intransitive)",
                    "The sides of a bowl flare. (intransitive)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, aviation) To (operate an aircraft to) transition from downward flight to level flight just before landing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To blaze brightly.",
                  "examples": [
                    "The blast furnace flared in the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shine out with a sudden and unsteady light; to emit a dazzling or painfully bright light.",
                  "examples": [
                    "The candle flared in a sudden draught."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To shine out with gaudy colours; to be offensively bright or showy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To suddenly happen or intensify.",
                  "examples": [
                    "Synonym: flare up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To suddenly erupt in anger.",
                  "examples": [
                    "Synonym: flare up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To be exposed to too much light.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}