{
  "word": "bellows",
  "etymologies": [
    {
      "description": [
        "From Middle English belwes, plural of belu, belwe, a northern form of beli, from Old English bæliġ, northern form of bielġ, from Proto-Germanic *balgiz. Compare German Balg. See also belly.",
        "For the pronunciation /ˈbɛl.əs/, compare bodice, gallows."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bellows (plural bellows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for delivering pressurized air in a controlled quantity to a controlled location. At its most simple terms a bellows is a container which is deformable in such a way as to alter its volume which has an outlet or outlets where one wishes to blow air.",
                  "examples": [
                    "When wood fires were common, so were bellows for helping start them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any flexible container or enclosure, as one used to cover a moving joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal or archaic) The lungs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) Flexible, light-tight enclosures connecting the lensboard and the camera back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) That which fans the fire of hatred, jealousy, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bellows (third-person singular simple present bellowses, present participle bellowsing, simple past and past participle bellowsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To operate a bellows; to direct air at (something) using a bellows.",
                  "examples": [
                    "So bellowsed, all the kindled soul of Hugh",
                    "Became a still white hell of brooding ire,",
                    "And through his veins regenerating fire",
                    "Ran, driving out the lethargy of pain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To expand and contract like a bellows.",
                  "examples": [
                    "[…]  [the dogs] sprang up, and, with a grand spraying of the crisp snow as they fleetly clambered up the steep side, they were with us in an incredibly short time, with pink tongues protruding, sides bellowsing, and sterns wagging."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fold up like a bellows; to accordion.",
                  "examples": [
                    "Without being tight  […]  the boot leg should fit close. The ankle should be supple as a stocking, and “bellowsed” to make sure of suppleness."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See bellow"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bellows",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of bellow",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bellows",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "third-person singular simple present indicative form of bellow",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}