{
  "word": "rote",
  "etymologies": [
    {
      "description": [
        "From Middle English rote (“custom, habit, wont, condition, state”), further origin unknown. Found in the Middle English phrase bi rote (“by heart, according to form, expertly”), c. 1300. Some have proposed a relationship either with Old French rote/rute (“route”), or Latin rota (“wheel”) (see rotary), but the OED calls both suggestions groundless."
      ],
      "adjectives": [
        {
          "description": "rote (comparative more rote, superlative most rote)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By repetition or practice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rote (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mechanical routine; a fixed, habitual, repetitive, or mechanical course of procedure.",
                  "examples": [
                    "The pastoral scenes from those commercials don’t bear too much resemblance to the rote of daily life on a farm.",
                    "He could perform by rote any of his roles in Shakespeare."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rote (third-person singular simple present rotes, present participle roting, simple past and past participle roted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To go out by rotation or succession; to rotate.",
                  "examples": [
                    "The Model of it was, That a third Part of the Senate or Parliament, ſhould rote out by Ballot every Year; […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To learn or repeat by rote.",
                  "examples": [
                    "[Volumnia to Corolianus] \"Because that it lies you on to speak/ to th' people, not by your own instruction,/ Nor by th' matter which your heart prompts you,/ But with such words that are but roted in/ your tongue,...\" Coriolanus III.ii.52-55"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old Norse rót n (“tossing, pitching (of sea)”), perhaps related to rauta (“to roar”); see hrjóta. Compare Middle English routen (“to roar, bellow, storm, rage, howl”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rote (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The roar of the surf; the sound of waves breaking on the shore. [from c. 1600]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rote, from Old French rote, probably of German origin; compare Middle High German rotte, and English crowd (“a kind of violin”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rote (plural rotes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A kind of guitar, the notes of which were produced by a small wheel or wheel-like arrangement; an instrument similar to the hurdy-gurdy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of crowd.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}