{
  "word": "humour",
  "etymologies": [
    {
      "description": [
        "From Middle English humour, from Old French humor, from Latin humor, correctly umor (“moisture”), from humō, correctly umō (“to be moist”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "humour (usually uncountable, plural humours) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The quality of being amusing, comical, funny. [from the early 18th c.]",
                  "examples": [
                    "She has a great sense of humour, and I always laugh a lot whenever we get together.",
                    "The sensitive subject was treated with humour, but in such way that no one was offended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A mood, especially a bad mood; a temporary state of mind or disposition brought upon by an event; an abrupt illogical inclination or whim.",
                  "examples": [
                    "He was in a particularly vile humour that afternoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or historical) Any of the fluids in an animal body, especially the four \"cardinal humours\" of blood, yellow bile, black bile and phlegm that were believed to control the health and mood of the human body.",
                  "examples": [
                    "For some days a fistula lacrymalis had come into my left eye, which discharged an humour, when pressed, that portended danger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Either of the two regions of liquid within the eyeball, the aqueous humour and vitreous humour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Moist vapour, moisture.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "humour (third-person singular simple present humours, present participle humouring, simple past and past participle humoured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pacify by indulging.",
                  "examples": [
                    "I know you don't believe my story, but humour me for a minute and imagine it to be true."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}