{
  "word": "question",
  "etymologies": [
    {
      "description": [
        "From Middle English question, questioun, questiun, from Anglo-Norman questiun, from Old French question, from Latin quaestiōnem, accusative of quaestiō (“a seeking, investigation, inquiry, question”), from quaerere (“to seek, ask, inquire”), of uncertain origin, but possibly from Proto-Italic *kʷaizeō, from Proto-Indo-European *kʷeh₂- (“to acquire”).",
        "Displaced native Old English āscung. Compare also Middle Low German quēstie (“questioning; inquiry”), Middle High German questje (“question”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "question (plural questions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sentence, phrase or word which asks for information, reply or response; an interrogative.",
                  "examples": [
                    "Can I ask you two a question? / Please, Christ, yes. / How can you two live like this? / How can... / Don't google the question, Moss!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subject or topic for consideration or investigation.",
                  "examples": [
                    "The question of seniority will be discussed at the meeting.",
                    "There was a question of which material to use."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A doubt or challenge about the truth, accuracy, or validity of a matter.",
                  "examples": [
                    "His claim to the property has come under question.",
                    "The story is true beyond question.",
                    "He obeyed without question."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A proposal to a meeting as a topic for deliberation.",
                  "examples": [
                    "I move that the question be put to a vote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, historical, chiefly with definite article) Interrogation by torture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Talk; conversation; speech.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "question (third-person singular simple present questions, present participle questioning, simple past and past participle questioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ask questions of; to interrogate; to ask for information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise doubts about; have doubts about.",
                  "examples": [
                    "He questioned South Korean claims that China is a major source of its pollution.\nAudio (US)(file)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ask a question or questions; inquire or seek to know; examine.",
                  "examples": [
                    "He that questioneth much shall learn much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To argue; to converse; to dispute.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}