{
  "word": "plan",
  "etymologies": [
    {
      "description": [
        "Borrowed from French plan (“a ground-plot of a building”), from plan (“flat”), a later form of the vernacular plain, from Latin planus (“flat, plane”); see plain, plane."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plan (plural plans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drawing showing technical details of a building, machine, etc., with unwanted details omitted, and often using symbols rather than detailed drawing to represent doors, valves, etc.",
                  "examples": [
                    "The plans for many important buildings were once publicly available."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of intended actions, usually mutually related, through which one expects to achieve a goal.",
                  "examples": [
                    "He didn't really have a plan; he had a goal and a habit of control."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A two-dimensional drawing of a building as seen from above with obscuring or irrelevant details such as roof removed, or of a floor of a building, revealing the internal layout; as distinct from the elevation.",
                  "examples": [
                    "Synonym: floor plan",
                    "Seen in plan, the building had numerous passageways not apparent to visitors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A method; a way of procedure; a custom.",
                  "examples": [
                    "The simple plan, / That they should take who have the power, / And they should keep who can."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subscription to a service.",
                  "examples": [
                    "a phone plan",
                    "an Internet plan"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plan (third-person singular simple present plans, present participle planning, simple past and past participle planned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To design (a building, machine, etc.).",
                  "examples": [
                    "The architect planned the building for the client."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To create a plan for.",
                  "examples": [
                    "They jointly planned the project in phases, with good detail for the first month."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To intend.",
                  "examples": [
                    "He planned to go, but work intervened."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a plan.",
                  "examples": [
                    "They planned for the worst, bringing lots of emergency supplies."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}