{
  "word": "sniff",
  "etymologies": [
    {
      "description": [
        "From Middle English sniffen, of imitative origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sniff (countable and uncountable, plural sniffs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of sniffing.",
                  "examples": [
                    "She gave the flowers a quick sniff to check they were real."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A quantity of something that is inhaled through the nose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, colloquial) A brief perception, or tiny amount.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Cocaine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sniff (third-person singular simple present sniffs, present participle sniffing, simple past and past participle sniffed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make a short, audible inhalation, through the nose, as when smelling something.",
                  "examples": [
                    "The dog sniffed around the park, searching for a nice scent.",
                    "I sniffed the meat to see whether it had gone off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say (something) while sniffing, such as in case of illness or unhappiness, or in contempt.",
                  "examples": [
                    "\"He's never coming back, is he?\" she sniffed while looking at a picture of him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perceive vaguely.",
                  "examples": [
                    "I don't know, of course, what your precious Radicals are planning to do, and I don't want to know; but I can sniff trouble in the air, nevertheless."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pry; to investigate in an interfering manner.",
                  "examples": [
                    "COOMBE: He got the clinch only last week — eighteen months. You see it's no good having anybody here as ain't got a unblemished character. We don't want to have the bluebottles come sniffing round here, do we?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be dismissive or contemptuous of something.",
                  "examples": [
                    "This opportunity is not to be sniffed at."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To intercept and analyse packets of data being transmitted over a network.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly UK) To inhale drugs (usually cocaine) through the nose, usually in powder form.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}