{
  "word": "parry",
  "etymologies": [
    {
      "description": [
        "From earlier parree, from Middle English *parree, *paree, from Old French paree (“preparation, ceremony, parade”), from Medieval Latin parāta (“preparation, parade”), from parāre (“to ward off, guard, defend, prepare, get ready”). More at pare. The English verb is taken from the noun. Doublet of parade.",
        "Alternative etymology derives the verb parry from French parez, the imperative form of parer (“to fend off”), ultimately from the Medieval Latin parāre. See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parry (plural parries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A defensive or deflective action; an act of parrying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) A simple defensive action designed to deflect an attack, performed with the forte of the blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(combat sports and martial arts) A defensive move intended to change the direction of an incoming strike to make it miss its intended target, rather than block and absorb it; and typically performed with an open hand in a downward or sideways slapping motion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parry (third-person singular simple present parries, present participle parrying, simple past and past participle parried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To avoid, deflect, or ward off (an attack, a blow, an argument, etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}