{
  "word": "aggro",
  "etymologies": [
    {
      "description": [
        "From a clipping of aggravation + -o (diminutive suffix), influenced by aggressive."
      ],
      "adjectives": [
        {
          "description": "aggro (comparative more aggro, superlative most aggro)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) Angry.",
                  "examples": [
                    "“The Chuckster say you two be finding aggro idiot who kilt Long,” said Dude.",
                    "I thought I understood but looked at Charles for help.",
                    "“Aggro means pissed off.” translated Charles. He still hadn't cracked a smile. Tardiness made Charles aggro."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming, MMORPG slang) Liable to attack without being attacked first (said of monsters).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, US, slang) Hardcore, aggressive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "aggro (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Aggravation; bother.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia) Aggressive behaviour; loud, intimidating behaviour that convincingly threatens violence without necessarily actually becoming violent.",
                  "examples": [
                    "Move along, lads; we don't want any aggro."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming) A measure of how belligerent a player is – a high value may inspire either avoidance or preemptive hostile action from enemies.",
                  "examples": [
                    "To reduce one player's aggro level, the other must build up his own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming, MMORPG slang) Hostile attention from an enemy that should target players with better defenses.",
                  "examples": [
                    "You just pulled aggro off the tank and wiped the raid."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "aggro (third-person singular simple present aggros or aggroes, present participle aggroing, simple past and past participle aggroed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming, MMORPG slang, intransitive) To become aggressive towards the player's character.",
                  "examples": [
                    "They'll aggro on you if you get too close."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(online gaming, MMORPG slang, transitive) To cause (a non-player character) to become aggressive towards the player's character.",
                  "examples": [
                    "I aggroed the enderman by looking in its eyes, and it killed me."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}