{
  "word": "jalouse",
  "etymologies": [
    {
      "description": [
        "From Scots jalouse, from Old French jalouser. The sense \"to be jealous of\" came about as a misunderstanding by southern writers, from the similarity to jealousy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "jalouse (third-person singular simple present jalouses, present participle jalousing, simple past and past participle jaloused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, transitive) To suspect.",
                  "examples": [
                    "Now the mention of the Skerburnfoot brought back to him only the thought of Ailie, and not of the witch wife, her mother. So he jaloused no ill, for at the best he was slow in the uptake. […] 'Ford!' cried John, in scorn. 'There'll be nae ford for you the nicht unless it was the ford o' the river Jordan. The burns are up and bigger than man ever saw them. It'll be a Beltane's E'en that a' folk will remember. They tell me that Gled valley is like a loch, and that there's an awesome heap o' folk drouned in the hills. Gin ye were ower the Mire, what about crossin' the Caulds and the Sker?' says he, for he jaloused he was going to Gledsmuir."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To be jealous of.",
                  "examples": [
                    "When my two sisters (these two bitches, O Commander of the Faithful!) saw me by the side of my young lover they jaloused me on his account and were wroth and plotted mischief against me."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}