{
  "word": "naughty",
  "etymologies": [
    {
      "description": [
        "From Middle English noughti, naughty (“evil, immoral, wicked; bungling, ineffectual; in want, needy; evil or hostile person”) [and other forms], from nought (“evil, immoral; of poor quality, worthless; unworthy; inappropriate, unsuitable; impotent, powerless, weak; useless; of an agreement, decree, or obligation: null, void; trivial; diseased”) + -ī̆ (suffix forming adjectives). Nought is derived from Old English nōwiht, nāwiht (“nothing”), from Proto-West Germanic *naiwwiht (“nothing”). The English word is analysable as naught +‎ -y."
      ],
      "adjectives": [
        {
          "description": "naughty (comparative naughtier, superlative naughtiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mischievous; tending to misbehave or act badly (especially of a child). [from 17th c.]",
                  "examples": [
                    "Some naughty boys at school hid the teacher's lesson notes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sexually provocative; now in weakened sense, risqué, cheeky. [from 19th c.]",
                  "examples": [
                    "I bought some naughty lingerie for my honeymoon.",
                    "If I see you send another naughty email to your friends, you will be forbidden from using the computer!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, archaic) Evil, wicked, morally reprehensible. [from 15th c.]",
                  "examples": [
                    "my proneſſe to ſinne, and naughty appetites and desires, woulde drawe me headlong to the pitte of hell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Bad, worthless, substandard. [16th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "naughty (third-person singular simple present naughties, present participle naughtying, simple past and past participle naughtied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform sexual acts upon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}