{
  "word": "mahogany",
  "etymologies": [
    {
      "description": [
        "A word of unknown origin concocted in either English or Middle Dutch from one or more exotic phytonyms and common European words."
      ],
      "adjectives": [
        {
          "description": "mahogany (comparative more mahogany, superlative most mahogany)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of mahogany.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the colour of mahogany; dark reddish-brown.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mahogany (countable and uncountable, plural mahoganies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The wood of any of various tropical American evergreen trees, of the genus Swietenia, mostly used to make furniture. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any of the trees from which such wood comes. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(regional) A Cornish drink made from gin and treacle. [from 18th c.]",
                  "examples": [
                    "William Murdoch  […]  produced a bottle of port; but I chose mahogany (two parts gin and one part treacle, which Lord Eliot made us at Sir Joshua Reynolds's as a Cornish liquor, but it seems they make it also with brandy, and often add porter to it)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reddish-brown color, like that of mahogany wood. [from 19th c.]",
                  "examples": [
                    "mahogany:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, colloquial) A table made from mahogany wood; a dining table. [19th c.]",
                  "examples": [
                    "Poets eat and drink without stint — and seldom at their own cost — for what man of mark or likelihood in the moneyed world is there, who is not eager to get their legs under his mahogany?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}