{
  "word": "screamer",
  "etymologies": [
    {
      "description": [
        "From scream +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "screamer (plural screamers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who screams; one who shouts; one who sings harshly.",
                  "examples": [
                    "In my opinion, Sarah was a total screamer.  […]  She screams in BRAIN OF MORIBUS, PYRAMIDS OF MARS, PLANET OF EVIL, REVENGE OF CYBERMEN, GENESIS OF DALEKS, SEEDS OF DOOM, ARK IN SPACE, etc, etc. In just about all her stories. When she is not screaming she is yelping, \"Run Doctor RUNNNNNN!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any bird in the taxonomic family Anhimidae, endemic to South America, being large, bulky birds with a small downy head, long legs and large feet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, US, hunting) A healthy, vigorous animal.",
                  "examples": [
                    "I had seen the track of the bear they were after, and I knowed he was a screamer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A healthy, vigorous person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something exceptionally good.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, cricket) A difficult catch.",
                  "examples": [
                    "But then he came around the wicket again, I slashed at one, and Strauss, at full stretch diving to his left at second slip, took an absolute screamer. It was the catch of the summer, and it happened to me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, baseball) A very hard hit.",
                  "examples": [
                    "His screamer into the right field bleachers in the sixth with Scarborough and Viau on base put Hickory out in front 9 to 8 and the lead held for the rest of the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, Australian rules football) A particularly high mark (clean catch of a kicked ball).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, soccer, golf) A powerful shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, surfing) A very large wave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A march played at the circus to arouse the crowd.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) A video that unexpectedly frightens the viewer by cutting to a loud scream and disturbing image.",
                  "examples": [
                    "The Web is also big business; who needs a real job when you can just send Grandma a screamer and—POOF!—there's your inheritance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An effeminate gay man; a man who is obviously homosexual.",
                  "examples": [
                    "So when George Michael sings in his latest hit, “Girl, you're just too funky for me,” is he really singing about a woman? Or is he just being a total screamer and gender-fucking his male love object?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) A bouncer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism, slang) An exclamation mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism, slang) A large, attention-getting headline.",
                  "examples": [
                    "Hartley's argument usefully reminds us that the spread of celebrity is not just the consequence of an accumulation of publicity handouts, advertisements, chat show interviews, or the shock-horror revelations in the tabloid screamers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}