{
  "word": "device",
  "etymologies": [
    {
      "description": [
        "From Middle English devys, from Old French devis, from Latin dīvīsus, past participle of dīvidō (“to divide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "device (plural devices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any piece of equipment made for a particular purpose, especially a mechanical or electrical one.",
                  "examples": [
                    "Every cycle shall be equipped with: [...] (b) an audible warning device consisting of a bell [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer hardware) A peripheral device; an item of hardware.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A project or scheme, often designed to deceive; a stratagem; an artifice.",
                  "examples": [
                    "Their recent device of demanding benevolences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) An improvised explosive device, home-made bomb",
                  "examples": [
                    "Inflammable material is planted in my head / It's a suspect device that's left 2000 dead"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) A technique that an author or speaker uses to evoke an emotional response in the audience; a rhetorical device.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A motto, emblem, or other mark used to distinguish the bearer from others. A device differs from a badge or cognizance primarily as it is a personal distinction, and not a badge borne by members of the same house successively.",
                  "examples": [
                    "The devices of these savages are the serpent, the Deer, and the Small Acorn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Power of devising; invention; contrivance.",
                  "examples": [
                    "Moreover I must have instruments of mine own device, weighty, and exceeding costly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An image used in whole or in part as a trademark or service mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) An image or logo denoting official or proprietary authority or provenience.",
                  "examples": [
                    "Prior to the issuance of the first stamps, letters accepted by postmasters for dispatch were marked \"Paid\" by means of pen and ink or hand stamps of various designs. [...] To facilitate the handling of mail matter, some postmasters provided special stamps or devices for use on letters as evidence of the prepayment of postage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A spectacle or show.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Opinion; decision.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}