{
  "word": "treacle",
  "etymologies": [
    {
      "description": [
        "From Middle English triacle, partly from  Old French triacle, and partly from Old English tiriaca, both from Late Latin *triaca,  *tiriaca, late form of theriaca, ultimately from Ancient Greek θηριακή (thēriakḗ, “antidote”), feminine form of θηριακός (thēriakós, “concerning venomous beasts”), from θήρ (thḗr, “beast”). Compare theriac, theriacle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "treacle (countable and uncountable, plural treacles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) A syrupy byproduct of sugar refining; molasses or golden syrup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cloying sentimental speech.",
                  "examples": [
                    "The public tributes to Griffith were over-the-top in a way his acting never was, spreading treacle from the evening newscasts to the front page of the New York Times."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cockney rhyming slang) Sweetheart (from treacle tart).",
                  "examples": [
                    "Listen, treacle, this is the last time I'll warn you!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Synonym of theriac: an antidote for poison, especially snakebite; a supposedly universal antidote.",
                  "examples": [
                    "CHEWING-BALLS, a kind of balls made of aſafœtida, liver of antimony, bay-wood, juniper-wood, and pellitory of Spain; which being dried in the ſun, and wrapped in a linen-cloth, are tied to the bit of the bridle for the horſe to chew: they create an appetite; and it is ſaid, that balls of Venice treacle may be uſed in the ſame manner with good ſucceſs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, figurative) Synonym of cure: an all-powerful curative for some particular affliction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, figurative) Synonym of cure-all: a panacea for all human ailments.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "treacle (third-person singular simple present treacles, present participle treacling, simple past and past participle treacled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply treacle to a surface, so as to catch flies or moths, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}