{
  "word": "allocution",
  "etymologies": [
    {
      "description": [
        "From Latin allocūtiō (“address”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "allocution (countable and uncountable, plural allocutions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formal speech, especially one which is regarded as authoritative and forceful.",
                  "examples": [
                    "The Minister of War, in a barrack-square allocution to the officers of the artillery regiment he had been inspecting, had declared the national honour sold to foreigners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, law) The question put to a convicted defendant by a judge after the rendering of the verdict in a trial, in which the defendant is asked whether he or she wishes to make a statement to the court before sentencing; the statement made by a defendant in response to such a question; the legal right of a defendant to make such a statement.",
                  "examples": [
                    "The term \"allocution\" refers to the personal right of a defendant to make a statement on his own behalf in an attempt to affect sentencing. . . . The word \"allocution\" is also frequently used . . . to describe the statement made by a defendant during a guilty plea proceeding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, law) The legal right of a victim, in some jurisdictions, to make a statement to a court prior to sentencing of a defendant convicted of a crime causing injury to that victim; the actual statement made to a court by a victim.",
                  "examples": [
                    "As of July, 1985, 19 states permitted victim allocution at the sentencing phase of criminal trials."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A pronouncement by a pope to an assembly of church officials concerning a matter of church policy.",
                  "examples": [
                    "The recent papal allocution To the International Congress on Life-Sustaining Treatment and Vegetative State: Scientific Advances and Ethical Dilemmas has been the occasion for much discussion concerning the use of artificial feeding tubes for nutrition and hydration."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(communication, media) The mode of information dissemination in which media broadcasts are transmitted to multiple receivers with no or very limited capability of a two-way exchange of information.",
                  "examples": [
                    "Allocution is the dissemination of information by a central unit towards a collectivity of decentral units, the central unit being both the source and the determining actor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}