{
  "word": "whitewood",
  "etymologies": [
    {
      "description": [
        "white +‎ wood"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whitewood (countable and uncountable, plural whitewoods)",
          "definitionGroups": [
            {
              "group": "Any of several deciduous trees, some used for furniture, as the tulip tree.",
              "entries": [
                {
                  "meaning": "Terminalia buceras (black olive, gregory wood), a Caribbean tree",
                  "examples": []
                },
                {
                  "meaning": "Coccoloba krugii (whitewood seagrape), of the neotropics",
                  "examples": []
                },
                {
                  "meaning": "Petrobium atboreum (Saint Helena whitewood), an endemic tree of the island of St Helena",
                  "examples": []
                },
                {
                  "meaning": "Elaeocarpus kirtonii (brown-heart quandong, mountain beech, Mowbullan whitewood, pigeonberry ash, silver quandong, white quandong, white beech), an Australian rainforest tree",
                  "examples": []
                },
                {
                  "meaning": "Elaeocarpus obovatus (blueberry-ash), freckled oliveberry, grey carrobean, hard quandong), an Australian rainforest tree",
                  "examples": []
                },
                {
                  "meaning": "Liriodendron tulipifera (tulip poplar), a large flowering tree of North America.",
                  "examples": []
                },
                {
                  "meaning": "Tabebuia heterophylla (white cedar), of the Caribbean and South America.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wood of these trees or of spruce (Picea spp.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pinball) A prototype version of a pinball table, without the final artwork.",
                  "examples": [
                    "When the design seems satisfactory, the whitewood is wired to make it playable. Meanwhile the software developer has been creating the unique software to control the game."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}