{
  "word": "archetype",
  "etymologies": [
    {
      "description": [
        "From Old French architipe (modern French archétype), from Latin archetypum (“original”), from Ancient Greek ἀρχέτυπον (arkhétupon, “model, pattern”), the neuter form of ἀρχέτυπος (arkhétupos, “first-moulded”), from ἀρχή (arkhḗ, “beginning, origin”) (from ἄρχω (árkhō, “to begin; to lead, rule”), from Proto-Indo-European *h₂ergʰ- (“to begin; to command, rule”)) + τῠ́πος (túpos, “blow, pressing; sort, type”) (from τύπτω (túptō, “to beat, strike”), from Proto-Indo-European *(s)tewp- (“to push; to stick”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "archetype (plural archetypes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An original model of which all other similar concepts, objects, or persons are merely copied, derivative, emulated, or patterned; a prototype. [from mid 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ideal example of something; a quintessence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature) A character, object, or story that is based on a known character, object, or story.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) According to Swiss psychologist Carl Jung: a universal pattern of thought, present in an individual's unconscious, inherited from the past collective experience of humanity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textual criticism) A protograph (“original manuscript of a text from which all further copies derive”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "archetype (third-person singular simple present archetypes, present participle archetyping, simple past and past participle archetyped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To depict as, model using, or otherwise associate an object or subject with an archetype.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}