{
  "word": "opening",
  "etymologies": [
    {
      "description": [
        "From Middle English openynge, openande, openand, from Old English openiende, from Proto-West Germanic *opanōndī, from Proto-Germanic *upanōndz, present participle of *upanōną (“to open”), equivalent to open +‎ -ing. Cognate with West Frisian iepenjend, Dutch openend, German öffnend, Swedish öppnande, Icelandic opnandi."
      ],
      "adjectives": [
        {
          "description": "opening (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to the start or beginning of a series of events.",
                  "examples": [
                    "The opening theme of Beethoven's Fifth Symphony is, perhaps, the most recognizable in all of European art music.",
                    "The opening act of the battle for Fort Sumter was the firing of a single 10-inch mortar round from Fort Johnson at 4:30 a.m. on April 12, 1861, by Lt. Henry S. Farley, who acted upon the command of Capt. George S. James, which round exploded over Fort Sumter as a signal to open the general bombardment from 43 guns and mortars at Fort Moultrie, Fort Johnson, the floating battery, and Cummings Point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket)  describing the first period of play, usually up to the fall of the first wicket; describing a batsman who opens the innings or a bowler who opens the attack",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "opening",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of open",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English openyng, openynge, openunge, from Old English openung (“an opening”), from Proto-West Germanic *opanungu, from Proto-Germanic *upanungō (“an opening”), equivalent to open +‎ -ing. Cognate with Saterland Frisian Eepenge, Epenge (“an opening”), West Frisian iepening (“an opening”), Dutch opening (“an opening”), German Öffnung (“an opening”), Danish åbning (“an opening”), Swedish öppning (“an opening”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "opening (plural openings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of making or becoming open.",
                  "examples": [
                    "The daily openings of the day lily bloom gives it its name.",
                    "He remembered fondly the Christmas morning opening of presents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gap permitting passage through.",
                  "examples": [
                    "A salamander darted out of an opening in the rocks.",
                    "He slipped through an opening in the crowd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of beginning.",
                  "examples": [
                    "There have been few factory and store openings in the US lately.",
                    "Their opening of the concert with Brass in Pocket always fires up the crowd."
                  ]
                }
              ]
            },
            {
              "group": "Something that is a beginning.",
              "entries": [
                {
                  "meaning": "The first performance of a show or play by a particular troupe.",
                  "examples": [
                    "They were disappointed at the turnout for their opening, but hoped that word would spread."
                  ]
                },
                {
                  "meaning": "The initial period when a show at an art gallery or museum is first opened, especially the first evening.",
                  "examples": []
                },
                {
                  "meaning": "The first few measures of a musical composition.",
                  "examples": []
                },
                {
                  "meaning": "The first few moves in a game.",
                  "examples": [
                    "John spends two hours a day studying chess openings, and another two hours studying endgames."
                  ]
                }
              ]
            },
            {
              "group": "A vacant position, especially in an array.",
              "entries": [
                {
                  "meaning": "A time available in a schedule.",
                  "examples": [
                    "If you'd like to make a booking with us, we have an opening at twelve o'clock.",
                    "The only two-hour openings for the hockey rink are between 1AM and 5AM."
                  ]
                },
                {
                  "meaning": "An unoccupied employment position.",
                  "examples": [
                    "We have an opening in our marketing department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opportunity, as in a competitive activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) In mathematical morphology, the dilation of the erosion of a set.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}