{
  "word": "humbug",
  "etymologies": [
    {
      "description": [
        "Origin unknown; the Oxford English Dictionary (OED) states that “the facts as to its origin appear to have been lost, even before the word became common enough to excite attention”. It has been suggested that the word possibly derives from hummer (“(slang) An obvious lie”), or from hum (“(dialectal and slang) to cajole; delude; impose on”) + bug (“a goblin, a spectre”). In his Slang Dictionary (1872), English bibliophile and publisher John Camden Hotten (1832–1873) suggested a link to the name of the German city of Hamburg, “from which town so many false bulletins and reports came during the war in the last century”.",
        "Hotten also said he had traced the earliest occurrence of the word to the title page of Ferdinando Killigrew’s book The Universal Jester (see quotations), which he dated to about 1735–1740. This dating has therefore been adopted by other dictionaries. However, the OED dates the word to about 1750, as the earliest edition of Killigrew’s work has been dated to 1754."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "humbug (countable and uncountable, plural humbugs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A hoax, jest, or prank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A fraud or sham; (uncountable) hypocrisy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) A cheat, fraudster, or hypocrite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Nonsense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain) A type of hard sweet (candy), usually peppermint flavoured with a striped pattern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, countable, slang) Anything complicated, offensive, troublesome, unpleasant or worrying; a misunderstanding, especially if trivial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, countable, African American Vernacular, slang) A fight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, African American Vernacular, slang, dated) A gang.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, crime, slang) A false arrest on trumped-up charges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang, perhaps by extension) The piglet of the wild boar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "humbug (third-person singular simple present humbugs, present participle humbugging, simple past and past participle humbugged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To play a trick on someone, to cheat, to swindle, to deceive.",
                  "examples": [
                    "Of all trades and arts in repute or possession, / Humbugging is held the most ancient profession. / Twixt nations, and parties, and state politicians, / Prim shopkeepers, jobbers, smooth lawyers, physicians, / Of worth and of wisdom the trial and test / Is—mark ye, my friends!—who shall humbug the best."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, African American Vernacular, slang) To fight; to act tough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) To waste time talking.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}