{
  "word": "vat",
  "etymologies": [
    {
      "description": [
        "From Middle English vat, a dialectal variant of fat (“vat, vessel, cask”), from Old English fæt (“vat, vessel”), from Proto-Germanic *fatą (“vessel”), from Proto-Indo-European *pod- (“vessel”). Cognate with Scots fat, vat, vautt (“vat, cask, tub”), West Frisian fet, Dutch vat (“barrel, cask, vessel, vat”), German Fass (“barrel, keg, drum, cask, vat”), Danish fad (“saucer, dish”), Swedish fat (“dish, barrel, cask, vat”), Icelandic fat (“dish, saucer”). See fat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vat (plural vats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large tub, such as is used for making wine or for tanning.",
                  "examples": [
                    "a vat of liquid",
                    "a vat of acid",
                    "a vat of wine",
                    "a vat of olives",
                    "a vat of fat",
                    "a vat of glue"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A square, hollow place on the back of a calcining furnace, where tin ore is laid to dry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A vessel for holding holy water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A liquid measure and dry measure; especially, a liquid measure in Belgium and Holland, corresponding to the hectolitre of the metric system, which contains 22.01 imperial gallons, or 26.4 standard gallons in the United States.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vat (third-person singular simple present vats, present participle vatting, simple past and past participle vatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a vat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blend (wines or spirits) in a vat; figuratively, to mix or blend elements as if with wines or spirits.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}