{
  "word": "print",
  "etymologies": [
    {
      "description": [
        "From Middle English *printen, prenten, preenten, an apheretic form of emprinten, enprinten (“to impress; imprint”) (see imprint). Compare Dutch prenten (“to imprint”), Middle Low German prenten (“to print; write”), Danish prente (“to print”), Swedish prenta (“to write German letters”). Compare also Late Old French printer, preindre (“to press”), from Latin premere (“to press”)."
      ],
      "adjectives": [
        {
          "description": "print (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, relating to, or writing for printed publications.",
                  "examples": [
                    "a print edition of a book"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "print (countable and uncountable, plural prints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Books and other material created by printing presses, considered collectively or as a medium.",
                  "examples": [
                    "Three citations are required for each meaning, including one in print.",
                    "TV and the Internet haven't killed print."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Clear handwriting, especially, writing without connected letters as in cursive.",
                  "examples": [
                    "Write in print using block letters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The letters forming the text of a document.",
                  "examples": [
                    "The print is too small for me to read."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A newspaper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A visible impression on a surface.",
                  "examples": [
                    "Using a crayon, the girl made a print of the leaf under the page."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fingerprint.",
                  "examples": [
                    "Did the police find any prints at the scene?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A footprint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(visual art) A picture that was created in multiple copies by printing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) A photograph that has been printed onto paper from the negative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A copy of a film that can be projected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cloth that has had a pattern of dye printed onto it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A plaster cast in bas relief.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "print (third-person singular simple present prints, present participle printing, simple past and past participle printed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce one or more copies of a text or image on a surface, especially by machine; often used with out or off: print out, print off.",
                  "examples": [
                    "Print the draft double-spaced so we can mark changes between the lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce a microchip (an integrated circuit) in a process resembling the printing of an image.",
                  "examples": [
                    "The circuitry is printed onto the semiconductor surface."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To write very clearly, especially, to write without connecting the letters as in cursive.",
                  "examples": [
                    "Print your name here and sign below.",
                    "I'm only in grade 2, so I only know how to print."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To publish in a book, newspaper, etc.",
                  "examples": [
                    "How could they print an unfounded rumour like that?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stamp or impress (something) with coloured figures or patterns.",
                  "examples": [
                    "to print calico"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fix or impress, as a stamp, mark, character, idea, etc., into or upon something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stamp something in or upon; to make an impression or mark upon by pressure, or as by pressure.",
                  "examples": [
                    "Forth on his fiery steed betimes he rode, / That scarcely prints the turf on which he trod."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To display a string on the terminal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, transitive, intransitive) To produce an observable value.",
                  "examples": [
                    "On March 16, 2020, the S&P printed at 2,386.13, one of the worst drops in history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fingerprint (a person).",
                  "examples": [
                    "Maybe we'll get lucky; maybe he was printed for some minor infraction in some backwater town."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}