{
  "word": "parachute",
  "etymologies": [
    {
      "description": [
        "Borrowed from French parachute, from para- (“protection against”) (as in parasol) and chute (“fall”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parachute (plural parachutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A device, generally constructed from fabric, that is designed to employ air resistance to control the fall of an object or person, causing them to float instead of falling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A web or fold of skin extending between the legs of gliding mammals, such as the flying squirrel and colugo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(BDSM) A small collar which fastens around the scrotum and from which weights can be hung.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of cloth used in physical education often colorful and surrounded by handles.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parachute (third-person singular simple present parachutes, present participle parachuting, simple past and past participle parachuted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To jump, fall, descend, etc. using such a device.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To introduce into a place using such a device.",
                  "examples": [
                    "The soldiers were parachuted behind enemy lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (somebody) in an organisation in a position of authority without their having previous experience there; used with in or into.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}