{
  "word": "relatedly",
  "etymologies": [
    {
      "description": [
        "related +‎ -ly"
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "relatedly (comparative more relatedly, superlative most relatedly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a related manner.",
                  "examples": [
                    "Dellamora argues that Swinburne's \"Anactoria\" aims \"to free desire\" by making sexual difference and orientation \"indeterminate\" (77). Slightly earlier in Masculine Desire, he argues relatedly that Swinburne \"enjoyed imagining such possibilities\" as \"male-male genital activity\" (69)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used to indicate that the accompanying statement is related (connected) to a preceding statement or occurrence.",
                  "examples": [
                    "While there is now a Department of Constitutional Affairs, there is no formal constitution. Relatedly, there is no fundamental questioning of the exercise of the prerogative powers by the Prime Minister, the position of the monarchy, and the relation between church and state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Used to indicate that the accompanying statement may not be true, but has been said to be true.",
                  "examples": [
                    "As noted earlier, cooperation between the United States and Mexico in police matters mostly revolves around the drug trade and has relatedly been hampered by the influence of corruption."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}