{
  "word": "love",
  "etymologies": [
    {
      "description": [
        "From Middle English love, luve, from Old English lufu, from Proto-West Germanic *lubu, from Proto-Germanic *lubō, from Proto-Indo-European *lewbʰ- (“love, care, desire”).",
        "The close of a letter sense is presumably a truncation of With love or the like.",
        "The verb is from Middle English loven, luvien, from Old English lufian (“to love”), from Proto-West Germanic *lubōn (“to love”), derived from the noun.",
        "Eclipsed non-native English amour (“love”), borrowed from French amour (“love”).",
        "Cognates include Russian любовь (ljubovʹ), Polish lubić and Sanskrit लोभ (lobha, “desire, greed”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "love (countable and uncountable, plural loves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A deep caring for the existence of another.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable) Strong affection.",
              "entries": [
                {
                  "meaning": "A profound and caring affection towards someone.",
                  "examples": [
                    "A mother’s love is not easily shaken.",
                    "My husband’s love is the most important thing in my life."
                  ]
                },
                {
                  "meaning": "Affectionate, benevolent concern or care for other people or beings, and for their well-being.",
                  "examples": [
                    "The love of your neighbor as yourself, is expressly given as the definition and test of Charity,—not alms-giving—and this love is [...] the highest of all the Divine commands[.]"
                  ]
                },
                {
                  "meaning": "A feeling of intense attraction towards someone.",
                  "examples": [
                    "I have never been in love as much as I have with you."
                  ]
                },
                {
                  "meaning": "A deep or abiding liking for something; an enthusiasm for something.",
                  "examples": [
                    "My love of cricket knows no bounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person who is the object of romantic feelings; a darling, a sweetheart, a beloved.",
                  "examples": [
                    "Synonyms: baby, darling, honey, lover, pet, sweetheart; see also Thesaurus:sweetheart"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, Commonwealth) A term of friendly address, regardless of feelings.",
                  "examples": [
                    "Synonyms: mate, darling, lovey, sweetie, sweetheart",
                    "Hello love, how can I help you?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing, activity, etc. which is the object of one's deep liking or enthusiasm.",
                  "examples": [
                    "But it wasn't until [Theresa M. Claiborne] went to ROTC training camp at the University of California at Berkeley that she discovered that flying was her first love. \"Pilots talk about getting bit by the flying bug,\" she says. \"I thought, This is heaven.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Sexual desire; attachment based on sexual attraction.",
                  "examples": [
                    "Synonyms: aphrodisia, carnality; see also Thesaurus:lust"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Sexual activity.",
                  "examples": [
                    "Synonyms: lovemaking, sex; see also Thesaurus:copulation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance or episode of being in love; a love affair.",
                  "examples": [
                    "Synonym: romance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used as the closing, before the signature, of a letter, especially between good friends or family members, or by the young.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Love (“personification of love”).",
                  "examples": [
                    "At busy hearts in vain love's arrows fly; [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A thin silk material.",
                  "examples": [
                    "Such a kind of transparency, as that of a Sive, a piece of Cyprus, or a Love-Hood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A climbing plant, Clematis vitalba.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "love (third-person singular simple present loves, present participle loving, simple past and past participle loved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually transitive, sometimes intransitive, stative) To have a strong affection for (someone or something).",
                  "examples": [
                    "Just give me a reason, / just a little bit's enough, / just a second we're not broken, just bent / and we can learn to love again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To need, thrive on.",
                  "examples": [
                    "Mold loves moist, dark places."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be strongly inclined towards something; an emphatic form of like.",
                  "examples": [
                    "I love walking barefoot on wet grass;  I'd love to join the team;  I love what you've done with your hair"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually transitive, sometimes intransitive) To care deeply about, to be dedicated to (someone or something).",
                  "examples": [
                    "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To derive delight from a fact or situation.",
                  "examples": [
                    "I love the fact that the coffee shop now offers fat-free chai latte."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, euphemistic) To have sex with (perhaps from make love).",
                  "examples": [
                    "I wish I could love her all night long."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Now widely believed (due to historical written record) to be from the idea that when one does a thing “for love”, that is for no monetary gain, the word “love” implying \"nothing\".",
        "The former assumption that it had originated from French l’œuf (literally “the egg”), due to its shape, has largely been discredited and is no longer widely accepted.",
        "Needless to say, the apparent similarity of the shape of an egg to a zero has inspired similar analogies, such as the use of duck (reputed to be short for duck's egg) for a zero score at cricket, and goose egg for \"zero\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "love (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(racquet sports, billiards) Zero, no score.",
                  "examples": [
                    "So that’s fifteen-love to Kournikova."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nothing; no recompense.",
                  "examples": [
                    "I fought the white man for less than sixpence. I fought him for love, which is nothing at all."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "love (third-person singular simple present loves, present participle loving, simple past and past participle loved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of lofe (“to praise, sell”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}