{
  "word": "bunker",
  "etymologies": [
    {
      "description": [
        "The origin of the noun is uncertain; the earliest sense is sense 6.1 (“box or chest, the lid of which serves as a seat”), from Scots bunker (“bench; pew; window-seat; sand pit (especially in golf); coal receptacle; sleeping berth, bunk”), from Early Scots bunker, bunkur, bonker (“a chest or box, often serving as a seat”), probably from Old Norse bunki (“a heap”) (probably whence bunk (“sleeping berth in a ship, train, etc.”)), from Proto-Germanic *bunkô (“a heap, pile; a bump, lump, a crowd”), perhaps from Proto-Indo-European *bʰenǵʰ- (“thick”) or *bʰeg- (“to billow, swell; to arch, bend, curve (?)”). Compare Middle Low German bunge (“drum, container”), Middle High German bunge (“drum”). Sense 1 (“hardened shelter designed to protect the inhabitants from falling bombs or other attacks”) was derived from German Bunker during World War II, which was itself from bunker (“large bin or container for storing coal”) (sense 5).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bunker (plural bunkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A hardened shelter, often partly buried or fully underground, designed to protect the inhabitants from falling bombs or other attacks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A container for storing coal or fuel oil for a ship's engine; (by extension) the quantity of fuel needed to replenish that container.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) The coal compartment on a tank engine.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(sports)",
              "entries": [
                {
                  "meaning": "(golf) A hazard on a golf course consisting of a sand-filled hollow.",
                  "examples": []
                },
                {
                  "meaning": "(paintball) An obstacle used to block an opposing player's view and field of fire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, chiefly historical) A large bin or container for storing coal, often built outdoors in the yard of a house.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(Scotland)",
              "entries": [
                {
                  "meaning": "A sort of box or chest, as in a window, the lid of which serves as a seat.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A kitchen worktop.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bunker (third-person singular simple present bunkers, present participle bunkering, simple past and past participle bunkered)",
          "definitionGroups": [
            {
              "group": "(nautical)",
              "entries": [
                {
                  "meaning": "(transitive) To load (a vessel) with coal or fuel oil for the engine.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, of a vessel) To take a load of coal or fuel oil for its engine.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, Nigeria) To steal bunker fuel by illicitly siphoning it off.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, golf) To hit (a golf ball) into a bunker; (chiefly passive) to place (a golfer) in the position of having a golf ball in a bunker.",
              "entries": [
                {
                  "meaning": "(idiomatic, UK, informal) To place (someone) in a position that is difficult to get out of; to hinder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, paintball) To fire constantly at (an opponent hiding behind an obstacle), trapping them and preventing them from firing at other players; also, to eliminate (an opponent behind an obstacle) by rushing to the position and firing at extremely close range as the player becomes exposed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Often followed by down: to take shelter in a bunker or other place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From bunk (“to fail to attend school or work without permission, to play truant”) +‎ -er (suffix forming agent nouns indicating a person or thing that does an action)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bunker (plural bunkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) One who bunks off; a truant from school.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of mossbunker, a variant of mossbanker, from Dutch marsbanker (“common scad or Atlantic horse mackerel (Trachurus trachurus)”), from Marsdiep (“deep tide-race between Den Helder and Texel in the Netherlands”) + bank (“shallow part of the sea near a coast”) + -er (suffix forming nouns denoting male inhabitants of a place)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bunker (plural bunkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) The menhaden, any of several species of fish in the genera Brevoortia and Ethmidium.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}