{
  "word": "beast",
  "etymologies": [
    {
      "description": [
        "From Middle English beeste, beste, from Old French beste (French bête), from Latin bēstia (“animal, beast”); many cognates – see bēstia."
      ],
      "adjectives": [
        {
          "description": "beast (comparative more beast, superlative most beast)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly Midwestern and northeastern US) great; excellent; powerful",
                  "examples": [
                    "There is another type from Siemens which is the HYB 39S64XXX(AT/ATL) -8B version (notice the \"B\" and the end) which is totally beast altogether."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "beast (plural beasts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "Any animal other than a human; usually only applied to land vertebrates, especially large or dangerous four-footed ones.",
              "entries": [
                {
                  "meaning": "(chiefly in Commonwealth English, more specifically) A domestic animal, especially a bovine farm animal.",
                  "examples": [
                    "Boxer was an enormous beast, nearly eighteen hands high, and as strong as any two ordinary horses put together."
                  ]
                },
                {
                  "meaning": "A monstrously unusual and dangerous animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who behaves in a violent, antisocial or uncivilized manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Anything regarded as larger or more powerful than one of its normal size or strength.",
                  "examples": [
                    "That is a beast of a stadium.",
                    "The subwoofer that comes with this set of speakers is a beast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Someone who is particularly impressive, especially athletically or physically.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison slang, derogatory) A sex offender.",
                  "examples": [
                    "Shouts had been heard: 'We're coming to kill you, beasts.' In desperation, Rule 43s had tried to barricade their doors […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something unpleasant and difficult.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thing or matter, especially a difficult or unruly one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beast (third-person singular simple present beasts, present participle beasting, simple past and past participle beasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, military) to impose arduous exercises, either as training or as punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, slang) to engage in sexual intercourse, particularly in an illicit context",
                  "examples": [
                    "That teacher is under investigation for beasting wee 'uns."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}