{
  "word": "crock",
  "etymologies": [
    {
      "description": [
        "From Middle English crok, crokke (“earthenware jar, pot, or other container; cauldron; belly, stomach”) [and other forms], from Old English crocc, crocca (“crock, pot, vessel”) [and other forms], from Proto-Germanic *krukkō, *krukkô (“vessel”), from Proto-Indo-European *growg- (“vessel”).",
        "The English word is cognate with Danish and Norwegian krukke (“jar”), Dutch kruik (“jar, jug”), regional German Kruke (“crock”), Icelandic krukka (“pot, jar”), Old English crōg, crōh (“crock, pitcher, vessel”). See also cruse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crock (plural crocks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stoneware or earthenware jar or storage container.",
                  "examples": [
                    "Therefore the Vulgar did about him flock / And cluster thick unto his leaſings vain; / Like fooliſh Flies about an Honey-Crock; / In hope by him great Benefit to gain, / And uncontrolled Freedom to obtain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of broken pottery, a shard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A person who is physically limited by age, illness or injury.",
                  "examples": [
                    "old crocks’ home ― home for the aged"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) An old or broken-down vehicle (and formerly a horse or ewe).",
                  "examples": [
                    "Synonyms: banger; see also Thesaurus:old car",
                    "old crocks race ― veteran car rally"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Canada, US, countable and uncountable) Silly talk, a foolish belief, a poor excuse, nonsense.",
                  "examples": [
                    "That's a bunch of crock.",
                    "The story is a crock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low stool.",
                  "examples": [
                    "I then inquired for the person that belonged to the petticoat; and, to my great surprise, was directed to a very beautiful young damsel, with so pretty a face and shape, that I bid her come out of the crowd, and seated her upon a little crock at my left hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medical slang, derogatory) A patient who is difficult to treat, especially one who complains of a minor or imagined illness.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crock (third-person singular simple present crocks, present participle crocking, simple past and past participle crocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To break something or injure someone.",
                  "examples": [
                    "\"That last time I brought down Barry I crocked him. He's in his study now with a sprained ankle. ...\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles, leatherworking) To transfer coloring through abrasion from one item to another.",
                  "examples": [
                    "thus producing a permanent, definite color thereon which will not fade or crock, and at the same time using up all of the coloring matter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) To cover the drain holes of a planter with stones or similar material, in order to ensure proper drainage.",
                  "examples": [
                    "The pots should be crocked for drainage to one-half their depth and the plants made moderately firm in the compost, as already indicated..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now dialectal) To put or store (something) in a crock or pot.",
                  "examples": [
                    "She filled the pail and carried it down to the springhouse to crock it and leave it to cool."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Compare Welsh croeg (“cover”), Scots crochit (“covered”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crock (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The loose black particles collected from combustion, as on pots and kettles, or in a chimney; soot; smut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Colouring matter that rubs off from cloth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crock (third-person singular simple present crocks, present participle crocking, simple past and past participle crocked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give off crock or smut.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}