{
  "word": "halfback",
  "etymologies": [
    {
      "description": [
        "From half +‎ back, in reference to position on the field of play; compare fullback."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "halfback (plural halfbacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(field sports) Any of various positions on the field of play between the forwards and the fullbacks.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(field sports) A player who occupies one of these positions.",
              "entries": [
                {
                  "meaning": "(American football) An offensive back whose primary jobs are to carry the ball on running plays and to serve as a receiver or blocker on passing plays.",
                  "examples": []
                },
                {
                  "meaning": "(Canadian football) A defensive back whose primary jobs are to cover the slotback on passing plays and prevent running plays from going to the outside.",
                  "examples": []
                },
                {
                  "meaning": "(field hockey) A player in the halfback position, with both offensive and defensive roles.",
                  "examples": []
                },
                {
                  "meaning": "(Australian rules football) One of three players (the centre halfback and two halfback flankers) on the line between the centre line and the fullback line.",
                  "examples": []
                },
                {
                  "meaning": "(rugby) The player who feeds the ball into the scrum, and receives the ball as it emerges from the back of the scrum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "halfback (third-person singular simple present halfbacks, present participle halfbacking, simple past and past participle halfbacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play in the position of halfback.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}