{
  "word": "govern",
  "etymologies": [
    {
      "description": [
        "From Middle English governen, governe, from Anglo-Norman and Old French governer, guverner, from Latin gubernō, from Ancient Greek κυβερνάω (kubernáō, “I steer, drive, govern”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "govern (plural governs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of governing",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "govern (third-person singular simple present governs, present participle governing, simple past and past participle governed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make and administer the public policy and affairs of; to exercise sovereign authority in.",
                  "examples": [
                    "The old king governed the land wisely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To exercise political authority; to run a government.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To control the actions or behavior of; to keep under control; to restrain.",
                  "examples": [
                    "Govern yourselves like civilized people.",
                    "a student who could not govern his impulses"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To exercise a deciding or determining influence on.",
                  "examples": [
                    "Chance governs the outcome of many card games."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have or exercise a determining influence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To handle, to manage, to oversee (a matter, an affair, a household, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To control the speed, flow etc. of; to regulate.",
                  "examples": [
                    "a valve that governs fuel intake"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To direct the course of, to guide in some direction, to steer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To look after, to take care of, to tend to (someone or some plant).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To manage, to control, to work (a tool or mechanical device).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, grammar) To require that a certain preposition, grammatical case, etc. be used with a word; sometimes used synonymously with collocate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}