{
  "word": "desolate",
  "etymologies": [
    {
      "description": [
        "From Middle English desolate, from Latin dēsōlātus, past participle of dēsōlāre (“to leave alone, make lonely, lay waste, desolate”), from sōlus (“alone”)."
      ],
      "adjectives": [
        {
          "description": "desolate (comparative more desolate, superlative most desolate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Deserted and devoid of inhabitants.",
                  "examples": [
                    "a desolate isle; a desolate wilderness; a desolate house"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Barren and lifeless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made unfit for habitation or use because of neglect, destruction etc.",
                  "examples": [
                    "desolate altars"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dismal or dreary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sad, forlorn and hopeless.",
                  "examples": [
                    "He was left desolate by the early death of his wife."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "desolate (third-person singular simple present desolates, present participle desolating, simple past and past participle desolated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deprive of inhabitants.",
                  "examples": [
                    "If you consider well of the People of the West-Indies, it is very probable, that they are a newer or younger People, than the People of the old World. And it is much more likely, that the destruction that hath heretofore been there, was not by Earthquakes,  […]  but rather, it was Desolated by a particular Deluge: For Earthquakes are seldom in those Parts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To devastate or lay waste somewhere.",
                  "examples": [
                    "But in Utopia there will be wide stretches of cheerless or unhealthy or toilsome or dangerous land with never a household; there will be regions of mining and smelting, black with the smoke of furnaces and gashed and desolated by mines, with a sort of weird inhospitable grandeur of industrial desolation, and the men will come thither and work for a spell and return to civilisation again, washing and changing their attire in the swift gliding train."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To abandon or forsake something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make someone sad, forlorn and hopeless.",
                  "examples": [
                    "It is not altogether uncommon to hear a reader whose heart has been desolated by the poignancy of a narrative complain that the writer is unemotional."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}