{
  "word": "section",
  "etymologies": [
    {
      "description": [
        "From Middle English seccioun, from Old French section, from Latin sectiō (“cutting, cutting off, excision, amputation of diseased parts of the body, etc.”), from sectus, past participle of secāre (“to cut”). More at saw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "section (plural sections)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cutting; a part cut out from the rest of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A part, piece, subdivision of anything.",
              "entries": [
                {
                  "meaning": "(music) A group of instruments in an orchestra.",
                  "examples": [
                    "The horn section is the group of symphonic musicians who play the French horn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a document, especially a major part; often notated with §.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of cutting.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A cross-section (image that shows an object as if cut along a plane).",
              "entries": [
                {
                  "meaning": "(aviation) A cross-section perpendicular the longitudinal axis of an aircraft in flight.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(surgery) An incision or the act of making an incision.",
              "entries": [
                {
                  "meaning": "(surgery, colloquial) Short for Caesarean section.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) A thin slice of material prepared as a specimen for research.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A taxonomic rank below the genus (and subgenus if present), but above the species.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) An informal taxonomic rank below the order ranks and above the family ranks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A group of 10-15 soldiers led by a non-commissioned officer and forming part of a platoon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(category theory) A right inverse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand) A piece of residential land; a plot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, law and land surveying) Synonym of square mile, a unit of land area, especially in the contexts of Canadan surveys and American land grants and legal property descriptions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The symbol §, denoting a section of a document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A sequence of rock layers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines, education) A class in a school; a group of students in a regularly scheduled meeting with a teacher in a certain school year or semester or school quarter year.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "section (third-person singular simple present sections, present participle sectioning, simple past and past participle sectioned) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut, divide or separate into pieces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce to the degree of thinness required for study with the microscope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) To commit (a person, to a hospital, with or without their consent), as for mental health reasons. So called after various sections of legal acts regarding mental health.",
                  "examples": [
                    "The doctor then sectioned her, making her an involuntary patient, and had her moved to a secure ward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medical): To perform a cesarean section on (someone).",
                  "examples": [
                    "\"But if she's gone into active labour she could be bleeding massively and you may have to section her there and then.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}