{
  "word": "stray",
  "etymologies": [
    {
      "description": [
        "From Middle English stray, strey, from Anglo-Norman estray, stray, Old French estrai, from the verb (see below)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stray (plural strays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any domestic animal that has no enclosure nor proper place and company, but that instead wanders at large or is lost; an estray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is lost, literally or figuratively.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of wandering off or going astray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An area of common land for use by domestic animals generally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio) An instance of atmospheric interference.",
                  "examples": [
                    "This invention relates broadly to radio communication, but more particularly to a radio receiving system used for the reception of high frequency current signals wherever they are subject to interference from \"static\" or strays of an untuned or aperiodic character."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English strayen, partly from Old French estraier, from Vulgar Latin via strata, and partly from Middle English strien, streyen, streyȝen (“to spread, scatter”), from Old English strēġan (“to strew”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "stray (third-person singular simple present strays, present participle straying, simple past and past participle strayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To wander, as from a direct course; to deviate, or go out of the way.",
                  "examples": [
                    "Thames among the wanton valleys strays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To wander from company or outside proper limits; to rove or roam at large; to go astray.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To wander from the path of duty or rectitude; to err.",
                  "examples": [
                    "It was a derby that left Manchester United a long way back in Manchester City’s wing-mirrors and, in the worst moments, straying dangerously close to being their own worst enemy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to stray; lead astray.",
                  "examples": [
                    "To ease myself I was compelled to leave my basket behind me, trusting to return and find it, if I should ever reach safety and discover on what pathless hill I had been strayed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stray, from the noun (see above)."
      ],
      "adjectives": [
        {
          "description": "stray (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having gone astray; strayed; wandering",
                  "examples": [
                    "The alley is full of stray cats rummaging through the garbage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the wrong place; misplaced.",
                  "examples": [
                    "a stray comma",
                    "a stray bullet"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}