{
  "word": "poppy",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English poppy, Middle English popy, popi, popie (“plant of the genus Papaver; poppy seeds used as a spice”) [and other forms], from Old English popiġ (“poppy”), Early Old English popeġ, popaeġ, popæġ, popei [and other forms], perhaps from Late Latin *papavum, popauer, from Latin papāver (“poppy”), possibly from a reduplication of Proto-Indo-European *péh₂wr̥ (“bonfire”).",
        "Sense 3 (“artificial poppy flower to remember those who died in the two World Wars and other armed conflicts”) reflects the efforts of American professor and humanitarian Moina Michael (1869–1944) to popularize the wearing of artificial poppies in remembrance of those who fought and died in World War I; she was inspired by the poem “In Flanders Fields” (1915) by the Canadian poet and soldier John McCrae (1872–1918): see the quotation.",
        "The adjective is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "poppy (comparative more poppy, superlative most poppy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a bright red colour tinted with orange, like that of the common poppy flower (Papaver rhoeas).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "poppy (plural poppies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any plant of the genus Papaver or the family Papaveraceae, with crumpled, often red, petals and a milky juice having narcotic properties; especially the common poppy or corn poppy (Papaver rhoeas) which has orange-red flowers; the flower of such a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bright red colour tinted with orange, like that of the common poppy flower.",
                  "examples": [
                    "poppy:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia, Britain, Canada) A simple artificial poppy flower worn in a buttonhole or displayed in other contexts to remember those who died in the two World Wars and other armed conflicts, especially around Remembrance Day/Remembrance Sunday.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From pop (“loud, sharp sound; fizzy drink; to make or burst with a loud, sharp sound; to stand out”) +‎ -y (suffix forming adjectives with the sense ‘having the quality of’)."
      ],
      "adjectives": [
        {
          "description": "poppy (comparative poppier or more poppy, superlative poppiest or most poppy) (informal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a popping or bursting sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a beverage: resembling soda pop; effervescent, fizzy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of eyes: protruding, sticking out.",
                  "examples": [
                    "Synonym: bulging"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From pop(ular) +‎ -y (suffix forming adjectives with the sense ‘having the quality of’)."
      ],
      "adjectives": [
        {
          "description": "poppy (comparative poppier or more poppy, superlative poppiest or most poppy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Popular.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Typical, or in the style, of pop music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From pop (“affectionate form of father”) +‎ -y (suffix forming terms of endearment)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "poppy (plural poppies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(endearing) One's father or grandfather, or a male authority figure having similar standing.",
                  "examples": [
                    "(father): Synonyms: pappy, pop, poppa, (potentially derogatory) pops",
                    "(grandfather): Synonyms: pappy, pop-pop"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}