{
  "word": "athwart",
  "etymologies": [
    {
      "description": [
        "From Late Middle English athwert, athirt, from a- (prefix meaning ‘in the direction of, toward’) + thwert (“crosswise; (cooking) across the grain”, adverb). Thwert is derived from thwert (“crosswise, transverse; Counter, opposing; contrary, obstinate, stubborn”, adjective), borrowed from Old Norse þvert (“across, athwart”), originally the neuter form of þverr (“across, transverse”), from Proto-Germanic *þwerhaz (“cross; adverse”) (altered or influenced by Proto-Germanic *þweraną (“to stir; to swirl; to turn”)), from Proto-Germanic *þerh-, probably from Proto-Indo-European *terkʷ- (“to spin; to turn”). The English word is analysable as a- (prefix meaning ‘in the direction of, toward’) +‎ thwart (“placed or situated across something else”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "athwart (comparative more athwart, superlative most athwart) (archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From side to side, often in an oblique manner; across or over.",
                  "examples": [
                    "Synonyms: (obsolete) overthwart, transversely",
                    "Above, the stars appeared to move slowly athwart.",
                    "We placed one log on the ground, and another athwart, forming a crude cross."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Across the path of something, so as to impede progress.",
                  "examples": [
                    "a fleet standing athwart our course"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Against the anticipated or appropriate course of something; improperly, perversely, wrongly.",
                  "examples": [
                    "Synonyms: awry, crosswise"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [
        {
          "description": "athwart (archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From one side to the other side of; across.",
                  "examples": [
                    "Synonym: (obsolete) overthwart",
                    "The stars moved slowly athwart the sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Across the course or path of, so as to meet; hence (figuratively), to the attention of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Across the course or path of, so as to oppose.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Across; through.",
                  "examples": []
                },
                {
                  "meaning": "Opposed to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Across the line of a ship's course, or across its deck.",
                  "examples": [
                    "The damaged mainmast fell athwart the deck, destroying the ship’s boat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}