{
  "word": "flirt",
  "etymologies": [
    {
      "description": [
        "1553, from the merger of Early Modern English flirt (“to flick”), flurt (“to mock, jibe, scorn”), and flirt, flurt (“a giddy girl”). Of obscure origin and relation. Apparently related to similar words in Germanic, compare Low German flirt (“a flick of the fingers, a light blow”), Low German flirtje (“a giddy girl”), Low German flirtje (“a flirt”), German Flittchen (“a flirt; tart; hussy”), Norwegian flira (“to giggle, titter”). Perhaps from Middle English gill-flurt (“a flirt”), or an alteration of flird (“a trifling\", also, \"to jibe, jeer at”), from Middle English flerd (“mockery, fraud, deception”), from Old English fleard (“nonsense, vanity, folly, deception”). Compare Scots flird (“to talk idly, flirt, flaunt”), Icelandic flærð (“trickiness, deceit”), Swedish flärd (“vanity, frivolity, flamboyance”). See flird."
      ],
      "adjectives": [
        {
          "description": "flirt (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Flirtatious.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "flirt (plural flirts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden jerk; a quick throw or cast; a darting motion",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who flirts a lot or enjoys flirting; a flirtatious person.",
                  "examples": [
                    "Several young flirts about town had a design to cast us out of the fashionable world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of flirting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tentative or brief, passing engagement with something.",
                  "examples": [
                    "However, after a brief flirt with socialist realism , this method was abandoned and strict controls were removed after 1948. By the early 1950s, writers had earned the right to use any method and to experiment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A brief shower (of rain or snow).",
                  "examples": [
                    "In the course of the month, there were three flirts of snow,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flirt (third-person singular simple present flirts, present participle flirting, simple past and past participle flirted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw (something) with a jerk or sudden movement; to fling. [from 16th c.]",
                  "examples": [
                    "They flirt water in each other's faces.",
                    "to flirt a glove, or a handkerchief"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To jeer at; to mock. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dart about; to move with quick, jerky motions. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To blurt out. [from 17th c.]",
                  "examples": [
                    "Chatterer flirted his tale in the saucy way he has, and his eyes twinkled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play at courtship; to talk with teasing affection, to insinuate sexual attraction in a playful (especially conversational) way. [from 18th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:flirt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To experiment, or tentatively engage, with; to become involved in passing with.",
                  "examples": [
                    "I've thrown away my reputation, self-respect, money, health and happiness through the use of drugs and alcohol; I can teach her how fragile a reputation is, how a fool and their money are soon parted, and how dangerous it is to flirt with drugs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}