{
  "word": "endorsement",
  "etymologies": [
    {
      "description": [
        "endorse +‎ -ment"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "endorsement (countable and uncountable, plural endorsements)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or quality of endorsing",
                  "examples": [
                    "The association announced its endorsement of the policy.",
                    "The bank required that cheque endorsement be witnessed by a cashier.",
                    "Companies sometimes pay millions for product endorsement by celebrities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amendment or annotation to an insurance contract or other official document (such as a driving licence).",
                  "examples": [
                    "Mr. Jones paid extra for the flood damage endorsement on his house insurance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) An instructor's signed acknowledgement of time practising specific flying skills.",
                  "examples": [
                    "Once she obtained the endorsement of her night flying hours, Joanna was approved to take the pilot's examination."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education, certification) Permission to carry out a specific skill or application in a field in which the practitioner already has a general licence.",
                  "examples": [
                    "Wanted: Accredited teacher with Grade 12 mathematics endorsement.",
                    "To transport gasoline, truckers must have a valid licence and the hazardous materials endorsement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sponsorship, in means of money, by a company, business or enterprise.",
                  "examples": [
                    "After the Olympics, he was hoping to get an endorsement deal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Support from an important, renowned figure of a media (celebrity, politics, sports, etc.), to get back up.",
                  "examples": [
                    "I'm not sure whether an endorsement from Donald Trump will help or hurt."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}