{
  "word": "ten",
  "etymologies": [
    {
      "description": [
        "From Middle English ten, tene, from Old English tīen, from Proto-West Germanic *tehun, from Proto-Germanic *tehun, from Proto-Indo-European *déḱm̥.",
        "Cognate with Scots ten, tene (“ten”), West Frisian tsien (“ten”), Saterland Frisian tjoon (“ten”), North Frisian tiin (“ten”), Dutch tien (“ten”), German zehn (“ten”), Norwegian ti (“ten”), Swedish tio (“ten”).",
        "Non-Germanic cognates include Albanian dhjetë, Old Armenian տասն (tasn), Lithuanian dešimt, Old Church Slavonic десѧть (desętĭ), Old Breton dec, Old Irish deich, Ancient Greek δέκα (déka), Sanskrit दश (dásá), Old Persian *𐎭𐎰 (*d-θ /daθa/), Latin decem, Tocharian A śäk.",
        "See also teen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ten (countable and uncountable, plural tens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set or group with ten elements.",
                  "examples": [
                    "We divided the chocolates into tens to hand out to Hallowe'en visitors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) An inexact quantity, typically understood to be between 20 and 100.",
                  "examples": [
                    "Our houses are tens of meters apart, so we don't have to worry about noise from our neighbours.",
                    "tens of thousands of voters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, card games) A card in a given suit with a value of ten.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A denomination of currency, such as a banknote, with a value of ten units.",
                  "examples": [
                    "Synonym: tenner",
                    "Can you give me two tens for this twenty?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, slang) A perfect specimen, (particularly) a physically attractive person.",
                  "examples": [
                    "Synonym: dime piece"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, slang) A high level of intensity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, rowing) The act of rowing ten strokes flat out.",
                  "examples": [
                    "At the 1,000-metres post we gave a ten, which raised our lead to 1⅔ lengths; the Belgians were rowing hard, but one felt that they still had plenty of spurting power."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}