{
  "word": "hut",
  "etymologies": [
    {
      "description": [
        "From Middle English *hutte, hotte, borrowed from Old French hutte, hute (“cottage”), from Old High German hutta (“hut, cottage”), from Proto-Germanic *hudjǭ, *hudjō (“hut”), from Proto-Indo-European *(s)kewt- (“to deck; cover; covering; skin”).",
        "Cognate with German Hütte (“hut”), Dutch hut (“hut”), West Frisian hutte (“hut”), Saterland Frisian Hutte (“hut”), Danish hytte (“hut”), Norwegian Bokmål hytte (“hut”), Swedish hydda (“hut”). Related to hide."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hut (plural huts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, simple one-storey dwelling or shelter, often with just one room, and generally built of readily available local materials.",
                  "examples": [
                    "a thatched hut; a mud hut; a shepherd’s hut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small wooden shed.",
                  "examples": [
                    "a groundsman’s hut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, obsolete) A small stack of grain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hut (third-person singular simple present huts, present participle hutting, simple past and past participle hutted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To provide (someone) with shelter in a hut.",
                  "examples": [
                    "to hut troops in winter quarters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To take shelter in a hut.",
                  "examples": [
                    "Seven boatfuls of Dutch prisoners have been taken to Chelsea College, where they are to hut under the walls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, obsolete, transitive) To stack (sheaves of grain).",
                  "examples": [
                    "The method of endeavouring to save corn in bad harvests, by hutting it in the field, is often practised in the north and west of Scotland,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A short, sharp sound of command. Compare hey, hup, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}