{
  "word": "rescript",
  "etymologies": [
    {
      "description": [
        "From Latin rescriptum (“written reply”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rescript (plural rescripts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical law) A clarification of a point of law by a monarch issued upon formal consultation by a lower magistrate.",
                  "examples": [
                    "\"'In order that the people may know of my decision, I request you to prepare at once an imperial rescript that I may broadcast to the nation.'\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(canon law) An ad hoc reply of a pope to some specific question of canon law or morality, without precedential force, sometimes (improper) inclusive of decretals which serve as precedents in canon law.",
                  "examples": [
                    "Decretals... ought, properly speaking, to be distinguished, on the one hand from constitutions... enacted by the Pope sua sponte without reference to any particular case, and on the other hand from rescripts... which apply only to special circumstances or individuals, and constitute no general precedent. But this nomenclature is not strictly observed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A duplicate copy of a legal document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rewriting, a document copied or written again.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rescript (third-person singular simple present rescripts, present participle rescripting, simple past and past participle rescripted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To script again or anew.",
                  "examples": [
                    "We're rescripting some popular British TV shows for an American audience."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}