{
  "word": "calumny",
  "etymologies": [
    {
      "description": [
        "From Late Middle English calumnīe (“false accusation, slander; (law) objection raised in bad faith”), borrowed from Old French calomnie (“slander, calumny”) (modern French calomnie), or directly from its etymon Latin calumnia (“false statement, misrepresentation; false accusation, malicious charge”), perhaps related to calvor (“to deceive”), ultimately from Proto-Indo-European *ḱelh₁- or *ḱh₂l-. The English word is a doublet of challenge.",
        "The verb is derived from French calomnier (“to slander”), from Late Latin calumniāre, from Latin calumpniārī, calumniārī, present active infinitive of calumnior (“to blame unjustly, misrepresent, calumniate; (law) to accuse falsely, bring false information against”), from calumnia (see above) + -or."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "calumny (countable and uncountable, plural calumnies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A false accusation or charge brought to tarnish another's reputation or standing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Falsifications or misrepresentations intended to disparage or discredit another.",
                  "examples": [
                    "Synonyms: calumniousness, defamation, obloquy, traducement, vilification; see also Thesaurus:slander",
                    "Accusations of abuse were pure extortive calumny in a malicious bid to make money."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "calumny (third-person singular simple present calumnies, present participle calumnying, simple past and past participle calumnied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, formal) To make false accusations or levy false charges against a person with the intent to tarnish that person's reputation or standing; to calumniate.",
                  "examples": [
                    "Synonyms: see Thesaurus:defame"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}