{
  "word": "case",
  "etymologies": [
    {
      "description": [
        "From Middle English cas, from Old French cas (“an event”), from Latin cāsus (“a falling, a fall; accident, event, occurrence; occasion, opportunity; noun case”), perfect passive participle of cadō (“to fall, to drop”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "case (plural cases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An actual event, situation, or fact.",
                  "examples": [
                    "For a change, in this case, he was telling the truth.",
                    "It is not the case that every unfamiliar phrase is an idiom.",
                    "In case of fire, break glass. [sign on fire extinguisher holder in public space]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A given condition or state.",
                  "examples": [
                    "Mares which are over-fat, hold with much difficulty; whereas those that are but in good case and plump, conceive with the greatest readiness and ease."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of work, specifically defined within a profession.",
                  "examples": [
                    "It was one of the detective's easiest cases.  Social workers should work on a maximum of forty active cases.  The doctor told us of an interesting case he had treated that morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(academia) An instance or event as a topic of study.",
                  "examples": [
                    "The teaching consists of theory lessons and case studies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A legal proceeding, lawsuit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A specific inflection of a word (particularly a noun, pronoun, or adjective) depending on its function in the sentence.",
                  "examples": [
                    "The accusative case canonically indicates a direct object.  Latin has six cases, and remnants of a seventh."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar, uncountable) Grammatical cases and their meanings taken either as a topic in general or within a specific language.",
                  "examples": [
                    "Jane has been studying case in Caucasian languages.  Latin is a language that employs case."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An instance of a specific condition or set of symptoms.",
                  "examples": [
                    "There were another five cases reported overnight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) A section of code representing one of the actions of a conditional switch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "case (third-person singular simple present cases, present participle casing, simple past and past participle cased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) to propose hypothetical cases",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English case, from Old Northern French casse, (compare Old French chasse (“box, chest, case”)), from Latin capsa (“box, bookcase”), from capiō (“to take, seize, hold”). Doublet of cash. Compare Spanish caja, Asturian caxa."
      ],
      "adjectives": [
        {
          "description": "case (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) The last remaining card of a particular rank.",
                  "examples": [
                    "He drew the case eight!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "case (plural cases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A box that contains or can contain a number of identical items of manufacture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A box, sheath, or covering generally.",
                  "examples": [
                    "a case for spectacles; the case of a watch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of luggage that can be used to transport an apparatus such as a sewing machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosing frame or casing.",
                  "examples": [
                    "a door case; a window case"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A suitcase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of furniture, constructed partially of transparent glass or plastic, within which items can be displayed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The outer covering or framework of a piece of apparatus such as a computer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A shallow tray divided into compartments or \"boxes\" for holding type, traditionally arranged in sets of two, the \"upper case\" (containing capitals, small capitals, accented) and \"lower case\" (small letters, figures, punctuation marks, quadrats, and spaces).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, by extension) The nature of a piece of alphabetic type, whether a “capital” (upper case) or “small” (lower case) letter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) Four of a kind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A unit of liquid measure used to measure sales in the beverage industry, equivalent to 192 fluid ounces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A small fissure which admits water into the workings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin layer of harder metal on the surface of an object whose deeper metal is allowed to remain soft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cardboard box that holds (usually 24) beer bottles or cans.",
                  "examples": [
                    "Synonym: carton",
                    "a single case of Bud Light"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A counterfeit crown (five-shilling coin).",
                  "examples": [
                    "The price of a case (five shillings piece bad) from the smasher is about one shilling; an alderman (two and sixpence) about sixpence; a peg (shilling) about threepence; a downer or sprat (sixpence) about twopence."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "case (third-person singular simple present cases, present participle casing, simple past and past participle cased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place (an item or items of manufacture) into a box, as in preparation for shipment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or protect with, or as if with, a case; to enclose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To survey (a building or other location) surreptitiously, as in preparation for a robbery.",
                  "examples": [
                    "Bonnie worked as a daycare director. She helped case the FBI office by posing as a college student interested in becoming an FBI agent."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}