{
  "word": "manual",
  "etymologies": [
    {
      "description": [
        "From Middle English manuel, from Old French manuel, from Late Latin manuāle (“handbook, manual”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "manual (plural manuals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A handbook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A booklet that instructs on the usage of a particular machine or product.",
                  "examples": [
                    "The dishwasher isn't working; can you remember where we put the manual?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A drill in the use of weapons, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, historical) An old office-book like the modern Roman Catholic ritual.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English manuel, from Anglo-Norman manuel, Old French manual, from Latin manuālis, from manus (“hand”)."
      ],
      "adjectives": [
        {
          "description": "manual (comparative more manual, superlative most manual)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an activity) Performed with the hands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a machine, device etc.) Operated by means of the hands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Performed by a human rather than a machine.",
                  "examples": [
                    "The teacher urged the students to do a manual check, because some errors aren't picked up by the spell checker."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "manual (countable and uncountable, plural manuals)",
          "definitionGroups": [
            {
              "group": "(countable) A device that is operated using the hands, or by a human rather than a machine.",
              "entries": [
                {
                  "meaning": "(automotive) A manual transmission; a gearbox, especially of a motorized vehicle, shifted by the operator.",
                  "examples": []
                },
                {
                  "meaning": "(by synecdoche) A vehicle with a manual transmission.",
                  "examples": [
                    "I'm not used to automatics; I've always driven manuals."
                  ]
                },
                {
                  "meaning": "(music) A keyboard for the hands on a harpsichord, organ, or other musical instrument.",
                  "examples": []
                },
                {
                  "meaning": "A manual typewriter (as contrasted with an electronic one).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) A procedure or operation that is done using the hands, or by a human rather than machine.",
              "entries": [
                {
                  "meaning": "(medicine, colloquial) Manual measurement of the blood pressure, done with a manual sphygmomanometer.",
                  "examples": [
                    "do a manual",
                    "give someone a quick manual"
                  ]
                },
                {
                  "meaning": "A bicycle technique whereby the front wheel is held aloft by the rider, without the use of pedal force.",
                  "examples": []
                },
                {
                  "meaning": "A similar maneuver on a skateboard, lifting the front or back wheels while keeping the tail or nose of the board from touching the ground.",
                  "examples": [
                    "In short tutorials, the player learns the basics of skating: reverts, manuals and the ollie  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Manual control or operation.",
                  "examples": [
                    "Put the controls to manual.",
                    "Leave the system on manual."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}