{
  "word": "happy",
  "etymologies": [
    {
      "description": [
        "From Middle English happy (“fortunate, happy”), perhaps an alteration of Middle English happyn, happen (“fortunate, happy”), possibly related to or from Old Norse heppinn (“fortunate, happy”); and potentially assimilated to be equivalent to hap (“chance, luck, fortune”) +‎ -y. Compare also Icelandic heppinn (“lucky”), Norwegian Nynorsk heppen (“lucky”), Scots happin (“fortunate, blessed”). See further at hap."
      ],
      "adjectives": [
        {
          "description": "happy (comparative happier or more happy, superlative happiest or most happy)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a feeling arising from a consciousness of well-being or of enjoyment; enjoying good of any kind, such as comfort, peace, or tranquillity; blissful, contented, joyous.",
                  "examples": [
                    "Music makes me feel happy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Experiencing the effect of favourable fortune; favored by fortune or luck; fortunate, lucky, propitious.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Content, willing, satisfied (with or to do something); having no objection (to something).",
                  "examples": [
                    "Are you happy to pay me back by the end of the week?",
                    "Yes, I am happy with the decision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Of acts, speech, etc.) Appropriate, apt, felicitous.",
                  "examples": [
                    "a happy coincidence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in combination) Favoring or inclined to use.",
                  "examples": [
                    "slaphappy, trigger-happy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, of people, often followed by \"at\" or \"in\") Dexterous, ready, skilful.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Implying 'May you have a happy ~' or similar; used in phrases to wish someone happiness or good fortune at the time of a festival, celebration, or other event or activity.",
                  "examples": [
                    "Happy birthday!, Happy Fourth of July!, Happy anniversary!, Happy job-hunting!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "happy (plural happies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, rare) A happy event, thing, person, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "happy (third-person singular simple present happies, present participle happying, simple past and past participle happied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) Often followed by up: to become happy; to brighten up, to cheer up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) Often followed by up: to make happy; to brighten, to cheer, to enliven.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}