{
  "word": "chest",
  "etymologies": [
    {
      "description": [
        "From Middle English cheste, chiste, from Old English ċest, ċist (“chest, casket; coffin; rush basket; box”), from Proto-West Germanic *kistu (“chest, box”), from Latin cista (“chest, box”), from Ancient Greek κίστη (kístē, “chest, box, basket, hamper”), from Proto-Indo-European *kisteh₂ (“woven container”).",
        "Germanic cognates include Scots kist (“chest, box, trunk, coffer”), West Frisian kiste (“box, chest”), Dutch kist (“box, case, chest, coffin”), German Kiste (“box, crate, case, chest”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chest (plural chests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A box, now usually a large strong box with a secure convex lid.",
                  "examples": [
                    "The clothes are kept in a chest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A coffin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place in which public money is kept; a treasury.",
                  "examples": [
                    "You can take the money from the chest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chest of drawers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The portion of the front of the human body from the base of the neck to the top of the abdomen; the thorax. Also the analogous area in other animals.",
                  "examples": [
                    "She had a sudden pain in her chest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hit or blow made with one's chest.",
                  "examples": [
                    "He scored with a chest into the goal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chest (third-person singular simple present chests, present participle chesting, simple past and past participle chested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hit with one's chest (front of one's body)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deposit in a chest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To place in a coffin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English chest, cheste, cheeste, cheaste, from Old English ċēast, ċēas (“strife, quarrel, quarrelling, contention, murmuring, sedition, scandal; reproof”). Related to Old Frisian kāse (“strife, contention”), Old Saxon caest (“quarrel, dispute”), Old High German kōsa (“speech, story, account”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chest (plural chests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Debate; quarrel; strife; enmity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}