{
  "word": "omnibus",
  "etymologies": [
    {
      "description": [
        "From French omnibus, from Latin omnibus (“to/for all”), dative plural of omnis (“all”), from Proto-Indo-European *h₃ep-ni- (“working”), from *h₃ep- (“to work; to possess”) or *h₁op- (“to work; to take”)."
      ],
      "adjectives": [
        {
          "description": "omnibus (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Containing multiple items.",
                  "examples": [
                    "The legislature enacted an omnibus appropriations bill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a transportation service, calling at every station, as opposed to express; local.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "omnibus (plural omnibuses or omnibusses or omnibi) (the last form is nonstandard)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A vehicle set up to carry many people (now usually called a bus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An anthology of previously released material linked together by theme or author, especially in book form.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broadcast programme consisting of all of the episodes of a serial that have been shown in the previous week.",
                  "examples": [
                    "The omnibus edition of The Archers is broadcast every Sunday morning at 11.00."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) A stamp issue, usually commemorative, that appears simultaneously in several countries as a joint issue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "omnibus (third-person singular simple present omnibuses or omnibusses, present participle omnibusing or omnibussing, simple past and past participle omnibused or omnibussed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To combine (legislative bills, etc.) into a single package.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To drive an omnibus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To travel or be transported by omnibus.",
                  "examples": [
                    "[John] Virtue has often sung his ode to pollution; the artist's friend. Whether to embrace or reject the begrimed air, the half-choked light has historically sorted out the men from the boys in London painters.  […]  Claude Monet was in two minds about it, cursing it from his room in the Savoy in 1899 for blotting out the fugitive sun. Yet by far the strongest of his paintings – completed in a studio a long, long way from the Thames – were the greeny-grey early-morning images of crowds tramping and omnibussing their way to work over hostile bridges, unblessed by even a hint of watery sunshine."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}