{
  "word": "gossip",
  "etymologies": [
    {
      "description": [
        "From Middle English godsybbe, godsib (“a close friend or relation, a confidant; a godparent”), from Old English godsibb (“godparent, sponsor”), equivalent to god +‎ sib. Doublet of godsib."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gossip (countable and uncountable, plural gossips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Someone who likes to talk about other people's private or personal business.",
                  "examples": [
                    "Synonyms: busybody, gossipmonger, meddler, rumormonger; see also Thesaurus:gossiper",
                    "Be careful what you say to him: he’s a bit of a gossip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Idle talk about someone’s private or personal matters, especially someone not present.",
                  "examples": [
                    "Synonyms: dirt, hearsay, rumor, scandal, scuttlebutt; see also Thesaurus:rumor",
                    "According to the latest gossip, their relationship is on the rocks.",
                    "I have a juicy piece of gossip to share with you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Idle conversation in general.",
                  "examples": [
                    "Synonyms: chat, chinwag, chit-chat, natter; see also Thesaurus:chatter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A genre in contemporary media, usually focused on the personal affairs of celebrities.",
                  "examples": [
                    "a gossip columnist",
                    "a gossip blog"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now only historical) A sponsor; a godfather or godmother; the godparent of a child.",
                  "examples": [
                    "Synonyms: sponsor, godsib",
                    "Hyponyms: godfather, godmother"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A familiar acquaintance.",
                  "examples": [
                    "Synonym: friend"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Title used with the name of one's child's godparent or of a friend.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gossip (third-person singular simple present gossips, present participle gossiping or gossipping, simple past and past participle gossiped or gossipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk about someone else's private or personal business, especially in a manner that spreads the information.",
                  "examples": [
                    "Synonyms: blab, dish the dirt, spill the tea, talk out of turn, tell tales out of school"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To talk idly.",
                  "examples": [
                    "Synonyms: chat, chatter, chew the fat, chinwag, natter, prattle, shoot the breeze"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To stand godfather to; to provide godparents for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To enjoy oneself during festivities, to make merry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}