{
  "word": "prebendal",
  "etymologies": [
    {
      "description": [
        "From Latin praebenda (“the support or allowance afforded by the state to a private person”)."
      ],
      "adjectives": [
        {
          "description": "prebendal (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to a prebend; prebendary.",
                  "examples": [
                    "Thus prebendal parishes were formed, with the canon prebendary as rector, employing his junior clerics as vicars either to serve his place in the collegiate church or to serve the parish if he preferred to reside in the college.  […]  Administrators tend to multiply and procedures to become more complex, and there were certainly large numbers of well-educated men, Oxford graduates, within Lacy's employ, who were paid, at least partly, by convenient prebendal incomes from colleges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an office) Having an associated prebend.",
                  "examples": [
                    "His father had held a prebendal stall at Ely in times when prebendal stalls were worth more than they are at present, and having also been possessed of a living in the neighbourhood, had amassed a considerable sum of money."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to an honorary religious title granted by the state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to official positions that are profitable for the incumbent, to the allocation of such positions, or to a system in which such allocation is prevalent.",
                  "examples": [
                    "Similar phenomena, which promote a guild-like closure of officialdom, are typically found in the patrimonial and, particularly, in prebendal officialdom of the past."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Relating to political patronage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}