{
  "word": "pulp",
  "etymologies": [
    {
      "description": [
        "From Middle English pulpe, from Latin pulpa."
      ],
      "adjectives": [
        {
          "description": "pulp (comparative more pulp, superlative most pulp)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fiction) Of or pertaining to pulp magazines; in the style of a pulp magazine or the material printed within such a publication.",
                  "examples": [
                    "The Nightwing annual had what felt like a very 'pulp-ish' plot, and the Superman annual was great, with a very pulp plot and a incredible Doc Savage tribute cover."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pulp (usually uncountable, plural pulps)",
          "definitionGroups": [
            {
              "group": "A soft, moist, shapeless mass or matter.",
              "entries": [
                {
                  "meaning": "A mixture of wood, cellulose and/or rags and water ground up to make paper.",
                  "examples": []
                },
                {
                  "meaning": "A mass of chemically processed wood fibres (cellulose).",
                  "examples": []
                },
                {
                  "meaning": "A suspension of mineral particles, typically achieved by some form of agitation.",
                  "examples": []
                },
                {
                  "meaning": "The soft center of a fruit.",
                  "examples": [
                    "Synonym: fruitflesh"
                  ]
                },
                {
                  "meaning": "The soft center of a tooth.",
                  "examples": []
                },
                {
                  "meaning": "The underside of a human fingertip; a finger pad.",
                  "examples": []
                },
                {
                  "meaning": "The very soft tissue in the spleen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A magazine or book containing lurid subject matter and characteristically printed on rough, unfinished paper.",
                  "examples": [
                    "The hard-hitting, action packed, thud and blunder adventure fantasy was a commodity during that somber decade: Americans paid money to forget their troubles, and the pulps were willing to sell."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pulp (third-person singular simple present pulps, present participle pulping, simple past and past participle pulped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make or be made into pulp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To beat to a pulp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deprive of pulp; to separate the pulp from.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}