{
  "word": "virtue",
  "etymologies": [
    {
      "description": [
        "From Middle English vertu, virtue, borrowed from Anglo-Norman vertu, virtu, from Latin virtus (“manliness, bravery, worth, moral excellence”), from vir (“man”). Doublet of vertu. See virile. In this sense, displaced Old English cræft, whence Modern English craft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "virtue (countable and uncountable, plural virtues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Accordance with moral principles; conformity of behaviour or thought with the strictures of morality; good moral conduct. [from 13th c.]",
                  "examples": [
                    "Without virtue, there is no freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular manifestation of moral excellence in a person; an admirable quality. [from 13th c.]",
                  "examples": [
                    "Some men are modest, and seem to take pains to hide their virtues; and, from a natural distance and reserve in their tempers, scarce suffer their good qualities to be known  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, each of several qualities held to be particularly important, including the four cardinal virtues, the three theological virtues, or the seven virtues opposed to the seven deadly sins. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inherently advantageous or excellent quality of something or someone; a favourable point, an advantage. [from 14th c.]",
                  "examples": [
                    "One virtue of the present coalition government's attack on access to education could be to reopen the questions raised so pertinently by Robinson in the 1960s  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A creature embodying divine power, specifically one of the orders of heavenly beings, traditionally ranked above angels and below archangels. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Specifically, moral conduct in sexual behaviour, especially of women; chastity. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The inherent power of a god, or other supernatural being. [13th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The inherent power or efficacy of something (now only in phrases). [from 13th c.]",
                  "examples": [
                    "many Egyptians still worry that the Brotherhood, by virtue of discipline and experience, would hold an unfair advantage if elections were held too soon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}