{
  "word": "ylem",
  "etymologies": [
    {
      "description": [
        "Resuscitation of Middle English ylem, from Medieval Latin hȳlem, accusative of hȳlē (“matter, the fundamental matter of all things; the matter of the body”) (whence English hyle), a transliteration of Ancient Greek ὕλη (húlē, “wood; material, substance; matter”). The concept of “fundamental matter” – Ancient Greek πρώτη ὕλη (prṓtē húlē) – was propounded by the Greek philosopher Aristotle (384–322 B.C.E.).",
        "The term ylem was first used in modern English in the paper “The Origin of Chemical Elements”, coauthored by Russian-American theoretical physicist and cosmologist George Gamow (1904–1968), American cosmologist Ralph Asher Alpher (1921–2007) and German-American nuclear physicist Hans Bethe (1906–2005), published 1 April 1948 in Physical Review. Alpher claimed to have found the word “in a large dictionary”, perhaps Webster’s New International Dictionary (2nd ed., 1934), which he referred to in a second 1948 paper (cited below). In a 1968 interview, Gamow also associated ylem with a Hebrew word he did not name; it remains unclear which word he was referring to.",
        "The word ylem reappeared in popular books on science following the discovery in 1964–1965 of the cosmic microwave background, which had been predicted in 1948 by Alpher and Robert Herman (1914–1997), and again after the publication of images of the radiation composed from measurements by two satellites, the Cosmic Background Explorer (COBE) in 1992 and the Wilkinson Microwave Anisotropy Probe (WMAP) in 2003."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ylem (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, cosmology, physics, now chiefly historical) In the Big Bang theory, the hot and dense plasma which made up the cosmos at the time of recombination in an early stage of its expansion and cooling, when the first atoms formed and photons decoupled. The ylem is regarded as the source of the cosmic microwave background. [from 1948.]",
                  "examples": [
                    "Let us now consider the state of matter during the first minutes of the expansion process, when the temperature of the universe was many billions of degrees high.  […]  [T]he state of matter must be visualized as a hot gas formed entirely by nuclear particles; that is, protons, neutrons, and electrons.  […]  We will call this primordial mixture of nuclear particles \"Ylem,\" [footnote: Pronounced: ī′lěm] reviving an obsolete noun which, according to Webster's Dictionary, means \"the first substance from which the elements were supposed to be formed.\" Next we can ask what happened to the Ylem when its density and temperature began to drop as the result of the rapid expansion taking place in the young universe."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}