{
  "word": "overset",
  "etymologies": [
    {
      "description": [
        "From Middle English oversetten (“to set over, upset”), from Old English ofersettan (“to set over, install, conquer, overcome”), from Proto-West Germanic *ubarsattjan (“to set or place over, install, establish”), equivalent to over- +‎ set. Compare Saterland Frisian uursätte (“to cross over, translate”), West Frisian oersette (“to translate”), Dutch overzetten (“to ferry, transport, translate”), German übersetzen (“to cross over, translate”), Swedish översätta (“to translate”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "overset (third-person singular simple present oversets, present participle oversetting, simple past and past participle overset)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To set over (something); to cover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To turn, or to be turned, over; to be upset; to capsize.",
                  "examples": [
                    "[…]  the barge was hoisted out for the preservation of the admiral, who entered it accordingly; but all distinction of persons being now abolished, the seamen rushed into it in such crowds, that in a few moments it overset."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To knock over, capsize, overturn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To overwhelm; to overthrow, defeat.",
                  "examples": [
                    "There is also the wilfully ignorant professor, or him that is afraid to know more, for fear of the cross; he is for picking and chusing of truth, and loveth not to hazzard his all for that worthy name by which he would be called: when he is at any time overset by arguments, or awaknings of conscience, he uses to heal all, by, I was not brought up in this faith  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To physically disturb (someone); to make nauseous, upset.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To unbalance (a situation, state etc.); to confuse, to put into disarray.",
                  "examples": [
                    "Amidst the calm produced by the treaty an event took place which had nearly overset the whole negotiation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) to set (type or copy) in excess of what is needed; to set too much type for a given space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To translate.",
                  "examples": [
                    "Overset into English, after the spirits and measures of the authentical; by Dr. Heinrich Krauss, Ph.D., and so wider."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To overfill.",
                  "examples": [
                    "[Tobacco] is a good companion to one that converseth with dead men, for if one hath been poring long upon a book, or is toiled with the pen and stupefied with study, it quickeneth him, and dispels those clouds that usually overset the brain."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}