{
  "word": "bruise",
  "etymologies": [
    {
      "description": [
        "From Middle English bruisen, brusen, brosen, brisen, bresen, from a merger two words, both ultimately from Proto-Indo-European *bʰrews- (“to break”):",
        "Cognate with Scots brizz, German brausen (“to roar; boom; pound”), Old English brosnian (“to crumble, fall apart”), Dutch broos (“brittle”), German Brosame (“crumb”), dialectal Norwegian brøysk (“breakable”), Latin frustum (“bit, scrap”), Old Church Slavonic бръснути (brŭsnuti, “to rake”), Albanian breshër (“hail”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bruise (plural bruises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A purplish mark on the skin due to leakage of blood from capillaries under the surface that have been damaged by a blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dark mark on fruit or vegetables caused by a blow to the surface.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bruise (third-person singular simple present bruises, present participle bruising, simple past and past participle bruised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike (a person), originally with something flat or heavy, but now specifically in such a way as to discolour the skin without breaking it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To damage the skin of (fruit or vegetables), in an analogous way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of fruit or vegetables, to gain bruises through being handled roughly.",
                  "examples": [
                    "Bananas bruise easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become bruised.",
                  "examples": [
                    "I bruise easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fight with the fists; to box.",
                  "examples": [
                    "Bruising was considered a fine, manly, old English custom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To harm or injure.",
                  "examples": [
                    "Her thoughtless remarks bruised my ego."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To impair (gin) by shaking rather than stirring.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}