{
  "word": "pollard",
  "etymologies": [
    {
      "description": [
        "From poll (“head, scalp”) +‎ -ard. The coin sense derives from the original penny's uncrowned obverse bust, as opposed to the laurel-wreathed form appearing on the rosary. The verb derives from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pollard (plural pollards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often attributive) A pruned tree; the wood of such trees.",
                  "examples": [
                    "Only a little pollard hedge kept us from their blood-shot eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A buck deer that has shed its antlers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hornless variety of domestic animal, as cattle or goats.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A European chub (Squalius cephalus, syn. Leuciscus cephalus), a kind of fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now Australia) A fine grade of bran including some flour. The fine cell layer between bran layers and endosperm, used for animal feed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(numismatics, historical) A 13th-century European coin minted as a debased counterfeit of the sterling silver penny of Edward I of England, at first legally accepted as a halfpenny and then outlawed.",
                  "examples": [
                    "Coordinate terms: crockard, rosary, mitre, leonine, scalding, steeping, eagle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pollard (third-person singular simple present pollards, present participle pollarding, simple past and past participle pollarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) To prune a tree heavily, cutting branches back to the trunk, so that it produces dense new growth.",
                  "examples": [
                    "I didn't know one could pollard elms. I thought one only pollarded willows."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}