{
  "word": "toque",
  "etymologies": [
    {
      "description": [
        "From Middle French toque (“toque”), from Arabic طَاقِيَّة‎ (ṭāqiyya)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toque (plural toques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of hat with no brim.",
                  "examples": [
                    "\"Because Esmé said she was going out this afternoon to choose a new toque, and she hoped I should like it, and I’m not quite sure what it is, or where she'll wear it. Do you mind explaining?\"",
                    "\"Not at all. A toque is that which if it had strings would be a bonnet, and if it had brim, would be a hat. It is worn on the head.\"",
                    "\"Thanks, now I know where I am,\" said the vicar of St. Machars, with a sigh of relief."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) A tall white hat with no brim of the sort worn by chefs",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, informal) A chef.",
                  "examples": [
                    "Sam Mason first grabbed the spotlight as the pastry chef ... for being the most rock 'n' roll toque in town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variety of bonnet monkey; toque macaque, Macaca sinica.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An African nominal money of account, equal to 40 cowries.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "1871. Assimilated from Canadian French tuque. Likely to be a hypercorrection from the time that toque was already in the dictionaries when they did not yet list tuque as a kind of hat. The French word tuque for hat is itself not strictly a deformation of French toque: it is also related to other meanings of tuque and to its former name bonnet à la turque (lit. Turkish-style bunnet/cap)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toque (plural toques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A knitted hat, usually conical but of varying shape, often woollen, and sometimes topped by a pom-pom or tassel.",
                  "examples": [
                    "Such is the demented nature of the universe that I was too weak to properly respond to my being hit on by carloads of Betties and Veronicas—all except for the cheeky Cheryl Anderson who gave me ‘manual release’ the day I lost my eye-brows, followed by a flood of tears and the snapping of Polaroids in which I wear a knit toque. Gush gush."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Spanish toque."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "toque (countable and uncountable, plural toques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A rhythm used in Latin music, especially Cuban religious rituals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The guitar part of flamenco music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}