{
  "word": "column",
  "etymologies": [
    {
      "description": [
        "From Middle English columne, columpne, columpe, borrowed from Old French columne, from Latin columna (“a column, pillar, post”), originally a collateral form of columen, contraction culmen (“a pillar, top, crown, summit”). Akin to Latin collis (“a hill”), celsus (“high”), probably to Ancient Greek κολοφών (kolophṓn, “top, summit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "column (plural columns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A solid upright structure designed usually to support a larger structure above it, such as a roof or horizontal beam, but sometimes for decoration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vertical line of entries in a table, usually read from top to bottom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A body of troops or army vehicles, usually strung out along a road.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A body of text meant to be read line by line, especially in printed material that has multiple adjacent such on a single page.",
                  "examples": [
                    "It was too hard to read the text across the whole page, so I split it into two columns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of width, especially of advertisements, in a periodical, equivalent to the width of a usual column of text.",
                  "examples": [
                    "Each column inch costs $300 a week; this ad is four columns by three inches, so will run $3600 a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A recurring feature in a periodical, especially an opinion piece, especially by a single author or small rotating group of authors, or on a single theme.",
                  "examples": [
                    "His initial foray into print media was as the author of a weekly column in his elementary-school newspaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something having similar vertical form or structure to the things mentioned above, such as a spinal column.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The gynostemium",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) An object used to separate the different components of a liquid or to purify chemical compounds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}