{
  "word": "cycle",
  "etymologies": [
    {
      "description": [
        "From Middle English cicle (“fixed length period of years”), from Late Latin cyclus, from Ancient Greek κύκλος (kúklos, “circle”), from Proto-Hellenic *kúklos, *kʷókʷlos, from Proto-Indo-European *kʷékʷlos (“circle, wheel”).",
        "Doublet of wheel; see there for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cycle (plural cycles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An interval of space or time in which one set of events or phenomena is completed.",
                  "examples": [
                    "the cycle of the seasons, or of the year"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complete rotation of anything.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A process that returns to its beginning and then repeats itself in the same sequence.",
                  "examples": [
                    "electoral cycle    menstrual cycle    news cycle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The members of the sequence formed by such a process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In musical set theory, an interval cycle is the set of pitch classes resulting from repeatedly applying the same interval class to the starting pitch class.",
                  "examples": [
                    "The interval cycle C4 consists of the pitch classes 0, 4 and 8; when starting on E, it is realised as the pitches E, G# and C."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series of poems, songs or other works of art, typically longer than a trilogy.",
                  "examples": [
                    "The \"Ring of the Nibelung\" is a cycle of four operas by Richard Wagner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A programme on a washing machine, dishwasher, or other such device.",
                  "examples": [
                    "Put the washing in on a warm cycle.",
                    "the spin cycle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pedal-powered vehicle, such as a unicycle, bicycle, or tricycle, or a motorized vehicle that has either two or three wheels.",
                  "examples": [
                    "Hyponyms: motorbike, motorcycle, unicycle, bicycle, tricycle, motortrike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A single, a double, a triple, and a home run hit by the same player in the same game.",
                  "examples": [
                    "Jones hit for the cycle in the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A closed walk or path, with or without repeated vertices allowed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology, algebraic topology) A chain whose boundary is zero.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An imaginary circle or orbit in the heavens; one of the celestial spheres.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An age; a long period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An orderly list for a given time; a calendar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) One entire round in a circle or a spire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A discharge of a taser.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) One take-off and landing of an aircraft, referring to a pressurisation cycle which places stresses on the fuselage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A scheduled period of time of weeks or months wherein a performance-enhancing substance or, by extension, supplement is applied, to be followed by another one where it is not or the dosage is lower.",
                  "examples": [
                    "The deterioration of his physique may be a result of his being off cycle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cycle (third-person singular simple present cycles, present participle cycling, simple past and past participle cycled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ride a bicycle or other cycle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go through a cycle or to put through a cycle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) To turn power off and back on",
                  "examples": [
                    "Avoid cycling the device unnecessarily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) To maintain a team's possession of the puck in the offensive zone by handling and passing the puck in a loop from the boards near the goal up the side boards and passing to back to the boards near the goal",
                  "examples": [
                    "They have their cycling game going tonight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}