{
  "word": "pearl",
  "etymologies": [
    {
      "description": [
        "From Middle English perle, from Old French perle of uncertain etymology. Probably via unattested Medieval Latin *pernula, from Latin perna (“haunch; a marine bivalve shaped like a leg of lamb”) but also derived from Medieval Latin perla, from Latin perula (“little bag”). Its typographic use follows the name given by Jean Jannon to the type used in his miniature editions of Vergil, Horace, & the New Testament in the 1620s, which were the smallest printed works to his time. Its surfing use derives from the supposed resemblance to pearl diving."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pearl (countable and uncountable, plural pearls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shelly concretion, usually rounded, and having a brilliant luster, with varying tints, found in the mantle, or between the mantle and shell, of certain bivalve mollusks, especially in the pearl oysters and river mussels, and sometimes in certain univalves. It is usually due to a secretion of shelly substance around some irritating foreign particle. Its substance is the same as nacre, or mother-of-pearl. Round lustrous pearls are used in jewellery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something precious.",
                  "examples": [
                    "Hugh helped himself to bacon. \"My dear fellow, she can think what she likes so long as she continues to grill bacon like this. Your wife is a treasure, James—a pearl amongst women; and you can tell her so with my love.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A capsule of gelatin or similar substance containing liquid for e.g. medicinal application.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nacre, or mother-of-pearl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whitish speck or film on the eye.",
                  "examples": [
                    "Boast not of your eyes; it is feared you have Balaam's disease, a pearl in your eye, Mammon's prestriction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish allied to the turbot; the brill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light-colored tern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the circle of tubercles which form the bur on a deer's antler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, typography, printing, dated) The size of type between diamond and agate, standardized as 5-point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fringe or border.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A jewel or gem.",
                  "examples": [
                    "There is gold, and multitude of pearles: but a precious vessel the lips of knowledge."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A valuable little nugget of information; especially, an aphorism or tip that is operationally useful for decision-making.",
                  "examples": [
                    "Hyponym: pearl of wisdom",
                    "clinical pearls"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, vulgar, slang) The clitoris.",
                  "examples": [
                    "My mouth and tongue finally find her pearl. Her clitoris."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pearl (third-person singular simple present pearls, present participle pearling, simple past and past participle pearled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes figurative) To set or adorn with pearls, or with mother-of-pearl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to resemble pearls in shape; to make into small round grains.",
                  "examples": [
                    "to pearl barley"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to resemble pearls in lustre or iridescence.",
                  "examples": [
                    "A Teaching Company Scheme developing new technology for pearling light bulbs was established in October  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To resemble pearl or pearls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To  hunt for pearls",
                  "examples": [
                    "to go pearling"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, surfing) To sink the nose of one's surfboard into the water, often on takeoff.",
                  "examples": [
                    "Used a pointed tip today and learned why I kept pearling with my round tipped board. Round noses like to dig into the water, causing frustrating wipeouts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, surfing) Of the nose of the surfboard: to sink in this manner.",
                  "examples": [
                    "He couldn't even turn the board or raise the nose. Consequently, the board pearled, nose-dived into the water, throwing Lee off almost like being thrown from a horse. But he persisted."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}