{
  "word": "sumac",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English sumac, asimac, simak, sumak, symak (“portions of the shrub Rhus coriaria, chiefly used for medicinal purposes”), from Anglo-Norman sumak, symak, and Old French sumac, or directly from its etymon Medieval Latin sumach, sumac, from Arabic سُمَّاق‎ (summāq), from Classical Syriac ܣܘܡܩܐ‎ (summāqā, “red; sumac”). The English word is cognate with Italian sommaco, sommacco, Occitan simac, Portuguese sumagre, Spanish zumaque.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sumac (usually uncountable, plural sumacs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various shrubs or small trees of the genus Rhus and other genera in Anacardiaceae, particularly the elm-leaved sumac, Sicilian sumac, or tanner's sumac (Rhus coriaria).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dried and chopped-up leaves and stems of a plant of the genus Rhus, particularly the tanner's sumac (see sense 1), used for dyeing and tanning leather or for medicinal purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sour spice popular in the Eastern Mediterranean, made from the berries of tanner's sumac.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sumac (third-person singular simple present sumacs, present participle sumacing or sumacking, simple past and past participle sumaced or sumacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply a  preparation of sumac to (an object), for example, to a piece of leather to tan it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}