{
  "word": "praetor",
  "etymologies": [
    {
      "description": [
        "From Middle English pretour, pretor, from the Anglo-Norman pretour, pretore, the Middle French preteur (from the Old French pretor; compare the Modern French préteur), and their etymon, the Classical Latin praetor (“leader”, “commander”, “magistrate”); the Latin praetor being contracted from *praeitor (“one who goes before”), from praeeō (“I go before”), from prae (“before”) + eō (“I go”); compare the Italian pretore, the Portuguese pretor, and the Spanish pretor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "praetor (plural praetors or praetores)",
          "definitionGroups": [
            {
              "group": "(history) The title designating a Roman administrative official whose role changed over time:",
              "entries": [
                {
                  "meaning": "(originally) A consul in command of the army.",
                  "examples": []
                },
                {
                  "meaning": "(after 366 BC) An annually-elected curule magistrate, subordinate to the consuls in provincial administration, and who performed some of their duties; numbering initially only one, later two (either of the praetor urbānus (“urban praetor”) or the praetor peregrīnus (“peregrine praetor”)), and eventually eighteen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A high civic or administrative official, especially a chief magistrate or mayor. Sometimes used as a title.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, translating Italian \"pretore\") The title of the chief magistrate, the mayor, and/or the podestà in Palermo, in Verona, and in various other parts of 17th- and 18th-century Italy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}