{
  "word": "lumpish",
  "etymologies": [
    {
      "description": [
        "lump +‎ -ish"
      ],
      "adjectives": [
        {
          "description": "lumpish (comparative more lumpish, superlative most lumpish)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Shaped like a lump, lumpy, ill-defined in shape.",
                  "examples": [
                    "It seems to me that mere unmixed ugliness does not arise from sharp angles, or from any sudden variation, but rather from that want of form, that unshapen lumpish appearance, which, perhaps, no one word exactly expresses; a quality that never can be mistaken for beauty, never can adorn it, and which is equally unconnected with the sublime and the picturesque."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Like lumps, lumpy, composed of unshaped or mismatched pieces.",
                  "examples": [
                    "Bandinelli  […]  is otherwise best known for the lumpish statue of Hercules and Cacus that still stands outside the Palazzo, a desperate and failed attempt to rival the greatness of his nemesis."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Like a lump, cloddish, dull, slow-witted.",
                  "examples": [
                    "The whole Sex are generally Quick and Sharp: I believe I may be allow’d to say generally so; for you rarely see them lumpish and heavy when they are Children, as Boys will often be."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Without energy, lethargic.",
                  "examples": [
                    "[…]  a song I prethee, I love these French moovings; oh they are so cleane if you treade them true, you shal hit them to a haire; sing, sing, sing some odde and fantasticall thing, for I cannot abide these dull and lumpish tunes, the Musition stands longer a pricking them then I would doe to heare them: no, no, no, give mee your light ones, that goe nimbly and quicke, and are full of changes, and carrie sweet devision  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Awkward, inelegant.",
                  "examples": [
                    "But the play’s snatches of racy prose do not offset its stretches of lumpish playwriting. Too often both untidy and oldfashioned, it closed after four performances."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}