{
  "word": "interference",
  "etymologies": [
    {
      "description": [
        "From interfere +‎ -ence. The sense in physics was likely introduced by Thomas Young, which he used as early as 1801 in a paper in the Philosophical Transactions of the Royal Society."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "interference (countable and uncountable, plural interferences)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of interfering with something, or something that interferes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The illegal obstruction of an opponent in some ball games.",
                  "examples": [
                    "They were glued to the TV, as the referee called out a fifteen yard penalty for interference."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) An effect caused by the superposition of two systems of waves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distortion on a broadcast signal due to atmospheric or other effects.",
                  "examples": [
                    "They wanted to watch the game on TV, but there was too much interference to even make out the score on the tiny screen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law) In United States patent law, an inter partes proceeding to determine the priority issues of multiple patent applications; a priority contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) The interruption of the line between an attacked piece and its defender by sacrificially interposing a piece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The situation where a person who knows two languages inappropriately transfers lexical items or structures from one to the other.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "interference (third-person singular simple present interferences, present participle interferencing, simple past and past participle interferenced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard) To interfere.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}