{
  "word": "basket",
  "etymologies": [
    {
      "description": [
        "From Middle English basket, from Anglo-Norman bascat, of obscure origin.",
        "One theory is that it derives from Late Latin bascauda (“kettle, table-vessel”), from Proto-Brythonic (in Breton baskodenn), from Proto-Celtic *baskis (“bundle, load”), from Proto-Indo-European *bʰask- (“bundle”). Related to Latin fascis (“bundle, package, load”). Doublet of fasces."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "basket (countable and uncountable, plural baskets)",
          "definitionGroups": [
            {
              "group": "A lightweight container, generally round, open at the top, and tapering toward the bottom.",
              "entries": [
                {
                  "meaning": "(by extension) A bed for a cat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wire or plastic container similar in shape to a basket, used for carrying articles for purchase in a shop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) In an online shop, a listing of a customer's chosen items before they are ordered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A set or collection of intangible things.",
                  "examples": [
                    "The basket of issues that developing countries had vigorously wanted addressed such as agriculture, SANDD and implementation-related issues were given scant attention by developed countries for most part of the conference."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) A circular hoop, from which a net is suspended, which is the goal through which the players try to throw the ball.",
                  "examples": [
                    "The point guard drove toward the basket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) The act of putting the ball through the basket, thereby scoring points.",
                  "examples": [
                    "The last-second basket sealed the victory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The game of basketball.",
                  "examples": [
                    "Let's play some basket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dance movement in some line dances, where men put their arms round the women's lower backs, and the women put their arms over the men's shoulders, and the group (usually of four, any more is difficult) spins round, which should result in the women's feet leaving the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, slang) The male genitalia and region surrounding it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The bulge of the male genitals seen through clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In a stage-coach, two outside seats facing each other.",
                  "examples": [
                    "In my time, the follies of the town crept slowly among us, but now they travel faster than a stage-coach. Its fopperies come down not only as inside passengers, but in the very basket."
                  ]
                }
              ]
            },
            {
              "group": "(archaic) A protection for the hand on a sword or a singlestick; a guard of a bladed weapon.",
              "entries": [
                {
                  "meaning": "A singlestick with a basket hilt.",
                  "examples": [
                    "Baw! damme, but I'll fight you both, one after the other——with baskets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ballooning) The gondola or wicker basket suspended from the balloon, in which the pilot and passengers travel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The bell or vase of the Corinthian capital.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, euphemistic) Bastard.",
                  "examples": [
                    "Wait till I catch you, you little basket!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, aircraft) A drogue (or para-drogue) in the probe-and-drogue refueling method",
                  "examples": [
                    "Don't smoosh the basket."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "basket (third-person singular simple present baskets, present participle basketing, simple past and past participle basketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place in a basket or baskets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, publishing) To cross-collateralize the royalty advances for multiple works so that the creator is not paid until all of those works have achieved a certain level of success.",
                  "examples": [
                    "Foreign language paperback, serial and book club would be basketed together in a 50/50 subsidiary rights clause."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}