{
  "word": "peremptory",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman peremptorie, parentorie et al. (Modern French péremptoire), and its source, Latin peremptōrius (“deadly; decisive”), from perimō (“destroy”), from per- (“thorough”) + emō (“I take, I acquire”)."
      ],
      "adjectives": [
        {
          "description": "peremptory (comparative more peremptory, superlative most peremptory)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Precluding debate or expostulation; not admitting of question or appeal",
                  "examples": [
                    "there is no reason but if any of the outlawries be indeed without error, but it should be a peremptory plea to the person in a writ of error, as well as in any other action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Positive in opinion or judgment; absolutely certain, overconfident, unwilling to hear any debate or argument (especially in a pejorative sense); dogmatic.",
                  "examples": [
                    "He marched under a placard reading \"End Bossiness Now\" but decided it was a little too peremptory, not quite British, so changed the slogan on subsequent badges, to \"End Bossiness Soon.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Firmly determined, resolute; obstinate, stubborn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Accepting no refusal or disagreement; imperious, dictatorial.",
                  "examples": [
                    "[…]  less surprising than that he had been depressed by a book. Something was making him nibble at the edge of stale ideas as if his sturdy physical egotism no longer nourished his peremptory heart."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "peremptory (plural peremptories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A challenge to the admission of a juror, without the challenger needing to show good cause.",
                  "examples": [
                    "Each side was allowed 20 peremptories, and the prosecution used 18 of its allotment."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}