{
  "word": "topiary",
  "etymologies": [
    {
      "description": [
        "From Latin topiarius (“of or relating to ornamental gardening; an ornamental garden, an ornamental gardener”), from Latin topia (“ornamental gardening, landscape painting”), from Ancient Greek τόπια (tópia, “artistic representation in which natural or artificial features of a place are used as the medium”), plural of Ancient Greek τόπιον (tópion, “field, landscape”), from τόπος (tópos, “place”). The adjective use dates to 1592, the noun use dates to 1908."
      ],
      "adjectives": [
        {
          "description": "topiary (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, or relating to art of topiaries.",
                  "examples": [
                    "As the topiary art has been allowed to practically die out, it is difficult to secure the services of skilled clippers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a tree or shrub, trimmed in artistic shape.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "topiary (countable and uncountable, plural topiaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Art or practice of trimming shrubs or trees in artistic or ornamental shapes, e.g. of animals.",
                  "examples": [
                    "The palace garden might have had a semblance of coolness had there been any trees, but the tallest things were fanciful topiary, tortured into the shapes of running horses or bears performing tumblers’ tricks or the like."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A garden decorated with such art.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One such shrub or tree.",
                  "examples": [
                    "We have topiaries for sale."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}