{
  "word": "punish",
  "etymologies": [
    {
      "description": [
        "From Middle English punischen, from Anglo-Norman, Old French puniss-, stem of some of the conjugated forms of punir, from Latin puniō (“I inflict punishment upon”), from poena (“punishment, penalty”); see pain. Displaced Old English wītnian and (mostly, in this sense) wrecan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "punish (third-person singular simple present punishes, present participle punishing, simple past and past participle punished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to suffer for crime or misconduct, to administer disciplinary action.",
                  "examples": [
                    "It was not from the want of proper laws that dangerous principles had been disseminated, and had assumed a threatening aspect, but because those laws had not been employed by the executive power to remedy the evil, and to punish the offenders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To treat harshly and unfairly.",
                  "examples": [
                    "Synonym: mistreat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To handle or beat severely; to maul.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To consume a large quantity of.",
                  "examples": [
                    "A few moments later, we were all sitting around the veranda of the hunters' dining hall, punishing the gin, as usual."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}