{
  "word": "dependent",
  "etymologies": [
    {
      "description": [
        "Originally dependant, from French dépendant, present participle of dépendre (“to depend”) (in English assimilated to Latin dēpendēns)."
      ],
      "adjectives": [
        {
          "description": "dependent (comparative more dependent, superlative most dependent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relying upon; depending upon.",
                  "examples": [
                    "At that point I was dependent on financial aid for my tuition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) Having a probability that is affected by the outcome of a separate event.",
                  "examples": [
                    "Within the GMM framework, the distribution of returns conditional on the market return can be both serially dependent and conditionally heteroscedastic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of Irish/Manx/Scottish (Gaelic) verb forms) Used after a particle (with one or two exceptions), such as those which express questions, subordinate clauses, and negative sentences.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Affecting the lower part of the body, such as the legs while standing up, or the back while supine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Hanging down.",
                  "examples": [
                    "a dependent bough or leaf"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "dependent (plural dependents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) One who relies on another for support",
                  "examples": [
                    "With two children and an ailing mother, she had three dependents in all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) An element in phrase or clause structure that is not the head. Includes complements, modifiers and determiners.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The aorist subjunctive or subjunctive perfective: a form of a verb not used independently but preceded by a particle to form the negative or a tense form. Found in Greek and in the Gaelic languages.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}