{
  "word": "roulette",
  "etymologies": [
    {
      "description": [
        "Borrowed from French roulette (“roulette, little wheel”). The sense \"situation with a random chance of incurring serious harm\" may be abstracted from Russian roulette."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "roulette (countable and uncountable, plural roulettes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A game of chance in which a small ball is made to move round rapidly on a circle divided off into numbered red and black spaces, the one on which it stops indicating the result of a variety of wagers permitted by the game.",
                  "examples": [
                    "Synonym: (historical) roly-poly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) An instance of risk-taking, especially when the downside exceeds the upside (contrary to the game of roulette where only the wager is lost).",
                  "examples": [
                    "1982 April 28,  Donna Hilts,  “TV Report On Vaccine Stirs Bitter Controversy”, in  Washington Post:Doctors and health officials said that the WRC-TV documentary, \"DPT: Vaccine Roulette,\" emphasized the risks of the vaccine while ignoring the dangers of the disease, which has been almost wiped out in this country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A small toothed wheel used by engravers to roll over a plate in order to produce rows of dots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A similar wheel used to roughen the surface of a plate, as in making alterations in a mezzotint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, geometry) The locus of a point on a plane curve that rolls without slipping along another fixed plane curve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) Any of the small incisions on a sheet of stamps, used as an alternative to perforations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cylindrical curler for the hair.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "roulette (third-person singular simple present roulettes, present participle rouletting, simple past and past participle rouletted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To separate or decorate by incisions made with a small toothed wheel.",
                  "examples": [
                    "to roulette a sheet of postage stamps"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}