{
  "word": "cumbrous",
  "etymologies": [
    {
      "description": [
        "From Late Middle English combrous (“causing obstruction; clumsy; obstructed; bothersome, difficult; burdensome, onerous; serious; causing trouble, troublesome; dangerous; immoral; unjust, wrongful; upset”) [and other forms], from combren (“to annoy, harass, trouble, worry, vex; to conquer, defeat; to harm, ruin; to overcome, overwhelm, possess; (reflexive) to burden oneself, do wrong”) + -ous (suffix forming adjectives). Combren is possibly an aphetic form of acombren (“to annoy, harass, vex; to burden; to cause distress; to defeat, overwhelm; to bewilder, confuse, perplex; to tire; to upset”) (whence accumber (obsolete)) or encombren (“to annoy, trouble, vex; to assault, beset, harass; to block, hinder; to burden or be a burden; to choke; to defeat, overcome, overwhelm; to ensnare in sin, tempt to do wrong; to get stuck; to bewilder, confuse, perplex”) (whence encumber), though the Oxford English Dictionary notes that combren is first attested earlier than those words.",
        "If that derivation is correct, encombren is from Old French encombrer (“to annoy, bother, irritate; to burden”) (modern French encombrer), from Late Latin incombrāre, the present active infinitive of incombrō (“to burden; to hinder, inconvenience”), from Latin in- (prefix meaning ‘into, on, upon’) + combrus (“barrage, barricade; obstacle”), and combrus is either:",
        "The English word is analysable as cumber +‎ -ous."
      ],
      "adjectives": [
        {
          "description": "cumbrous (comparative more cumbrous, superlative most cumbrous) (literary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) Unwieldy because of size or weight; cumbersome.",
                  "examples": [
                    "Synonym: (obsolete) encumbrous",
                    "Antonym: uncumbrous"
                  ]
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Causing hindrance or obstruction.",
                  "examples": [
                    "Synonym: cumbersome"
                  ]
                },
                {
                  "meaning": "Giving annoyance or trouble; troublesome, vexatious.",
                  "examples": [
                    "Synonyms: cumbersome, wearisome"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}