{
  "word": "tincture",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Late Middle English tincture (“a dye, pigment; a colour, hue, tint; process of colouring or dyeing; medicinal ointment or salve (perhaps one discolouring the skin); use of a medicinal tincture; (alchemy) transmutation of base metals into gold; ability to cause such transmutation; substance supposed to cause such transmutation”) [and other forms], borrowed from Latin tīnctūra (“act of dyeing”) + Middle English -ure (suffix indicating an action or a process and the means or result of that action or process). Tīnctūra is derived from tīnctus (“coloured, tinged; dipped in; impregnated with; treated”) + -tūra (suffix forming action nouns expressing activities or results); while tīnctus is the perfect passive participle of tingō (“to colour, dye, tinge; to dip (in), immerse; to impregnate (with); to moisten, wet; to smear”), ultimately from Proto-Indo-European *teng- (“to dip; to soak”). Doublet of teinture and tinctura.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tincture (plural tinctures)",
          "definitionGroups": [
            {
              "group": "Senses relating to colour, and to dipping something into a liquid.",
              "entries": [
                {
                  "meaning": "(obsolete) A pigment or other substance that colours or dyes; specifically, a pigment used as a cosmetic. [15th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(by extension)",
                  "examples": []
                },
                {
                  "meaning": "A colour or tint, especially if produced by a pigment or something which stains; a tinge.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) A slight addition of a thing to something else; a shade, a touch, a trace.",
                  "examples": []
                },
                {
                  "meaning": "(heraldry) A hue or pattern used in the depiction of a coat of arms; namely, a colour, fur, or metal.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": [
                    "a tincture of orange peel"
                  ]
                },
                {
                  "meaning": "The act of colouring or dyeing.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively)",
                  "examples": [
                    "a tincture of orange peel"
                  ]
                },
                {
                  "meaning": "A slight physical quality other than colour (especially taste), or an abstract quality, added to something; a tinge.",
                  "examples": [
                    "a tincture of orange peel"
                  ]
                },
                {
                  "meaning": "A small flaw; a blemish, a stain.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) Synonym of baptism",
                  "examples": []
                }
              ]
            },
            {
              "group": "Scientific and alchemical senses.",
              "entries": [
                {
                  "meaning": "(pharmacy) A medicine consisting of one or more substances dissolved in ethanol or some other solvent.",
                  "examples": [
                    "tincture of cannabis    tincture of iodine"
                  ]
                },
                {
                  "meaning": "(by extension, humorous) A (small) alcoholic drink.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete except historical)",
                  "examples": []
                },
                {
                  "meaning": "(alchemy)",
                  "examples": []
                },
                {
                  "meaning": "An immaterial substance or spiritual principle which was thought capable of being instilled into physical things; also, the essence or spirit of something.",
                  "examples": []
                },
                {
                  "meaning": "A material essence thought to be capable of extraction from a substance.",
                  "examples": []
                },
                {
                  "meaning": "(chemistry) The part of a substance thought to be essential, finer, and/or more volatile, which could be extracted in a solution; also, the process of obtaining this.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tincture (third-person singular simple present tinctures, present participle tincturing, simple past and past participle tinctured)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(chiefly in past participle form) To colour or stain (something) with, or as if with, a dye or pigment.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively, chiefly in past participle form) Followed by with: to add to or impregnate (something) with (a slight amount of) an abstract or (obsolete) physical quality; to imbue, to taint, to tinge.",
                  "examples": []
                },
                {
                  "meaning": "(pharmacy) To dissolve (a substance) in ethanol or some other solvent to produce a medicinal tincture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To have a taint or tinge of some quality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}