{
  "word": "zither",
  "etymologies": [
    {
      "description": [
        "Borrowed from German Zither, from Old High German zithara, from Latin cithara, from Ancient Greek κιθάρα (kithára, “a kind of harp”). Doublet of cithara, cither, and guitar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zither (plural zithers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical instrument consisting of a flat sounding box with numerous strings placed on a horizontal surface, played with a plectrum or fingertips.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, translations) Related or similar instruments in other cultures, such as the Chinese guqin or Norwegian harpeleik; especially any chordophone without a neck, and with strings that pass over the body.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "zither (third-person singular simple present zithers, present participle zithering, simple past and past participle zithered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play a zither.",
                  "examples": [
                    "[…]  the fluting began again. Not alone this time, but, to Rosalie’s infinite surprise, accompanied on a zither.  […]  At this moment the fluting and zithering began again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a sound similar to that made by a zither; to move while making such a sound.",
                  "examples": [
                    "Now [the wind] swithered through the badly-fixed windows, making zithering sounds as of an army of cold and frozen-out mosquitoes  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}