{
  "word": "turn",
  "etymologies": [
    {
      "description": [
        "From Middle English turnen, from Old English turnian, tyrnan (“to turn, rotate, revolve”) and Old French torner (“to turn”), both from Latin tornāre (“to round off, turn in a lathe”), from tornus (“lathe”), from Ancient Greek τόρνος (tórnos, “turning-lathe: a tool used for making circles”), from Proto-Indo-European *terh₁- (“to rub, rub by turning, turn, twist, bore”). Cognate with Old English þrāwan (“to turn, twist, wind”). Displaced native Old English wendan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "turn (third-person singular simple present turns, present participle turning, simple past and past participle turned or (obsolete) turnt)",
          "definitionGroups": [
            {
              "group": "To make a non-linear physical movement.",
              "entries": [
                {
                  "meaning": "(intransitive) Of a body, person, etc, to move around an axis through itself.",
                  "examples": [
                    "the Earth turns;  turn on the spot"
                  ]
                },
                {
                  "meaning": "(transitive) To change the direction or orientation of, especially by rotation.",
                  "examples": [
                    "Turn the knob clockwise."
                  ]
                },
                {
                  "meaning": "(intransitive) To change one's direction of travel.",
                  "examples": [
                    "She turned right at the corner."
                  ]
                },
                {
                  "meaning": "(transitive) To shape (something) symmetrically by rotating it against a stationary cutting tool, as on a lathe.",
                  "examples": [
                    "She turned the table legs with care and precision."
                  ]
                },
                {
                  "meaning": "(by extension) To give form to; to shape or mould; to adapt.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To position (something) by folding it, or using its folds.",
                  "examples": [
                    "turn the bed covers;  turn the pages"
                  ]
                },
                {
                  "meaning": "(transitive, figuratively) To navigate through a book or other printed material.",
                  "examples": [
                    "turn to page twenty;  turn through the book"
                  ]
                },
                {
                  "meaning": "(transitive, cricket) Of a bowler, to make (the ball) move sideways off the pitch when it bounces.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, cricket) Of a ball, to move sideways off the pitch when it bounces.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To change condition or attitude.",
              "entries": [
                {
                  "meaning": "(copulative) To become (begin to be).",
                  "examples": [
                    "Synonyms: become, get",
                    "The leaves turn brown in autumn. When I asked him for the money, he turned nasty."
                  ]
                },
                {
                  "meaning": "(intransitive) To change the color of the leaves in the autumn.",
                  "examples": [
                    "The hillside behind our house isn't generally much to look at, but once all the trees turn it's gorgeous."
                  ]
                },
                {
                  "meaning": "To change fundamentally; to metamorphose.",
                  "examples": [
                    "Midas made everything turn to gold.  He turned into a monster every full moon."
                  ]
                },
                {
                  "meaning": "(intransitive) To sour or spoil; to go bad.",
                  "examples": [
                    "This milk has turned; it smells awful."
                  ]
                },
                {
                  "meaning": "(transitive) To make acid or sour; to ferment; to curdle.",
                  "examples": [
                    "to turn cider or wine"
                  ]
                },
                {
                  "meaning": "(transitive, fantasy) To change (a person) into a vampire, werewolf, zombie, etc.",
                  "examples": [
                    "How long ago was he turned?"
                  ]
                },
                {
                  "meaning": "(intransitive, fantasy) To transform into a vampire, werewolf, zombie, etc.",
                  "examples": [
                    "Bruce Banner turns when he is angry; he becomes the Hulk, an incredibly powerful green monster."
                  ]
                },
                {
                  "meaning": "To reach a certain age.",
                  "examples": [
                    "Charlie turns six on September 29."
                  ]
                },
                {
                  "meaning": "To hinge; to depend.",
                  "examples": [
                    "The decision turns on a single fact."
                  ]
                },
                {
                  "meaning": "To rebel; to go against something formerly tolerated.",
                  "examples": [
                    "The prisoners turned on the warden."
                  ]
                },
                {
                  "meaning": "To change personal condition.",
                  "examples": [
                    "The sight turned my stomach."
                  ]
                },
                {
                  "meaning": "(professional wrestling) To change personalities, such as from being a face (good guy) to heel (bad guy) or vice versa.",
                  "examples": []
                },
                {
                  "meaning": "To become giddy; said of the head or brain.",
                  "examples": []
                },
                {
                  "meaning": "To sicken; to nauseate.",
                  "examples": [
                    "The sight turned my stomach."
                  ]
                },
                {
                  "meaning": "To be nauseated; said of the stomach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, reflexive) To change one's course of action; to take a new approach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, usually with over) To complete.",
                  "examples": [
                    "They say they can turn the parts in two days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (money); turn a profit.",
                  "examples": [
                    "We turned a pretty penny with that little scheme."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, soccer) Of a player, to go past an opposition player with the ball in one's control.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To undergo the process of turning on a lathe.",
                  "examples": [
                    "Ivory turns well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obstetrics) To bring down the feet of a child in the womb, in order to facilitate delivery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) To invert a type of the same thickness, as a temporary substitute for any sort which is exhausted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To translate.",
                  "examples": [
                    "to turn the Iliad"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, role-playing games) To magically or divinely attack undead.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Partly from Anglo-Norman *torn, from Latin turnus, from Ancient Greek τόρνος (tórnos), and partly an action noun from the verb turn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turn (plural turns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change of direction or orientation.",
                  "examples": [
                    "Give the handle a turn, then pull it."
                  ]
                }
              ]
            },
            {
              "group": "A movement of an object about its own axis in one direction that continues until the object returns to its initial orientation.",
              "entries": [
                {
                  "meaning": "(geometry) A unit of plane angle measurement based on this movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A walk to and fro.",
                  "examples": [
                    "Let's take a turn in the garden.",
                    "Synonym: promenade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chance to use (something) shared in sequence with others.",
                  "examples": [
                    "They took turns playing with the new toy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spell of work, especially the time allotted to a person in a rota or schedule.",
                  "examples": [
                    "I cooked tonight, so it's your turn to do the dishes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's chance to make a move in a game having two or more players.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A figure in music, often denoted ~, consisting of the note above the one indicated, the note itself, the note below the one indicated, and the note itself again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time required to complete a project.",
                  "examples": [
                    "They quote a three-day turn on parts like those.",
                    "Synonym: turnaround"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fit or a period of giddiness.",
                  "examples": [
                    "I've had a funny turn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change in temperament or circumstance.",
                  "examples": [
                    "She took a turn for the worse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A sideways movement of the ball when it bounces (caused by rotation in flight).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The fourth communal card in Texas hold 'em.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker, obsolete) The flop (the first three community cards) in Texas hold 'em.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deed done to another; an act of kindness or malice.",
                  "examples": [
                    "One good turn deserves another.",
                    "I felt that the man was of a vindictive nature, and would do me an evil turn if he found the opportunity […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single loop of a coil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rope) A pass behind or through an object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Character; personality; nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) An instance of going past an opposition player with the ball in one's control.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(circus, theater, especially physical comedy) A short skit, act, or routine.",
                  "examples": [
                    "Between the pieces were individual turns, comic songs and dances."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) A type turned upside down to serve for another character that is not available.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, finance, historical) The profit made by a stockjobber, being the difference between the buying and selling prices.",
                  "examples": [
                    "There are usually at least two jobbers who specialise in the leading stocks, and this acts to keep the jobber's turn to a reasonable amount  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}