{
  "word": "secondary",
  "etymologies": [
    {
      "description": [
        "From Middle English secundarie, from Latin secundārius (“of the second class or quality”), from secundus (whence the English second) + -ārius (whence the English suffix -ary); compare the French secondaire, the Italian secondario, the Occitan secundari, the Portuguese secundario, and the Spanish secundario."
      ],
      "adjectives": [
        {
          "description": "secondary (not generally comparable, comparative more secondary, superlative most secondary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Next in order to the first or primary; of second place in origin, rank, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Originating from a deputy or delegated person or body",
                  "examples": [
                    "the work of secondary hands"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(organic chemistry) Derived from a parent compound by replacement of two atoms of hydrogen by organic radicals",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Produced by alteration or deposition subsequent to the formation of the original rock mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Developed by pressure or other causes.",
                  "examples": [
                    "secondary cleavage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Pertaining to the second joint of the wing of a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Dependent or consequent upon another disease, or occurring in the second stage of a disease.",
                  "examples": [
                    "Bright's disease is often secondary to scarlet fever.",
                    "the secondary symptoms of syphilis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of less than primary importance.",
                  "examples": [
                    "a secondary issue"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) Related to secondary education, i.e. schooling between the ages of (approximately) 11 and 18.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) Relating to the manufacture of goods from raw materials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a color) Formed by mixing primary colors.",
                  "examples": [
                    "Yellow is a secondary light color, though a primary CMYK color."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy, not comparable) Representing a reversion to an ancestral state.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "secondary (plural secondaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) Any flight feather attached to the ulna (forearm) of a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A radar return generated by the response of an aircraft's transponder to an interrogation signal broadcast by a radar installation, containing additional encoded identification and situational data not available from a simple primary return.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The second stage of a multistage thermonuclear weapon, which generates a fusion explosion when imploded as an indirect result of the fission explosion of the primary, and which, in a few extremely large weapons, itself implodes a fusion tertiary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) An act of issuing more stock by an already publicly traded corporation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football, Canadian football) The defensive backs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) An inductive coil or loop that is magnetically powered by a primary in a transformer or similar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who occupies a subordinate or auxiliary place; a delegate deputy.",
                  "examples": [
                    "the secondary, or undersheriff, of the city of London"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A secondary circle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A satellite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) A secondary school.",
                  "examples": [
                    "There are four secondaries in this district, each with several thousand pupils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything secondary or of lesser importance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}