{
  "word": "spurn",
  "etymologies": [
    {
      "description": [
        "From Middle English spurnen, spornen, from Old English spurnan (“to strike against, kick, spurn, reject; stumble”), from Proto-Germanic *spurnaną (“to tread, kick, knock out”), from Proto-Indo-European *sperH-.",
        "Cognate with Scots spurn (“to strike, push, kick”), German spornen (“to spur on”), Icelandic sporna, spyrna (“to kick”), Latin spernō (“despise, distain, scorn”). Related to spur and spread."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spurn (plural spurns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of spurning; a scornful rejection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kick; a blow with the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Disdainful rejection; contemptuous treatment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A body of coal left to sustain an overhanging mass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spurn (third-person singular simple present spurns, present participle spurning, simple past and past participle spurned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To reject disdainfully; contemn; scorn.",
                  "examples": [
                    "Domestics will pay a more ready and cheerful service, when they find themselves not spurned, because fortune has laid them below the level of others, at their master's feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reject something by pushing it away with the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To waste; fail to make the most of (an opportunity)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To kick or toss up the heels.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}