{
  "word": "clap",
  "etymologies": [
    {
      "description": [
        "From Middle English clappen, from Old English clæppan, from Proto-Germanic *klappōną. Cognate with Dutch klappen, Icelandic klappa, and Faroese klappa. Doublet of clepe and yclept."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clap (plural claps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of striking the palms of the hands, or any two surfaces, together.",
                  "examples": [
                    "He summoned the waiter with a clap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The explosive sound of thunder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any loud, sudden, explosive sound made by striking hard surfaces together, or resembling such a sound.",
                  "examples": [
                    "Off in the distance, he heard the clap of thunder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slap with the hand, usually in a jovial manner.",
                  "examples": [
                    "His father's affection never went further than a handshake or a clap on the shoulder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single, sudden act or motion; a stroke; a blow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) The nether part of the beak of a hawk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Yorkshire) A dropping of cow dung (presumably from the sound made as it hits the ground)",
                  "examples": [
                    "“Oh! get some coo clap (cow dung), mix it wi’ fish oil (whale oil), put it on, and let it stop on all neet.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clap (third-person singular simple present claps, present participle clapping, simple past and past participle clapped or (archaic) clapt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike the palms of the hands together, creating a sharp sound.",
                  "examples": [
                    "The children began to clap in time with the music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To applaud.",
                  "examples": [
                    "The audience loudly clapped the actress, who responded with a deep curtsey.",
                    "It isn’t the singers they are clapping; it's the composer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To slap with the hand in a jovial manner.",
                  "examples": [
                    "He would often clap his teammates on the back for encouragement."
                  ]
                }
              ]
            },
            {
              "group": "To bring two surfaces together forcefully, creating a sharp sound.",
              "entries": [
                {
                  "meaning": "(slang) To have sex.",
                  "examples": [
                    "clap alien cheeks"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To slam (a door or window); formerly often construed with to.",
                  "examples": [
                    "The doors around me clapped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To create or assemble (something) hastily (usually followed by up or together).",
                  "examples": [
                    "We should clap together a shelter before nightfall.",
                    "The rival factions clapped up a truce."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set or put, usually in haste.",
                  "examples": [
                    "The sheriff clapped him in jail.",
                    "She was the prettiest thing I'd ever clapped eyes on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, African-American Vernacular) To shoot (somebody) with a gun.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To fornicate, copulate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Probably from Old French clapoir (“bubo, inflammation from infection”), from clapier (“brothel”).\nMay also be from old, unsafe treatments for gonnorhea, such as clapping the penis between a book and a hard surface to break up obstructions in the urethra and permit urination. Attested from the 16th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clap",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually with \"the\") Gonorrhea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}