{
  "word": "wank",
  "etymologies": [
    {
      "description": [
        "Origin unknown. First known use as a verb is 1905, as a noun 1948. Perhaps compare regional slang term wang, whang (“to whack or beat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wank (countable and uncountable, plural wanks) (UK, Ireland, Australia, New Zealand)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang, vulgar) An act of masturbation.",
                  "examples": [
                    "Synonyms: jerk off, toss, tug, fingering; see also Thesaurus:masturbation",
                    "He’s having a wank!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang, vulgar, derogatory) An undesirable person.",
                  "examples": [
                    "You utter wank! How could you behave like that?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang, vulgar) Nonsense, rubbish.",
                  "examples": [
                    "This opera is wank.",
                    "Did you see that thing on Channel 4? Yeah, it was a wank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, chiefly vulgar, fandom slang and Internet slang) Ridiculous, circular or inappropriately elaborate argument about something, especially if obnoxious, pretentious or unsubstantial.",
                  "examples": [
                    "Synonym: wankery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, fandom slang) Drama, turmoil, or disagreement within a fannish space.",
                  "examples": [
                    "Sometimes those involved in the wank will attempt to steer discussion by disguising themselves with a different user name and posting their own support."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wank (third-person singular simple present wanks, present participle wanking, simple past and past participle wanked) (UK, Ireland, Australia, New Zealand)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, vulgar) To masturbate.",
                  "examples": [
                    "Synonyms: see Thesaurus:masturbate",
                    "I was so embarrassed when my mother caught me wanking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, vulgar) To masturbate; to give a hand job to.",
                  "examples": [
                    "Synonym: masturbate",
                    "She wanked me in the morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, vulgar, chiefly fandom slang and Internet slang) To argue in an inappropriate manner or about pretentious or insubstantial matters; to engage in wank.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}