{
  "word": "retread",
  "etymologies": [
    {
      "description": [
        "re- +‎ tread (“grooves carved into the face of a tire”, noun)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "retread (plural retreads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A used tire whose surface, the tread, has been replaced to extend its life and use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, slang) A person who re-entered military service in World War II after serving in World War I.",
                  "examples": [
                    "In Our War the Retreads usually slinked in over-aged, over-weight and overcautious in the face of a new generation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "retread (third-person singular simple present retreads, present participle retreading, simple past and past participle retreaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To replace the traction-providing surface of a vehicle that employs tires, tracks or treads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) To renew the tread of a tyre, providing a cheaper alternative to buying a new tyre, but potentially introducing a risk of premature failure if performed improperly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "re- +‎ tread (verb)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "retread (plural retreads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes figurative) A return over ground previously covered; a retraversal or repetition.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "retread (third-person singular simple present retreads, present participle retreading, simple past retrod, past participle retrodden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tread again, to walk along again, to follow a path again.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}