{
  "word": "chamois",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French chamois, from Late Latin camox, from Gaulish camox (5th c. AD, Polemius Silvius), probably from an extinct Alpine language (Raetic, Ancient Ligurian), possibly Proto-Indo-European *kem (“without horns”). Compare also Old High German gamiza (“chamois”) (whence modern German Gämse)."
      ],
      "adjectives": [
        {
          "description": "chamois (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chamois-colored.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chamois (countable and uncountable, plural chamoises or chamois)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short-horned goat antelope native to mountainous terrain in southern Europe; Rupicapra rupicapra.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for chamois leather (“soft pliable leather originally made from the skin of chamois (nowadays the hides of deer, sheep, and other species of goat are alternatively used)”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The traditional colour of chamois leather.",
                  "examples": [
                    "chamois:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An absorbent cloth used for cleaning and polishing, formerly made of chamois leather.",
                  "examples": [
                    "Mirrors can be cleaned with warm water and ammonia or vinegar and polished with a chamois."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cycling) A padded insert which protects the groin from the bicycle saddle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chamois (third-person singular simple present chamoises, present participle chamoising, simple past and past participle chamoised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean with a chamois leather cloth.",
                  "examples": [
                    "Synonym: shammy"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}