{
  "word": "seethe",
  "etymologies": [
    {
      "description": [
        "From Middle English sethen, from Old English sēoþan (“to seethe, boil, cook in a liquid; subject to a fiery ordeal, try as with fire; subject to great pain, afflict, afflict grievously, disturb; prepare food for the mind; subject the mind with occupations; be troubled in mind, brood”), from Proto-Germanic *seuþaną (“to seethe, boil”), from Proto-Indo-European *h₂sewt-, *h₂sut-, *h₂sew- (“to move about, roil, seethe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "seethe (third-person singular simple present seethes, present participle seething, simple past seethed or (archaic) sod, past participle seethed or (archaic) sodden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To boil.",
                  "examples": [
                    "When he had cooked or seethed the Peace-offering, the priest took the sodden shoulder of the ram and one unleavened cake out of the basket and one unleavened wafer and put them upon the hands of the Nazirite and waved them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a liquid) To boil vigorously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a liquid) To foam in an agitated manner, as if boiling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a person, figuratively) To be in an agitated or angry mental state, as if boiling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a place, figuratively) To buzz with activity.",
                  "examples": [
                    "Shock Box was the skankiest bar in Hasted, complete with a cheesy jukebox, cheap pints, and a sweaty club in the basement that seethed every weekend with a superhorny boarding-school crowd."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}