{
  "word": "jog",
  "etymologies": [
    {
      "description": [
        "Late Middle English, of uncertain origin. Originally with the meaning of \"to shake up and down\".",
        "Perhaps an early alteration of English shog (“to jolt, shake; depart, go”), from Middle English shoggen, schoggen (“to shake up and down, jog”), from Middle Dutch schocken (“to jolt, bounce”) or Middle Low German schoggen, schocken (“to shog”), ultimately from Proto-West Germanic *skokkan (“to move, shake, tremble”). More at shock.",
        "Alternatively from Middle English joggen, a variant of jaggen (“to pierce, prod, stir up, arouse”) (see jag)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jog (plural jogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An energetic trot, slower than a run, often used as a form of exercise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden push or nudge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A flat placed perpendicularly to break up a flat surface.",
                  "examples": [
                    "Synonym: return piece"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In card tricks, one or more cards that are secretly made to protrude slightly from the deck as an aid to the performer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jog (third-person singular simple present jogs, present participle jogging, simple past and past participle jogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To push slightly; to move or shake with a push or jerk, as to gain the attention of; to jolt.",
                  "examples": [
                    "jog one's elbow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To shake, stir or rouse.",
                  "examples": [
                    "I tried desperately to jog my memory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk or ride forward with a jolting pace; to move at a heavy pace, trudge; to move on or along.",
                  "examples": [
                    "Here lieth one who did most truly prove,",
                    "That he could never die while he could move,",
                    "So hung his destiny, never to rot,",
                    "While he might still jogg on and keep his trot,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(exercise) To move at a pace between walking and running, to run at a leisurely pace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause to move at an energetic trot.",
                  "examples": [
                    "to jog a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To straighten stacks of paper by lightly tapping against a flat surface.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}