{
  "word": "heaven",
  "etymologies": [
    {
      "description": [
        "From a wide variety of Middle English forms including hevene, heven, hevin, and hewin (“heaven, sky”), from Old English heofon, heofone (“heaven, sky”), from Proto-West Germanic *hebn (“heaven, sky”), of uncertain origin.",
        "Cognate with Scots heiven, hewin (“heaven, sky”), Old Saxon heƀan (“heaven, sky”), Low German Heven (“heaven, sky”), Middle High German heben (“sky, heaven”), and possibly the rare Icelandic and Old Norse hifinn (“heaven, sky”), which are all probably dissimilated forms of the Germanic root which appears in Old Norse himinn (“heaven, sky”), Gothic 𐌷𐌹𐌼𐌹𐌽𐍃 (himins, “heaven, sky”), Old Swedish himin, Old Danish himæn and probably also (in another variant form) Old Saxon himil, Old Dutch himil (modern Dutch hemel), and Old High German himil (German Himmel).",
        "Accepting these as cognates, some scholars propose a further derivation from Proto-Germanic *himinaz (“cover, cloud cover, firmament, sky, heaven”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "heaven (countable and uncountable, plural heavens)",
          "definitionGroups": [
            {
              "group": "The sky, specifically:",
              "entries": [
                {
                  "meaning": "(dated or poetic, now usually in the plural) The distant sky in which the sun, moon, and stars appear or move; the firmament; the celestial spheres.",
                  "examples": [
                    "All that is vnder the heauen."
                  ]
                },
                {
                  "meaning": "(obsolete) The near sky in which weather, flying animals, etc. appear; (obsolete) the atmosphere; the climate.",
                  "examples": [
                    "Everie...Countrie, by the nature of the place, the climate of the Heaven, and the influence of the starres hath certaine vertues."
                  ]
                },
                {
                  "meaning": "(obsolete) A model displaying the movement of the celestial bodies, an orrery.",
                  "examples": [
                    "Euery man cannot, with Archimedes, make a heauen of brasse."
                  ]
                }
              ]
            },
            {
              "group": "(religion) The abode of God or the gods, traditionally conceived as beyond the sky; especially:",
              "entries": [
                {
                  "meaning": "(Christianity, usually capitalized) The abode of God and of the angels and saints in His presence.",
                  "examples": [
                    "And there was a battel in heauen. Michael & his Angels foght againſt the dragon, and the dragon foght & his Angels. But they preuailed not, nether was their place founde anie more in heauen."
                  ]
                },
                {
                  "meaning": "(religion, by extension, often capitalized) The abode of the Abrahamic God; similar abodes of the gods in other religions and traditions, such as Mount Olympus.",
                  "examples": [
                    "As he [Muhammad] was returning, in the fourth Heaven, Moses advised him to goe back to God."
                  ]
                },
                {
                  "meaning": "(by extension, usually capitalized) Providence, the will of God or the council of the gods; fate.",
                  "examples": [
                    "Heaven commands thine armTo lift the sure-destroying sword!"
                  ]
                }
              ]
            },
            {
              "group": "(religion) The afterlife of the blessed dead, traditionally conceived as opposed to an afterlife of the wicked and unjust (compare hell); specifically:",
              "entries": [
                {
                  "meaning": "(Christianity, Islam) Paradise, the afterlife of the souls who are not sent to a place of punishment or purification such as hell, purgatory, or limbo; the state or condition of being in the presence of God after death.",
                  "examples": [
                    "Teache the people to gett heuen with fastynge."
                  ]
                },
                {
                  "meaning": "(religion, by extension, often capitalized) The afterlife of the blessed dead in other religions and traditions, such as the Pure Land or Elysium.",
                  "examples": [
                    "The belief in ascending to Heaven after death became widespread in the Han dynasty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any paradise; any blissful place or experience.",
                  "examples": [
                    "England, that was formerly the heaven, would be now the hell for women."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A state of bliss; a peaceful ecstasy.",
                  "examples": [
                    "Husbandes are in heauen...whose wiues scold not."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with a modifier) Similarly blissful afterlives, places, or states for particular people, animals, or objects.",
                  "examples": [
                    "Perhaps it has gone to the dog heaven, and is wagging somewhere in glory."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "heaven (third-person singular simple present heavens, present participle heavening, simple past and past participle heavened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To transport to the abode of God, the gods, or the blessed.",
                  "examples": [
                    "He heauens himselfe on earth, & for a litle pelfe cousens himselfe of blisse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To beatify, enchant, or please greatly.",
                  "examples": [
                    "They [Byron's Tales]...enraptured the public and heavened Murray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To beautify, to make into a paradise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}