{
  "word": "bathe",
  "etymologies": [
    {
      "description": [
        "From Middle English bathen, from Old English baþian (“to bathe, wash”), from Proto-West Germanic *baþōn, from Proto-Germanic *baþōną (“to bathe”), from Proto-Indo-European *bʰeh₁- (“to warm”). Cognate with Saterland Frisian boadje (“to bathe”), Dutch baden (“to bathe”), German Low German baden (“to bathe”), German baden (“to bathe”), Danish bade (“to bathe”), Swedish bada (“to bathe”), Icelandic baða (“to bathe”). More at bath. Compare also bask."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bathe (plural bathes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, colloquial) The act of swimming or bathing, especially in the sea, a lake, or a river; a swimming bath.",
                  "examples": [
                    "I'm going to have a midnight bathe tonight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bathe (third-person singular simple present bathes, present participle bathing, simple past and past participle bathed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To clean oneself by immersion in water or using water; to take a bath, have a bath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To immerse oneself, or part of the body, in water for pleasure or refreshment; to swim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean a person by immersion in water or using water; to give someone a bath.",
                  "examples": [
                    "We bathe our baby before going to bed; other parents do it in the morning if they have time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply water or other liquid to; to suffuse or cover with liquid.",
                  "examples": [
                    "She bathed her eyes with liquid to remove the stinging chemical.",
                    "The nurse bathed his wound with a sponge.",
                    "The incoming tides bathed the coral reef."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive and intransitive) To cover or surround.",
                  "examples": [
                    "The room was bathed in moonlight.",
                    "A dense fog bathed the city streets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To sunbathe.",
                  "examples": [
                    "The women bathed in the sun."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}