{
  "word": "plough",
  "etymologies": [
    {
      "description": [
        "From Middle English plouh, plow, plugh(e), plough(e), plouw, from Old English plōh (“hide of land, ploughland”) and Old Norse plógr (“plough (the implement)”), both from Proto-Germanic *plōgaz, *plōguz (“plough”). Cognate with Scots pleuch, plou, North Frisian plog, West Frisian ploech, Low German Ploog, Dutch ploeg, Russian ploog, German Pflug, Danish plov, Swedish and Norwegian plog, Icelandic plógur. Replaced Old English sulh (“plough, furrow”); see sullow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plough (plural ploughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device pulled through the ground in order to break it open into furrows for planting.",
                  "examples": [
                    "Synonym: sull",
                    "Hyponyms: ard, light plough, scratch plough, carruca, heavy plough, mouldboard plough, turnplough",
                    "The horse-drawn plough had a tremendous impact on agriculture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The use of a plough; tillage.",
                  "examples": [
                    "If you get it early ploughed and it lies all winter possibly, you find it an advantage to give it a second plough; but it does not invariably follow that we plough twice for our green crop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of Plough (Synonym of Ursa Major)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of ploughland, an alternative name for a carucate or hide.",
                  "examples": [
                    "Synonym: carucate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A joiner's plane for making grooves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bookbinder's implement for trimming or shaving off the edges of books.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(yoga) A yoga pose resembling a traditional plough, halāsana.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plough (third-person singular simple present ploughs, present participle ploughing, simple past and past participle ploughed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use a plough on soil to prepare for planting.",
                  "examples": [
                    "I've still got to plough that field."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use a plough.",
                  "examples": [
                    "Some days I have to plough from sunrise to sunset."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move with force.",
                  "examples": [
                    "Trucks ploughed through the water to ferry flood victims to safety."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furrow; to make furrows, grooves, or ridges in.",
                  "examples": [
                    "Synonyms: chamfer, groove, rut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To run through, as in sailing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bookbinding) To trim, or shave off the edges of, as a book or paper, with a plough.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(joinery) To cut a groove in, as in a plank, or the edge of a board; especially, a rectangular groove to receive the end of a shelf or tread, the edge of a panel, a tongue, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, university slang, transitive) To fail (a student).",
                  "examples": [
                    "Synonyms: flunk, pluck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, vulgar) To have sex with, penetrate.",
                  "examples": [
                    "Synonyms: get up in, pound, sleep with; see also Thesaurus:copulate with"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}