{
  "word": "white",
  "etymologies": [
    {
      "description": [
        "From Middle English whit, hwit, from Old English hwīt, from Proto-West Germanic *hwīt, from Proto-Germanic *hwītaz, from Proto-Indo-European *ḱweydós, a byform of *ḱweytós (“bright; shine”).",
        "See also West Frisian wyt, Dutch wit, German weiß, Norwegian Bokmål hvit, Norwegian Nynorsk kvit; also Lithuanian šviẽsti (“to gleam”), šviesa (“light”), Old Church Slavonic свѣтъ (světŭ, “light”), свѣтьлъ (světĭlŭ, “clear, bright”), Persian سفید‎ (sefid), Avestan 𐬯𐬞𐬀𐬉𐬙𐬀‎ (spaēta, “white”), Sanskrit श्वेत (śvetá, “white, bright”)."
      ],
      "adjectives": [
        {
          "description": "white (comparative whiter or more white, superlative whitest or most white)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bright and colourless; reflecting equal quantities of all frequencies of visible light.",
                  "examples": [
                    "Antonyms: black, nonwhite, unwhite",
                    "Write in black ink on white paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes capitalized) Of or relating to Caucasians, people of European descent with light-coloured skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly historical) Designated for use by Caucasians.",
                  "examples": [
                    "white drinking fountain",
                    "white hospital"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relatively light or pale in colour.",
                  "examples": [
                    "white wine",
                    "white grapes",
                    "white birch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pale or pallid, as from fear, illness, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person or skin) Lacking coloration (tan) from ultraviolet light; not tanned.",
                  "examples": [
                    "Synonyms: fair, pale",
                    "Antonym: tanned"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of an animal) Affected by leucism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of coffee or tea) Containing cream, milk, or creamer.",
                  "examples": [
                    "Antonym: black"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(board games, chess) The standard denomination of the playing pieces of a board game deemed to belong to the white set, no matter what the actual colour.",
                  "examples": [
                    "The white pieces in this set are in fact made of light green glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to an ecclesiastical order whose adherents dress in white habits; Cistercian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Honourable, fair; decent.",
                  "examples": [
                    "He's a fine fellow, this Gabriel Stanton, a white man all through"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Grey, as from old age; having silvery hair; hoary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Characterized by freedom from that which disturbs, and the like; fortunate; happy; favourable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Regarded with especial favour; favourite; darling.",
                  "examples": [
                    "I am his white boy, and will not be gulled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Pertaining to constitutional or anti-revolutionary political parties or movements.",
                  "examples": [
                    "Aimée de Coigny had always adopted with enthusiasm the political views of her ruling lover and she had thus already held nearly every shade of opinion from red republicanism to white reaction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of tea) Made from immature leaves and shoots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) Not containing characters; see white space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) Said of a symbol or character outline, not solid, not filled with color. Compare black (“said of a character or symbol filled with color”).",
                  "examples": [
                    "Compare two Unicode symbols: ☞ = \"WHITE RIGHT POINTING INDEX\"; ☛ = \"BLACK RIGHT POINTING INDEX\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterised by the presence of snow.",
                  "examples": [
                    "a white Christmas",
                    "a white Easter"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a set of armor) Alwhite, pertaining to white armor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "white (countable and uncountable, plural whites)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The color/colour of snow or milk; the colour of light containing equal amounts of all visible wavelengths.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person of European descent with light-coloured skin.",
                  "examples": [
                    "Synonyms: see Thesaurus:white person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any butterfly of the subfamily  Pierinae in the family Pieridae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) White wine.",
                  "examples": [
                    "Those were my first impressions of wine: Ladies drink chilled, soft white while they gossip in the kitchen; old men drink strong, room-temperature red to get shellacked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) White coffee",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) Any object or substance that is of the color white.",
              "entries": [
                {
                  "meaning": "The albumen of bird eggs (egg white).",
                  "examples": []
                },
                {
                  "meaning": "(anatomy) The sclera, white of the eye.",
                  "examples": []
                },
                {
                  "meaning": "(sports, billiards, snooker, pool) The cue ball in cue games.",
                  "examples": []
                },
                {
                  "meaning": "(slang, US, UK) Cocaine",
                  "examples": []
                },
                {
                  "meaning": "The snow- or ice-covered \"green\" in snow golf.",
                  "examples": []
                },
                {
                  "meaning": "A white pigment.",
                  "examples": [
                    "Venice white"
                  ]
                },
                {
                  "meaning": "A white bean",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery) The central part of the butt, which was formerly painted white; the centre of a mark at which a missile is shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The enclosed part of a letter of the alphabet, especially when handwritten.",
                  "examples": [
                    "Also it giueth a great grace to your writing, if the whites of certeine letters bee made of one equall bignesse with the o. supposing the same were all round, as the white of the b. of the a. p. y. v. w. x. q. d. g. and s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feather, from the wing of the cock ostrich, that is of the palest possible shade.",
                  "examples": [
                    "Synonym: prime"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "white (third-person singular simple present whites, present participle whiting, simple past and past participle whited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make white; to whiten; to bleach.",
                  "examples": [
                    "Woe unto you, scribes and Pharisees, hypocrites! for ye are like unto whited sepulchres, which indeed appear beautiful outward, but are within full of dead men's bones, and of all uncleanness."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}