{
  "word": "ban",
  "etymologies": [
    {
      "description": [
        "From Middle English bannen (“to summon; to banish; to curse”), partly from Old English bannan (“to summon, command, proclaim, call out”) and partly from Old Norse banna (“to prohibit; to curse”), both from Proto-Germanic *bannaną (“to proclaim, to order; to summon; to ban; to curse, forbid”), from Proto-Indo-European *bʰh₂-new-ti ~ bʰh₂-n̥w-énti, innovative nasal-infixed zero-grade athematic present of *bʰeh₂- (“to say”).",
        "Cognate with Dutch bannen (“to ban, exile, discard”), German bannen (“to exile, to exorcise, captivate, excommunicate”), Swedish banna (“to ban, scold”), Vedic Sanskrit भनति (bhánati), Armenian բան (ban) and perhaps Albanian banoj (“to reside, dwell”). See also banal, abandon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ban (plural bans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Prohibition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A public proclamation or edict; a summons by public proclamation. Chiefly, in early use, a summons to arms.",
                  "examples": [
                    "Bans is common and ordinary amongst the Feudists, and signifies a proclamation, or any public notice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The gathering of the (French) king's vassals for war; the whole body of vassals so assembled, or liable to be summoned; originally, the same as arrière-ban: in the 16th c., French usage created a distinction between ban and arrière-ban, for which see the latter word.",
                  "examples": [
                    "He has sent abroad to assemble his ban and arriere ban.",
                    "The Ban and the Arrierban are met armed in the field to choose a king.",
                    "France was at such a Pinch..that they call'd their Ban and Arriere Ban, the assembling whereof had been long discussed, and in a manner antiquated.",
                    "The ban was sometimes convoked, that is, the possessors of the fiefs were called upon for military services.",
                    "The act of calling together the vassals in armed array, was entitled ‘convoking the ban."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A curse or anathema.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pecuniary mulct or penalty laid upon a delinquent for offending against a ban, such as a mulct paid to a bishop by one guilty of sacrilege or other crimes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ban (third-person singular simple present bans, present participle banning, simple past and past participle banned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To summon; to call out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To anathematize; to pronounce an ecclesiastical curse upon; to place under a ban.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To curse; to execrate.",
                  "examples": [
                    "They will curse and ban […] even into the deep pit of hell, all that gainsay their appetite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prohibit; to interdict; to proscribe; to forbid or block from participation.",
                  "examples": [
                    "To whom the goodly earth and air Are banned"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To curse; to utter curses or maledictions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Romanian ban of uncertain origin, perhaps from Serbo-Croatian bân."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ban (plural bani)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subdivision of currency, equal to one hundredth of a Romanian leu.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A subdivision of currency, equal to one hundredth of a Moldovan leu.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Banburismus; coined by Alan Turing."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ban (plural bans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit measuring information or entropy based on base-ten logarithms, rather than the base-two logarithms that define the bit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From South Slavic (compare Serbo-Croatian bȃn), from Proto-Slavic *banъ; see there for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ban (plural bans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A title used in several states in central and south-eastern Europe between the 7th century and the 20th century.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}