{
  "word": "be",
  "etymologies": [
    {
      "description": [
        "From Middle English been (“to be”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "be (highly irregular; see conjugation table)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now usually literary) To exist; to have real existence, to be alive.",
                  "examples": [
                    "The Universe has no explanation: it just is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with there, or dialectally it, as dummy subject) To exist.",
                  "examples": [
                    "\"There has been lots of commentary on who is staying and who is staying out and this weekend will be the real test,\" said one senior media buying agency executive who has pulled the advertising for one major client."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To occupy a place.",
                  "examples": [
                    "The cup is on the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To occur, to take place.",
                  "examples": [
                    "When will the meeting be?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, in perfect tenses) Elliptical form of \"be here\", \"go to and return from\" or similar, also extending to certain other senses of \"go\".",
                  "examples": [
                    "The postman has been today, but my tickets have still not yet come.",
                    "I have been to Spain many times.",
                    "We've been about twenty miles.",
                    "I have terrible constipation – I haven't been for several days.",
                    "They have been through a great deal of trouble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to indicate that the subject and object are the same.",
                  "examples": [
                    "Knowledge is bliss.",
                    "Hi, I’m Jim."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative, mathematics) Used to indicate that the values on either side of an equation are the same.",
                  "examples": [
                    "3 times 5 is fifteen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to indicate that the subject is an instance of the predicate nominal.",
                  "examples": [
                    "A dog is an animal.",
                    "Dogs are animals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to indicate that the subject plays the role of the predicate nominal.",
                  "examples": [
                    "François Mitterrand was president of France from 1981 to 1995."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to indicate that the subject has the qualities described by an adjective.",
                  "examples": [
                    "The sky is blue.",
                    "Father, if thou be willing, remove this cup from me: nevertheless not my will, but thine, be done. (Luke 22:42)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to indicate that the subject has the qualities described by a noun or noun phrase.",
                  "examples": [
                    "The sky is a deep blue today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Used to form the passive voice.",
                  "examples": [
                    "The dog was saved by the boy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Used to form the continuous aspect.",
                  "examples": [
                    "The woman is walking.",
                    "I shall be writing to you soon.",
                    "We liked to chat while we were eating."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary) Used to form the perfect aspect with certain intransitive verbs; this was more common in archaic use, especially with verbs indicating motion. \"He is finished\", and \"He is gone\" are common, but \"He is come\" is archaic.",
                  "examples": [
                    "‘I wish that he were come to me, / For he will come,’ she said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal, auxiliary) Used to express future action as well as what is due to, intended to, or should happen.",
                  "examples": [
                    "They are to be married next month.",
                    "They are to stay here until I return.",
                    "They are not to be blamed.",
                    "How are they to get out of this mess?",
                    "I am to leave tomorrow.",
                    "I would drive you, were I to obtain a car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) Used to link a subject to a measurement.",
                  "examples": [
                    "This building is three hundred years old.",
                    "I am 75 kilograms.",
                    "He’s about 6 feet tall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative, with a cardinal numeral) Used to state the age of a subject in years.",
                  "examples": [
                    "I’m 20 (years old)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with a dummy subject it) Used to indicate the time of day.",
                  "examples": [
                    "It is almost eight (o’clock).",
                    "It’s 8:30 [read eight-thirty] in Tokyo.",
                    "What time is it there? It’s night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(With since) Used to indicate passage of time since the occurrence of an event.",
                  "examples": [
                    "It has been three years since my grandmother died. (similar to \"My grandmother died three years ago\", but emphasizes the intervening period)",
                    "It had been six days since his departure, when I received a letter from him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare and regional, chiefly in the past tense) Used to link two noun clauses, the first of which is a day of the week, recurring date, month, or other specific time (on which the event of the main clause took place), and the second of which is a period of time indicating how long ago that day was. [from 15th c.]",
                  "examples": [
                    "I saw her Monday was a week: I saw her a week ago last Monday (a week before last Monday).",
                    "On the morning of Sunday was fortnight before Christmas: on the morning of the Sunday that was two weeks before the Sunday prior to Christmas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often impersonal, with it as a dummy subject) Used to indicate weather, air quality, or the like.",
                  "examples": [
                    "It is hot in Arizona, but it is not usually humid.",
                    "Why is it so dark in here?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dynamic / lexical \"be\", especially in progressive tenses, conjugated non-suppletively in the present tense, see usage notes) To exist or behave in a certain way.",
                  "examples": [
                    "\"When I get sad, I stop being sad and be awesome instead.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, Caribbean, auxiliary, not conjugated) To tend to do, often do; marks the habitual aspect.",
                  "examples": [
                    "Women be shoppin’! You cannot stop a woman from shoppin’!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of by which goes back to Middle English be (variant of Middle English bi)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [
        {
          "description": "be",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, possibly dated) Alternative form of by. Also found in compounds, especially oaths, e.g. begorra.",
                  "examples": [
                    "O ful tru un pertikler akeawnt o... th' greyt Eggshibishun. Be o felley fro Rachde."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Russian бэ (bɛ)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "be (plural bes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The name of the Cyrillic script letter Б / б.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}