{
  "word": "pack",
  "etymologies": [
    {
      "description": [
        "From Middle English pak, pakke, from Old English *pæcca and/or Middle Dutch pak, packe; both ultimately from Proto-West Germanic *pakkō, from Proto-Germanic *pakkô (“bundle, pack”). Cognate with Dutch pak (“pack”), Low German Pack (“pack”), German Pack (“pack”), Swedish packe (“pack”), Icelandic pakka, pakki (“package”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pack (plural packs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bundle made up and prepared to be carried; especially, a bundle to be carried on the back, but also a load for an animal, a bale.",
                  "examples": [
                    "The horses carried the packs across the plain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number or quantity equal to the contents of a pack",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A multitude.",
                  "examples": [
                    "a pack of lies",
                    "a pack of complaints"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number or quantity of connected or similar things; a collective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A full set of playing cards",
                  "examples": [
                    "We were going to play cards, but nobody brought a pack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The assortment of playing cards used in a particular game.",
                  "examples": [
                    "cut the pack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of hounds or dogs, hunting or kept together.",
                  "examples": [
                    "African wild dogs hunt by sight, although stragglers use their noses to follow the pack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wolfpack: a number of wolves, hunting together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flock of knots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people associated or leagued in a bad design or practice; a gang.",
                  "examples": [
                    "a pack of thieves"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of Cub Scouts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shook of cask staves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bundle of sheet iron plates for rolling simultaneously.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large area of floating pieces of ice driven together more or less closely.",
                  "examples": [
                    "The ship had to sail round the pack of ice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An envelope, or wrapping, of sheets used in hydropathic practice, called dry pack, wet pack, cold pack, etc., according to the method of treatment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A loose, lewd, or worthless person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, pool) A tight group of object balls in cue sports. Usually the reds in snooker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) The forwards in a rugby team (eight in Rugby Union, six in Rugby League) who with the opposing pack constitute the scrum.",
                  "examples": [
                    "The captain had to take a man out of the pack to replace the injured fullback."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roller derby) The largest group of blockers from both teams skating in close proximity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English pakken, from the noun (see above). Compare Middle Dutch packen (“to pack”), Middle Low German packen (“to pack”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pack (third-person singular simple present packs, present participle packing, simple past and past participle packed)",
          "definitionGroups": [
            {
              "group": "(physical) To put or bring things together in a limited or confined space, especially for storage or transport.",
              "entries": [
                {
                  "meaning": "(transitive) To make a pack of; to arrange closely and securely in a pack; hence, to place and arrange compactly as in a pack",
                  "examples": [
                    "to pack goods in a box;  to pack fish"
                  ]
                },
                {
                  "meaning": "(transitive) To fill in the manner of a pack, that is, compactly and securely, as for transportation; hence, to fill closely or to repletion; to stow away within; to cause to be full; to crowd into.",
                  "examples": [
                    "to pack a trunk;  the play, or the audience, packs the theater"
                  ]
                },
                {
                  "meaning": "(transitive) To wrap in a wet or dry sheet, within numerous coverings.",
                  "examples": [
                    "The doctor gave Kelly some sulfa pills and packed his arm in hot-water bags."
                  ]
                },
                {
                  "meaning": "(transitive) To make impervious, such as by filling or surrounding with suitable material, or to fit or adjust so as to move without allowing air, water, or steam inside.",
                  "examples": [
                    "to pack a joint;  to pack the piston of a steam engine;  pack someone's arm with ice."
                  ]
                },
                {
                  "meaning": "(intransitive) To make up packs, bales, or bundles; to stow articles securely for transportation.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To form a compact mass, especially in order for transportation.",
                  "examples": [
                    "the goods pack conveniently;  wet snow packs well"
                  ]
                },
                {
                  "meaning": "(intransitive, of animals) To gather together in flocks, herds, schools or similar groups of animals.",
                  "examples": [
                    "the grouse or the perch begin to pack"
                  ]
                },
                {
                  "meaning": "(transitive, historical) To combine (telegraph messages) in order to send them more cheaply as a single transmission.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) To cheat.",
              "entries": [
                {
                  "meaning": "(transitive, card games) To sort and arrange (the cards) in the pack to give oneself an unfair advantage",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To bring together or make up unfairly, in order to secure a certain result.",
                  "examples": [
                    "to pack a jury"
                  ]
                },
                {
                  "meaning": "(transitive) To contrive unfairly or fraudulently; to plot.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To put together for morally wrong purposes; to join in cahoots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To load with a pack",
                  "examples": [
                    "to pack a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) to load; to encumber.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move, send or carry.",
              "entries": [
                {
                  "meaning": "(transitive) To cause to go; to send away with baggage or belongings; especially, to send away peremptorily or suddenly; – sometimes with off. See pack off.",
                  "examples": [
                    "to pack a boy off to school"
                  ]
                },
                {
                  "meaning": "(transitive, US, chiefly Western US) To transport in a pack, or in the manner of a pack (on the backs of men or animals).",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To depart in haste; – generally with off or away.",
                  "examples": [
                    "Poor Stella must pack off to town."
                  ]
                },
                {
                  "meaning": "(transitive, slang) To carry weapons, especially firearms, on one's person.",
                  "examples": [
                    "packing heat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports, slang) To block a shot, especially in basketball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rugby, of the forwards in a rugby team) To play together cohesively, specially with reference to their technique in the scrum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, LGBT, of a drag king, trans man, etc.) To wear an object, such as a prosthetic penis, inside one’s trousers to appear more male or masculine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}