{
  "word": "overreach",
  "etymologies": [
    {
      "description": [
        "The verb is from Middle English overrechen (“to rise above; to extend beyond or over; to encroach; to catch, overtake; to reach; to obtain wrongfully (?); to take up (a book) to revise it”) [and other forms], equivalent to over- +‎ reach; the noun is derived from the verb or from the phrase to reach over."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "overreach (countable and uncountable, plural overreaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) An act of extending or reaching over, especially if too far or too much; overextension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(equestrianism) Of a horse: an act of striking the heel of a forefoot with the toe of a hindfoot; an injury caused by this action.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "overreach (third-person singular simple present overreaches, present participle overreaching, simple past and past participle overreached)",
          "definitionGroups": [
            {
              "group": "(transitive, intransitive) To reach above or beyond, especially to an excessive degree. [from 14th c.]",
              "entries": [
                {
                  "meaning": "(transitive, property law) To defeat or override a person's interest in property; (Britain, specifically) of a holder of the legal title of real property: by mortgaging or selling the legal title to a third party, to cause another person's equitable right in the property to be dissolved and to be replaced by an equitable right in the money received from the third party.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, figuratively) To do something beyond an appropriate limit, or beyond one's ability.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, reflexive, equestrianism) Of a horse: to strike the heel of a forefoot with the toe of a hindfoot. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, now rare) To deceive, to swindle.",
                  "examples": [
                    "Synonyms: cheat, defraud; see also Thesaurus:deceive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To sail on one tack farther than is necessary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To get the better of, especially by artifice or cunning; to outwit. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}