{
  "word": "kill",
  "etymologies": [
    {
      "description": [
        "From Middle English killen, kyllen, cüllen (“to strike, beat, cut”), of obscure origin.",
        "Compare also Middle Dutch killen, kellen (“to kill”), Middle Low German killen (“to ache strongly, cause one great pain”), Middle High German kellen (“to torment; torture”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kill (plural kills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of killing.",
                  "examples": [
                    "The assassin liked to make a clean kill, and thus favored small arms over explosives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, the death blow.",
                  "examples": [
                    "The hunter delivered the kill with a pistol shot to the head."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of killing; that which has been killed.",
                  "examples": [
                    "The fox dragged its kill back to its den."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) The grounding of the ball on the opponent's court, winning the rally.",
                  "examples": [
                    "As a senior in 1993, Turner had a kill percentage of 40.8, which was a school record at the time and the best in the SAC. Turner concluded her volleyball career with 1,349 kills, ranking fifth all-time at Catawba."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kill (third-person singular simple present kills, present participle killing, simple past and past participle killed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put to death; to extinguish the life of.",
                  "examples": [
                    "Smoking kills more people each year than alcohol and drugs combined."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To render inoperative.",
                  "examples": [
                    "He killed the engine and turned off the headlights, but remained in the car, waiting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To stop, cease, or render void; to terminate.",
                  "examples": [
                    "The editor decided to kill the story.",
                    "The news that a hurricane had destroyed our beach house killed our plans to sell it.",
                    "My computer wouldn't respond until I killed some of the running processes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, hyperbolic) To amaze, exceed, stun, or otherwise incapacitate.",
                  "examples": [
                    "That night, she was dressed to kill.",
                    "That joke always kills me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, hyperbolic) To cause great pain, discomfort, or distress to; to hurt.",
                  "examples": [
                    "These tight shoes are killing my feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To produce feelings of dissatisfaction or revulsion in.",
                  "examples": [
                    "It kills me to throw out three whole turkeys, but I can't get anyone to take them and they've already started to go bad.",
                    "It kills me to learn how many poor people are practically starving in this country while rich moguls spend such outrageous amounts on useless luxuries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use up or to waste.",
                  "examples": [
                    "I'm just doing this to kill time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, informal) To exert an overwhelming effect on.",
                  "examples": [
                    "Look at the amount of destruction to the enemy base. We pretty much killed their ability to retaliate anymore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, hyperbolic) To overpower, overwhelm, or defeat.",
                  "examples": [
                    "The team had absolutely killed their traditional rivals, and the local sports bars were raucous with celebrations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To force a company out of business.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal, hyperbolic) To produce intense pain.",
                  "examples": [
                    "You don't ever want to get rabies. The doctor will have to give you multiple shots and they really kill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, informal, hyperbolic, transitive) To punish severely.",
                  "examples": [
                    "My parents are going to kill me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To strike (a ball, etc.) with such force and placement as to make a shot that is impossible to defend against, usually winning a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To cause (a ball, etc.) to be out of play, resulting in a stoppage of gameplay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To succeed with an audience, especially in comedy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, transitive, informal) To cause to assume the value zero.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, Internet, IRC, transitive) To disconnect (a user) involuntarily from the network.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metallurgy) To deadmelt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To sexually penetrate in a skillful way.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, informal) To exert oneself to an excessive degree.",
                  "examples": [
                    "Don't kill yourself raking the leaves now; we're due for a windstorm tonight."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowing from Dutch kil, from Middle Dutch kille."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kill (plural kills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(north-east US) A creek; a body of water; a channel or arm of the sea.",
                  "examples": [
                    "The channel beyond Staten Island, which connects Newark Bay with Bergen Neck is the Kill van Kull, or the Kills.",
                    "Schuylkill, Catskill, etc."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kill (plural kills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Alternative form of kiln",
                  "examples": [
                    "Admonished that she should “keep the woman's virtue and be more silent,” she countered “that she was 'born in a mill, begot in a kill, she must have her will,' she could speak no softlier.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}