{
  "word": "gather",
  "etymologies": [
    {
      "description": [
        "From Middle English gaderen, from Old English gaderian (“to gather, assemble”), from Proto-West Germanic *gadurōn (“to bring together, unite, gather”), from Proto-Indo-European *gʰedʰ- (“to unite, assemble, keep”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gather (plural gathers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plait or fold in cloth, made by drawing a thread through it; a pucker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The inclination forward of the axle journals to keep the wheels from working outward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The soffit or under surface of the masonry required in gathering. See gather (transitive verb).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glassblowing) A blob of molten glass collected on the end of a blowpipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gathering.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gather (third-person singular simple present gathers, present participle gathering, simple past and past participle gathered)",
          "definitionGroups": [
            {
              "group": "To collect; normally separate things.",
              "entries": [
                {
                  "meaning": "Especially, to harvest food.",
                  "examples": [
                    "We went to gather some blackberries from the nearby lane."
                  ]
                },
                {
                  "meaning": "To accumulate over time, to amass little by little.",
                  "examples": [
                    "Over the years he'd gathered a considerable collection of mugs."
                  ]
                },
                {
                  "meaning": "(intransitive) To congregate, or assemble.",
                  "examples": [
                    "People gathered round as he began to tell his story."
                  ]
                },
                {
                  "meaning": "(intransitive) To grow gradually larger by accretion.",
                  "examples": [
                    "Their snow-ball did not gather as it went."
                  ]
                }
              ]
            },
            {
              "group": "To bring parts of a whole closer.",
              "entries": [
                {
                  "meaning": "(sewing) To add pleats or folds to a piece of cloth, normally to reduce its width.",
                  "examples": [
                    "A gown should be gathered around the top so that it will remain shaped."
                  ]
                },
                {
                  "meaning": "(knitting) To bring stitches closer together.",
                  "examples": [
                    "Be careful not to stretch or gather your knitting.",
                    "If you want to emphasise the shape, it is possible to gather the waistline."
                  ]
                },
                {
                  "meaning": "(architecture) To bring together, or nearer together, in masonry, as for example where the width of a fireplace is rapidly diminished to the width of the flue.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) To haul in; to take up.",
                  "examples": [
                    "to gather the slack of a rope"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To infer or conclude; to know from a different source.",
                  "examples": [
                    "From his silence, I gathered that things had not gone well.",
                    "I gather from Aunty May that you had a good day at the match."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, medicine, of a boil or sore) To be filled with pus",
                  "examples": [
                    "Salt water can help boils to gather and then burst."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(glassblowing) To collect molten glass on the end of a tool.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gain; to win.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}