{
  "word": "clown",
  "etymologies": [
    {
      "description": [
        "From earlier clowne, cloyne (“man of rustic or coarse manners, boor, peasant”), likely of North Germanic origin, akin to Icelandic klunni (“clumsy fellow, klutz”). Compare also North Frisian klönne (“clumsy fellow, klutz”), Dutch kluns (“clumsy fellow”). Unlikely from Latin colōnus (“colonist, farmer”), although learned awareness of this term may have influenced semantic development."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clown (plural clowns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slapstick performance artist often associated with a circus and usually characterized by bright, oversized clothing, a red nose, face paint, and a brightly colored wig.",
                  "examples": [
                    "Over there in Norway, the churches all burn down / Let's go dress in goth clothes and get painted like a clown"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who acts in a silly fashion.",
                  "examples": [
                    "He was regarded as the clown of the school, always playing pranks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stupid or badly-behaved person.",
                  "examples": [
                    "'Breaking my sister's heart then getting pissed with his mates in the very next pub while she's sobbing alone?' I dragged this clown away from the fruitie and back to Amy next door, running my mouth off at him as we went."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A man of coarse nature and manners; an awkward fellow; an illbred person; a boor.",
                  "examples": [
                    "[…]  three things ought always to be kept under: a mastiff dog, a stone horse and a clown; and really I think a snarling, cross-grained clown to be the most unlucky beast of three."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who works upon the soil; a rustic; a churl; a yokel.",
                  "examples": [
                    "The clown, the child of nature, without guile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A clownfish.",
                  "examples": [
                    "While the tomato clownfish Amphiprion frenatus has been spawned in captivity, wild-caught tomato clowns are more often seen for sale."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clown (third-person singular simple present clowns, present participle clowning, simple past and past participle clowned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act in a silly or playful fashion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, African-American Vernacular) To ridicule.",
                  "examples": [
                    "Synonym: clown on"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}