{
  "word": "purpose",
  "etymologies": [
    {
      "description": [
        "From Middle English purpos, from Old French purposer (“to propose”) (with conjugation altered based on poser), from Latin prō- (“forth”) + pōnere (“place, put”), hence Latin prōpōnō, prōpōnere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purpose (countable and uncountable, plural purposes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The end for which something is done, is made or exists.",
                  "examples": [
                    "What is the purpose of your visit?",
                    "My purpose in coming to Egypt was simply to take it en route to the desert.",
                    "It has been my purpose to illustrate rather than to explain.",
                    "The exceptionally small gate-leg table served the purpose of a tea table admirably.",
                    "The purpose of the device is to prevent the breechblock from opening accidentally should the gun be held barrel down.",
                    "The purpose of this letter is to set the record straight.",
                    "The purpose of this book is to study the interrelationship of government and religion.",
                    "The device can be used for both civilian and military purposes.",
                    "The purpose of turning off the lights overnight is to save energy.",
                    "Synonym: end"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Function, role.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Sense of having a) meaning for existing or doing something.",
                  "examples": [
                    "Synonym: meaning"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resolution; determination.",
                  "examples": [
                    "United began with more purpose in the early phase of the second half and Liverpool were grateful for Glen Johnson's crucial block from Young's goalbound shot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The subject of discourse; the point at issue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English purposen, from Old French purposer (“to propose”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "purpose (third-person singular simple present purposes, present participle purposing, simple past and past participle purposed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have or set as one's purpose or aim; resolve to accomplish; intend; plan.",
                  "examples": [
                    "Soo was Alysander purposed to ryde to london by the coūceille of sire Tristram to syre Launcelot /",
                    "\"So was Alisander purposed to ride to London, by the counsel of Sir Tristram, to Sir Launcelot.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have (an) intention, purpose, or design; to intend; to mean.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To discourse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}