{
  "word": "kludge",
  "etymologies": [
    {
      "description": [
        "Perhaps from British military slang, possibly based on a Scots word kludge or kludgie (“common toilet”), or perhaps from German klug (“clever”). Alternatively, possibly related to Polish klucz (“a key, a hint, a main point”) and Russian ключ (ključ, “key, clue”).",
        "Alternatively, perhaps from (a form related to) Germanic words such as Dutch Low Saxon klütje (“(little) dumpling, clod”), Dutch kluit(je) or Jutland Danish klyt (“piece of bad workmanship, klud(g)e”); compare and standard Danish kludder (“mess, disorder”). (Compare klutz.)",
        "There is evidence that kluge (which see) was once a separate word with similar meaning but separate derivation, but the spelling kludge was widely popularized in the US by a 1962 Datamation article on \"How to Design a Kludge\", and since then the two words have often been used as alternative spellings of each other.",
        "According to the OED, an \"invented word\" influenced by bodge and fudge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kludge (plural kludges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, electronics, engineering) An improvised device, typically crudely constructed to test the validity of a principle before doing a finished design.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any construction or practice, typically crude yet effective, designed to solve a problem temporarily or expediently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, computing) An amalgamated mass of unrelated parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, computing) A badly written or makeshift piece of software; a hack.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "kludge (third-person singular simple present kludges, present participle kludging, simple past and past participle kludged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To build or use a kludge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}