{
  "word": "pill",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pill (plural pills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(broadly) A small, usually round or cylindrical object designed for easy swallowing, usually containing some sort of medication.",
              "entries": [
                {
                  "meaning": "(strictly) Such an object that is of solid constitution (usually of compressed, bonded powder) rather than a capsule (with a shell containing loose powder or liquid).",
                  "examples": [
                    "Hyponyms: tablet, caplet, lozenge",
                    "Coordinate term: capsule"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, uncountable, definite, i.e. used with \"the\") Contraceptive medication, usually in the form of a pill to be taken by a woman; an oral contraceptive pill.",
                  "examples": [
                    "Jane went on the pill when she left for college.",
                    "She got pregnant one month after going off the pill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something offensive, unpleasant or nauseous which must be accepted or endured.",
                  "examples": [
                    "\"It's a sad unpalatable truth,\" said Mr. Pembroke, thinking that the despondency might be personal, \"but one must accept it. My sister and Gerald, I am thankful to say, have accepted it, so naturally it has been a little pill.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A contemptible, annoying, or unpleasant person.",
                  "examples": [
                    "Instead, I saw a woman in her mid-fifties, who was a real pill; while all the others had managed a decent “So pleased,” or even a plain “Hello,” Ginger just inclined her head, as if she was doing a Queen Mary imitation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A comical or entertaining person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textile) A small piece of any substance, for example a ball of fibres formed on the surface of a textile fabric by rubbing. Colloquially known as a bobble, fuzzball, or lint ball.",
                  "examples": [
                    "One sleeve, threadbare and loaded with what my mother called “sweater pills,” hung halfway to the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, baseball slang) A baseball.",
                  "examples": [
                    "\"Strike two!\" bawled the umpire. I threw the pill back to Tom with a heart which drummed above the noise of the rooters along the side lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms, slang) A bullet (projectile).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface) A rounded rectangle indicating the tag or category that an item belongs to.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pill (third-person singular simple present pills, present participle pilling, simple past and past participle pilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, textiles) Of a woven fabric surface, to form small matted balls of fiber.",
                  "examples": [
                    "During processing, inferior short fibers (which can cause pilling and itching) are removed to enhance the natural softness of the yarn and to improve its wash-and-wear performance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form into the shape of a pill.",
                  "examples": [
                    "Pilling is a skill rarely used by modern pharmacists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To medicate with pills.",
                  "examples": [
                    "She pills herself with all sorts of herbal medicines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Internet slang) To persuade or convince someone of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, slang, dated) To blackball (a potential club member).",
                  "examples": [
                    "“I pilled him because he is a liar,” said Thackeray. “He calls himself 'ill' when he isn't.”"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Latin pilō (“depilate”), from pilus (“hair”). Doublet of peel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pill (plural pills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The peel or skin.",
                  "examples": [
                    "To make Sallet of Lemon pill, or green Citron. You must have your Lemon Pill preserved very green, Rasp it into a Dish, and raise it up lightly with a Fork  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pill (third-person singular simple present pills, present participle pilling, simple past and past participle pilled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To peel; to remove the outer layer of hair, skin, or bark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To peel; to make by removing the skin.",
                  "examples": [
                    "[Jacob] pilled white streaks […] in the rods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be peeled; to peel off in flakes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To pillage; to despoil or impoverish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English *pill, *pyll, from Old English pyll (“a pool, pill”), from Proto-Germanic *pullijaz (“small pool, ditch, creek”), diminutive of Proto-Germanic *pullaz (“pool, stream”), from Proto-Indo-European *bl̥nos (“bog, marsh”). Cognate with Old English pull (“pool, creek”), Scots poll (“slow moving stream, creek, inlet”), Icelandic pollur (“pond, pool, puddle”). More at pool."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pill (plural pills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now UK regional) An inlet on the coast; a small tidal pool or bay.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}