{
  "word": "refit",
  "etymologies": [
    {
      "description": [
        "re- +‎ fit"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "refit (plural refits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The process of having something fitted again, repaired or restored.",
                  "examples": [
                    "The ship required a refit before setting out again."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "refit (third-person singular simple present refits, present participle refitting, simple past and past participle refitted or refit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit again; to put back into its place.",
                  "examples": [
                    "The truth is they made no great scruple, at least for that one time, to come under the Stern of their Neighbouring Common-wealth, thereby to have better leisure to recollect and refit the scattered planks and pieces of their own broken Republic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prepare for use again; to repair or restore.",
                  "examples": [
                    "to refit a garment; to refit ships of war"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fit out or supply again (with something).",
                  "examples": [
                    "For what can be more comfortable then to be asserted from the power of the grave, and rescued from death and mortality, to have our Soul refitted with Organs, and all the bodily powers awakened again so as to lose nothing by our fall;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To prepare a vessel for use again (e.g. by replenishing depleted supplies or doing maintenance or repair work); (of a vessel) to be prepared for use again.",
                  "examples": [
                    "[…]  I discovered two Gallies making towards Nicita, whom I saluted with two Cannons, which I levelled and fired my self, so happily, that one of them being shot through between wind and water, was fain to go off to refit, and the other had three or four slaves killed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}