{
  "word": "surfeit",
  "etymologies": [
    {
      "description": [
        "From Middle English surfeite, surfet, a borrowing from Anglo-Norman surfet, surfeit and Old French sorfet, sorfait, past participle of surfaire (“to augment, exaggerate, exceed”), from sur- (“over”) + faire (“to do”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "surfeit (countable and uncountable, plural surfeits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An excessive amount of something.",
                  "examples": [
                    "A surfeit of wheat is driving down the price."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Overindulgence in either food or drink; overeating.",
                  "examples": [
                    "Now comes the sick hour that his surfeit made."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A sickness or condition caused by overindulgence.",
                  "examples": [
                    "King Henry I is said to have died of a surfeit of lampreys."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Disgust caused by excess; satiety.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A group of skunks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "surfeit (third-person singular simple present surfeits, present participle surfeiting, simple past and past participle surfeited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill (something) to excess.",
                  "examples": [
                    "Synonym: stuff"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feed (someone) to excess (on, upon or with something).",
                  "examples": [
                    "Synonyms: glut, overfeed, stuff",
                    "She surfeited her children on sweets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (someone) sick as a result of overconsumption.",
                  "examples": [
                    "[…]  that proportion of meat surfetteth, and surchargeth the stomacks of some, which is not enough to satisfie the hunger of others,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To supply (someone) with something to excess; to disgust (someone) through overabundance.",
                  "examples": [
                    "Synonyms: cloy, glut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To satisfy (someone's appetite) to excess (both literally and figuratively).",
                  "examples": [
                    "Synonym: glut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive) To overeat or feed to excess (on or upon something).",
                  "examples": [
                    "Synonyms: glut, indulge, overfeed, overindulge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive, figurative) To indulge (in something) to excess.",
                  "examples": [
                    "After surfeiting itself with the Feast here provided for it, the Eye, by using a little Exercise in travelling about the Country, grows hungry again, and returns to the Entertainment with fresh Appetite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive) To become sick from overindulgence (both literally and figuratively).",
                  "examples": [
                    "But are children to be allowed to surfeit themselves? Shall they be suffered to take their fill of dainties and make themselves ill, as they certainly will do?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}