{
  "word": "rax",
  "etymologies": [
    {
      "description": [
        "From Middle English raxen, rasken (“to stretch oneself”), from Old English raxan, racsan (“to stretch oneself after sleep”), probably alteration, with formative s, of Old English rǣċan, ræċċan, reċċan (“to stretch, extend”), from Proto-Germanic *rakjaną (“to stretch”), from Proto-Indo-European *reǵ- (“to make straight”). Related to Dutch rekken (“to stretch”), German recken (“to stretch”), Swedish räcka (“to suffice, reach, pass, last”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rax (third-person singular simple present raxes, present participle raxing, simple past and past participle raxed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, Northern England, Scotland, transitive) To stretch; stretch out.",
                  "examples": [
                    "Shoeless, he stood naked on his toes, his arms raxed upwards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, Northern England, Scotland, transitive) To reach out; reach or attain to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, Northern England, Scotland, transitive) To extend the hand to; hand or pass something.",
                  "examples": [
                    "Please rax me the pitcher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, Northern England, Scotland, intransitive) To perform the act of reaching or stretching; stretch oneself; reach for or try to obtain something",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, chiefly Scotland, intransitive) To stretch after sleep.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening of barracks."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rax (plural rax or raxes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video game slang) barracks",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}