{
  "word": "pernoctation",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Late Latin pernoctātiō (“act of spending of the night (doing something, particularly praying)”) + English -ion (suffix forming nouns indicating an action or process, or the result of an action or process). Pernoctātiō is derived from Latin pernoctātus (“having spent the night”) + -iō (suffix forming abstract nouns from verbs); pernoctātus is the perfect passive participle of pernoctō (“to spend the night”), from per- (prefix with the sense of completion or entirety forming verbs) + nox (“night; darkness”) (ultimately from Proto-Indo-European *nókʷts (“night; evening (?)”), possibly from *negʷ- (“bare, naked”) in the sense of becoming bare of sunlight)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pernoctation (countable and uncountable, plural pernoctations) (formal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The action of abiding through the night at a location; (countable) an instance of this; an overnight stay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The action of walking about at night, especially as a vigil or watch; (countable) an instance of this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, religion, chiefly Christianity, obsolete) A religious watch kept during normal sleeping hours, during which prayers or other ceremonies are performed; a vigil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}