{
  "word": "environ",
  "etymologies": [
    {
      "description": [
        "The adverb is derived from Middle English enviroun (“round about in a circle or ring; all around”) [and other forms], from Anglo-Norman enviroun, environ [and other forms], and Middle French enviroun, environ [and other forms], from Old French environ (“around, surrounding; about, approximately, roughly”) (modern French environ), from en- (prefix meaning ‘in; into’) + viron (“circuit; circumference, compass; country round about”) (though first attested later) (from virer (“to bear, turn, veer”) (either from Latin gȳrō (“to turn in a circle, rotate; to circle, revolve around”) (ultimately from Proto-Indo-European *gew- (“to bend, curve; an arch, vault”)), or from Latin vibrō (“to hurl, launch; shake; to tremble, vibrate”) (ultimately from Proto-Indo-European *weyb-, *weyp- (“to shake; to tremble; to sway, swing; to rotate, turn, wind, wrap (around)”))) + -on (augmentative suffix)).",
        "The preposition is derived from Middle English enviroun (“around the outside or perimeter of; all around; about or throughout the extent of”), which is from the adverb."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "environ (not comparable) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the neighbourhood; around.",
                  "examples": [
                    "Synonyms: round, round about"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Almost, nearly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English envirounen, enviroun (“to surround in a circle or ring, or on the perimeter; to beset, besiege; to cover, enclose, envelop; to provide a setting or surrounding to; to move in a circle; to move around the perimeter; to go, move, or wander about (a place); to fill or pervade (a place); to run all the way through”) [and other forms], from Anglo-Norman envirouner [and other forms], Middle French environner, and Old French environner (“to arrange in a circle; to circumnavigate, travel around; to traverse, wander around; to encircle, encompass, surround”) [and other forms] (modern French environner), from environ (adverb) (see etymology 1) + -er (suffix forming verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "environ (third-person singular simple present environs, present participle environing, simple past and past participle environed) (transitive)",
          "definitionGroups": [
            {
              "group": "To encircle or surround (someone or something).",
              "entries": [
                {
                  "meaning": "(often military) To encircle or surround (someone or something) so as to attack from all sides; to beset.",
                  "examples": [
                    "Synonyms: beleaguer, besiege"
                  ]
                },
                {
                  "meaning": "(heraldry, chiefly passive, obsolete) To encircle or surround (a heraldic element such as a charge or escutcheon (shield)).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover, enclose, or envelop (someone or something).",
                  "examples": [
                    "Synonym: (obsolete) belay"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Followed by from: to hide or shield (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly passive) Of a person: to be positioned or stationed around (someone or something) to attend to or protect them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Of a situation or state of affairs, especially danger or trouble: to happen to and affect (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "To amount to or encompass (a space).",
                  "examples": []
                },
                {
                  "meaning": "To travel completely around (a place or thing); to circumnavigate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English invyroun, Middle English enuyroun, enuyrown, from Anglo-Norman enviroun, environ, envirun, and Middle French environ (“circumference; surroundings; (in the plural) boundaries, frontiers”) (chiefly in the plural) (modern French environ), a noun use of Old French environ (adverb): see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "environ (plural environs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic except in the plural, formal, also figuratively) A surrounding area or place (especially of an urban settlement); an environment.",
                  "examples": [
                    "Naples and its environs"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}