{
  "word": "innocent",
  "etymologies": [
    {
      "description": [
        "From Middle English innocent, from Old French inocent, borrowed from Latin innocens (“harmless, inoffensive”), from in- (“not”) + nocēns, present participle of noceō (“to hurt”). Displaced native Old English unsċyldiġ."
      ],
      "adjectives": [
        {
          "description": "innocent (comparative more innocent, superlative most innocent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from guilt, sin, or immorality.",
                  "examples": [
                    "I'm sure there's an innocent explanation for all this.",
                    "The situation certainly looked bad, but it turned out that everything was innocent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bearing no legal responsibility for a wrongful act.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without wrongful intent; accidental or in good faith.",
                  "examples": [
                    "He didn't mean anything by it; it was an innocent mistake.",
                    "The child's innocent question revealed the embarrassing truth in front of everyone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Naive; artless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except medicine) Not harmful; innocuous; harmless; benign.",
                  "examples": [
                    "Although an innocent murmur is not an obstacle to participation in sports and exercise, a pathologic murmur may necessitate restrictions on the child's physical activity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with of) Lacking (something), or knowledge of it.",
                  "examples": [
                    "Her only slight comfort is that they are not as bad as the new litter of Awful children who resulted from this marriage, Lisa, Adam, Jason, and Kristen. By all reports, they are entirely innocent of manners of any kind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lawful; permitted.",
                  "examples": [
                    "an innocent trade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not contraband; not subject to forfeiture.",
                  "examples": [
                    "innocent goods carried to a belligerent nation"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "innocent (plural innocents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is innocent, especially a young child.",
                  "examples": [
                    "The slaughter of the innocents was a significant event in the New Testament."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A harmless simple-minded person; an idiot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}