{
  "word": "tool",
  "etymologies": [
    {
      "description": [
        "From Middle English tool, tol, from Old English tōl (“tool, implement, instrument”, literally “that with which one prepares something”), from Proto-West Germanic *tōl, from Proto-Germanic *tōlą (“that which is used in preparation, tool”), from Proto-Indo-European *dewh₂- (“to tie to, secure”), equivalent to taw (“to prepare”) +‎ -le (agent suffix). Cognate with Scots tuil (“tool, implement, instrument, device”), Icelandic tól (“tool”), Faroese tól (“tool, instrument”). Related to Old English tāwian (“to make, prepare, or cultivate”); see taw, and tow (\"fibres used for spinning\")."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tool (plural tools)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical device intended to make a task easier.",
                  "examples": [
                    "Hand me that tool, would you?",
                    "I don't have the right tools to start fiddling around with the engine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any piece of equipment used in a profession, e.g. a craftman's tools.",
                  "examples": [
                    "These are the tools of the trade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something to perform an operation; an instrument; a means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A piece of software used to develop software or hardware, or to perform low-level operations.",
                  "examples": [
                    "The software engineer had been developing lots of EDA tools.",
                    "a tool for recovering deleted files from a disk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or group which is used or controlled, usually unwittingly, by another person or group.",
                  "examples": [
                    "He was a tool, no more than a pawn to her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, vulgar, slang, derogatory) An obnoxious or uptight person.",
                  "examples": [
                    "He won't sell us tickets because it's 3:01, and they went off sale at 3. That guy's such a tool."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) A penis, notably with a sexual or erotic connotation.",
                  "examples": [
                    "Synonyms: see Thesaurus:penis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Canada, US, MTE, MLE, and possibly wider) A gun.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tool (third-person singular simple present tools, present participle tooling, simple past and past participle tooled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work on or shape with tools, e.g., hand-tooled leather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip with tools.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To work very hard.",
                  "examples": [
                    "Do this lab and read this book, now tool, one and all,And be sure and pass that final quiz or be screwed right to the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To put down another person (possibly in a subtle, hidden way), and in that way to use him or her to meet a goal.",
                  "examples": [
                    "Dude, he's not your friend. He's just tooling you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, volleyball) To intentionally attack the ball so that it deflects off a blocker out of bounds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, slang, dated) To drive (a coach or other vehicle).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, slang, dated) To carry or convey in a coach or other vehicle.",
                  "examples": [
                    "Among those who seemed disposed to join in this opinion was the Jehu of the Warwickshire coach, who expressed his conviction to our hero, that \"he wos a young gent as had much himproved hisself since he tooled him up to the Warsity with his guvnor.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To travel in a vehicle; to ride or drive.",
                  "examples": [
                    "boys on their bicycles tooling along the well-kept roads"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}