{
  "word": "gleam",
  "etymologies": [
    {
      "description": [
        "From Middle English glem, gleam, gleme (“shaft of light; part of a comet’s tail; reflected sparkle; dawn; daylight; radiance (physical or spiritual); something fleeting”), from Old English glǣm (“gleam”), from Proto-Germanic *glaimiz (“brightness; splendour”), from Proto-Indo-European *ǵʰley- (“to shine”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gleam (countable and uncountable, plural gleams)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An appearance of light, especially one which is indistinct or small, or short-lived.",
                  "examples": [
                    "Synonym: (Britain, dialectal) leam"
                  ]
                }
              ]
            },
            {
              "group": "(countable, figuratively)",
              "entries": [
                {
                  "meaning": "An indistinct sign of something; a glimpse or hint.",
                  "examples": [
                    "Synonyms: flicker, glimmer, trace",
                    "The rescue workers preserved a gleam of optimism that the trapped miners might still survive."
                  ]
                },
                {
                  "meaning": "A bright, but intermittent or short-lived, appearance of something.",
                  "examples": []
                },
                {
                  "meaning": "A look of joy or liveliness on one's face.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "(countable) Sometimes as hot gleam: a warm ray of sunlight; also, a period of warm weather, for instance, between showers of rain.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) Brightness or shininess; radiance, splendour.",
                  "examples": [
                    "Synonyms: dazzle, lambency, shine"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English glemen (“to shine; to glance, look”) [and other forms], from glem, gleam (noun) (see etymology 1) + -en (suffix forming the infinitive of verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gleam (third-person singular simple present gleams, present participle gleaming, simple past and past participle gleamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Chiefly in conjunction with an adverb: to cause (light) to shine.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To shine, especially in an indistinct or intermittent manner; to glisten, to glitter.",
                  "examples": [
                    "Synonyms: glint, glow, (Britain, dialectal) leam, sparkle"
                  ]
                },
                {
                  "meaning": "(figuratively) To be strongly but briefly apparent.",
                  "examples": [
                    "Synonyms: flare, flash, kindle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of Middle English gleimen, gleym (“to smear; to make slimy or sticky; to fill up (the stomach); to nauseate; of a slimy or viscous substance: to be stuck together; (figuratively) to captivate, ensnare; to infect with heresy”) [and other forms], probably a blend of glet (“slimy or viscous matter produced by animals; mucus, phlegm; congestion of mucus or phlegm in the body; viscosity”), gleu (“substance used to stick things together, glue; viscous medicine made from plants”), etc. + Old Norse kleima (“to daub, smear”) (whence Old English clǣman (“to smear”)) (ultimately from Proto-Germanic *klaimijaną (“to smear with clay, to mortar”), from *klaimaz (“clay; mortar”), from Proto-Indo-European *gleh₁y- (“to glue, stick; to smear”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "gleam (third-person singular simple present gleams, present participle gleaming, simple past and past participle gleamed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, falconry, obsolete) Of a hawk or other bird of prey: to disgorge filth from its crop or gorge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}