{
  "word": "casualty",
  "etymologies": [
    {
      "description": [
        "From casual, from Middle French casuel, from Medieval Latin casualitas and Late Latin cāsuālis (“happening by chance”), from Latin cāsus (“event”) (English case), from cadere (“to fall”). Originally meaning “a chance event” (compare casual, as in “casual encounter”), it developed a negative meaning as “an unfortunate event”, especially the loss of a person."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "casualty (countable and uncountable, plural casualties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that happens by chance, especially an unfortunate event; an accident, a disaster.",
                  "examples": [
                    "The course of his education was like that of others, such as put him little in the way of extraordinary casualties."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person suffering from injuries or who has been killed due to an accident or through an act of violence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed) Specifically, a person who has been killed (not only injured) due to an accident or through an act of violence; a fatality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A person in military service who becomes unavailable for duty, for any reason (notably death, injury, illness, capture, or desertion).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) The accident and emergency department of a hospital providing immediate treatment; a casualty department or emergency room.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An incidental charge or payment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something adversely affected by a decision, event or situation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Chance nature; randomness.",
                  "examples": [
                    "The non-necessary [causes] follow; of which, saith Fuchsius, no art can be made, by reason of their uncertainty, casualty, and multitude  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}