{
  "word": "zebra",
  "etymologies": [
    {
      "description": [
        "1600; borrowed from Italian zebra, from Portuguese zebra, zebro (“zebra”), from Old Galician-Portuguese enzebro, ezebra, azebra (“wild ass”), from earlier cebrario (882), ezebrario (897), from Vulgar Latin *eciferus, from Latin equiferus (“wild horse”) (Pliny), from equus (“horse”) + ferus (“wild”).",
        "While the word was traditionally pronounced with a long vowel in the first syllable in standard English, during the twentieth century a vowel shift occurred in regions of England, with the shortening of the first vowel. This pronunciation is now used throughout the UK and most Commonwealth nations. The long-vowel pronunciation remains standard in Canadian and American English.",
        "(referee): In reference to the black and white striped shirts they wear."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "zebra (plural zebra or zebras)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of three species of subgenus Hippotigris: E. grevyi, E. quagga, or E. zebra, all with black and white stripes and native to Africa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, slang) A referee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, slang) An unlikely diagnosis, especially for symptoms probably caused by a common ailment. (Originates in the advice often given to medical students: \"when you hear hoofbeats, think of horses, not zebras\".)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, derogatory, slang, ethnic slur) A biracial person, specifically one born to a member of the Sub-Saharan African race and a Caucasian.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A fish, the zebra cichlid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various papilionid butterflies of the subgenus Paranticopsis of the genus Graphium, having black and white markings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A zebra crossing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}