{
  "word": "norther",
  "etymologies": [
    {
      "description": [
        "north +‎ -er"
      ],
      "adjectives": [
        {
          "description": "norther",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) comparative form of north: more north; northern",
                  "examples": [
                    "\"Northest\" of all",
                    "There is something about Scandinavia that leads those who live there to stress the \"northness\" of their position [...] This gentleman, it will be remembered, claimed to live \"norther\" than any other man. [...] he placed chief emphasis on the fact that no man lived norther than he."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "norther (plural northers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong north wind, a wind blowing from the north.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "norther (third-person singular simple present northers, present participle northering, simple past and past participle northered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move or go toward the north.",
                  "examples": [
                    "The hills  […]  run inland with a slight northering tendency."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of wind) To blow from (closer to) the north, pushing ships (etc) towards the south; to have its apparent source shift northward.",
                  "examples": [
                    "The 23 February 1667 Sunday. All the morning flat calm until after six. At the coming away of the ebb sprang up a small gale at W.N.W. and N.W. by W., that we stretched along the shore toward the Ness, S.W. course. The wind northered and came easterly, a small gale. We stayed for our boat until one, which we had sent to search 4 French shallops that assured lay there to lade wool."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}