{
  "word": "nook",
  "etymologies": [
    {
      "description": [
        "From Middle English noke, nok (“nook, corner, angle”), of uncertain origin. Cognate with Scots neuk, nuk (“corner, angle of a square, angular object”). Perhaps from Old English hnoc, hnocc (“hook, angle”), from Proto-Germanic *hnukkaz, *hnukkô (“a bend”), from Proto-Indo-European *knewg- (“to turn, press”), from Proto-Indo-European *ken- (“to pinch, press, bend”). If so, then also related to Scots nok (“small hook”), Norwegian dialectal nok, nokke (“hook, angle, bent object”), Danish nok (“hook”), Swedish nock (“ridge”), Faroese nokki (“crook”), Icelandic hnokki (“hook”), Dutch nok (“ridge”) or Dutch hoek (“corner”), Low German Nocke (“tip”), Old Norse hnúka (“to bend, crouch”), Old English ġehnycned (“drawn, pinched, wrinkled”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nook (plural nooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small corner formed by two walls; an alcove.",
                  "examples": [
                    "Synonyms: alcove, ancone, recess",
                    "There was a small broom for sweeping ash kept in the nook between the fireplace bricks and the wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hidden or secluded spot; a secluded retreat.",
                  "examples": [
                    "The back of the used book shop was one of her favorite nooks; she could read for hours and no one would bother her or pester her to buy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A recess, cove or hollow.",
                  "examples": [
                    "Synonym: niche"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An English unit of land area, originally 1⁄4 of a yardland but later 12+1⁄2 or 20 acres.",
                  "examples": [
                    "Synonym: fardel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Northern England, archaic) A corner of a piece of land; an angled piece of land, especially one extending into other land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Homestuck fandom slang, vulgar) The vagina-like genitalia of a troll, featured in Homestuck fanworks but not in canon.",
                  "examples": [
                    "Coordinate term: tentabulge"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nook (third-person singular simple present nooks, present participle nooking, simple past and past participle nooked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To withdraw into a nook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To situate in a nook.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}