{
  "word": "tomahawk",
  "etymologies": [
    {
      "description": [
        "From an Eastern Algonquian word, most likely Powhatan tumahák; compare also Malecite-Passamaquoddy tomhikon (“ax”), Abenaki temahigan, demahigan (“ax”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tomahawk (plural tomahawks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ax used by Native American warriors.",
                  "examples": [
                    "yeerely bring into our store house, at the beginning of their haruest two bushels of corne a man  […]  for which they should receiue so many Iron Tomahawkes or small hatchets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) A dunk performed with one's arm behind one's head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A geometric construction consisting of a semicircle and two line segments that serves as a tool for trisecting an angle; so called from its resemblance to the American Indian axe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(field hockey) A field hockey shot style that involves a player turning their hockey stick upside-down and swinging it so that its inside edge will come into contact with the ball.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tomahawk (third-person singular simple present tomahawks, present participle tomahawking, simple past and past participle tomahawked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike or cut up with a tomahawk.",
                  "examples": [
                    "Not satisfied with tomahawking our colleagues in the country, they ask the scanty remnant in the House to join in the scalp dance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) To girdle or incise the trees around (an area of land) so as to claim ownership of it.",
                  "examples": [
                    "He was the owner of 1,300 acres of land bought from the government and located where the city of Lexington, Ky., now stands. After his marriage he tomahawked an area of 600 acres near Carmichaelstown,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) To perform a tomahawk dunk.",
                  "examples": [
                    "When the league held its first slam-dunk contest in 1984 in Denver, Nance, then a Phoenix Sun, soared into the rafters with a basketball in each hand and tomahawked each one through the net before floating back to earth  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}