{
  "word": "spiral",
  "etymologies": [
    {
      "description": [
        "From Middle French spirale, from Medieval Latin spiralis, from Latin spira, from Ancient Greek σπείρα (speíra, “wreath, coil, twist”)."
      ],
      "adjectives": [
        {
          "description": "spiral (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Helical, like a spiral.",
                  "examples": [
                    "The formation of tornados and water-spouts is very probably identical with that of dust-storms and \"devils,\" viz., a sudden disturbance of the vertical equilibrium of the atmosphere, where by an upward rush of air is generated, which rapidly becomes spiral."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "spiral (plural spirals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A curve that is the locus of a point that rotates about a fixed point while continuously increasing its distance from that point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A helix.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A self-sustaining process with a lot of momentum involved, so it is difficult to accelerate or stop it at once.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A section of track that forms a circle and crosses over itself, used for gaining height in mountainous territory.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spiral (third-person singular simple present spirals, present participle (US) spiraling or (UK) spiralling, simple past and past participle (US) spiraled or (UK) spiralled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move along the path of a spiral or helix.",
                  "examples": [
                    "The falling leaves spiralled down from the tree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause something to spiral.",
                  "examples": [
                    "You need to learn how to spiral a ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, intransitive) To increase continually.",
                  "examples": [
                    "Her debts were spiralling out of control."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}