{
  "word": "arming",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "arming (plural armings)",
          "definitionGroups": [
            {
              "group": "The act of supplying (oneself or others) with armor and (now especially) arms and ammunition in preparation for a conflict; the act of providing with the means of defense and attack.",
              "entries": [
                {
                  "meaning": "(in particular, especially in compounds) The affixing and securing on of armor.",
                  "examples": [
                    "arming buckle, arming doublet, arming garments (garments for anchoring armor to), arming harness, arming jacket, arming nail, arming point, arming straps (for securing armor)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of supplying with the equipment, knowledge, authority, or other tools needed for a particular task.",
                  "examples": [
                    "The Party has always seen to the selection of its most active fighters propagandists and lecturers , and to the arming of them with knowledge. The theoretical level of our propaganda depends primarily on them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of preparing a tool or a weapon for action; activation.",
                  "examples": [
                    "This insures the arming of the fuze when fired."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A piece of tallow or soap put in the cavity and over the bottom of a sounding lead to pick up samples of the bottom of the sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, chiefly in the plural) One of the red dress cloths formerly hung fore and aft outside of a ship's upper works on holidays, or used as a visual screen during times of action.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "arming",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of arm",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}