{
  "word": "hern",
  "etymologies": [
    {
      "description": [
        "From Middle English herne, hyrne, from Old English hyrne (“corner”), from Proto-Germanic *hurnijō, *hurnijǭ (“projecting point, corner, angle”), from Proto-Indo-European *ḱerh₂- (“horn”). More at hirn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hern (plural herns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) Corner, nook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) A recess beside a wide chimney-fireside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) A corner of angular piece of land; a nook of land projecting into another district, parish, or field.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hiren, hirne, from the same source as her. The -n was added (especially in the speech of the Midlands and Southern England, starting in the 1300s) by analogy with mine and thine. (Compare ourn.) Displaced in standard speech by the -s form, hers, which see for more. Cognate with West Flemish heurn (“hern”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Dialectal variant of heron."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hern (plural herns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal or poetic) Heron.",
                  "examples": [
                    "\"Now for Swans & Ducks, and such like Birds of the Water, it is obvious to take notice how well they are fitted for that manner of life. For those that swim, their Feet are framed for it like a pair of Oars, their Claws being connected with a pretty broad Membrane; and their Necks are long, that they may dive deep enough into the water. As also the Neck of the Hern, and such like Fowl who live of Fishes, and are fain to frequent their Element, who walk on long stilts also like the people that dwell in the Marshes; but their Claws have no such Membranes, for they had been but a hindrance to those kind of Birds that onely wade in the water, and do not swim.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}