{
  "word": "pudding",
  "etymologies": [
    {
      "description": [
        "From circa 1305, Middle English podynge (“kind of sausage; meat-filled animal stomach”), puddynge, from Old French boudin (“blood sausage, black pudding”), from Latin botellus (“sausage, small intestine”). Doublet of boudin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pudding (countable and uncountable, plural puddings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various dishes, sweet or savoury, prepared by boiling or steaming, or from batter.",
                  "examples": [
                    "The dishes in this chapter represent a range of multiethnic savory custards and steamed puddings, including a few surprises like a chèvre popover pudding and a bread pudding with lettuce and cheese."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of cake or dessert cooked usually by boiling or steaming.",
                  "examples": [
                    "Steamed puddings, a favourite for winter, are both easy to make and delicious. Served with one of the sweet sauces (recipes 497 to 506) they make a filling and satisfying end to a meal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of dessert that has a texture similar to custard or mousse but using some kind of starch as the thickening agent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) Dessert; the dessert course of a meal.",
                  "examples": [
                    "We have apple pie for pudding today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally) A sausage made primarily from blood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An overweight person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Entrails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any food or victuals.",
                  "examples": [
                    "Eat your pudding, slave, and hold your tongue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, slang) A piece of good fortune.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}