{
  "word": "carpet",
  "etymologies": [
    {
      "description": [
        "From late Middle English carpette, from Old French carpite, from Medieval Latin carpita/Italian carpita, introduced in the 13th century by the Florentines from the Armenian Kingdom of Cilicia, from Middle Armenian կարպետ (karpet, “carpet, rug”), earlier կապերտ (kapert)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carpet (countable and uncountable, plural carpets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fabric used as a complete floor covering.",
                  "examples": [
                    "A great bargain also had been the excellent Axminster carpet which covered the floor; as, again, the arm-chair in which Bunting now sat forward, staring into the dull, small fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Any surface or cover resembling a carpet or fulfilling its function.",
                  "examples": [
                    "Way deep in left field, where the carpet of green sloped upward to a terrace and greeted the thick line of trees, he reached out his glove."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a number of moths in the geometrid subfamily Larentiinae",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A wrought cover for tables.",
                  "examples": [
                    "Tables and beds covered with copes instead of carpets and coverlets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar) A woman's pubic hair.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "carpet (third-person singular simple present carpets, present participle carpeting, simple past and past participle carpeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lay carpet, or to have carpet installed, in an area.",
                  "examples": [
                    "After the fire, they carpeted over the blackened hardwood flooring.",
                    "The builders were carpeting in the living room when Zadie inspected her new house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To substantially cover something, as a carpet does; to blanket something.",
                  "examples": [
                    "Popcorn and candy wrappers carpeted the floor of the cinema."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) To reprimand.",
                  "examples": [
                    "Even Colonel Yakov, so recently carpeted by St Petersburg, was reported to be back in the Pamirs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}