{
  "word": "bourgeois",
  "etymologies": [
    {
      "description": [
        "Borrowed from French bourgeois (“a class of citizens who were wealthier members of the Third Estate”), from Old French burgeis (“town dweller”), from Frankish *burg, ultimately from Proto-Germanic *burgz (“stronghold; city”) (whence borough). Doublet of burgess; compare also burgish."
      ],
      "adjectives": [
        {
          "description": "bourgeois (comparative more bourgeois, superlative most bourgeois)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the middle class, (often derogatory) their presumed overly conventional, conservative, and materialistic values.",
                  "examples": [
                    "bourgeois opinion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Of or relating to the bourgeoisie, the third estate of the French Ancien Regime.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Marxism) Of or relating to the capitalist class, (usually derogatory) the capitalist exploitation of the proletariat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bourgeois (usually uncountable, plural bourgeois)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, collectively, usually in the plural) The middle class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) An individual member of the middle class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually derogatory) A person of any class with bourgeois (i.e., overly conventional and materialistic) values and attitudes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(history) An individual member of the bourgeoisie, the third estate of the French Ancien Regime.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Marxism) A capitalist, (usually derogatory) an exploiter of the proletariat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bourgeois (third-person singular simple present bourgeoises, present participle bourgeoising, simple past and past participle bourgeoised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make bourgeois.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English burjois, from French Bourgois, probably from Bourges (“the French city”) + -ois (“forming adjectives”) but possibly from bourgeois above or after Jean de Bourgeois who worked as a printer in Rouen c. 1500."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bourgeois (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) A size of type between brevier and long primer, standardized as 9-point.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}