{
  "word": "cinnamon",
  "etymologies": [
    {
      "description": [
        "From Middle English synamome, from Old French cinnamone, from Latin cinnamon, cinnamōmum, from Ancient Greek κιννάμωμον (kinnámōmon), later κίνναμον (kínnamon), probably to be explained as “Chinese amomum”, ἄμωμον (ámōmon) being, only cognate to Classical Syriac ܚܡܵܡܵܐ‎ (ḥəmāmā) and Arabic حَمَامَا‎ (ḥamāmā), a phytonym of lost provenience for a varied genus Amomum of spice and drug plants; compare for this composition the Iranian designation دارچین‎ (dârčin, literally “Chinese tree”)."
      ],
      "adjectives": [
        {
          "description": "cinnamon (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Containing cinnamon, or having a cinnamon taste.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a yellowish-brown color.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cinnamon (countable and uncountable, plural cinnamons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A small evergreen tree native to Sri Lanka and southern India, Cinnamomum verum or Cinnamomum zeylanicum, belonging to the family Lauraceae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Several related trees, notably the Indonesian cinnamon (Cinnamomum burmanni) and Chinese cinnamon or cassia (Cinnamomum aromaticum or Cinnamomum cassia).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(chiefly uncountable) A spice from the dried aromatic bark of the cinnamon tree, either rolled into strips or ground into a powder. The word is commonly used as trade name for spices made of any of the species above.",
              "entries": [
                {
                  "meaning": "true cinnamon, the product made of Cinnamomum verum",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A warm yellowish-brown color, the color of cinnamon.",
                  "examples": [
                    "cinnamon:"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}