{
  "word": "naked",
  "etymologies": [
    {
      "description": [
        "From Middle English naked, from Old English nacod, from Proto-West Germanic *nak(k)wad, from Proto-Germanic *nakwadaz, from Proto-Indo-European *negʷ- (“naked”)."
      ],
      "adjectives": [
        {
          "description": "naked (comparative more naked, superlative most naked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Bare, not covered by clothing.",
                  "examples": [
                    "She was as naked as the day she was born."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Lacking some clothing; clothed only in underwear.",
                  "examples": [
                    "For no body would staye to give them intelligence, the countrey people running evry wher out of ther waye, and some of them flying out of ther bedds nacked in their shirts, who runne to the neerest rockes on the sea syde; so formidable was ther very name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Glib, without decoration, put bluntly.",
                  "examples": [
                    "This is the naked truth.",
                    "The naked facts lay there on the table, enclosed within the files."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by the nakedness of the people concerned or to whom the described noun is attributed.",
                  "examples": [
                    "So here I went the first time into a naked bed, only my drawers on; and did sleep pretty well: but still both sleeping and waking had a fear of fire in my heart, that I took little rest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Unarmed.",
                  "examples": [
                    "You an’t even with me yet, ſays ſhe; I ſcorn as much to take up a Sword againſt a Naked Man; as you ought to have ſcorn’d, if you had been a Gentleman, to give the Lie to a Woman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unaided, unaccompanied.",
                  "examples": [
                    "Christ commeth not bare or naked, but clothed and accompanied with all his mercies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unprotected, uncovered; (by extension) without a condom.",
                  "examples": [
                    "The tendrils of the naked flame stretched into the skies.",
                    "I entered her naked and came in her too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, of a derivative contract) Where the writer (seller) does not own the underlying asset to cover the contract.",
                  "examples": [
                    "a naked put, a naked call",
                    "Synonym: uncovered"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) Resourceless, poor, lacking means.",
                  "examples": [
                    "I knowe my self moost naked in al artes, / My comune ne vulgare eke moost interupte, / And I conversaunte and born in the partes / Where my natyfe langage is moost corrupt, / And with most sundry tonges myxt and rupte."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with “of”) Lacking or devoid of something.",
                  "examples": [
                    "Freewill is made naked of all maner merite."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Blank, clean, empty.",
                  "examples": [
                    "For in the first it finds the mind naked and unprepossessed with any former notions, and so easily and insensibly gains upon the assent, grows up with it, and incorporates into it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of land, rocks, or plants) Barren, having no foliage, unvegetated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Uncomfortable or vulnerable, as if missing something important.",
                  "examples": [
                    "I feel naked without my mobile phone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of food or other consumer products) Without any additives, or without some component that would usually be included.",
                  "examples": [
                    "a naked burrito (i.e. one without a tortilla); a naked burger (without a bun)",
                    "Naked Bacon (a brand without nitrates or phosphates)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Of a singularity, not hidden within an event horizon and thus observable from other parts of spacetime.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See the etymology of the corresponding lemma form."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "naked",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "simple past tense and past participle of nake",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}