{
  "word": "obtain",
  "etymologies": [
    {
      "description": [
        "From Middle English obteinen, from Anglo-Norman obtenir, optiner et al., and Middle French obtenir, from Latin obtinēre (“to gain, achieve, succeed, possess”), from ob- + tenēre (“to hold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "obtain (third-person singular simple present obtains, present participle obtaining, simple past and past participle obtained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get hold of; to gain possession of, to procure; to acquire, in any way. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To secure (that) a specific objective or state of affairs be reached. [15th–19th c.]",
                  "examples": [
                    "he was condemned to die for the felony, and being so well known for an old offender, had certainly died, but the merchant, upon his earnest application, had obtained that he should be transported, on condition that he restored all the rest of his bills, which he had done accordingly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To prevail, be victorious; to succeed. [15th–19th c.]",
                  "examples": [
                    "This, though it failed at present, yet afterward obtained, and was a mighty step to the ruin of the commonwealth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To hold; to keep, possess or occupy. [15th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To exist or be the case; to hold true, be in force. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}