{
  "word": "repast",
  "etymologies": [
    {
      "description": [
        "From Middle English repast, repaste (“feast, meal; food, nourishment; the Eucharist; refreshment, rest”) [and other forms], from Anglo-Norman, Middle French, Old French repast, Middle French, Old French repas (“meal, repast; spiritual nourishment”) (modern French repas), probably from Medieval Latin, Late Latin repastus (“meal”), from repāstus, the perfect passive participle of repāscō (“to feed; to feed one after another”), from Latin re- (prefix meaning ‘again’) + pāscō (“to feed, nourish; to pasture (an animal); of an animal: to browse, graze; to maintain, support”) (ultimately from Proto-Indo-European *peh₂- (“to protect; to shepherd”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "repast (countable and uncountable, plural repasts)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "(archaic or literary) A meal.",
                  "examples": [
                    "Synonyms: refection; see also Thesaurus:meal"
                  ]
                },
                {
                  "meaning": "(obsolete) A period of refreshment or rest.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable)",
              "entries": [
                {
                  "meaning": "(archaic) Food or drink that may be consumed as a meal.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, figuratively) Something that is intellectually or spiritually nourishing.",
                  "examples": [
                    "Synonym: refection"
                  ]
                },
                {
                  "meaning": "(obsolete) The consumption of food; also, refreshment obtained from eating; (generally) refreshment; rest.",
                  "examples": [
                    "Synonym: refection"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Partly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "repast (third-person singular simple present repasts, present participle repasting, simple past and past participle repasted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(archaic) To supply (an animal or person) with food; to feed.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, figuratively) To provide (a person) with intellectual or spiritual nourishment; to enlighten, to feed.",
                  "examples": []
                },
                {
                  "meaning": "(also reflexive, obsolete) To refresh (oneself or someone) through eating and drinking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, also figuratively) Usually followed by on or upon: to take food and drink; to feast, to feed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}