{
  "word": "rape",
  "etymologies": [
    {
      "description": [
        "From Middle English rapen, rappen (“to abduct; ravish; seduce; rape; seize; snatch; carry off; transport”), probably from Latin rapere (verb), possibly through or influenced by Anglo-Norman rap, rape (noun) (compare also ravish). But compare Swedish rappa (“to snatch, seize, carry off”), Low German rapen (“to snatch, seize”), Dutch rapen (“to pick up, gather, collect”); the relationship with Germanic forms is not clear. Cognate with Lithuanian reikėti (“to be in need”). Compare also rap (“seize, snatch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rape (countable and uncountable, plural rapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The taking of something by force; seizure, plunder. [from early 14th c.]",
                  "examples": [
                    "the Rape of Nanking"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic) The abduction of a woman, especially for sexual purposes. [from 15th c.]",
                  "examples": [
                    "The tale of the rape of Lucretia, for example, is hardly tellable - as many Roman writers themselves discovered - without raising the question of where seduction ends and rape begins; the rape of the Sabines puts a similar question mark over the distinction between rape and marriage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of forcing sex upon another person without their consent or against their will; originally coitus forced by a man on a woman, but now generally any sex act forced by any person upon another person; by extension, any non-consensual sex act forced on or perpetrated by any being. [from 15th c.]",
                  "examples": [
                    "Last April the media world exploded in indignation at the rape and beating of a jogger in Central Park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which is snatched away.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Movement, as in snatching; haste; hurry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, sometimes offensive) Overpowerment; utter defeat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rape (third-person singular simple present rapes, present participle raping, simple past and past participle raped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To seize by force. (Now often with overtones of later senses.) [from late 14th c.]",
                  "examples": [
                    "Dr Ashok's eyes had a tendency to pop whenever he wanted to rape your attention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry (someone, especially a woman) off against their will, especially for sex; to abduct. [from 15th c.]",
                  "examples": [
                    "A Princess rap’d transcends a Navy storm'd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly transitive) To force sexual intercourse or other penetrative sexual activity upon (someone) without their consent. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plunder, to destroy or despoil. [from 17th c.]",
                  "examples": [
                    "I raped your richest roadstead—I plundered Singapore!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, sometimes offensive) To overpower, destroy (someone); to trounce. [from 20th c.]",
                  "examples": [
                    "My experienced opponent will rape me at chess."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Generally considered to derive from Old English rāp (“rope”), in reference to the ropes used to delineate the courts that ruled each rape. Compare Dutch reep and the parish of Rope, Cheshire.",
        "In the 18th century, Edward Lye proposed derivation from Old Norse hreppr (“tract of land”), but this was rejected by the New English Dictionary and is considered \"phonologically impossible\" by the English Place-Name Society. Others, considering it improbable that the Normans would have adopted a local word, suggest derivation from Old French raper (“take by force”).",
        "See Wikipedia for more."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rape (plural rapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) One of the six former administrative divisions of Sussex, England. [from 11th c.]",
                  "examples": [
                    "It seems to me very clear that the rapes of Sussex were divisions already existing there when the Normans landed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rapen, from Old Norse hrapa (“to fall, rush headlong, hurry, hasten”), from Proto-Germanic *hrapaną (“to fall down”). Cognate with Norwegian rapa (“to slip, fall”), Danish rappe (“to make haste”), German rappeln (“to hasten, hurry”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "rape (comparative more rape, superlative most rape)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Quickly; hastily. [14th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "rape (plural rapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Haste; precipitancy; a precipitate course. [14th–17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rape (third-person singular simple present rapes, present participle raping, simple past and past participle raped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive or reflexive) To make haste; to hasten or hurry. [14th–16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Latin rapa, from rāpum (“turnip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rape (plural rape)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of rapeseed, Brassica napus. [late 14th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rape, from rape (“grape stalk, rasper”), from Old French raper, rasper (“to rasp, scratch”), from Old Frankish *raspōn (“to scratch”), related to Old High German raspōn (“to scrape”), Old English ġehrespan (“to strip, spoil”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rape (countable and uncountable, plural rapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The stalks and husks of grapes from which the must has been expressed in winemaking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A filter containing the stalks and husks of grapes, used for clarifying wine, vinegar, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fruit plucked in a bunch.",
                  "examples": [
                    "a rape of grapes"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}