{
  "word": "faunch",
  "etymologies": [
    {
      "description": [
        "Uncertain. Used in Midland American English and Western American English. Entered the fanspeak body of slang after writer Noel Loomis used it in a review in Pro-Phile."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "faunch (plural faunches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, fandom slang) A desire; a yearning.",
                  "examples": [
                    "Byrne was the best thing about *Man in the Iron Mask*, as far as plot and acting. I do confess a faunch for John Malkovitch, and DiCaprio should be allowed to develop his considerable latent acting abilities."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "faunch (third-person singular simple present faunches, present participle faunching, simple past and past participle faunched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, equestrianism) To bite the bit, especially when restless; to champ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, chiefly Midland American English and Western American English) To complain; to rant; to rave.",
                  "examples": [
                    "Right Wingers can rant, stomp, faunch, condemn and mislead all day long and pack the laws with well archestrated[sic] bigotry and bias from here til doomsday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, chiefly Midland American English and Western American English) To worry; to be eager; to show impatience.",
                  "examples": [
                    "Rather than have me fidget and faunch while waiting in line (I'd neglected to bring a book) my wife sent me off to the music store with her blessing, with the promise to send our daughter Celia to fetch me when we finally got our table an hour later."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, fandom slang) To desire; to yearn; to covet.",
                  "examples": [
                    "One thing you will learn *very* quickly is that, while you can do a very broad range of photography indeed with cheap equipment, there is *always* some very expensive toy you faunch over that will let you do something a little bit better."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}