{
  "word": "frost",
  "etymologies": [
    {
      "description": [
        "From Middle English frost, from an unmetathesized variant of Old English forst (“frost”), from Proto-Germanic *frustaz (“frost”), from Proto-Indo-European *prews- (“to freeze; frost”). Cognate with West Frisian froast (“frost”), Dutch vorst (“frost”), German Frost (“frost”), Swedish frost (“frost”), Norwegian frost (“frost”), Icelandic frost (“frost”), Latin pruīna (“hoarfrost, frost, rime, snow”). Related to freeze."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frost (countable and uncountable, plural frosts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cover of minute ice crystals on objects that are exposed to the air. Frost is formed by the same process as dew, except that the temperature of the frosted object is below freezing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cold weather that causes these ice crystals to form.",
                  "examples": [
                    "It is more probable, in almost every country of Europe, that there will be frost sometime in January, than that the weather will continue open throughout that whole month;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Coldness or insensibility; severity or rigidity of character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of freezing; the congelation of water or other liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shade of white, like that of frost.",
                  "examples": [
                    "frost:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A disappointment; a cheat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A kind of light diffuser.",
                  "examples": [
                    "Frosts and diffusion are flame retardant and produce similar results except that some of the frosts are very subtle in their effects. For example: Hamburg Frost will soften the beam edge with little additional spread of the beam."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "frost (third-person singular simple present frosts, present participle frosting, simple past and past participle frosted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with frost.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become covered with frost.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To coat (something, e.g. a cake) with icing to resemble frost.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To anger or annoy.",
                  "examples": [
                    "I think the boss's decision frosted him a bit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sharpen (the points of a horse's shoe) to prevent it from slipping on ice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bleach individual strands of hair while leaving adjacent strands untouched.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}