{
  "word": "chunder",
  "etymologies": [
    {
      "description": [
        "Unknown and debated origin. Possibly a shortening of Chunder Loo, rhyming slang for spew (said to be derived from the cartoon character “Chunder Loo of Akim Foo”, drawn by Norman Lindsay for a series of boot-polish advertisements in the early 1900s), but the rhyming slang usage is not recorded. The derivation from some supposed nautical phrase \"*Watch under!\", used to warn people on lower decks that someone above was vomiting over the side of the ship, is wholly unsubstantiated and likely folk etymology. Also possibly from some dialectal pronunciation of thunder. First attested in c. 1950."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chunder (countable and uncountable, plural chunders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand, Ireland, slang) Vomit. [from 1950.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand, Ireland, slang) An act of vomiting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Heavy, sticky snow that makes snowsports difficult.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chunder (third-person singular simple present chunders, present participle chundering, simple past and past participle chundered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, Britain, slang) To throw up, to vomit.",
                  "examples": [
                    "There are plenty of winding roads, diesel fumes, crowded public transport and various less than sweet odours to get you chundering when you′re on the move in this part of the world, so take a good supply of motion sickness remedies if you know you′re susceptible to this."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps by confusion with chunter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "chunder (third-person singular simple present chunders, present participle chundering, simple past and past participle chundered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a motor vehicle: to rumble loudly, to roar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}