{
  "word": "scarecrow",
  "etymologies": [
    {
      "description": [
        "The noun is derived from scare (“to frighten, startle, terrify”) +‎ crow (“bird of the genus Corvus”). The word displaced other terms such as bogle (now dialectal, dated), sewel or shewel, and shoy-hoy (perhaps imitative of the cry of crows).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scarecrow (plural scarecrows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An effigy, typically made of straw and dressed in old clothes, fixed to a pole in a field to deter birds from eating crops or seeds planted there. [from 1530s]",
                  "examples": [
                    "Synonyms: see Thesaurus:scarecrow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, derogatory) A person regarded as resembling a scarecrow (sense 1) in some way; especially, a tall, thin, awkward person; or a person wearing ragged and tattered clothes.",
                  "examples": [
                    "(tall, thin person): Synonym: beanpole"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Synonym of crow scarer (“a farmhand employed to scare birds from the fields”)",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Anything that appears terrifying but presents no danger; a paper tiger.",
                  "examples": []
                },
                {
                  "meaning": "(military, World War II, historical) Military equipment or tactics used to scare and deter rather than cause actual damage.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(Britain, dialectal, obsolete)",
              "entries": [
                {
                  "meaning": "The black tern (Chlidonias niger).",
                  "examples": []
                },
                {
                  "meaning": "The hooded crow (Corvus cornix).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scarecrow (third-person singular simple present scarecrows, present participle scarecrowing, simple past and past participle scarecrowed) (transitive)",
          "definitionGroups": [
            {
              "group": "To cause (a person, their body, etc.) to look awkward and stiff, like a scarecrow (noun sense 1).",
              "entries": [
                {
                  "meaning": "To splay (one's arms) away from the body, like the arms of a scarecrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To frighten or terrify (someone or something), as if using a scarecrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To spoil the appearance of (something, such as the landscape or a view), as scarecrows may be regarded as doing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}