{
  "word": "shrub",
  "etymologies": [
    {
      "description": [
        "From Middle English schrub, schrob, (also unassibilated as scrub), from Old English *sċrob (in placenames) and sċrybb (“a shrub; shrubbery; underbrush”); akin to Norwegian skrubbe (“the dwarf cornel tree”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shrub (plural shrubs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A woody plant smaller than a tree, and usually with several stems from the same base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Kenyan English) A word mispronounced by replacing some consonant sounds with others of a similar place of articulation due to interference from one's knowledge of an indigenous Kenyan language.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shrub (third-person singular simple present shrubs, present participle shrubbing, simple past and past participle shrubbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To lop; to prune.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Kenyan English) To mispronounce a word by replacing some consonant sounds with others of a similar place of articulation due to interference from one's knowledge of an indigenous Kenyan language.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Arabic شِرَاب‎ (širāb, “a drink, beverage”), شَرِبَ‎ (šariba, “to drink”), akin to syrup, sherbet"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shrub (countable and uncountable, plural shrubs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquor composed of vegetable acid, fruit juice (especially lemon), sugar, sometimes vinegar, and a small amount of spirit as a preservative. Modern shrub is usually non-alcoholic, but in earlier times it was often mixed with a substantial amount of spirit such as brandy or rum, thus making it a liqueur.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}