{
  "word": "vampire",
  "etymologies": [
    {
      "description": [
        "From French vampire, from German Vampir, via Hungarian from a Slavic word, probably Serbo-Croatian вампир (vàmpīr), proposed to be a variant of unattested *upir, from Proto-Slavic *ǫpyrь, q.v. Compare Russian упы́рь (upýrʹ), Polish upiór, Polish wąpierz, etc. Doublet of oupire."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vampire (plural vampires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mythological undead creature said to feed on the blood of the living. [from 1732]",
                  "examples": [
                    "Synonyms: nosferatu, lamia, cadaver sanguine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A person with the medical condition systemic lupus erythematosus, colloquially known as vampirism, with effects such as photosensitivity and brownish-red stained teeth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blood-sucking bat; vampire bat (Desmodus rotundus) [from later 18th c.]",
                  "examples": [
                    "Synonym: vampire bat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, derogatory) A person who drains one's time, energy, money, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A vamp: a seductive woman who exploits men.",
                  "examples": [
                    "\"What followed this decision was exactly what we had expected: Mr. Fox, realizing that the public was tiring of Theda Bara in vampire roles, announced that he would star her in a production of Romeo and Juliet,\" she illustrated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A medical technician who works with patients' blood.",
                  "examples": [
                    "\"I draw blood from patients, and then I take it back to the lab and analyze it. Sometimes, the vampires do all the sticks, that is to say the lab assistants do all the blood collections.\" He grinned. \"We have our own language at the lab.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US naval jargon) Synonym of anti-ship missile (ASM), particularly an incoming hostile one.",
                  "examples": [
                    "Vampire. Vampire. Vampire. Battle stations."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vampire (third-person singular simple present vampires, present participle vampiring, simple past and past participle vampired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To drain of energy or resources.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}