{
  "word": "tartan",
  "etymologies": [
    {
      "description": [
        "Blend of Middle English tartaryn (“rich material”), from Middle French tartarin (“Tartar cloth”), and Middle French tiretaine (“cloth of mixed fibers”), from Old French tiret (“kind of cloth”), from tire (“oriental cloth of silk”), from Medieval Latin tyrius (“material from Tyre”), from Latin Tyrus (“Tyre”)."
      ],
      "adjectives": [
        {
          "description": "tartan (comparative more tartan, superlative most tartan)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a pattern like a tartan.",
                  "examples": [
                    "In the second row of the cavalcade were Francie, Fanny's god-daughter, now thirteen years old and already elegant in long frilled pantalettes, tartan skirts, and a leghorn hat with streamers, …"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous) Scottish.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tartan (countable and uncountable, plural tartans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of woven woollen cloth with a distinctive pattern of coloured stripes intersecting at right angles, associated with Scottish Highlanders, different clans and some Scottish families and institutions having their own distinctive patterns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The pattern associated with such material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An individual or a group wearing tartan; a Highlander or Scotsman in general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Trade name of a synthetic resin, used for surfacing tracks etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tartan (third-person singular simple present tartans, present participle tartaning, simple past and past participle tartaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clothe in tartan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French tartane, from Italian tartana, of uncertain origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tartan (plural tartans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of one-masted lateen-sailed vessel used in the Mediterranean.",
                  "examples": [
                    "Hakkabut hereupon descended into the hold of the tartan, and soon returned, carrying ten packets of tobacco, each weighing one kilogramme, and securely fastened by strips of paper, labelled with the French Government stamp."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A kind of long covered carriage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}