{
  "word": "face",
  "etymologies": [
    {
      "description": [
        "From Middle English face, from Old French face, from Late Latin facia, from Latin faciēs (“form, appearance”). Doublet of facies.",
        "Displaced native Middle English onlete (“face, countenance, appearance”), anleth (“face”), from Old English anwlite, andwlita, compare German Antlitz; Old English ansīen (“face”), Middle English neb (“face, nose”) (from Old English nebb), Middle English ler, leor, leer (“face, cheek, countenance”) (from Old English hlēor), and non-native Middle English vis (“face, appearance, look”) (from Old French vis) and Middle English chere (“face”) from Old French chere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "face (plural faces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The front part of the head of a human or other animal, featuring the eyes, nose, and mouth, and the surrounding area.",
                  "examples": [
                    "That girl has a pretty face.",
                    "The monkey pressed its face against the railings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's facial expression.",
                  "examples": [
                    "Why the sad face?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in expressions such as 'make a face') A distorted facial expression; an expression of displeasure, insult, etc.",
                  "examples": [
                    "Children! Stop making faces at each other!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Public image; outward appearance.",
                  "examples": [
                    "Our chairman is the face of this company.",
                    "He managed to show a bold face despite his embarrassment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The frontal aspect of something.",
                  "examples": [
                    "The face of the cliff loomed above them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An aspect of the character or nature of someone or something.",
                  "examples": [
                    "This is a face of her that we have not seen before.",
                    "Poverty is the ugly face of capitalism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Presence; sight; front.",
                  "examples": [
                    "to fly in the face of danger",
                    "to speak before the face of God"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The directed force of something.",
                  "examples": [
                    "They turned the boat into the face of the storm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Good reputation; standing, in the eyes of others; dignity; prestige. (See lose face, save face).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Shameless confidence; boldness; effrontery.",
                  "examples": [
                    "You've got some face coming round here after what you've done."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any surface, especially a front or outer one.",
                  "examples": [
                    "Put a big sign on each face of the building that can be seen from the road.",
                    "They climbed the north face of the mountain.",
                    "She wanted to wipe him off the face of the earth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) Any of the flat bounding surfaces of a polyhedron; more generally, any of the bounding pieces of a polytope of any dimension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The numbered dial of a clock or watch; the clock face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The mouth.",
                  "examples": [
                    "Shut your face!",
                    "He's always stuffing his face with chips."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Makeup; one's complete facial cosmetic application.",
                  "examples": [
                    "I'll be out in a sec. Just let me put on my face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically) A person; the self; (reflexively, objectifying) oneself.",
                  "examples": [
                    "It was just the usual faces at the pub tonight.",
                    "He better not show his face around here no more.",
                    "Coordinate term: ass (see ass § Usage notes)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A familiar or well-known person; a member of a particular scene, such as the music or fashion scene.",
                  "examples": [
                    "He owned several local businesses and was a face around town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(professional wrestling, slang) A headlining wrestler with a persona embodying heroic or virtuous traits and who is regarded as a \"good guy\", especially one who is handsome and well-conditioned; a baby face.",
                  "examples": [
                    "The fans cheered on the face as he made his comeback."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The front surface of a bat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) The part of a golf club that hits the ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The side of the card that shows its value (as opposed to the back side, which looks the same on all cards of the deck).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) The head of a lion, shown face-on and cut off immediately behind the ears.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The width of a pulley, or the length of a cog from end to end.",
                  "examples": [
                    "a pulley or cog wheel of ten inches face"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A typeface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mode of regard, whether favourable or unfavourable; favour or anger.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) The amount expressed on a bill, note, bond, etc., without any interest or discount; face value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "face (third-person singular simple present faces, present participle facing, simple past and past participle faced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a person or animal) To position oneself or itself so as to have one's face closest to (something).",
                  "examples": [
                    "Face the sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of an object) To have its front closest to, or in the direction of (something else).",
                  "examples": [
                    "Turn the chair so it faces the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to turn or present a face or front, as in a particular direction.",
                  "examples": [
                    "The croupier delicately faced her other two cards with the tip of his spatula. A four! She had lost!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be presented or confronted with; to have in prospect.",
                  "examples": [
                    "We are facing an uncertain future."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deal with (a difficult situation or person); to accept (facts, reality, etc.) even when undesirable.",
                  "examples": [
                    "I'm going to have to face this sooner or later."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have the front in a certain direction.",
                  "examples": [
                    "The seats in the carriage faced backwards."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have as an opponent.",
                  "examples": [
                    "Real Madrid face Juventus in the quarter-finals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket) To be the batsman on strike.",
                  "examples": [
                    "Willoughby comes in to bowl, and it's Hobson facing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To confront impudently; to bully.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover in front, for ornament, protection, etc.; to put a facing upon.",
                  "examples": [
                    "a building faced with marble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To line near the edge, especially with a different material.",
                  "examples": [
                    "to face the front of a coat, or the bottom of a dress"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with better, or better appearing, material than the mass consists of, for purpose of deception, as the surface of a box of tea, a barrel of sugar, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) To make the surface of (anything) flat or smooth; to dress the face of (a stone, a casting, etc.); especially, in turning, to shape or smooth the flat (transverse) surface of, as distinguished from the cylindrical (axial) surface.",
                  "examples": [
                    "Hyponym: spotface"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, retail) To arrange the products in (a store) so that they are tidy and attractive.",
                  "examples": [
                    "In my first job, I learned how to operate a till and to face the store to high standards."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}