{
  "word": "try",
  "etymologies": [
    {
      "description": [
        "From Middle English trien (“to try a legal case”), from Anglo-Norman trier (“to try a case”), Old French trier (“to choose, pick out or separate from others, sift, cull”), of uncertain origin. It is probably related to Italian tritare (“to grind; to sort; to analyze”) (see also French trier). Alternatively, believed to be a metathetic variation of Old French tirer (“to pull out, snatch”), from Gothic 𐍄𐌹𐍂𐌰𐌽 (tiran, “to tear away, remove”), from Proto-Germanic *teraną (“to tear, tear apart”), from Proto-Indo-European *der- (“to tear, tear apart”), see tear. Related to Occitan triar (“to pick out, choose from among others”), although the Occitan verb could also be a borrowing from French. Alternatively or by confluence, the Old French is from Gallo-Roman Vulgar Latin *triare, of unknown origin.",
        "Replaced native Middle English cunnen (“to try”) (from Old English cunnian), Middle English fandien (“to try, prove”) (from Old English fandian), and Middle English costnien (“to try, tempt, test”) (from Old English costnian)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "try (plural tries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attempt.",
                  "examples": [
                    "I gave unicycling a try but I couldn’t do it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of tasting or sampling.",
                  "examples": [
                    "I gave sushi a try but I didn’t like it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) A score in rugby league and rugby union, analogous to a touchdown in American football.",
                  "examples": [
                    "Today I scored my first try."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, obsolete) A screen, or sieve, for grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A field goal or extra point",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) A move that almost solves a chess problem, except that Black has a unique defense.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "try (third-person singular simple present tries, present participle trying, simple past and past participle tried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To attempt; to endeavour. Followed by infinitive.",
                  "examples": [
                    "I tried to rollerblade, but I couldn’t.",
                    "I'll come to dinner soon. I'm trying to beat this level first."
                  ]
                }
              ]
            },
            {
              "group": "(obsolete) To divide; to separate.",
              "entries": [
                {
                  "meaning": "To separate (precious metal etc.) from the ore by melting; to purify, refine.",
                  "examples": []
                },
                {
                  "meaning": "(one sort from another) To winnow; to sift; to pick out; frequently followed by out.",
                  "examples": [
                    "to try out the wild corn from the good"
                  ]
                },
                {
                  "meaning": "(nautical) To extract oil from blubber or fat; to melt down blubber to obtain oil",
                  "examples": []
                },
                {
                  "meaning": "To extract wax from a honeycomb",
                  "examples": []
                }
              ]
            },
            {
              "group": "To test, to work out.",
              "entries": [
                {
                  "meaning": "To make an experiment. Usually followed by a present participle.",
                  "examples": [
                    "I tried mixing more white paint to get a lighter shade."
                  ]
                },
                {
                  "meaning": "To put to test.",
                  "examples": [
                    "I shall try my skills on this."
                  ]
                },
                {
                  "meaning": "(specifically) To test someone's patience.",
                  "examples": [
                    "You are trying my patience.",
                    "Don't try me."
                  ]
                },
                {
                  "meaning": "(figuratively, chiefly used in the imperative) To receive an imminent attack; to take.",
                  "examples": [
                    "Mona: Try this vampire bolt on for size!",
                    "Cedric: Why don't you try this alien bolt?"
                  ]
                },
                {
                  "meaning": "To taste, sample, etc.",
                  "examples": [
                    "Oh, you need to try the soup of the day!"
                  ]
                },
                {
                  "meaning": "To prove by experiment; to apply a test to, for the purpose of determining the quality; to examine; to prove; to test.",
                  "examples": [
                    "to try weights or measures by a standard;  to try a person's opinions"
                  ]
                },
                {
                  "meaning": "(with indirect interrogative clause) To attempt to determine (by experiment or effort).",
                  "examples": [
                    "I'll try whether I can make it across town on foot."
                  ]
                },
                {
                  "meaning": "(law) To put on trial.",
                  "examples": [
                    "He was tried and executed."
                  ]
                }
              ]
            },
            {
              "group": "To experiment, to strive.",
              "entries": [
                {
                  "meaning": "To have or gain knowledge of by experience.",
                  "examples": []
                },
                {
                  "meaning": "To work on something with one's best effort and focus.",
                  "examples": [
                    "Dad, for fuck's sake, I'm trying my best!",
                    "You are trying too hard."
                  ]
                },
                {
                  "meaning": "(obsolete) To do; to fare.",
                  "examples": [
                    "How do you try! (i.e., how do you do?)"
                  ]
                },
                {
                  "meaning": "To settle; to decide; to determine; specifically, to decide by an appeal to arms.",
                  "examples": [
                    "to try rival claims by a duel;  to try conclusions"
                  ]
                },
                {
                  "meaning": "(euphemistic, of a couple) To attempt to conceive a child.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To lie to in heavy weather under just sufficient sail to head into the wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strain; to subject to excessive tests.",
                  "examples": [
                    "The light tries his eyes.",
                    "Repeated failures try one's patience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly African-American Vernacular, used with another verb) To want",
                  "examples": [
                    "I am really not trying to hear you talk about my mama like that."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from Old French trié."
      ],
      "adjectives": [
        {
          "description": "try (comparative more try, superlative most try)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Fine, excellent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}