{
  "word": "squeeze",
  "etymologies": [
    {
      "description": [
        "From earlier squize, squise (whence also dialectal English squizzen and squeege), first attested around 1600, further origin uncertain; probably an alteration of quease (which is attested since 1550), from Middle English queisen (“to squeeze”), from Old English cwēsan, cwȳsan (“to crush, squeeze”), itself also of unknown origin, perhaps imitative (compare Swedish qväsa, kväsa (“to squeeze, bruise, crush; quell”), Dutch kwetsen (“to injure, hurt”), German quetschen (“to squeeze”)). Or, a blend of obsolete squiss (“to squeeze”) (whence also squash and squish) with quease. Compare also French esquicher from Old Occitan esquichar (“to press, squeeze”).",
        "The slang expression \"to put the squeeze on (someone or something)\", meaning \"to exert influence\", is from 1711. The baseball term \"squeeze play\" is first recorded 1905. \"Main squeeze\" (\"most important person\") is attested from 1896, the specific meaning \"one's sweetheart, lover\" is attested in 1970s.",
        "The nonstandard strong forms squoze and squozen, attested dialectally since at least the mid-19th century, are by analogy with freeze."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squeeze (plural squeezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of squeezing.",
                  "examples": [
                    "to give something a squeeze ― to squeeze something"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A close or tight fit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A difficult position.",
                  "examples": [
                    "I'm in a tight squeeze right now when it comes to my free time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hug or other affectionate grasp.",
                  "examples": [
                    "a gentle squeeze on the arm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A romantic partner.",
                  "examples": [
                    "I want to be your main squeeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An illicit alcoholic drink made by squeezing Sterno through cheesecloth, etc., and mixing the result with fruit juice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The act of bunting in an attempt to score a runner from third.",
                  "examples": [
                    "The game ended in exciting fashion with a failed squeeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A play that forces an opponent to discard a card that gives up one or more tricks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(caving) A traversal of a narrow passage.",
                  "examples": [
                    "It was a tight squeeze, but I got through to the next section of the cave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moulding, cast or other impression of an object, chiefly a design, inscription etc., especially by pressing wet paper onto the surface and peeling off when dry.",
                  "examples": [
                    "Nollekens, finding his wife always benefited by these visits, never refused White a squeeze of a patera, or any thing that would answer his purpose;  […]  White  […]  had turned his wine-cellars into manufactories for the produce of cast coins, and moderns squeezes from Roman lamps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) The gradual closing of workings by the weight of the overlying strata.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) The situation experienced by a middleman when pressured from both sides, especially financially.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A bribe, fee, or extortionary price paid to a middleman, especially in China; the practice of requiring such a bribe or fee.",
                  "examples": [
                    "If the licence  […]  was costly, it secured to them uninterrupted and extraordinary pecuniary advantages; but on the other hand it subjected them to 'calls' or 'squeezes' for contributions to public works,  […]  for the relief of districts suffering from scarcity  […]  as well as for the often imaginary  […]  damage caused by the overflowing of the 'Yangtse Keang' or the 'Yellow River.'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squeeze (third-person singular simple present squeezes, present participle squeezing, simple past squeezed or (nonstandard) squoze, past participle squeezed or (nonstandard) squozen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply pressure to from two or more sides at once.",
                  "examples": [
                    "I squeezed the ball between my hands.",
                    "Please don't squeeze the toothpaste tube in the middle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To embrace closely; to give a tight hug to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To fit into a tight place.",
                  "examples": [
                    "I managed to squeeze the car into that parking space.",
                    "Can you squeeze through that gap?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove something with difficulty, or apparent difficulty.",
                  "examples": [
                    "He squeezed some money out of his wallet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put in a difficult position by presenting two or more choices.",
                  "examples": [
                    "I'm being squeezed between my job and my volunteer work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To oppress with hardships, burdens, or taxes; to harass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To attempt to score a runner from third by bunting.",
                  "examples": [
                    "Jones squeezed in Smith with a perfect bunt."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}