{
  "word": "bus",
  "etymologies": [
    {
      "description": [
        "Clipping of omnibus. Formerly often spelt 'bus. The electrical sense is derived from figurative application of the automotive sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bus (plural buses or busses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A motor vehicle for transporting large numbers of people along roads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An electrical conductor or interface serving as a common connection for two or more circuits or components.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of a MIRV missile, having on-board motors used to deliver the warhead to a target.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medical industry, slang) An ambulance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bus (third-person singular simple present busses or buses, present participle bussing or busing, simple past and past participle bussed or bused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, automotive, transport) To transport via a motor bus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, automotive, transport, chiefly US) To transport students to school, often to a more distant school for the purposes of achieving racial integration.",
                  "examples": [
                    "But if you ask me to bus my children / I hope the cops take down your name"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, automotive, transport) To travel by bus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, food service) To clear meal remains from.",
                  "examples": [
                    "He bussed tables as the restaurant emptied out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, food service) To work at clearing the remains of meals from tables or counters; to work as a busboy.",
                  "examples": [
                    "He’s been bussing for minimum wage."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}