{
  "word": "breakthrough",
  "etymologies": [
    {
      "description": [
        "From break +‎ through. Compare German Durchbruch and Dutch doorbraak (“breakthrough”, literally “through-break”)."
      ],
      "adjectives": [
        {
          "description": "breakthrough (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by major progress or overcoming some obstacle.",
                  "examples": [
                    "a breakthrough technological advance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(immunology) Involving the contraction of a disease by a person with a decreased susceptibility, such as a person who has been vaccinated to help prevent that disease.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The emergence or one or more symptoms of a condition despite medication or other medical treatment.",
                  "examples": [
                    "She was on two antiepileptics for five years but then had a breakthrough seizure.",
                    "He was managing his discomfort with common painkillers, but one morning he had breakthrough pain causing him to miss work."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "breakthrough (plural breakthroughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An advance through and past enemy lines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any major progress; such as a great innovation or discovery that overcomes a significant obstacle.",
                  "examples": [
                    "Albert Einstein is credited with making some of the greatest breakthroughs in modern physics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The penetration of the opposition's defence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) The penetration of a separating wall or the remaining distance to an adjacent hollow (a crosscut in mining) or between two parts of a tunnel build from both ends; knockthrough.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}