{
  "word": "joint",
  "etymologies": [
    {
      "description": [
        "The noun is from Middle English joynt (attested since the late 13th century), from Old French joint (“joint of the body”) (attested since the 12th century). The adjective (attested since the 15th century) is from Old French jointiz. Both Old French words are from Latin iūnctus, the past participle of iungō. See also join, jugular.",
        "The meaning of \"building, establishment\", especially in connection with shady activities, appeared in Anglo-Irish by 1821 and entered general American English slang by 1877, especially in the sense of \"opium den\". The sense \"marijuana cigarette\" is attested since 1935."
      ],
      "adjectives": [
        {
          "description": "joint (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Done by two or more people or organisations working together.",
                  "examples": [
                    "The play was a joint production between the two companies."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "joint (plural joints)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point where two components of a structure join, but are still able to rotate.",
                  "examples": [
                    "This rod is free to swing at the joint with the platform.",
                    "Synonyms: hinge, pivot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point where two components of a structure join rigidly.",
                  "examples": [
                    "The water is leaking out of the joint between the two pipes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Any part of the body where two bones join, in most cases allowing that part of the body to be bent or straightened.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The means of securing together the meeting surfaces of components of a structure.",
                  "examples": [
                    "The dovetail joint, while more difficult to make, is also quite strong."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cut of meat, especially (but not necessarily) (a) one containing a joint in the sense of an articulation or (b) one rolled up and tied.",
                  "examples": [
                    "Set the joint in a roasting tin and roast for the calculated cooking time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part or space included between two joints, knots, nodes, or articulations.",
                  "examples": [
                    "a joint of cane or of a grass stem; a joint of the leg"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A fracture in which the strata are not offset; a geologic joint.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(chiefly US slang, somewhat derogatory) A place of business, particularly in the food service or hospitality industries.",
              "entries": [
                {
                  "meaning": "(slang, dated) A place of resort for tramps.",
                  "examples": []
                },
                {
                  "meaning": "(slang, US, dated) An opium den.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, with the definite article) Prison.",
                  "examples": [
                    "I'm just trying to stay out of the joint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A marijuana cigarette.",
                  "examples": [
                    "After locking the door and closing the shades, they lit the joint.",
                    "Synonyms: see Thesaurus:marijuana cigarette"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A syringe used to inject an illicit drug.",
                  "examples": [
                    "Captain Jack McMahon, chief of Houston's police narcotics division, holds tools of the “junkie” trade, including “joints” (syringes), needles, heroin, milk sugar (used to cut pure heroin), spoons for heating a shot of heroin (mixed with water),  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) The penis.",
                  "examples": [
                    "There I was, going down at last on the star of all those pornographic films that I had been producing in my head since I first laid a hand upon my own joint . . ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally an idiolectic sense) A thing.",
                  "examples": [
                    "a Spike Lee joint",
                    "Compare: jawn"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "joint (third-person singular simple present joints, present participle jointing, simple past and past participle jointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To unite by a joint or joints; to fit together; to prepare so as to fit together",
                  "examples": [
                    "to joint boards",
                    "a jointing plane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To join; to connect; to unite; to combine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a joint or joints; to articulate.",
                  "examples": [
                    "The fingers are  […] jointed together for motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate the joints; of; to divide at the joint or joints; to disjoint; to cut up into joints, as meat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fit as if by joints; to coalesce as joints do.",
                  "examples": [
                    "the stones joint, neatly."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}