{
  "word": "boma",
  "etymologies": [
    {
      "description": [
        "Borrowed from Swahili boma (“enclosure, fortified outpost”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boma (countable and uncountable, plural bomas) (East Africa)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosure usually made of thorn bushes, and latterly of steel fencing, for protection from marauders.",
                  "examples": [
                    "Orders had been given for the entrance to the boma to be blocked up, and accordingly we listened in the expectation of hearing the lion force his way through the bushes with his prey. As a matter of fact the doorway had not been closed and while we were wondering what the lion could be doing inside the boma for so long, he was outside reconnoitering our position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stockade made of bushes and thorns.",
                  "examples": [
                    "the area has three main groups. The Wamasi and Waarushaare still settled on the boma system where the clan settle in one cluster called a boma comprised of several houses enclosed in a fence leaving the centre open for keeping livestock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hide.",
                  "examples": [
                    "You try to arrange the scene so the moonlight will be on the bait with a clear background against which the lion will show up. You pile as much fresh brush as you can on your thicket or boma, as the hiding place is called, for the lion can see as well by day as by night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hut.",
                  "examples": [
                    "The exotic beauty of our Masaailand is a marvel to our creator, she thought as she stepped back into her boma, a typical Masaai hut built with grass, dry sticks and twigs and covered with cow dung for insulation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A military or police post or magistracy.",
                  "examples": [
                    "GWEMBE district police officer-in-charge Adams Gondwe has appealed to Government to put up a police post in Muyumbwe boma to replace one that was washed away by floods last year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of fertilizer rich in animal dung.",
                  "examples": [
                    "The cattle are usually corralled overnight which enables farmers to collect farmyard or boma manure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A method of composting.",
                  "examples": [
                    "The Boma method is used on farms where there are animals (cows, sheep, goats, rabbits, chickens), which are kept in enclosures where droppings are concentrated."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}