{
  "word": "anima",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin anima (“a current of air, wind, air, breath, the vital principle, life, soul”), sometimes equivalent to animus (“mind”), both from Proto-Indo-European *h₂enh₁- (“to breathe, blow”); see animus. Cognate with Ancient Greek ἄνεμος (ánemos, “wind”), Old English anda (“anger, envy, zeal”). More at onde."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "anima (plural animas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly philosophy) The soul or animating principle of a living thing, especially as contrasted with the animus. [from 10th c.]",
                  "examples": [
                    "[W]e cannot chuse but admire the exceeding vividness of the governing faculty or Anima of the Insect, which is able to dispose and regulate so the motive faculties, as to cause every peculiar organ, not onely to move or act so quick, but to do it also so regularly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Jungian psychology) The inner self (not the external persona) of a person that is in touch with the unconscious as opposed to the persona. [from 20th c.]",
                  "examples": [
                    "Dorothy is bodiless and sexless in Tintern Abbey because she is Wordsworth's Jungian anima, an internal aspect of self momentarily projected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Jungian psychology) The unconscious feminine aspect of a person. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}