{
  "word": "final",
  "etymologies": [
    {
      "description": [
        "From Middle English final, fynal, fynall, from Old French final, from Latin fīnālis (“of or relating to the end or to boundaries”), from fīnis (“end”); see fine. Replaced native English endly (“final”)."
      ],
      "adjectives": [
        {
          "description": "final (comparative more final, superlative most final)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Last; ultimate.",
                  "examples": [
                    "final solution;   the final day of a school term"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conclusive; decisive.",
                  "examples": [
                    "a final judgment;   the battle of Waterloo brought the contest to a final issue"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Respecting an end or object to be gained; respecting the purpose or ultimate end in view.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Expressing purpose; as in the term final clause.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Word-final; occurring at the end of a word.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "final (plural finals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) A final examination; a test or examination given at the end of a term or class; the test that concludes a class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Oxbridge slang) A final examination taken at the end of the final year of an undergraduate course, which contributes towards a student's degree classification.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The last round, game or match in a contest, after which the winner is determined.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) The final part of a syllable, the combination of medial and rime in phonetics and phonology.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The tonic or keynote of a Gregorian mode, and hence the final note of any conventional melody played in that mode.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}