{
  "word": "core",
  "etymologies": [
    {
      "description": [
        "From Middle English core, kore, coor (“apple-core, pith”), of uncertain origin. Possibly of native English origin (compare Old English corn (“seed\", also \"grain”), or perhaps from Old French cuer (“heart”), from Latin cor (“heart”); or from Old French cors (“body”), from Latin corpus (“body”). Compare also Middle English colk, coke, coll (“the heart or centre of an apple or onion, core”), Dutch kern (“core”), German Kern (“core”). See also heart, corpse."
      ],
      "adjectives": [
        {
          "description": "core (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forming the most important or essential part.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "core (countable and uncountable, plural cores)",
          "definitionGroups": [
            {
              "group": "In general usage, an essential part of a thing surrounded by other essential things.",
              "entries": [
                {
                  "meaning": "The central part of a fruit, containing the kernels or seeds.",
                  "examples": [
                    "the core of an apple or quince"
                  ]
                },
                {
                  "meaning": "The heart or inner part of a physical thing.",
                  "examples": []
                },
                {
                  "meaning": "The anatomical core, muscles which bridge abdomen and thorax.",
                  "examples": []
                },
                {
                  "meaning": "The center or inner part of a space or area.",
                  "examples": [
                    "the core of the square"
                  ]
                }
              ]
            },
            {
              "group": "The most important part of a thing or aggregate of things wherever located and whether of any determinate location at all; the essence.",
              "entries": [
                {
                  "meaning": "A technical term for classification of things denoting those parts of a category that are most easily or most likely understood as within it.",
                  "examples": []
                },
                {
                  "meaning": "(botany) Used to designate the main and most diverse monophyletic group within a clade or taxonomic group.",
                  "examples": []
                },
                {
                  "meaning": "(game theory) The set of feasible allocations that cannot be improved upon by a subset (a coalition) of the economy's agents.",
                  "examples": []
                }
              ]
            },
            {
              "group": "particular parts of technical instruments or machines essential in function:",
              "entries": [
                {
                  "meaning": "(engineering) The portion of a mold that creates an internal cavity within a casting or that makes a hole in or through a casting.",
                  "examples": []
                },
                {
                  "meaning": "(computing, informal, historical) Ellipsis of core memory.; magnetic data storage.",
                  "examples": []
                },
                {
                  "meaning": "(computer hardware) An individual computer processor, in the sense when several processors (called cores or CPU cores) are plugged together in one single integrated circuit to work as one (called a multi-core processor).",
                  "examples": [
                    "I wanted to play a particular computer game, which required I buy a new computer, so while the game said it needed at least a dual-core processor, I wanted my computer to be a bit ahead of the curve, so I bought a quad-core."
                  ]
                },
                {
                  "meaning": "(engineering) The material between surface materials in a structured composite sandwich material.",
                  "examples": [
                    "a floor panel with a Nomex honeycomb core"
                  ]
                },
                {
                  "meaning": "(engineering, nuclear physics) The inner part of a nuclear reactor, in which the nuclear reaction takes place.",
                  "examples": []
                },
                {
                  "meaning": "(military) The central fissile portion of a fission weapon.",
                  "examples": [
                    "In a hollow-core design, neutrons escape from the core more readily, allowing more fissile material to be used (and thus allowing for a greater yield) while still keeping the core subcritical prior to detonation."
                  ]
                },
                {
                  "meaning": "A piece of ferromagnetic material (e.g., soft iron), inside the windings of an electromagnet, that channels the magnetic field.",
                  "examples": []
                },
                {
                  "meaning": "(printing) A hollow cylindrical piece of cardboard around which a web of paper or plastic is wound.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Hence particular parts of a subject studied or examined by technical operations, likened by position and practical or structural robustness to kernels, cores in the most vulgar sense above.",
              "entries": [
                {
                  "meaning": "(medicine) A tiny sample of organic material obtained by means of a fine-needle biopsy.",
                  "examples": []
                },
                {
                  "meaning": "The bony process which forms the central axis of the horns in many animals.",
                  "examples": []
                },
                {
                  "meaning": "A disorder of sheep caused by worms in the liver.",
                  "examples": []
                },
                {
                  "meaning": "(biochemistry) The central part of a protein's structure, consisting mostly of hydrophobic amino acids.",
                  "examples": []
                },
                {
                  "meaning": "A cylindrical sample of rock or other materials obtained by core drilling.",
                  "examples": []
                },
                {
                  "meaning": "(physics) An atomic nucleus plus inner electrons (i.e., an atom, except for its valence electrons).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "core (third-person singular simple present cores, present participle coring, simple past and past participle cored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the core of an apple or other fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut or drill through the core of (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To extract a sample with a drill.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See corps"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "core (plural cores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A body of individuals; an assemblage.",
                  "examples": [
                    "He was in a core of people."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See chore"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "core (plural cores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A miner's underground working time or shift.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Hebrew כֹּר‎."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "core (plural cores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical units of measure) Alternative form of cor: a former Hebrew and Phoenician unit of volume.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly an acronym for cash on return"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "core (plural cores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive, machinery, aviation, marine) A deposit paid by the purchaser of a rebuilt part, to be refunded on return of a used, rebuildable part, or the returned rebuildable part itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}