{
  "word": "clip",
  "etymologies": [
    {
      "description": [
        "From Middle English clippen, cleppen, clüppen, from Old English clyppan (“to hug, embrace, cherish, clasp”), from Proto-Germanic *klumpijaną, from Proto-Indo-European *glemb-, *glembʰ- (“lump, clump, clod, clamp”). Cognate with Old Frisian kleppa, klippa (“to hug, embrace”), Middle High German klimpen, klimpfen (“to contract tightly, constrict, squeeze”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clip (plural clips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something which clips or grasps; a device for attaching one object to another.",
                  "examples": [
                    "Use this clip to attach the check to your tax form."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unspecified, but normally understood as rapid, speed or pace.",
                  "examples": [
                    "She reads at a pretty good clip.",
                    "He was walking at a fair clip and I was out of breath trying to keep up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An embrace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A frame containing a number of rounds of ammunition which is intended to be inserted into an internal magazine of a firearm to allow for rapid reloading.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, colloquial) A removable magazine of a firearm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projecting flange on the upper edge of a horseshoe, turned up so as to embrace the lower part of the hoof; a toe clip or beak.",
                  "examples": [
                    "The heel - clips are two clips at the heels of the side bars , which correspond to the toe - clip ; the latter embracing the toe of the crust , whilst the former embrace its heels"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing, UK, Scotland) A gaff or hook for landing the fish, as in salmon fishing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clip (third-person singular simple present clips, present participle clipping, simple past and past participle clipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grip tightly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fasten with a clip.",
                  "examples": [
                    "Please clip the photos to the pages where they will go."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To hug, embrace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To collect signatures, generally with the use of a clipboard.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English clippen, from Old Norse klippa (“to clip, cut the hair, shear sheep”). Cognate with Icelandic klippa (“to clip”), Swedish klippa (“to clip”), Danish klippe (“to clip”), Norwegian Bokmål klippe (“to clip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clip (countable and uncountable, plural clips)",
          "definitionGroups": [
            {
              "group": "Something which has been clipped from a larger whole:",
              "entries": [
                {
                  "meaning": "The product of a single shearing of sheep.",
                  "examples": []
                },
                {
                  "meaning": "A season's crop of wool.",
                  "examples": []
                },
                {
                  "meaning": "A section of video taken from a film, broadcast, or other longer video",
                  "examples": [
                    "The morning news today played a clip of last night's debate.",
                    "The 100th episode of Seinfeld consisted of clips from previous episodes."
                  ]
                },
                {
                  "meaning": "A newspaper clipping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of clipping, such as a haircut.",
                  "examples": [
                    "I went into the salon to get a clip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Tyneside) The condition of something, its state.",
                  "examples": [
                    "Deeky the clip of that aad wife ower thor!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A blow with the hand (often in the set phrase clip round the ear)",
                  "examples": [
                    "Give him a clip round the ear!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clip (third-person singular simple present clips, present participle clipping, simple past and past participle clipt or clipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut, especially with scissors or shears as opposed to a knife etc.",
                  "examples": [
                    "She clipped my hair with her scissors.",
                    "Please clip that coupon out of the newspaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To curtail; to cut short.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal, informal) To strike with the hand.",
                  "examples": [
                    "I’ll clip ye round the lugs!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hit or strike, especially in passing.",
                  "examples": [
                    "The car skidded off the road and clipped a lamppost."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) To perform an illegal tackle, throwing the body across the back of an opponent's leg or hitting him from the back below the waist while moving up from behind unless the opponent is a runner or the action is in close line play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(signal processing) To cut off a signal level at a certain maximum value.",
                  "examples": [
                    "The WFM display above shows a very contrasty picture with clipped whites and blacks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) To discard (an occluded part of a model or scene) rather than waste resources on rendering it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics, video games, transitive, intransitive) To move (through or into) (a rendered object or barrier).",
                  "examples": [
                    "The camera keeps clipping that ceiling.",
                    "Clipping through walls is integral to the game's speedruns.",
                    "Oh, no, I clipped my avatar through the barrier!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cheat, swindle, or fleece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to grab or take stealthily",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}