{
  "word": "voodoo",
  "etymologies": [
    {
      "description": [
        "From Louisiana Creole voudou, from Haitian Creole vodou, from a West African language, such as Ewe vódũ (“deity, idol”), Fon vòdún (“fetish”) or the Kwa languages vodũ."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "voodoo (countable and uncountable, plural voodoos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a group of related religious practices found chiefly in and around the Caribbean, particularly in Haiti and Louisiana.",
                  "examples": [
                    "You cannot understand Haitian Vodou as it is practised today without first knowing something about the culture from which it sprang, and the ways history has shaped religion, and vice versa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The spiritual beliefs of the Ewe/Fon of West Africa, practiced chiefly in Benin and in the south of Togo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Any sort of magical or irrational approach to a problem.",
                  "examples": [
                    "I want a real explanation, not this statistical voodoo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) One who practices voodoo; a native sorcerer.",
                  "examples": [
                    "So a reporter of the Boston Herald (U.S.) has 'interviewed' a few local Voodoos. He has seen a dance round a boiling pot, seen some tomfoolery with spiders, and heard a lot of superstitious stories."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "voodoo (third-person singular simple present voodoos, present participle voodooing, simple past and past participle voodooed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bewitch someone or something using voodoo",
                  "examples": [
                    "He claimed his neighbor had voodooed him."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}