{
  "word": "leapfrog",
  "etymologies": [
    {
      "description": [
        "leap +‎ frog."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "leapfrog (countable and uncountable, plural leapfrogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(games) A game, often played by children, in which a player leaps like a frog over the back of another person who has stooped over. One variation of the game involves a number of people lining up in a row and bending over. The last person in the line then vaults forward over each of the others until he or she reaches the front of the line, whereupon he also bends over. The process is then repeated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, law, usually attributive) The process by which a case is appealed or allowed to be appealed directly to a supreme court, bypassing an intermediate appellate court.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "leapfrog (third-person singular simple present leapfrogs, present participle leapfrogging, simple past and past participle leapfrogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To jump over some obstacle, as in the game of leapfrog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To overtake.",
                  "examples": [
                    "This new product will leapfrog the competition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To progress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Britain, law) To appeal or allow to be appealed (a case) directly to a supreme court, bypassing an intermediate appellate court.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To advance by engaging the enemy with one unit while another moves further forward.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}