{
  "word": "application",
  "etymologies": [
    {
      "description": [
        "From Late Middle English applicacioun, borrowed from Old French aplicacion (French application), from Latin applicātiōnem, accusative singular of applicātiō (“attachment; application, inclination”), from applicō (“join to, attach; apply”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "application (countable and uncountable, plural applications)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of applying or laying on, in a literal sense",
                  "examples": [
                    "The application of this cream should reduce the swelling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The substance applied.",
                  "examples": [
                    "His body was stripped, laid out upon a table, and covered with a hearsecloth, when some of his attendants perceived symptoms of returning animation, and by the use of warm applications, internal and external, gradually restored him to life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of applying as a means; the employment of means to accomplish an end; specific use.",
                  "examples": [
                    "All that I have hitherto contended for, is, that whatsoever rigor is necessary, it is more to be us'd, the younger children are; and having by a due application wrought its effect, it is to be relax'd, and chang'd into a milder sort of government."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of directing or referring something to a particular case, to discover or illustrate agreement or disagreement, fitness, or correspondence.",
                  "examples": [
                    "I make the remark, and leave you to make the application.",
                    "The application of a theory to a set of data can be challenging."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A computer program or the set of software that the end user perceives as a single entity as a tool for a well-defined purpose. (Also called: application program; application software.)",
                  "examples": [
                    "This iPhone application can connect to most social networks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A verbal or written request for assistance or employment or admission to a school, course or similar.",
                  "examples": [
                    "December 31 is the deadline for MBA applications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bureaucracy, law) A petition, entreaty, or other request, with the adposition for denoting the subject matter.",
                  "examples": [
                    "Their application for a deferral of the hearing was granted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of requesting, claiming, or petitioning something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Diligence; close thought or attention.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of needlework; appliqué.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Compliance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}