{
  "word": "syndicate",
  "etymologies": [
    {
      "description": [
        "From French syndicat (“office of a syndic; board of syndics; trade union”), from syndic (“syndic; representative; chief magistrate of Geneva”) + -at (“suffix denoting an action or result of an action”), from Medieval Latin *syndicatus, from syndicus (“representative of a corporation or town; syndic”) (from Ancient Greek σύνδικος (súndikos, “advocate for a defendant”), from σύν (sún, “beside; with”) + δίκη (díkē, “judgment; justice”)) + -ātus (“suffix forming adjectives from nouns indicating the possession of a thing or a quality”).",
        "Compare Italian sindacato (“syndicate; trade union; audit, control, supervision”), Occitan sendegat, Portuguese sindicato (“trade union”), Spanish sindicado, sindicato (“office of a syndic; syndicate; trade union”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "syndicate (plural syndicates)",
          "definitionGroups": [
            {
              "group": "A group of individuals or companies formed to transact some specific business, or to promote a common interest; a self-coordinating group.",
              "entries": [
                {
                  "meaning": "(crime) A group of gangsters engaged in organized crime.",
                  "examples": []
                },
                {
                  "meaning": "(mass media) A group of media companies, or an agency, formed to acquire content such as articles, cartoons, etc., and to publish it in multiple outlets; a chain of newspapers or other media outlets managed by such an organization.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The office or jurisdiction of a syndic; a body or council of syndics.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "syndicate (third-person singular simple present syndicates, present participle syndicating, simple past and past participle syndicated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become a syndicate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put under the control of a group acting as a unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mass media) To release media content through a syndicate to be broadcast or published through multiple outlets.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}