{
  "word": "ticket",
  "etymologies": [
    {
      "description": [
        "From Middle English ticket, from Old French etiquet m, *estiquet m, and etiquette f, estiquette f (“a bill, note, label, ticket”), from Old French estechier, estichier, estequier (“to attach, stick”), (compare Picard estiquier (“to stick, pierce”)), from Frankish *stikkjan, *stekan (“to stick, pierce, sting”), from Proto-Germanic *stikaną, *stikōną, *staikijaną (“to be sharp, pierce, prick”), from Proto-Indo-European *(s)teyg- (“to be sharp, to stab”). Doublet of etiquette. More at stick."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ticket (plural tickets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pass entitling the holder to admission to a show, concert, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pass entitling the holder to board a train, a bus, a plane, or other means of transportation",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A citation for a traffic violation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A permit to operate a machine on a construction site.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A service request, used to track complaints or requests that an issue be handled. (Generally technical support related).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A list of candidates for an election, or a particular theme to a candidate's manifesto.",
                  "examples": [
                    "Joe has joined the party's ticket for the county elections.",
                    "Joe will be running on an anti-crime ticket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A solution to a problem; something that is needed.",
                  "examples": [
                    "That's the ticket.",
                    "I saw my first bike as my ticket to freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A little note or notice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A tradesman's bill or account (hence the phrase on ticket and eventually on tick).",
                  "examples": [
                    "Your courtier is mad to take up silks and velvets / On ticket for his mistress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A label affixed to goods to show their price or description.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A certificate or token of a share in a lottery or other scheme for distributing money, goods, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A visiting card.",
                  "examples": [
                    "I asked for a card, please, and she was quite put about, and said that she didn't require tickets to get in where she visited."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law enforcement slang) A warrant.",
                  "examples": [
                    "[…]  I need a ticket, Bobby.” Agnor knew a ticket meant a search warrant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A certificate of qualification as a ship's master, pilot, or other crew member.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ticket (third-person singular simple present tickets, present participle ticketing, simple past and past participle ticketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To issue someone a ticket, as for travel or for a violation of a local or traffic law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark with a ticket.",
                  "examples": [
                    "to ticket goods in a retail store"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}