{
  "word": "enter",
  "etymologies": [
    {
      "description": [
        "From Middle English entren, from Old French entrer, from Latin intrō (“enter”, verb), from intrā (“inside”). Has been spelled as \"enter\" for several centuries even in the United Kingdom, although British English and the English of many Commonwealth Countries (e.g. Australia, Canada) retain the \"re\" ending for many words such as centre, fibre, spectre, theatre, calibre, sombre, lustre, and litre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "enter (plural enters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Alternative spelling of Enter (“the computer key”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Alternative spelling of Enter (“a stroke of the computer key”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "enter (third-person singular simple present enters, present participle entering, simple past and past participle entered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go or come into an enclosed or partially enclosed space.",
                  "examples": [
                    "You should knock before you enter, unless you want to see me naked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to go (into), or to be received (into); to put in; to insert; to cause to be admitted.",
                  "examples": [
                    "to enter a knife into a piece of wood;  to enter a boy at college, a horse for a race, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To go or come into (a state or profession).",
                  "examples": [
                    "My twelve-year-old son will be entering his teens next year.  She had planned to enter the legal profession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To type (something) into a computer; to input.",
                  "examples": [
                    "Enter your user name and password."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To record (something) in an account, ledger, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, law) To become a party to an agreement, treaty, etc.",
                  "examples": [
                    "I am pleased to notify the Congress of my intent to enter into a Free Trade Agreement (FTA) with the Government of Singapore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, intransitive) To become effective; to come into effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To go into or upon, as lands, and take actual possession of them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To place in regular form before the court, usually in writing; to put upon record in proper from and order",
                  "examples": [
                    "to enter a writ, appearance, rule, or judgment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make report of (a vessel or its cargo) at the custom house; to submit a statement of (imported goods), with the original invoices, to the proper customs officer for estimating the duties. See entry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, dated, historical) To file, or register with the land office, the required particulars concerning (a quantity of public land) in order to entitle a person to a right of preemption.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deposit for copyright the title or description of (a book, picture, map, etc.).",
                  "examples": [
                    "entered according to act of Congress"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To initiate; to introduce favourably.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}