{
  "word": "chevron",
  "etymologies": [
    {
      "description": [
        "Borrowed from French chevron (“rafter, chevron”), the mark so called because it looks like rafters of a shallow roof, from Vulgar Latin *capriō, from Latin caper (“goat”), the likely connection between goats and rafters being the animal's angular hind legs."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chevron (plural chevrons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A V-shaped pattern; used in architecture, and as an insignia of military or police rank, on the sleeve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A wide inverted V placed on a shield.",
                  "examples": [
                    "Coordinate terms: chevronel, couple-close"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) One of the V-shaped markings on the surface of roads used to indicate minimum distances between vehicles.",
                  "examples": [
                    "I told you that in fact they were called chevrons and it was an exercise by the transport department to teach us to stay two chevrons behind the car in front."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A guillemet, either of the punctuation marks “«” or “»”, used in several languages to indicate passages of speech. Similar to typical quotation marks used in the English language such as ““” and “””.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An angle bracket, either used as a typographic or a scientific symbol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A háček, a diacritical mark that may resemble an inverted circumflex.",
                  "examples": [
                    "It is pertinent to remember, however, that one of the greatest phoneticians, Jan Hus, used diacritics (in the form of points, which have later become chevrons in his own language), and that his alphabet is the most satisfactory for eastern Europe, since it has been officially adopted by the languages which use the Latin script."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chevron (third-person singular simple present chevrons, present participle chevroning, simple past and past participle chevroned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To form or be formed into chevrons",
                  "examples": [
                    "...the sheet to be chevroned locks itself into the furrow."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}