{
  "word": "harp",
  "etymologies": [
    {
      "description": [
        "From Middle English harpe, from Old English hearpe (“harp”), from Proto-West Germanic *harpā, from Proto-Germanic *harpǭ (“harp”). Cognate with Scots hairp (“harp”), West Frisian harpe, harp (“harp”), Low German Harp (“harp”), Dutch harp (“harp”), German Harfe (“harp”), Danish harpe (“harp”), Swedish harpa (“harp”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "harp (plural harps)",
          "definitionGroups": [
            {
              "group": "(music) A musical instrument consisting of a body and a curved neck, strung with strings of varying length that are stroked or plucked with the fingers and are vertical to the soundboard when viewed from the end of the body",
              "entries": [
                {
                  "meaning": "Any instrument of the same musicological type.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A harmonica.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A grain sieve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for harp seal.",
                  "examples": [
                    "More likely, it was the prospect of meat. Curwen was by now craving a juicy roast – 'even seal chop' – and was always loosing off at tickleasses and harps."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "harp (third-person singular simple present harps, present participle harping, simple past and past participle harped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with on) To repeatedly mention a subject.",
                  "examples": [
                    "Why do you harp on a single small mistake? (US)",
                    "Why do you harp on about a single small mistake? (UK)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play on (a harp or similar instrument).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play (a tune) on the harp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To develop or give expression to by skill and art; to sound forth as from a harp; to hit upon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}