{
  "word": "fish",
  "etymologies": [
    {
      "description": [
        "From Middle English fisch, from Old English fisċ (“fish”), from Proto-West Germanic *fisk, from Proto-Germanic *fiskaz (“fish”) (compare West Frisian fisk, Dutch vis, German Fisch, Danish fisk, Norwegian fisk, Swedish fisk, Icelandic fiskur), from Proto-Indo-European *peysḱ- (“fish”) (compare Irish iasc, Latin piscis)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fish (countable and uncountable, plural fish or fishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A cold-blooded vertebrate animal that lives in water, moving with the help of fins and breathing with gills.",
                  "examples": [
                    "Salmon is a fish.",
                    "The fishmonger sells fishes from all over the world.",
                    "Ichthyologists study the fish of the world.",
                    "We have many fish in our aquarium."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or loosely) Any animal (or any vertebrate) that lives exclusively in water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Newfoundland) Cod; codfish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh of the fish used as food.",
                  "examples": [
                    "The seafood pasta had lots of fish but not enough pasta.",
                    "Though Lena is a vegetarian, she doesn't have any problem with eating fish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A card game in which the object is to obtain cards in pairs or sets of four (depending on the variation), by asking the other players for cards of a particular rank.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, derogatory, slang) A woman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, slang) An easy victim for swindling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, poker slang) A bad poker player. Compare shark (a good poker player).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, nautical) A makeshift overlapping longitudinal brace, originally shaped roughly like a fish, used to temporarily repair or extend a spar or mast of a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A purchase used to fish the anchor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, nautical, military, slang) A torpedo (self-propelled explosive device).",
                  "examples": [
                    "The second and third fish went to the middle of her long superstructure and under her forward deck."
                  ]
                }
              ]
            },
            {
              "group": "(zoology) A paraphyletic grouping of the following extant taxonomic groups:",
              "entries": [
                {
                  "meaning": "Class Myxini, the hagfish (no vertebrae)",
                  "examples": []
                },
                {
                  "meaning": "Class Petromyzontida, the lampreys (no jaw)",
                  "examples": []
                },
                {
                  "meaning": "Within infraphylum Gnathostomata (jawed vertebrates (also including Tetrapoda))",
                  "examples": []
                },
                {
                  "meaning": "Class Chondrichthyes, cartilaginous fish such as sharks and rays",
                  "examples": []
                },
                {
                  "meaning": "Superclass Osteichthyes, bony fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The thirty-fourth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison slang) A new (usually vulnerable) prisoner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Jamaica, offensive, derogatory) A male homosexual; a gay man.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Deverbal from to fish (etymology 3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fish (plural fishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of time spent fishing.",
                  "examples": [
                    "The fish at the lake didn't prove successful."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of seeking something.",
                  "examples": [
                    "Merely two fishes for information told the whole story."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old English fiscian, from Proto-West Germanic *fiskōn, from Proto-Germanic *fiskōną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fish (third-person singular simple present fishes, present participle fishing, simple past and past participle fished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt fish or other aquatic animals in a body of water.",
                  "examples": [
                    "We went fishing for crabs by the pier.",
                    "She went to the river to fish for trout."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To search (a body of water) for something other than fish.",
                  "examples": [
                    "They fished the surrounding lakes for the dead body."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing, transitive) To use as bait when fishing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To (attempt to) find or get hold of an object by searching among other objects.",
                  "examples": [
                    "Synonym: rummage",
                    "Why are you fishing through my things?",
                    "He was fishing for the keys in his pocket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by \"for\" or \"around for\") To talk to people in an attempt to get them to say something, or seek to obtain something by artifice.",
                  "examples": [
                    "The detective visited the local pubs fishing around for more information.",
                    "The actors loitered at the door, fishing for compliments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket) Of a batsman, to attempt to hit a ball outside off stump and miss it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To repair (a spar or mast) by fastening a beam or other long object (often called a fish) over the damaged part (see Noun above).",
                  "examples": [
                    "[…]  the crew were set to replacing and splicing the rigging and fishing the spars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To hoist the flukes of.",
                  "examples": [
                    "Found that the cause of the ship's having drifted on the night of the 19th, was from the bight of the chain span (used to fish the anchor,) having slipped between the shank and upper fluke, thereby preventing the lower fluke from opening  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French fiche (“peg, mark”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fish (plural fishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A counter, used in various games.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}