{
  "word": "scab",
  "etymologies": [
    {
      "description": [
        "From Middle English scabb, scabbe (also as shabbe, schabbe > English shab), from Old English sċeabb and Old Norse skabb, both from Proto-Germanic *skabbaz (“scab, scabies”), from Proto-Indo-European *skabʰ- (“to cut, split, carve, shape”). Doublet of shab. Cognate with German Schabe (“scabies”), Danish skab (“scab, scabies”), Swedish skabb (“scab, scabies”), Latin scabies (“scab, itch, mange”). Related also to Old English scafan (“to scrape, shave”), Latin scabere (“to scratch”), English shabby."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scab (countable and uncountable, plural scabs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An incrustation over a sore, wound, vesicle, or pustule, formed during healing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial or obsolete) The scabies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mange, especially when it appears on sheep.",
                  "examples": [
                    "Scab was the terror of the sheep farmer, and the peril of his calling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any of several different diseases of potatoes producing pits and other damage on their surface, caused by streptomyces bacteria (but formerly believed to be caused by a fungus).",
                  "examples": [
                    "Coordinate term: blight"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Common scab, a relatively harmless variety of scab (potato disease) caused by Streptomyces scabies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phytopathology) Any one of various more or less destructive fungal diseases that attack cultivated plants, forming dark-colored crustlike spots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(founding) A slight irregular protuberance which defaces the surface of a casting, caused by the breaking away of a part of the mold.",
                  "examples": [
                    "Coordinate term: (material left around the edge of a moulded part) flash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mean, dirty, paltry fellow.",
                  "examples": [
                    "Synonyms: see Thesaurus:villain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A worker who acts against trade union policies; any picket crosser (strikebreaker), and especially one with devotion to union busting.",
                  "examples": [
                    "When a scab comes down the street, men turn their backs and angels weep in heaven, and the devil shuts the gates of hell to keep him out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scab (third-person singular simple present scabs, present participle scabbing, simple past and past participle scabbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become covered by a scab or scabs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form into scabs and be shed, as damaged or diseased skin.",
                  "examples": [
                    "Thoſe Puſtules aroſe, maturated, and ſcabbed off, intirely like the true Pox."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove part of a surface (from).",
                  "examples": [
                    "The beds shall be scabbed off to give a solid bearing, no pinning shall be admitted between the backing and the face stones and there shall be a good square joint not exceeding one inch in width, and the face stone shall be scabbed off to allow this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a strikebreaker.",
                  "examples": [
                    "Nobody desires to scab, to give most for least. The ambition of every individual is quite the opposite, to give least for most; and, as a result, living in a tooth-and-nail society, battle royal is waged by the ambitious individuals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, Australia, New Zealand, informal) To beg (for), to cadge or bum.",
                  "examples": [
                    "I scabbed some money off a friend."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}