{
  "word": "turf",
  "etymologies": [
    {
      "description": [
        "From Middle English turf, torf, from Old English turf (“turf, sod, soil, piece of grass covered earth, greensward”), from Proto-West Germanic *turb, from Proto-Germanic *turbz (“turf, lawn”), from Proto-Indo-European *derbʰ- (“tuft, grass”).",
        "Cognate with Dutch turf (“turf”), Middle Low German torf (“peat, turf”) (whence German Torf and German Low German Torf), Swedish torv (“turf”), Norwegian torv (“turf”), Icelandic torf (“turf”), Russian трава (trava, “grass”), Sanskrit दर्भ (darbhá, “a kind of grass”), दूर्वा (dū́rvā, “bent grass”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turf (countable and uncountable, plural turfs or turves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A layer of earth covered with grass; sod.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A piece of such a layer cut from the soil. May be used as sod to make a lawn, dried for peat, stacked to form earthen structures, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A block of peat used as fuel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) A territory claimed by a person, gang, etc., as their own.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, with \"the\", sports) A racetrack, hippodrome; or the sport of racing horses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "turf (third-person singular simple present turfs, present participle turfing, simple past and past participle turfed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover with turf; to create a lawn by laying turfs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ultimate Frisbee) To throw a frisbee well short of its intended target, usually causing it to hit the ground within 10 yards of its release.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) To fire from a job or dismiss from a task.",
                  "examples": [
                    "Eight managers were turfed after the merger of the two companies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) To cancel a project or product.",
                  "examples": [
                    "The company turfed the concept car because the prototype performed poorly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, transitive) To expel, eject, or throw out; to turf out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medical slang, transitive) To transfer or attempt to transfer (a patient or case); to eschew or avoid responsibility for.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}