{
  "word": "dump",
  "etymologies": [
    {
      "description": [
        "From Middle English dumpen, dompen, probably from Old Norse dumpa (“to thump”) (whence Danish dumpe (“to fall suddenly”)), of uncertain origin, possibly imitative of falling, similar to thump."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dump (plural dumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where waste or garbage is left; a ground or place for dumping ashes, refuse, etc.; a disposal site.",
                  "examples": [
                    "A toxic waste dump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A car or boat for dumping refuse, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is dumped, especially in a chaotic way; a mess.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An act of dumping, or its result.",
                  "examples": [
                    "The new XML dump is coming soon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A formatted listing of the contents of program storage, especially when produced automatically by a failing program.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A storage place for supplies, especially military.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An unpleasant, dirty, disreputable, unfashionable, boring, or depressing looking place.",
                  "examples": [
                    "This place looks like a dump.",
                    "Don't feel bad about moving away from this dump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, often with the verb \"take\", euphemistic) An act of defecation; a defecating.",
                  "examples": [
                    "I have to take a dump."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A sad, gloomy state of the mind; sadness; melancholy; despondency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Absence of mind; reverie.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A pile of ore or rock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A melancholy strain or tune in music; any tune.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An old kind of dance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Australia, Canada) A small coin made by punching a hole in a larger coin (called a holey dollar).",
                  "examples": [
                    "Basically, to overcome an acute shortage of money in 1813, Governor Lachlan Macquarie bought silver dollars from Spain and then punched the centres out, thereby producing two coins - the ‘holey dollar’ (worth five shillings) and the ‘dump’ (worth one shilling and threepence). Talk about creating money out of nothing—the original silver dollar only cost five shillings! The holey dollar and the dump have been adopted as the symbol for the Macquarie Bank in Australia."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) A temporary display case that holds many copies of an item being sold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dump (third-person singular simple present dumps, present participle dumping, simple past and past participle dumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To release, especially in large quantities and chaotic manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discard; to get rid of something one no longer wants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sell below cost or very cheaply; to engage in dumping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To copy (data) from a system to another place or system, usually in order to archive it.",
                  "examples": [
                    "to dump the ROM from a rare Nintendo game cartridge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To output the contents of storage or a data structure, often in order to diagnose a bug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To end a romantic relationship with.",
                  "examples": [
                    "Sarah dumped Nelson after finding out he was cheating on her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, Scotland) To knock heavily; to stump.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put or throw down with more or less of violence; hence, to unload from a cart by tilting it",
                  "examples": [
                    "We dumped the coal onto the fireplace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To precipitate (especially snow) heavily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia) Of a surf wave, to crash a swimmer, surfer, etc., heavily downwards.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See dumpling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dump (plural dumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, archaic) A thick, ill-shapen piece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, archaic) A lead counter used in the game of chuck-farthing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Cognate with Scots dump (“hole in the ground”), Norwegian dump (“a depression or hole in the ground”), German Low German dumpen (“to submerge”), Dutch dompen (“to dip, sink, submerge”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dump (plural dumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England) A deep hole in a river bed; a pool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}