{
  "word": "tormentor",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman tourmentour, from Old French tormenteor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tormentor (plural tormentors)",
          "definitionGroups": [
            {
              "group": "One who torments; a person, animal, or object that causes suffering.",
              "entries": [
                {
                  "meaning": "(archaic) A person delegated to torture prisoners.",
                  "examples": [
                    "All the racks and dungeons of Rome, with their tormentors, could not terrify him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something abstract that causes suffering.",
                  "examples": [
                    "The infant  […]  feels only the uneasiness of the present instant, which can never be great. With regard to the future it is perfectly secure, and in its thoughtlessness and want of foresight possesses an antidote against fear and anxiety, the great tormentors of the human breast, from which reason and philosophy will in vain attempt to defend it when it grows up to a man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) One of a pair of narrow curtains just behind the front curtain and teaser that mask the areas on the sides of the stage and can be adjusted to the desired width.",
                  "examples": [
                    "Then Nathan Eldred, gently pushing, was muttering, ‘On you go, dear. Good luck!’ and she was edging between the tormentor and the backing flats, in front of the curtain, holding her small hands out to the sudden-silenced audience  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement for reducing a stiff soil, resembling a harrow, but running upon wheels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, nautical) A long meat-fork.",
                  "examples": [
                    "Cabin furniture received onboard the U.S.F. Constellation at Washington  […]  1 Cleaver and tormentors/Cook; [footnote:] A tormentor is a long iron meat fork used by sea cooks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}