{
  "word": "emarginate",
  "etymologies": [
    {
      "description": [
        "From Latin emarginare; e- (“out”) + marginare (“to furnish with a margin”), from margo (“margin”)."
      ],
      "adjectives": [
        {
          "description": "emarginate (comparative more emarginate, superlative most emarginate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, of leaves) With the outline of the margin more or less concave in places, usually at the apex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, mycology) Having roughly the same height or width for most of its length, becoming much shallower or narrower before reaching the attachment point.",
                  "examples": [
                    "In this group of mushrooms, the attachment of the gills to the stipe is emarginate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, anatomy) Having a margin that has concave edges as though with parts removed or notched.",
                  "examples": [
                    "In the Haliotus, Lam, the shell is perforated along the side of the columella with a series of holes; and when the last hole remains incomplete, the shell has the appearance of beiing emarginate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mineralogy) Of a crystal: having edges or corners of the primitive form beveled, crossed by a face.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "emarginate (third-person singular simple present emarginates, present participle emarginating, simple past and past participle emarginated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take away the margin of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lose the margin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To marginalize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}