{
  "word": "spike",
  "etymologies": [
    {
      "description": [
        "From Middle English spike, spyke, spik , from Old Norse spík (“spike, sprig”), from Proto-Germanic *spīkō (“stick, splinter, point”), from Proto-Indo-European *spey- (“to be pointed; sharp point, stick”). Cognate with Icelandic spík (“spike”), Swedish spik (“spike, nail”), Dutch spijker (“nail”), Old English spīcing (“spike”), and Latin spīca (“ear of corn”), which may have influenced some senses."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spike (plural spikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sort of very large nail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of pointed metal etc. set with points upward or outward.",
                  "examples": [
                    "The trap was lined with spikes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything resembling such a nail in shape.",
                  "examples": [
                    "He wears on his head the corona radiata  […] ; the spikes that shoot out represent the rays of the sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ear of corn or grain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) A kind of inflorescence in which sessile flowers are arranged on an unbranched elongated axis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, chiefly in the plural) A running shoe with spikes in the sole to provide grip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp peak in a graph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A surge in power or in the price of a commodity, etc.; any sudden and brief change that would be represented by a sharp peak on a graph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rod-like protrusion from a woman's high-heeled shoe that elevates the heel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long nail for storing papers by skewering them; (by extension) the metaphorical place where rejected newspaper articles are sent.",
                  "examples": [
                    "Synonym: spindle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) An attack from, usually, above the height of the net performed with the intent to send the ball straight to the floor of the opponent or off the hands of the opposing block.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) An adolescent male deer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, historical) The casual ward of a workhouse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Spike lavender.",
                  "examples": [
                    "oil of spike"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, lutherie) Synonym of endpin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A mark indicating where a prop or other item should be placed on stage.",
                  "examples": [
                    "Sometimes actors set props on the spikes, or sometimes a deckhand will do it, depending on the action of the play."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering, XP) A small project that uses the simplest possible program to explore potential solutions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spike (third-person singular simple present spikes, present participle spiking, simple past and past participle spiked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fasten with spikes, or long, large nails.",
                  "examples": [
                    "to spike down planks"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set or furnish with spikes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To embed nails into (a tree) so that any attempt to cut it down will damage equipment or injure people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix on a spike.",
                  "examples": [
                    "He spiked the story on the “dead” hook and answered his interphone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, journalism) To discard; to decide not to publish or make public.",
                  "examples": [
                    "Nicolaas, or Nick, as the family called him, wanted to turn professional but an ear injury, sustained during the war, spiked his plans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To increase sharply.",
                  "examples": [
                    "Traffic accidents spiked in December when there was ice on the roads."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To covertly put alcohol or another intoxicating substance into a drink.",
                  "examples": [
                    "She spiked my lemonade with vodka!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To add a small amount of one substance to another.",
                  "examples": [
                    "The water sample to be tested has been spiked with arsenic, antimony, mercury, and lead in quantities commonly found in industrial effluents."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) To attack from, usually, above the height of the net with the intent to send the ball straight to the floor of the opponent or off the hands of the opposing block.",
                  "examples": [
                    "Synonyms: attack, hit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To render (a gun) unusable by driving a metal spike into its touch hole.",
                  "examples": [
                    "Small skirmishes also took place, and the Afghans managed to seize a pair of mule-guns and force the British to spike and abandon two other precious guns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football slang) To slam the football to the ground, usually in celebration of scoring a touchdown, or to stop expiring time on the game clock after snapping the ball as to save time for the losing team to attempt to score the tying or winning points.",
                  "examples": [
                    "to spike the football"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To inject a drug with a syringe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}