{
  "word": "douzeper",
  "etymologies": [
    {
      "description": [
        "From Middle English dosse per, dousse-per (“one of Charlemagne’s twelve peers or paladins; one of the twelve great peers of France at later times; a famous knight or noble”) [and other forms], treated as a singular form of dosse pers, dousse pers [and other forms], from Anglo-Norman, Middle French douse pers, douze pers [and other forms], and Old French douze pers, doze pers, duze pers (“Charlemagne’s twelve peers; twelve great peers of France at later times”) [and other forms] (also in the singular forms doze per, duze per, and in Anglo-Norman and Middle French written with a Roman numeral as XII pers), from doze, douze (“twelve”) (modern French douze) + pers (plural of per (“peer”); modern French pair). Doze is derived from Latin duodecim (“twelve”), from duo (“two”) (ultimately from Proto-Indo-European *dwóh₁ (“two”)) + decem (“ten”) (ultimately from Proto-Indo-European *déḱm̥ (“ten”)); per is derived from Latin pār (“equal; like”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "douzeper (plural douzepers) (rare, chiefly in the plural)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical fiction) One of the legendary \"twelve peers\" or renowned warriors of Charlemagne, the Emperor of the Romans from 800 to 814. [13th–17th c.; revived 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, historical) One of the twelve nobles granted feudal territories or episcopal sees by the King of France in return for their fealty (namely the Archbishop-Duke of Rheims; the Bishop-Dukes of Laon and Langres; the Bishop-Counts of Beauvais, Chalons, and Noyon, the Dukes of Normandy, Burgundy, and Aquitaine; and the Counts of Toulouse, Flanders and Champagne). [13th–17th c.; revived 19th c.]",
                  "examples": [
                    "Synonym: paladin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An individual considered to be like or in the model of Charlemagne's peers; someone considered a great hero or paladin. [14th–16th c.; revived 19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}