{
  "word": "hiss",
  "etymologies": [
    {
      "description": [
        "From Middle English hissen, probably of onomatopoeic origin. Compare Middle Dutch hissen, hisschen."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hiss (plural hisses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sibilant sound, such as that made by a snake or escaping steam; an unvoiced fricative.",
                  "examples": [
                    "Her voice was a hiss, like gas escaping from a bottle of soda."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expression of disapproval made using such a sound.",
                  "examples": [
                    "The Actors, in the midst of an innocent old Play, are often startled with unexpected Claps or Hisses; and do not know whether they have been talking like good Subjects, or have spoken Treason."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hiss (third-person singular simple present hisses, present participle hissing, simple past and past participle hissed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a hissing sound.",
                  "examples": [
                    "As I started to poke it, the snake hissed at me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To call someone by hissing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To condemn or express contempt (for someone or something) by hissing.",
                  "examples": [
                    "The crowd booed and hissed her off the stage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter (something) with a hissing sound.",
                  "examples": [
                    "Lies oft o’erthrown with ceaseless Venom spread,Still hiss out Scandal from their Hydra Head,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with a hissing sound.",
                  "examples": [
                    "The arrow hissed through the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To emit or eject (something) with a hissing sound.",
                  "examples": [
                    "The man in white pyjamas hissed soda into his glass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To whisper, especially angrily or urgently.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}