{
  "word": "brush",
  "etymologies": [
    {
      "description": [
        "From Middle English brusshe, from Old French broisse (Modern French brosse), from Vulgar Latin *brustia, from Frankish *bursti, from Proto-Germanic *burstiz (“bristle”), or also Vulgar Latin *bruscia, from Proto-Germanic *bruskaz (“tuft, thicket, underbrush”), which could be from Proto-Indo-European *bʰrusgo-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brush (countable and uncountable, plural brushes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement consisting of multiple more or less flexible bristles or other filaments attached to a handle, used for any of various purposes including cleaning, painting, and arranging hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of brushing something.",
                  "examples": [
                    "She gave her hair a quick brush."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of conductive material, usually carbon, serving to maintain electrical contact between the stationary and rotating parts of a machine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brush-like electrical discharge of sparks.",
                  "examples": [
                    "Synonym: corposant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Wild vegetation, generally larger than grass but smaller than trees. See shrubland.",
                  "examples": [
                    "We broke away toward the north, the tribe howling on our track. Across the open spaces we gained, and in the brush they caught up with us, and more than once it was nip and tuck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short and sometimes occasional encounter or experience.",
                  "examples": [
                    "He has had brushes with communism from time to time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The furry tail of an animal, especially of a fox.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A tuft of hair on the mandibles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A short contest, or trial, of speed.",
                  "examples": [
                    "Mark and Lord Lufton had been boys together, and his lordship knew that Mark in his heart would enjoy a brush across the country quite as well as he himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An instrument, resembling a brush, used to produce a soft sound from drums or cymbals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) An on-screen tool for \"painting\" a particular colour or texture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) A set of defined design and parameters that produce drawn strokes of a certain texture and quality.",
                  "examples": [
                    "Coordinate term: texture",
                    "downloading brushes for Photoshop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) In 3D video games, a convex polyhedron, especially one that defines structure of the play area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker, slang) The floorperson of a poker room, usually in a casino.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(North Wisconsin, uncountable) Evergreen boughs, especially balsam, locally cut and baled for export, usually for use in making wreaths.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brush (third-person singular simple present brushes, present participle brushing, simple past and past participle brushed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean with a brush.",
                  "examples": [
                    "Brush your teeth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To untangle or arrange with a brush.",
                  "examples": [
                    "Brush your hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply with a brush.",
                  "examples": [
                    "I am brushing the paint onto the walls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove with a sweeping motion.",
                  "examples": [
                    "'She brushes the flour off your clothes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To touch with a sweeping motion, or lightly in passing.",
                  "examples": [
                    "Her scarf brushed his skin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To clean one's teeth by brushing them.",
                  "examples": [
                    "Of course, Halloween does not have to be completely treatless. Plain chocolate candy is okay, provided you remember to brush afterwards."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}