{
  "word": "solitaire",
  "etymologies": [
    {
      "description": [
        "Borrowed from French solitaire, ultimately from Latin sōlitārius. Doublet of solitary."
      ],
      "adjectives": [
        {
          "description": "solitaire (comparative more solitaire, superlative most solitaire)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "living or being alone; solitary",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "solitaire (countable and uncountable, plural solitaires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who lives alone; a recluse or hermit.",
                  "examples": [
                    "[…]  he really wishes he had never beheld you, nor yours. You have spoiled him for a solitaire, and a book, all the days of his life; and put him into such a condition, that he thinks of nothing, and enquires of nothing but after a person who has nothing to say to him, and has left him for ever  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game for one person, played on a board with pegs or balls, in which the object is, beginning with all the places filled except one, to remove all but one of the pieces by \"jumping\", as in draughts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) Any of various card games that can be played by one person. Called patience in the rest of the world.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extinct bird, related to the dodo, Pezophaps solitaria Rodrigues solitaire), that lived on the island of Rodrigues.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An extinct bird formerly believed to be related to the dodo, more precisely Réunion solitaire, Raphus solitarius, now preferably Réunion ibis, Threskiornis solitarius.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of several American species of bird in the genus Myadestes in the thrush family.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single gem, usually a diamond, mounted in a piece of jewellery by itself.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A black neck ribbon worn with a bag wig in the 18th century.",
                  "examples": [
                    "The fellow wears a solitaire, uses paint, and takes rappee with all the grimace of a French marquis."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}