{
  "word": "connive",
  "etymologies": [
    {
      "description": [
        "From French conniver (“to ignore and thus become complicit in wrongdoing”), or directly from its etymon Latin connīvēre, cōnīvēre, third-person plural perfect active indicative of connīveō, cōnīveō (“to close or screw up the eyes, blink, wink; to overlook, turn a blind eye, connive”) (perhaps alluding to two persons involved in a scheme together winking to each other), from con- (prefix indicating a being or bringing together of several objects) + *nīvēre (related to nictō (“to blink, wink”), from Proto-Indo-European *kneygʷʰ- (“to bend, droop”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "connive (third-person singular simple present connives, present participle conniving, simple past and past participle connived)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To secretly cooperate with other people in order to commit a crime or other wrongdoing; to collude, to conspire. [from mid 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, botany, rare) Of parts of a plant: to be converging or in close contact; to be connivent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) Often followed by at: to pretend to be ignorant of something in order to escape blame; to ignore or overlook a fault deliberately.",
                  "examples": [
                    "Synonyms: (rare) dissimulate, look the other way, shut one's eyes, turn a blind eye, wink"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To open and close the eyes rapidly; to wink.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}