{
  "word": "mercurial",
  "etymologies": [
    {
      "description": [
        "Noun sense 1 (“(obsolete) plant known as mercury”) is from Middle English mercurial, from Anglo-Norman mercurial and Old French mercurial, or directly from their etymon,  from Mercurius (“the Roman god Mercury”) + -ālis (suffix forming adjectives of relationship from nouns).",
        "Later adjective and noun uses may have been directly derived from Latin mercuriālis, whence Middle English mercurial (“under the astrological influence of the planet Mercury”)."
      ],
      "adjectives": [
        {
          "description": "mercurial (comparative more mercurial, superlative most mercurial)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(comparable) Having a lively or volatile character; animated, changeable, quick-witted. [from 17th c.]",
                  "examples": [
                    "Synonyms: fickle, unpredictable",
                    "his mercurial temperament"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, astrology) Pertaining to the astrological influence of the planet Mercury; having the characteristics of a person under such influence (see adjective sense 1). [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, astronomy) Pertaining to the planet Mercury. [from 16th c., from 14th c. Middle English]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, chemistry) Of or pertaining to the element mercury or quicksilver; containing mercury. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, medicine) Caused by the action of mercury or a mercury compound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable, Roman mythology) Pertaining to Mercury, the Roman god of, among other things, commerce, financial gain, communication, and thieves and trickery; hence (comparable), money-making; crafty. [from 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun sense 1 (“(obsolete) plant known as mercury”) is from Middle English mercurial, from Anglo-Norman mercurial and Old French mercurial, or directly from their etymon,  from Mercurius (“the Roman god Mercury”) + -ālis (suffix forming adjectives of relationship from nouns). Later adjective and noun uses may have been directly derived from Latin mercuriālis, whence Middle English mercurial (“under the astrological influence of the planet Mercury”).",
          "definitionGroups": []
        },
        {
          "description": "mercurial (plural mercurials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any of the plants known as mercury, especially the annual mercury or French mercury (Mercurialis annua). [13th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) A person born under the influence of the planet Mercury; hence, a person having an animated, lively, quick-witted or volatile character. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A chemical compound containing mercury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology, historical) A preparation of mercury, especially as a treatment for syphilis. [from 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}