{
  "word": "stopper",
  "etymologies": [
    {
      "description": [
        "stop +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stopper (plural stoppers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agent noun of stop, someone or something that stops something.",
                  "examples": [
                    "Often, in our conversations we encourage people to talk, or we manage to stop them. This can happen without our even thinking about it. Following is a list of conversation starters and stoppers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of knot at the end of a rope, to prevent it from unravelling.",
                  "examples": [
                    "Put a stopper in the knot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bung or cork.",
                  "examples": [
                    "We need a stopper or the boat will sink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, soccer) Goalkeeper.",
                  "examples": [
                    "He's the number one stopper in the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, slang) In the commodity futures market, someone who is long (owns) a futures contract and is demanding delivery because they want to take possession of the deliverable commodity.",
                  "examples": [
                    "Cattle futures: spillover momentum plus evidence of a strong stopper (i.e., 96 loads demanded) should kick the opening higher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A train that calls at all or almost all stations between its origin and destination, including very small ones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Any of several trees of the genus Eugenia, found in Florida and the West Indies.",
                  "examples": [
                    "Red Stopper. Leaves ovate-oblong, contracted at the apex into long points, coriaceous. Eugenia Garber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A short rope for making something fast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A playspot where water flows back on itself, creating a retentive feature.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stopper (third-person singular simple present stoppers, present participle stoppering, simple past and past participle stoppered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To close a container by using a stopper.",
                  "examples": [
                    "He tightly stoppered the decanter, thinking the expensive liqueur had been evaporating.",
                    "The diaphragmatic spasm of his hiccup caused his epiglottis to painfully stopper his windpipe with a loud \"hic\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}