{
  "word": "napoleon",
  "etymologies": [
    {
      "description": [
        "Borrowed from French Napoléon (“given name, usually in reference to Napoleon Bonaparte”). In reference to coins, via French napoléon (“(slang) a coin that originally had the appearance of Napoleon's face in the obverse”). In reference to guns and possibly cards, in reference to Napoleon III."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "napoleon (plural napoleons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical numismatics, slang) The franc germinal: a 20-franc gold coin issued under Napoleon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical numismatics, slang) Other subsequent 20-franc coins, notes, or values.",
                  "examples": [
                    "We had occasion some months ago to strengthen our resources, and borrowed, for that purpose, thirty thousand napoleons from the Bank of France."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually admiringly derogatory) A person resembling Napoleon Bonaparte, (usually) in having come to dominate an area or sphere of activity through ruthlessness or illegality as well as surpassing ability.",
                  "examples": [
                    "He [sc. James Moriarty] is the Napoleon of crime, Watson. He is the organizer of half that is evil and of nearly all that is undetected in this great city [sc. London]. He is a genius, a philosopher, an abstract thinker."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion, obsolete) Clipping of Napoleon boot: a form of topboot worn by officers during the Napoleonic Wars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical weaponry) Clipping of Napoleon gun: a 12-pounder cannon first used by the Second French Empire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, uncountable) A 19th-century five-card trick-taking game simplified from euchre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, uncountable) Clipping of double napoleon: a form of patience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare UK horse racing slang, obsolete) Alternative form of nap: a horse to go nap on, a sure thing, a certain winner; a prediction of such a horse; a bet on such a horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clipping of Napoleon bigarreau: a variety of the white-fleshed bigarreau cherry; a variety of cherry tree bearing such fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(food, originally US slang) Clipping of Napoleon cake: another name for a millefeuille pastry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Clipping of Napoleon brandy: any excellent brandy; a serving of such a brandy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for Napoleon slice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}