{
  "word": "blob",
  "etymologies": [
    {
      "description": [
        "Possibly onomatopoeic, similarly to bleb and blubber."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blob (plural blobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shapeless or amorphous mass; a vague shape or amount, especially of a liquid or semisolid substance; a clump, group or collection that lacks definite shape.",
                  "examples": [
                    "Only the outermost blob on either side in map 2 displays misalignment."
                  ]
                }
              ]
            },
            {
              "group": "(astronomy) A large cloud of gas.",
              "entries": [
                {
                  "meaning": "Ellipsis of extended Lyman-Alpha blob (a huge body of gas that may be the precursor to a galaxy).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) A bubble; a bleb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small freshwater fish (Cottus bairdii); the miller's thumb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The partially inflated air bag used in the sport of blobbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, slang) A score of zero.",
                  "examples": [
                    "A gentleman named W. Shakespeare scored a blob in the Worcestershire v. Lancashire match. We understand that he got out because the ball pitched on a \"damned spot.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blob (third-person singular simple present blobs, present participle blobbing, simple past and past participle blobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drop in the form of a blob or blobs.",
                  "examples": [
                    "[…]  a cross has been burned during the night on Wechsler's lawn and a painted KKK blobbed across one wall of his home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drop a blob or blobs onto; to cover with blobs.",
                  "examples": [
                    "Asked to do a mural in the coffee room of the Municipal Museum, Appel responded by blobbing all four walls and the ceiling with brilliant colors  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall in the form of a blob or blobs.",
                  "examples": [
                    "Caroline began to separate eggs, cracking them into unbelievably even halves, sliding the gold, round and elastic, from shell to shell, whilst the white hung, heavy, translucent, in thick sheets, and blobbed suddenly into her basin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To relax idly and mindlessly; to veg out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To catch eels by means of worms strung on a thread.",
                  "examples": [
                    "Synonym: bob"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blob (plural blobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(databases) Alternative spelling of BLOB",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}