{
  "word": "appoint",
  "etymologies": [
    {
      "description": [
        "From Middle English apointen, borrowed from Old French apointier (“to prepare, arrange, lean, place”) (French appointer (“to give a salary, refer a cause”)), from Late Latin appunctare (“to bring back to the point, restore, to fix the point in a controversy, or the points in an agreement”); Latin ad + punctum (“a point”). See point."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "appoint (third-person singular simple present appoints, present participle appointing, simple past and past participle appointed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set, fix or determine (a time or place for something such as a meeting, or the meeting itself) by authority or agreement.",
                  "examples": [
                    "His Royal Highness called to pay his respects to her Majesty; but, from the unexpected nature of his visit, her Majesty was not in a state then to receive him; but soon after sent a letter to Prince Leopold, to appoint one o'clock this day for an interview."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To name (someone to a post or role).",
                  "examples": [
                    "Aaron and his shall go in, and appoint them every one to his service."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish or equip (a place) completely; to provide with all the equipment or furnishings necessary; to fit out.",
                  "examples": [
                    "The hotel is beautifully designed and beautifully appointed in a classic, modern style that manages to be both serene and luxurious at the same time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip (someone) with (something); to assign (someone) authoritatively (some equipment).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To fix the disposition of (property) by designating someone to take use of (it).",
                  "examples": [
                    "If the donee of a power appoint the fund to one of the objects of the power, under an understanding that the latter is to lend the fund to tho former, although on good security, the appointment is bad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To fix with power or firmness by decree or command; to ordain or establish.",
                  "examples": [
                    "When he gave to the sea his decree, that the waters should not pass his commandment: when he appointed the foundations of the earth:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To resolve; to determine; to ordain.",
                  "examples": [
                    "For the Lord had appointed to defeat the good counsel of Ahithophel."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}