{
  "word": "tern",
  "etymologies": [
    {
      "description": [
        "Via an East Anglian dialect, from some Scandinavian (North Germanic) language, related to Danish terne, Norwegian terne, and Swedish tärna, all from Old Norse þerna (“tern; maidservant”), ultimately from Proto-Germanic *þewernǭ (“maidservant; servant’s daughter”), from Proto-Indo-European *tekʷ- (“to run; to flow”). Cognate with Old English stearn. First attested in the 1670s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tern (plural terns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various seabirds of the subfamily Sternidae (of the family Laridae) that are similar to gulls but are smaller and have a forked tail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Late Middle English terne (“throw of a die or dice showing the number three”), from Old French terne (“gathering of three people; trinity”) (modern French terne), from Latin ternās, the accusative feminine plural of ternī (“three each; three at a time”), from ter (“thrice”) (ultimately from Proto-Indo-European *tréyes (“three”)) + -ī (from -us (suffix forming adjectives)).",
        "The adjective is either derived from the noun, or directly from Latin ternī (“three each; three at a time”); see above."
      ],
      "adjectives": [
        {
          "description": "tern (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly botany, rare) Consisting of three components; ternate, threefold, triple.",
                  "examples": [
                    "Synonyms: ternary, treble, trine; see also Thesaurus:triple",
                    "tern flowers; tern leaves",
                    "a tern schooner, one with three masts"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tern (plural terns)",
          "definitionGroups": [
            {
              "group": "(dated or obsolete) A thing with three components; a set of three things.",
              "entries": [
                {
                  "meaning": "(gambling, dated) A lottery prize resulting from the favourable combination of three numbers in the draw.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}