{
  "word": "asshole",
  "etymologies": [
    {
      "description": [
        "Variation of earlier arsehole, from Middle English arshole, arcehoole, equivalent to ass +‎ hole. Cognate with Norwegian rasshøl (“asshole”), Swedish arsle (“asshole”). Compare also German Arschloch (“asshole”). Attested from the 1370s, replacing earlier Old English earsþyrel (“anus”, literally “ass hole”).\nFirst recorded in Middle English, as ers hole (Glouc. Cath. Manuscript 19. No. I., dated 1379, cited after OED), ars-hole (Bodleian Ashmole MS. 1396, dated ca. 1400, ed. Robert Von Fleischhacker as Lanfrank's \"Science of Cirurgie\", EETS 102, 1894, cited after OED.)",
        "Slang figurative usage dates to the 20th century; it was used of an uninviting place (compare shithole) in the 1920s, and then of an anti-social or despicable person from at least the 1950s (Harvard Advocate 137, March 1954). It also used appositionally (as in \"You're an asshole moralist\", T. Chamales, 1957)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "asshole (plural assholes) (US)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar) The anus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, derogatory) A jerk; an inappropriately or objectionably mean, inconsiderate, contemptible, obnoxious, intrusive, stupid, and/or rude person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar) By extension, anything unpleasant or undesirable. Often used appositionally.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Scots ass, asse or ash +‎ hole."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "asshole (plural assholes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Scotland and Northern England) A receptacle under a fire grate for collecting ashes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}