{
  "word": "larrikin",
  "etymologies": [
    {
      "description": [
        "Unclear. Suggested are:"
      ],
      "adjectives": [
        {
          "description": "larrikin (comparative more larrikin, superlative most larrikin)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) Exhibiting the characteristics or behaviour of a larrikin; playfully rebellious against and contemptuous of authority and convention.",
                  "examples": [
                    "Despite his skills as a singer and storyteller, Percy sometimes felt like an outsider among the diggers, excluded by his own ideal and practice of moral manhood from the more larrikin masculinity that he perceived to be predominant."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "larrikin (plural larrikins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang, dated) A brash and impertinent, possibly violent, troublemaker, especially a youth; a hooligan.",
                  "examples": [
                    "Another man told me there never had been a staff on the hill; but if there had been, perhaps larrikins would have removed it. For larrikinism is one of the evils of New Zealand. Everywhere there one hears of the larrikin, or young hoodlum. Larrikins are an unorganized, mischievous fraternity. They are always despoiling or marring public or private property or making people the butt of coarse jokes and jeers. If something is stolen, \"the larrikins took it\"; if windows or park seats are broken, \"the larrikins did it.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) A high-spirited person who playfully rebels against authority and conventional norms.",
                  "examples": [
                    "When Browne's turn came, he went down like a true larrikin, giving cheek to the end."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}