{
  "word": "drift",
  "etymologies": [
    {
      "description": [
        "From Middle English drift, dryft (“act of driving, drove, shower of rain or snow, impulse”), from Old English *drift (“drift”), from Proto-Germanic *driftiz (“drift”), from Proto-Indo-European *dʰreybʰ- (“to drive, push”). Equivalent to drive +‎ -t; cognate with North Frisian drift (“drift”), Saterland Frisian Drift (“current, flow, stream, drift”), Dutch drift (“drift, passion, urge”), German Drift (“drift”) and Trift (“drove, pasture”), Swedish drift (“impulse, instinct”), Icelandic drift (“drift, snow-drift”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drift (countable and uncountable, plural drifts)",
          "definitionGroups": [
            {
              "group": "(physical) Movement; that which moves or is moved.",
              "entries": [
                {
                  "meaning": "Anything driven at random.",
                  "examples": []
                },
                {
                  "meaning": "A mass of matter which has been driven or forced onward together in a body, or thrown together in a heap, etc., especially by wind or water.",
                  "examples": [
                    "a drift of snow, of ice, of sand, of plants, etc."
                  ]
                },
                {
                  "meaning": "The distance through which a current flows in a given time.",
                  "examples": []
                },
                {
                  "meaning": "A drove or flock, as of cattle, sheep, birds.",
                  "examples": [
                    "cattle coming over the bridge (with their great drifts doing much damage to the high ways)"
                  ]
                },
                {
                  "meaning": "A collection of loose earth and rocks, or boulders, which have been distributed over large portions of the earth's surface, especially in latitudes north of forty degrees, by the retreat of continental glaciers, such as that which buries former river valleys and creates young river valleys.",
                  "examples": [
                    "It is there seen that at a distance from the valleys of streams, the old glacial drift usually comes to the surface, and often rises into considerable eminences."
                  ]
                },
                {
                  "meaning": "Driftwood included in flotsam washed up onto the beach.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A driving; a violent movement.",
                  "examples": [
                    "The dragon drew him [self] away with drift of his wings."
                  ]
                },
                {
                  "meaning": "Course or direction along which anything is driven; setting.",
                  "examples": []
                },
                {
                  "meaning": "That which is driven, forced, or urged along.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act or motion of drifting; the force which impels or drives; an overpowering influence or impulse.",
                  "examples": [
                    "A bad man, being under the drift of any passion, will follow the impulse of it till something interpose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place (a ford) along a river where the water is shallow enough to permit crossing to the opposite side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tendency of an act, argument, course of conduct, or the like; object aimed at or intended; intention; hence, also, import or meaning of a sentence or discourse; aim.",
                  "examples": [
                    "He has made the drift of the whole poem a compliment on his country in general."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The horizontal thrust or pressure of an arch or vault upon the abutments.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(handiwork) A tool.",
              "entries": [
                {
                  "meaning": "A slightly tapered tool of steel for enlarging or shaping a hole in metal, by being forced or driven into or through it; a broach.",
                  "examples": []
                },
                {
                  "meaning": "A tool used to pack down the composition contained in a rocket, or like firework.",
                  "examples": []
                },
                {
                  "meaning": "A tool used to insert or extract a removable pin made of metal or hardwood, for the purpose of aligning and/or securing two pieces of material together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deviation from the line of fire, peculiar to obloid projectiles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Minor deviation of audio or video playback from its correct speed.",
                  "examples": [
                    "Reference sync servo system — permits minimal time-base error, assuring minimum jitter and drift."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, film) The situation where a performer gradually and unintentionally moves from their proper location within the scene.",
                  "examples": [
                    "There is another form of drift when playing in a scene with other actors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A passage driven or cut between shaft and shaft; a driftway; a small subterranean gallery; an adit or tunnel.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(nautical) Movement.",
              "entries": [
                {
                  "meaning": "The angle which the line of a ship's motion makes with the meridian, in drifting.",
                  "examples": []
                },
                {
                  "meaning": "The distance a vessel is carried off from her desired course by the wind, currents, or other causes.",
                  "examples": []
                },
                {
                  "meaning": "The place in a deep-waisted vessel where the sheer is raised and the rail is cut off, and usually terminated with a scroll, or driftpiece.",
                  "examples": []
                },
                {
                  "meaning": "The distance between the two blocks of a tackle.",
                  "examples": []
                },
                {
                  "meaning": "The difference between the size of a bolt and the hole into which it is driven, or between the circumference of a hoop and that of the mast on which it is to be driven.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A sideways movement of the ball through the air, when bowled by a spin bowler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Slow, cumulative change.",
                  "examples": [
                    "genetic drift"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In New Forest National Park, UK, the bi-annual round-up of wild ponies in order to be sold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drift (third-person singular simple present drifts, present participle drifting, simple past and past participle drifted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move slowly, especially pushed by currents of water, air, etc.",
                  "examples": [
                    "The boat drifted away from the shore.",
                    "The balloon was drifting in the breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move haphazardly without any destination.",
                  "examples": [
                    "He drifted from town to town, never settling down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deviate gently from the intended direction of travel.",
                  "examples": [
                    "This car tends to drift left at high speeds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive or carry, as currents do a floating body.",
                  "examples": [
                    "I was drifted back first to the ante - Nicene history , and then to the Church of Alexandria"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive into heaps.",
                  "examples": [
                    "A current of wind drifts snow or sand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To accumulate in heaps by the force of wind; to be driven into heaps.",
                  "examples": [
                    "Snow or sand drifts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, US) To make a drift; to examine a vein or ledge for the purpose of ascertaining the presence of metals or ores; to follow a vein; to prospect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, engineering) To enlarge or shape, as a hole, with a drift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) To oversteer a vehicle, causing loss of traction, while maintaining control from entry to exit of a corner. See Drifting (motorsport).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}