{
  "word": "street",
  "etymologies": [
    {
      "description": [
        "From Middle English strēt, from Old English strǣt, from Proto-West Germanic *strātu (“street”), an early borrowing from Late Latin (via) strāta (“paved (road)”), from Latin strātus, past participle of sternō (“stretch out, spread, bestrew with, cover, pave”), from Proto-Indo-European *sterh₃- (“to stretch out, extend, spread”). Cognate with Scots stret, strete, streit (“street”), Saterland Frisian Sträite (“street”), West Frisian strjitte (“street”), Dutch straat (“street”), German Low German Straat (“street”), German Straße (“street”), Swedish stråt (“way, path”), Icelandic stræti (“street”) (Scandinavian forms are borrowed from Old English), Portuguese estrada (“road, way, drive”), Italian strada (“road, street”). Related to Old English strēowian, strewian (“to strew, scatter”). More at strew.",
        "The vowel shifted from /aː/ in Latin to /æː/ in Old English (Anglo-Frisian brightening), /ɛː/ in Middle English, /eː/ in Early Modern English, and finally /iː/ in Modern English (the Great Vowel Shift)."
      ],
      "adjectives": [
        {
          "description": "street (comparative more street, superlative most street)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Having street cred; conforming to modern urban trends.",
                  "examples": [
                    "Eric had to admit that she looked street—upscale street, but still street. Kayla's look tended to change with the seasons; at the moment it was less Goth than paramilitary, with laced jump boots."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "street (plural streets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A paved part of road, usually in a village or a town.",
                  "examples": [
                    "Walk down the street until you see a hotel on the right."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A road as above, but including the sidewalks (pavements) and buildings.",
                  "examples": [
                    "I live on the street down from Joyce Avenue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, US) The roads that run perpendicular to avenues in a grid layout.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Metonymic senses:",
              "entries": [
                {
                  "meaning": "The people who live in such a road, as a neighborhood.",
                  "examples": []
                },
                {
                  "meaning": "The people who spend a great deal of time on the street in urban areas, especially, the young, the poor, the unemployed, and those engaged in illegal activities.",
                  "examples": []
                },
                {
                  "meaning": "An illicit or contraband source, especially of drugs.",
                  "examples": [
                    "I got some pot cheap on the street.",
                    "The seized drugs had a street value of $5 million."
                  ]
                },
                {
                  "meaning": "(finance) Wall Street.",
                  "examples": [
                    "Orders were reported to have increased 2% monthly, ahead of the 1.2% expected by the street.",
                    "Professional services and other revenue made up $577 million, edging out street estimates for $541.4 million."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) Living in the streets.",
                  "examples": [
                    "a street cat; a street urchin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Streetwise slang.",
                  "examples": [
                    "Toaster is street for guns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A great distance.",
                  "examples": [
                    "He's streets ahead of his sister in all the subjects in school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker slang) Each of the three opportunities that players have to bet, after the flop, turn and river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, sports) A style of skateboarding featuring typically urban obstacles.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "street (third-person singular simple present streets, present participle streeting, simple past and past participle streeted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To build or equip with streets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eject; to throw onto the streets.",
                  "examples": [
                    "Stage doormen and all sorts of doormen are very quick at streeting a man who won't move fast. I know a well-known Irishman who at a New York theatre was streeted just because he was insisting on getting in when the house was apparently booked out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, by extension) To heavily defeat.",
                  "examples": [
                    "Wearing his custom-made silks, McCarthy duly rode the horse a treat as they streeted the opposition and helped connections clean up the bookies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go on sale.",
                  "examples": [
                    "He points to the success of a recent Destiny's Child DVD that streeted just after member Beyonce's new solo CD"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Japanese Mormonism) To proselytize in public.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}