{
  "word": "installment",
  "etymologies": [
    {
      "description": [
        "A 1732 alteration of estallment, from Anglo-Norman estaler (“fix payments”), from Old French estal (“fixed position”), from Old High German stal (“stall\", \"standing place”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "installment (plural installments) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a series of parts, whether equal or unequal to the other parts of the series, of a given entity or a given process, which part presents or is presented at a particular scheduled interval.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(banking, finance) One member of a series of portions of a debt or sum of money, which portions may or may not be equated (depending in part on whether the interest rate is fixed or variable), payment of which portions are serially exacted at regularly scheduled intervals toward satisfaction of the total. Payments of installments are generally mensual, quarterly, triannual, biannual, or annual.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(publishing, media) A part of a published or broadcast serial.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From install +‎ -ment, install from Old French installer, from Medieval Latin installare, from Medieval Latin in- and Medieval Latin stallum, stall from a Germanic source (compare Old High German stal)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "installment (plural installments) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of installing; installation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The seat in which one is placed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}