{
  "word": "purposive",
  "etymologies": [
    {
      "description": [
        "From purpose +‎ -ive. Compare purpositive."
      ],
      "adjectives": [
        {
          "description": "purposive (comparative more purposive, superlative most purposive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Serving a particular purpose; adapted to a given purpose, especially through natural evolution. [from 19th c.]",
                  "examples": [
                    "Irresistably it came to me again that beauty, far from being wasted, was purposive, that this purpose was of a redeeming kind, and that some one who was pleased co-operated with it for my personal benefit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Done or performed with a conscious purpose or intent. [from 19th c.]",
                  "examples": [
                    "Synonyms: deliberate, intentional, purposeful; see also Thesaurus:intentional"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) Pertaining to purpose, as reflected in behaviour or mental activity. [from 19th c.]",
                  "examples": [
                    "The question at once arises whether medieval thinkers really believed that what we now call inanimate objects were sentient and purposive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to or demonstrating purpose. [from 19th c.]",
                  "examples": [
                    "The world was generally agreed to be a purposive one, responsive to the wishes of its Creator […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Possessed of a firm purpose. [from 20th c.]",
                  "examples": [
                    "Synonyms: determined, resolute"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of a clause or conjunction: expressing purpose. [from 20th c.]",
                  "examples": [
                    "Many scholars suggest that  […]  the increase in the use of the to-infinitive in Middle English took place at the expense of the bare infinitive (i.e. an infinitive without the marker to).  […]  due to the loss of verbal inflections, it became difficult to distinguish the infinitival form from other verbal forms. As a result  […]  to began to function as a mere marker of the infinitive, losing its original ‘purposive’ sense  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}