{
  "word": "penumbra",
  "etymologies": [
    {
      "description": [
        "From New Latin pēnumbra, from Latin paene (“almost”) + umbra (“shadow”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "penumbra (plural penumbras or penumbrae or (obsolete) penumbræ)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A partially shaded area around the edges of a shadow, especially an eclipse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A region around the edge of a sunspot, darker than the sun's surface but lighter than the middle of the sunspot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An area of uncertainty or intermediacy between two mutually exclusive states or categories.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An area that lies on the edge of something; a fringe.",
                  "examples": [
                    "But for all the expansionist energy of a metro area that sprawls from Wisconsin to Indiana (total population: 7.2 million), downtown Chicago and its penumbra also stand rejuvenated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something related to, connected to, and implied by, the existence of something else that is necessary for the second thing to be full and complete in its essential aspects.",
                  "examples": [
                    "The foregoing [United States Supreme Court] cases suggest that specific guarantees in the Bill of Rights have penumbras, formed by emanations from those guarantees that help give them life and substance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, preceded by \"ischaemic\", after a stroke) A region of the brain that has lost only some of its blood supply, and retains structural integrity but has lost function.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}