{
  "word": "phylactery",
  "etymologies": [
    {
      "description": [
        "Recorded since circa 1380, Middle English philaterie, either from Old French filatiere (12th c), or via Medieval Latin philaterium, an alteration of Late Latin phylacterium (“reliquary”), from Ancient Greek φυλακτήριον (phulaktḗrion, “safeguard, amulet”), via adjective φυλακτήριος (phulaktḗrios, “serving as a protection”), from φυλακτήρ (phulaktḗr, “watcher, guard”), itself from φυλάσσω (phulássō, “guard or ward off”), from φύλαξ (phúlax, “a guard”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phylactery (plural phylacteries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Judaism) Either of the two small leather cases, containing biblical scrolls, worn by Jewish men at morning prayer; the tefilla.",
                  "examples": [
                    "Some Rabbis allow a woman or a minor who are themselves not obligated to put on phylacteries to assist a hospitalized patient to don his phylacteries if he is otherwise unable to do so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A case in which (Christian) relics were preserved.",
                  "examples": [
                    "After Marie was exhumed around 1226, another of her fingers was placed in a phylactery that was created by Hugh of Oignies and remained at Oignies until 1817 (see fig. 17.1)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any small object worn for its magical or supernatural power; an amulet or charm.",
                  "examples": [
                    "According to the decreta issued by the archbishop of Utrecht in 1372-75, the word phylactery pertained either to amulets on separate sheets or to entire books."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy, role-playing games) An enspelled object used (by such as a lich) to contain and protect the owner's soul.",
                  "examples": [
                    "Synonym: horcrux (Harry Potter)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, historical) A speech scroll, an illustrative device depicting speech, song or other sound as if written on a scroll.",
                  "examples": [
                    "Just as phylacteries became more commonplace in prints in the 17th century, there was a growing aversion for the use of phylacteries in paintings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}