{
  "word": "lull",
  "etymologies": [
    {
      "description": [
        "From Middle English lullen, lollen. Originally, perhaps expressive in origin from la-la-la or lu-lu-lu sounds made in calming a child. Compare Finnish laulaa (to sing) and Hiligaynon lala (to sing a lullaby).",
        "Cognate with Scots lul, lule, loll (“to lull, put to sleep, howl, caterwaul”), Dutch lollen (“to sing badly, caterwaul”), Dutch lullen (“to chatter, prate, cheat, deceive”), Low German lullen (“to lull”), German lullen (“to lull”), Danish lulle (“to lull, sing to sleep”), Swedish lulla (“to lull”), Icelandic lulla (“to lull”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lull (plural lulls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of rest or soothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of reduced activity; a respite",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A period without waves or wind.",
                  "examples": [
                    "[…] during the lull, wind shifted to S. E. […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) An extended pause between sets of waves.",
                  "examples": [
                    "It is advisable to leave the surf zone during the lull between sets of larger waves, waiting outside the surf zone for a lull."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lull (third-person singular simple present lulls, present participle lulling, simple past and past participle lulled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to rest by soothing influences; to compose; to calm",
                  "examples": [
                    "Synonyms: soothe, quiet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become gradually calm; to subside; to cease or abate.",
                  "examples": [
                    "The storm lulled."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}