{
  "word": "bulge",
  "etymologies": [
    {
      "description": [
        "From Middle English bulge (“leather bag; hump”), from Old Northern French boulge (“leather bag”), from Late Latin bulga (“leather sack”), from Gaulish *bulga, *bulgos, from Proto-Celtic *bolgos (“sack, bag, stomach”). Cognate with bilge, belly, bellows, budget, French bouge, German Balg, etc. Doublet of budge, and from the same root as belly and bellows. See also budget."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bulge (plural bulges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something sticking out from a surface; a swelling, protuberant part; a bending outward, especially when caused by pressure.",
                  "examples": [
                    "a bulge in a wall",
                    "a bulge in my pocket where I kept my wallet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bilge or protuberant part of a cask.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The bilge of a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The outline of male genitals visible through clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A sudden rise in value or quantity.",
                  "examples": [
                    "A second bulge in prices occurred during September 30 — October 9. The rise of prices up to October 3 was in part apparently a technical adjustment of the markets, a reaction to the preceding decline."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bulge (third-person singular simple present bulges, present participle bulging, simple past and past participle bulged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stick out from (a surface).",
                  "examples": [
                    "The submarine bulged because of the enormous air pressure inside.",
                    "He stood six feet tall, with muscular arms bulging out of his black T-shirt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bilge, as a ship; to founder.",
                  "examples": [
                    "Fatal to Man! at once all Ocean roars,",
                    "And scattered navies bulge on distant shores."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}