{
  "word": "turret",
  "etymologies": [
    {
      "description": [
        "From Middle English touret, from Old French torete (French tourette), diminutive of tour (“tower”), from Latin turris. See tower."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turret (plural turrets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A little tower, frequently a merely ornamental structure at one of the corners of a building or castle.",
                  "examples": [
                    "There breathes no being but has some pretence / To that fine instinct called poetic sense;  […]  / The freeman, casting with unpurchased hand / The vote that shakes the turrets of the land."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, military) A siege tower; a movable building, of a square form, consisting of ten or even twenty stories and sometimes one hundred and twenty cubits high, usually moved on wheels, and employed in approaching a fortified place, for carrying soldiers, engines, ladders, casting bridges, and other necessaries.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A tower-like solder post on a turret board (a circuit board with posts instead of holes).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An armoured, rotating gun installation on a fort, ship, aircraft, or armoured fighting vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) The elevated central portion of the roof of a passenger car, with sides that are pierced for light and ventilation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}