{
  "word": "heat",
  "etymologies": [
    {
      "description": [
        "From Middle English hete, from Old English hǣtu, from Proto-West Germanic *haitī, from Proto-Germanic *haitį̄ (“heat”), from Proto-Indo-European *kayd-, a derived form of *kay- (“heat; hot”).",
        "Cognate with Scots hete (“heat”), North Frisian hiet (“heat”), Old High German heizī (“heat”). Related also to Dutch hitte (“heat”), German Hitze (“heat”), Swedish hetta (“heat”), Icelandic hiti (“heat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "heat (countable and uncountable, plural heats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Thermal energy.",
                  "examples": [
                    "Heat and temperature, although different, are intimately related. [...] For example, suppose you added equal amounts of heat to equal masses of iron and aluminum. How do you think their temperatures would change? […] if the temperature of the iron increased by 100 C°, the corresponding temperature change in the aluminum would be only 48 C°."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The condition or quality of being hot.",
                  "examples": [
                    "Stay out of the heat of the sun!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An attribute of a spice that causes a burning sensation in the mouth.",
                  "examples": [
                    "The chili sauce gave the dish heat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A period of intensity, particularly of emotion.",
                  "examples": [
                    "Synonyms: passion, vehemence",
                    "It's easy to make bad decisions in the heat of the moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) An undesirable amount of attention.",
                  "examples": [
                    "The heat from her family after her DUI arrest was unbearable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) The police.",
                  "examples": [
                    "The heat! Scram!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) One or more firearms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, baseball) A fastball.",
                  "examples": [
                    "The catcher called for the heat, high and tight."
                  ]
                }
              ]
            },
            {
              "group": "(uncountable) A condition where a mammal is aroused sexually or where it is especially fertile and therefore eager to mate; oestrus.",
              "entries": [
                {
                  "meaning": "(countable, fandom slang) In omegaverse fiction, a cyclical period in which omegas experience an intense, sometimes irresistible biological urge to mate.",
                  "examples": [
                    "Some stories engage in dub-con scenarios where one or both partners are out of their minds with heat lust and lose all reasoning and inhibitions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A preliminary race, used to determine the participants in a final race",
                  "examples": [
                    "The runner had high hopes, but was out of contention after the first heat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, by extension) A stage in a competition, not necessarily a sporting one; a round.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One cycle of bringing metal to maximum temperature and working it until it is too cool to work further.",
                  "examples": [
                    "I can make a scroll like that in a single heat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A hot spell.",
                  "examples": [
                    "The children stayed indoors during this year's summer heat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Heating system; a system that raises the temperature of a room or building.",
                  "examples": [
                    "I'm freezing; could you turn on the heat?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The output of a heating system.",
                  "examples": [
                    "During the power outage we had no heat because the controls are electric.   Older folks like more heat than the young."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A violent action unintermitted; a single effort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English heten, from Old English hǣtan (“to heat; become hot”), from Proto-Germanic *haitijaną (“to heat, make hot”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "heat (third-person singular simple present heats, present participle heating, simple past and past participle heated or (dialectal) het)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause an increase in temperature of (an object or space); to cause to become hot (often with \"up\").",
                  "examples": [
                    "I'll heat up the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become hotter.",
                  "examples": [
                    "There's a pot of soup heating on the stove."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To excite or make hot by action or emotion; to make feverish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To excite ardour in; to rouse to action; to excite to excess; to inflame, as the passions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To arouse, to excite (sexually).",
                  "examples": [
                    "The massage heated her up."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}