{
  "word": "pretty",
  "etymologies": [
    {
      "description": [
        "From Middle English prety, preti, praty, prati, from Old English prættiġ (“tricky, crafty, sly, cunning, wily, astute”), from Proto-Germanic *prattugaz (“boastful, sly, slick, deceitful, tricky, cunning”), corresponding to prat (“trick”) +‎ -y. Cognate with Dutch prettig (“nice, pleasant”), Low German prettig (“funny”), Icelandic prettugur (“deceitful, tricky”). For the semantic development, compare canny, clever, cute."
      ],
      "adjectives": [
        {
          "description": "pretty (comparative prettier, superlative prettiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pleasant to the sight or other senses; attractive, especially of women or children. [from 15th c.]",
                  "examples": [
                    "To escape a violent beating from sailors to whom he has sold a non-functioning car, Jerry takes his stepfamily for a holiday in a trailer park miles away, where, miraculously, young Nick meets a very pretty young woman called Sheeni, played by Portia Doubleday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of objects or things: nice-looking, appealing. [from 15th c.]",
                  "examples": [
                    "'Petit Posy' brassicas  […]  are a cross between kale and brussels sprouts, and are really very pretty with a mild, sweet taste."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often derogatory) Fine-looking; only superficially attractive; initially appealing but having little substance; see petty. [from 15th c.]",
                  "examples": [
                    "Damned by the Socialists as \"traitors to the working class,\" its leaders were decried by Tories as \"faceless peddlers of politics with a pretty little trinket for every taste.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cunning; clever, skilful. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Moderately large; considerable. [from 15th c.]",
                  "examples": [
                    "\"What did you do to your hair?\" The answer could be worth a pretty penny for L'Oreal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Excellent, commendable, pleasing; fitting or proper (of actions, thoughts etc.). [from 16th c.]",
                  "examples": [
                    "‘This new fashion of introducing the candidate's children into an election contest is a pretty one,’ said Mrs. Panstreppon; ‘it takes away something from the acerbity of party warfare, and it makes an interesting experience for the children to look back on in after years.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ironic) Awkward, unpleasant. [from 16th c.]",
                  "examples": [
                    "\"Nay, not I; it is a pretty thing to expect me to wash them; you may take them back again, and say, as Sally had them before, she may wash them now, for me; I am not going to be 'Jack at a pinch,' I can tell you.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "pretty (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Somewhat, fairly, quite; sometimes also (by meiosis) very.",
                  "examples": [
                    "By the Sheets you have sent me to peruse, the Account you have given of her Birth and Parentage is pretty exact [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialect) Prettily, in a pretty manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "pretty (plural pretties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pretty person; a term of address to a pretty person.",
                  "examples": [
                    "I'll get you, my pretty, and your little dog, too!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is pretty.",
                  "examples": [
                    "We'll stop at the knife store and look at the sharp pretties."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pretty (third-person singular simple present pretties, present participle prettying, simple past and past participle prettied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make pretty; to beautify",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}