{
  "word": "duet",
  "etymologies": [
    {
      "description": [
        "From Italian duetto (“short musical composition for two voices”), diminutive of due (“two”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "duet (plural duets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical composition in two parts, each performed by a single voice (singer, instrument or univoce ensemble).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A song composed for and/or performed by a duo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pair or couple, especially one that is harmonious or elegant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "duet (third-person singular simple present duets, present participle duetting or dueting, simple past and past participle duetted or dueted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform a duet.",
                  "examples": [
                    "When you can spare time from duetting, coquetting, and claretting with your Hibernians of both sexes, let me have a line from you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, zoology, of pairs of animals) To communicate (warnings, mating calls, etc.) through song.",
                  "examples": [
                    "Duetting species are typically monogamous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform (sing, play, etc.) as a duet.",
                  "examples": [
                    "After the Lord's Prayer the Missionaries duetted a hymn while the children stared at me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (of two people) To say at the same time, to chorus.",
                  "examples": [
                    "“My dear papa!” duetted the girls; but there was something in the husband and father's face, that told the three ladies it would be worse than useless to raise that question at present."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}