{
  "word": "introvert",
  "etymologies": [
    {
      "description": [
        "From New Latin intrōvertere, from intro- (“within”) and vertere (“to turn”). Popularized as a psychological term by the German works of Carl Jung."
      ],
      "adjectives": [
        {
          "description": "introvert (comparative more introvert, superlative most introvert)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of introverted.",
                  "examples": [
                    "They were noticeably more introvert, schizoid and desurgent in temperament."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "introvert (plural introverts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) An organ or other body part that is or can be turned inside out, especially an anterior portion of some annelid worms capable of retraction.",
                  "examples": [
                    "Important distinctions which obtain amongst the various ‘introverts’ or intro- and e-versible tubes so frequently met with in animal bodies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) An introverted person: one who is considered more thoughtful than social, with a personality more inwardly than outwardly directed; one who often prefers to have time in non-social situations.",
                  "examples": [
                    "An Extravert can hardly conceive the necessity which compels the Introvert to conquer the world by means of a system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, proscribed) A reserved person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "introvert (third-person singular simple present introverts, present participle introverting, simple past and past participle introverted)",
          "definitionGroups": [
            {
              "group": "To turn inwards.",
              "entries": [
                {
                  "meaning": "To think about internal or spiritual matters.",
                  "examples": [
                    "[…]  the Soul being straight, introverted  […]  into itself, and easily conforming to God's will and time  […]"
                  ]
                },
                {
                  "meaning": "(zoology) To withdraw an organ or body part within itself or its base.",
                  "examples": [
                    "His awkward gait, his introverted toes,Bent knees, round shoulders, and dejected looks  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}