{
  "word": "chameleonize",
  "etymologies": [
    {
      "description": [
        "chameleon +‎ -ize"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "chameleonize (third-person singular simple present chameleonizes, present participle chameleonizing, simple past and past participle chameleonized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change colour or turn various colours; to be transformed (to suit changing circumstances).",
                  "examples": [
                    "I care nothing for the plaudits of the populace. I’m ambitious, in a way; but when that way requires me to leave the people—the things—that I love, then ambition chameleonizes and I become ambitious antithetically."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to change colour or turn various colours; to transform (to suit changing circumstances).",
                  "examples": [
                    "Such a difference of opinion is passed over with a shrug of the shoulder, for some “regulars” practise empirically (clinically), and others scientifically. The “majority” and “Medical Ethics” contend that every practitioner shall sail under the colors he or she may select, but not use one which may be chameleonized to suit the individual notions and prejudices of the public at large."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To transform oneself, as if changing colour like a chameleon.",
                  "examples": [
                    "[…]  after [reading] Virgil and Dante  […]  in an atmosphere trembling with eternal lamentations and on a soil drenched with unceasing showers of tears all the morning, every evening, lately, I am in a ball-room where flourishes a whip-syllabub of life, as if under our feet yawned no such realities. But I can chameleonize myself and enjoy all."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}