{
  "word": "doghouse",
  "etymologies": [
    {
      "description": [
        "dog +‎ house"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "doghouse (plural doghouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any small house or structure or enclosure used to house a dog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A structure of small size, similar to a doghouse, but offering useful shelter for a human.",
                  "examples": [
                    "This berth of mine was commonly called a doghouse (a box about six feet long, four high, and two broad,) containing a mattress fitted about 18 inches from the deck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mechanically, an equipment cover with an opening, with a shape resembling a doghouse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A difficult or demoralizing situation.",
                  "examples": [
                    "During the slave trade, slaves were packed into every available niche aboard the slave ships, including the officers' cabins. The officers slept on deck in semi-cylindrical boxes, nicknamed \"dog houses.\" The term \"in the dog house\" grew to describe being in a difficult situation due to the extreme discomfort of sleeping in these boxes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traffic signal with five sections: two on the bottom, two in the middle, and one on top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Any shabby or disreputable establishment.",
                  "examples": [
                    "He didn't even know where he was taking her. He had assumed she would suggest a place she wanted to eat, the movie she wanted to see. Now he suspected she was waiting for him to make the decision. Unfortunately, he hardly knew the area. He didn't want to risk taking her to the local doghouse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}