{
  "word": "piece",
  "etymologies": [
    {
      "description": [
        "From Middle English pece, peece, peice, from Old French piece, from Late Latin petia, pettia, possibly from Gaulish *pettyā, from Proto-Celtic *kʷezdis (“piece, portion”); doublet of English fit, fytte, fytt (“musical piece, chapter”), Icelandic fit (“web”), German Fitze (“skein”), from Old High German *fitjâ. Compare Welsh peth, Breton pez (“thing”), Irish cuid. Compare French pièce, Portuguese peça, Spanish pieza, Italian pezza, Italian pezzo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "piece (plural pieces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a larger whole, usually in such a form that it is able to be separated from other parts.",
                  "examples": [
                    "I’d like another piece of pie.",
                    "I've lost a piece of this jigsaw puzzle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single item belonging to a class of similar items.",
                  "examples": [
                    "a piece of machinery",
                    "a piece of software",
                    "a useful piece of advice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) One of the figures used in playing chess, specifically a higher-value figure as distinguished from a pawn; by extension, a similar counter etc. in other games.",
                  "examples": [
                    "Pawns, unlike pieces, move only in one direction: forward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A coin, especially one valued at less than the principal unit of currency.",
                  "examples": [
                    "a sixpenny piece"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artistic creation, such as a painting, sculpture, musical composition, literary work, etc.",
                  "examples": [
                    "Synonyms: see Thesaurus:musical composition",
                    "She played two beautiful pieces on the piano."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An article published in the press.",
                  "examples": [
                    "Today's paper has an interesting piece on medical research."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An artillery gun.",
                  "examples": [
                    "[…]  all our Ammunition was spent. Those of us who had Money made Slugs of it; their next Shift was to take the middle Screws out of their Guns, and charge their Pieces with them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial) A gun.",
                  "examples": [
                    "He's packin' a piece!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, colloquial, short for hairpiece) A toupee or wig, especially when worn by a man.",
                  "examples": [
                    "The announcer is wearing a new piece."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Ireland, UK, US, dialectal) A slice or other quantity of bread, eaten on its own; a sandwich or light snack.",
                  "examples": [
                    "My grannie came and gived them all a piece and jam and cups of water then I was to bring them back out to the street and play a game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial, vulgar) A sexual encounter; from piece of ass or piece of tail.",
                  "examples": [
                    "I got a piece at lunchtime."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial, mildly vulgar, short for piece of crap/piece of shit) A shoddy or worthless object (usually applied to consumer products like vehicles or appliances).",
                  "examples": [
                    "Ugh, my new computer is such a piece. I'm taking it back to the store tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) A cannabis pipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, uncountable) Used to describe a pitch that has been hit but not well, usually either being caught by the opposing team or going foul. Usually used in the past tense with get.",
                  "examples": [
                    "he got a piece of that one;  she got a piece of the ball […] and it's going foul."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, sometimes derogatory) An individual; a person.",
                  "examples": [
                    "His own spirit is as unsettled a piece as there is in all the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A castle; a fortified building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A pacifier; a dummy.",
                  "examples": [
                    "Synonyms: see Thesaurus:pacifier"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A distance.",
                  "examples": [
                    "a far piece",
                    "located a fair piece away from their camp",
                    "a fair piece off"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) A structured practice row, often used for performance evaluation.",
                  "examples": [
                    "At practice we rowed four 5,000 meter pieces.",
                    "That last piece was torture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amount of work to be done at one time; a unit of piece work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An ounce of a recreational drug.",
                  "examples": [
                    "In fact, that was back during the era when you could buy a piece of heroin, an ounce of heroin, for $500 and cut it three times for a 3-to-1 cut on it and the dope would still be good."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "piece (third-person singular simple present pieces, present participle piecing, simple past and past participle pieced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, usually with together) To assemble (something real or figurative).",
                  "examples": [
                    "These clues allowed us to piece together the solution to the mystery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make, enlarge, or repair, by the addition of a piece or pieces; to patch; often with out.",
                  "examples": [
                    "to piece a garment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To produce a work of graffiti more complex than a tag.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}