{
  "word": "franchise",
  "etymologies": [
    {
      "description": [
        "From Middle English franchise, fraunchise, from Old French franchise (“freedom”), a derivative of franc (“free”). More at frank."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "franchise (countable and uncountable, plural franchises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right to vote at a public election or referendum; see: suffrage, suffragette.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A right or privilege officially granted to a person, a group of people, or a company by a government.",
                  "examples": [
                    "Election by universal suffrage, as modified by the Constitution, is the one crowning franchise of the American people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An acknowledgment of a corporation's existence and ownership.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The authorization granted by a company to sell or distribute its goods or services in a certain area.",
                  "examples": [
                    "McDonald’s has exported its franchise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A business operating under such authorization, a franchisee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legal exemption from jurisdiction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The membership of a corporation or state; citizenship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The district or jurisdiction to which a particular privilege extends; the limits of an immunity; hence, an asylum or sanctuary.",
                  "examples": [
                    "Churches and monasteries in Spain are franchises for criminals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The collection of organizations in the history of a sports team; the tradition of a sports team as an entity, extending beyond the contemporary organization.",
                  "examples": [
                    "The Whalers' home city of Hartford was one of many for the franchise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, marketing) The positive influence on the buying behavior of customers exerted by the reputation of a company or a brand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The loose collection of fictional works pertaining to a particular fictional universe, including literary, film, or television series from various sources, generally when all authorized by a copyright holder or similar authority.",
                  "examples": [
                    "the Star Wars franchise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exemption from constraint or oppression; freedom; liberty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Magnanimity; generosity; liberality; frankness; nobility.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English franchisen, fraunchisen, from Old French franchir (stem franchiss-, “to set free”), from franc (“free”). More at frank."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "franchise (third-person singular simple present franchises, present participle franchising, simple past and past participle franchised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confer certain powers on; grant a franchise to; authorize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To set free; invest with a franchise or privilege; enfranchise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}