{
  "word": "stringer",
  "etymologies": [
    {
      "description": [
        "From string +‎ -er (“agent”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stringer (plural stringers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who threads something; one who makes or provides strings, especially for bows.",
                  "examples": [
                    "Be content to put your trust in honest stringers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who strings someone along.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A horizontal timber that supports upright posts, or supports the hull of a vessel.",
                  "examples": [
                    "A startled man looked out the office window and then rushed for the door, but the boys were too quick for him. They were lying behind a wooden stringer in the lot before he even got near the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side rail supporting the rungs of a ladder or the steps of a flight of stairs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small screw-hook to which piano strings are sometimes attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) A freelance correspondent not on the regular newspaper staff, especially one retained on a part-time basis to report on events in a particular place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A person who plays on a particular string.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) Wooden strip running lengthwise down the centre of a surfboard, for strength.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, slang, 1800s) A hard-hit ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A cord or chain, sometimes with additional loops, that is threaded through the mouth and gills of caught fish.",
                  "examples": [
                    "\"Okay, that's a keeper,\" Harold said as he netted the 3-pounder and put him on a stringer over the side of the boat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pallet or skid used when shipping less than truckload (LTL) freight. A platform typically constructed of timber or plastic designed such that freight may be stacked on top, able to be lifted by a forklift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A libertine; a wencher.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(birdwatching) A person who deliberately states that a certain bird is present when it is not; one who knowingly misleads other birders about the occurrence of a bird, especially a rarity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}