{
  "word": "curtain",
  "etymologies": [
    {
      "description": [
        "From Middle English curteyn, corteyn, cortyn, cortine, from Old French cortine, from Medieval Latin cōrtīna (“curtain”), from Latin cohors (“court, enclosure”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "curtain (plural curtains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of cloth covering a window, bed, etc. to offer privacy and keep out light.",
                  "examples": [
                    "Thus the red damask curtains which now shut out the fog-laden, drizzling atmosphere of the Marylebone Road, had cost a mere song, and yet they might have been warranted to last another thirty years. A great bargain also had been the excellent Axminster carpet which covered the floor; as, again, the arm-chair in which Bunting now sat forward, staring into the dull, small fire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A similar piece of cloth that separates the audience and the stage in a theater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater, by extension) The beginning of a show; the moment the curtain rises.",
                  "examples": [
                    "He took so long to shave his head that we arrived 45 minutes after curtain and were denied late entry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fortifications) The flat area of wall which connects two bastions or towers; the main area of a fortified wall.",
                  "examples": [
                    "Captain Rense, beleagring the Citie of Errona for us, […] caused a forcible mine to be wrought under a great curtine of the walles […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, also \"final curtain\", sometimes in the plural) Death.",
                  "examples": [
                    "For life is quite absurd / And death's the final word / You must always face the curtain with a bow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) That part of a wall of a building which is between two pavilions, towers, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, derogatory) A flag; an ensign.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "curtain (third-person singular simple present curtains, present participle curtaining, simple past and past participle curtained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover (a window) with a curtain; to hang curtains.",
                  "examples": [
                    "The window, softly curtained with dotted swiss, became the focus of my desperate hour-by-hour attention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To hide, cover or separate as if by a curtain.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}