{
  "word": "fee",
  "etymologies": [
    {
      "description": [
        "From Middle English fee, fe, feh, feoh, from Old English feoh (“cattle, property, wealth, money, payment, tribute, fee”) with contamination from Old French fieu, fief (from Medieval Latin fevum, a variant of feudum (see feud), from Frankish *fehu (“cattle, livestock”); whence fief), both from Proto-Germanic *fehu (“cattle, sheep, livestock, owndom”), from Proto-Indo-European *péḱu (“livestock”). Cognate with Old High German fihu (“cattle, neat”), Scots fe, fie (“cattle, sheep, livestock, deer, goods, property, wealth, money, wages”), West Frisian fee (“livestock”), Dutch vee (“cattle, livestock”), Low German Veeh (“cattle, livestock, property”), Veh, German Vieh (“cattle, livestock”), Danish fæ (“cattle, beast, dolt”), Swedish fä (“beast, cattle, dolt”), Norwegian fe (“cattle”), Icelandic fé (“livestock, assets, money”), Latin pecū (“cattle”), Sanskrit paśu (“cattle”).."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fee (plural fees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, historical) A right to the use of a superior's land as a stipend for certain services to be performed, typically military service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, historical) Synonym of fief: the land so held.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, historical) An inheritable estate in land held of a feudal lord on condition of performance of certain services, typically military service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An inheritable estate in land, whether absolute and without limitation to potential heirs (fee simple) or with limitations to particular kinds of heirs (fee tail).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, obsolete) Synonym of possession.",
                  "examples": [
                    "What doth the poor man's son inherit? / Stout muscles and a sinewy heart, / A hardy frame, a hardier spirit; / King of two hands, he does his part / In every useful toil and art; / A heritage, it seems to me, / A king might wish to hold in fee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Money paid or bestowed; payment; emolument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A prize or reward. Only used in the set phrase \"A finder's fee\" in Modern English.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An additional monetary payment charged for a service or good that is minor compared to the underlying cost.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fee (third-person singular simple present fees, present participle feeing, simple past and past participle feed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reward for services performed, or to be performed; to recompense; to hire or keep in hire; hence, to bribe.",
                  "examples": [
                    "In vain for Hellebore the patient cries / And fees the doctor; but too late is wise"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}