{
  "word": "quarter",
  "etymologies": [
    {
      "description": [
        "From Middle English quarter, from Anglo-Norman quarter, from Latin quartarius, from quartus. Compare Spanish cuarto (“room, quarters; quarter”). Doublet of quartier."
      ],
      "adjectives": [
        {
          "description": "quarter (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to an aspect of a quarter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly) Consisting of a fourth part, a quarter (1⁄4, 25%).",
                  "examples": [
                    "a quarter hour; a quarter century; a quarter note; a quarter pound"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly) Related to a three-month term, a quarter of a year.",
                  "examples": [
                    "A quarter day is one terminating a quarter of the year.",
                    "A quarter session is one held quarterly at the end of a quarter."
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "",
          "definitionGroups": []
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "quarter (countable and uncountable, plural quarters)",
          "definitionGroups": [
            {
              "group": "A fourth part of something.",
              "entries": [
                {
                  "meaning": "(in general sense) Each of four equal parts into which something can be divided; a fourth part. [from 14th c.]",
                  "examples": [
                    "A quarter of an hour."
                  ]
                },
                {
                  "meaning": "(now chiefly historical) A measure of capacity used chiefly for grain or coal, varying greatly in quantity by time and location. [from 13th c.]",
                  "examples": []
                },
                {
                  "meaning": "A fourth part of a pound; approximately 113 grams. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(historical) A measure of length; originally a fourth part of an ell, now chiefly a fourth part of a yard. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now historical) A fourth part of the night; one of the watches or divisions of the night. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly financial) A fourth part of the year; 3 months; a term or season. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(time) A fourth part of an hour; a period of fifteen minutes, especially with reference to the quarter before or after the hour. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly historical) A fourth part of a hundredweight. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(heraldry) A fourth part of a coat of arms, or the charge on it, larger than a canton and normally on the upper dexter side, formed by a perpendicular line from the top meeting a horizontal line from the side. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Canada, US) A quarter-dollar, divided into 25 cents; the coin of that value minted in the United States or Canada. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(sports) One of four equal periods into which a game is divided. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(Chester, historical) A quarter of an acre or 40 roods.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Place or position.",
              "entries": [
                {
                  "meaning": "A region or place. [from 13th c.]",
                  "examples": []
                },
                {
                  "meaning": "Each of four parts into which the earth or sky is divided, corresponding to the four cardinal points of the compass. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "A division or section of a town or city, especially having a particular character of its own, or associated with a particular group etc. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "One's residence or dwelling-place; (in plural) rooms, lodgings, especially as allocated to soldiers or domestic staff. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(figurative, archaic) A topic or area of endeavour.",
                  "examples": [
                    "“I'll tell you something, too,” retorted the captain, duskily flushing. “I wouldn't sail this ship for the man you are, if you went upon your knees. I've dealt with gentlemen up to now.”“I can tell you the names of a number of gentlemen you'll never deal with any more, and that's the whole of Longhurst's gang,” said Jim. “I'll put your pipe out in that quarter, my friend. Here, rout out your traps as quick as look at it, and take your vermin along with you. I'll have a captain in, this very night, that's a sailor, and some sailors to work for him.”"
                  ]
                },
                {
                  "meaning": "(nautical) The aftmost part of a vessel's side, roughly from the last mast to the stern. [from 16th c.]",
                  "examples": [
                    "I was one morning walking the deck, when Rogers, whose watch it was, sitting upon the quarter, called to me in his usual style, ‘Come here, Bill.’"
                  ]
                },
                {
                  "meaning": "(farriery) The part on either side of a horse's hoof between the toe and heel, the side of its coffin. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often plural) A section (of a population), especially one having a particular set of values or interests.",
                  "examples": [
                    "opposition to the policy came from an unexpected quarter, as well as from certain quarters which had historically opposed it",
                    "all quarters of the socialist movement; praise from Conservative quarters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Relations between people. [17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Accommodation given to a defeated opponent; mercy; exemption from being killed. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "Short forms.",
              "entries": [
                {
                  "meaning": "(now rare, rugby, American football) A quarterback. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(military slang, now rare) A quartermaster; a quartermaster sergeant. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "A quarterfinal. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quarter (third-person singular simple present quarters, present participle quartering, simple past and past participle quartered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide into quarters; to divide by four.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide housing for military personnel or other equipment.",
                  "examples": [
                    "Quarter the horses in the third stable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lodge; to have a temporary residence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To quartersaw.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from French cartayer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "quarter (third-person singular simple present quarters, present participle quartering, simple past and past participle quartered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To drive a carriage so as to prevent the wheels from going into the ruts, or so that a rut shall be between the wheels.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}