{
  "word": "classic",
  "etymologies": [
    {
      "description": [
        "From French classique, from Latin classicus (“relating to the classes of Roman citizenry, especially the highest”), from classis; surface analysis, class +‎ -ic"
      ],
      "adjectives": [
        {
          "description": "classic (comparative more classic, superlative most classic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to the first class or rank, especially in literature or art.",
                  "examples": [
                    "During the whole time of his abode in the university he generally spent thirteen hours of the day in study; by which assiduity besides an exact dispatch of the whole course of philosophy, he read over in a manner all classic authors that are extant […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exemplary of a particular style; defining a class/category; typical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exhibiting timeless quality and excellence.",
                  "examples": [
                    "\"To Kill a Mockingbird\" is a 1960 classic book by Harper Lee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of or from the past; old; retro; vintage.",
                  "examples": [
                    "watching classic movies as a hobby"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the ancient Greeks and Romans, especially to Greek or Roman authors of the highest rank, or of the period when their best literature was produced; of or pertaining to places inhabited by the ancient Greeks and Romans, or rendered famous by their deeds.",
                  "examples": [
                    "Though throned midst Latium's classic plains."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Traditional; original.",
                  "examples": [
                    "Users who dislike the new visual layout can return to classic mode."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "classic (plural classics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A perfect and/or early example of a particular style.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artistic work of lasting worth, such as a film or song; a work of enduring excellence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The author of such a work.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A major, long-standing sporting event.",
              "entries": [
                {
                  "meaning": "(horse racing) Any of the British Classic Races, five long-standing Group 1 horse races run during the traditional flat racing season.",
                  "examples": [
                    "The goal of the top horses was to win a Classic (or preferably three, thus claiming the Triple Crown) or the Ascot Gold Cup,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) One learned in the literature of Ancient Greece and Ancient Rome; a student of classical literature.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}