{
  "word": "relict",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English relicte (“widow”), from Middle French relicte (“widow”), from Late Latin relicta (“widow”), from Latin relictus, past participle of relinquō (“I abandon, I relinquish, I leave (behind)”), from re- + linquō (“I leave, quit, forsake, depart from”)."
      ],
      "adjectives": [
        {
          "description": "relict (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Surviving, remaining.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That is a relict; pertaining to a relict.",
                  "examples": [
                    "In the lakes and in the streams were species of fish not known elsewhere on earth and birds and lizards and other forms of life as well all long relict here for the desert stretched away on every side."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "relict (plural relicts)",
          "definitionGroups": [
            {
              "group": "(formal) Something that, or someone who, survives or remains or is left over after the loss of others; a relic.",
              "entries": [
                {
                  "meaning": "(archaic) The surviving member of a married couple after one or the other has died; a widow or widower.",
                  "examples": [
                    "Upon which the Chancellor, by way of note said, 'it is suggested, that there is a relict of the deceased, married to another man, who has joined her in a power of attorney to authorize the sale of her interest,  […] '"
                  ]
                },
                {
                  "meaning": "(biology, ecology) A species, organism, or ecosystem that has survived from a previous age: one that was once widespread but is now found only in a few areas.",
                  "examples": []
                },
                {
                  "meaning": "(geology) A structure or other feature that has survived from a previous age.",
                  "examples": []
                },
                {
                  "meaning": "(linguistics) A survival of an archaic word, language or other form.",
                  "examples": [
                    "A small number of linguists believe that Cimbrian is not an Austro-Bavarian dialect but a relict of Lombardic."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}