{
  "word": "report",
  "etymologies": [
    {
      "description": [
        "From Middle English reporten, from Anglo-Norman reporter, Middle French reporter, and their source, Latin reportāre (“to carry back, return, remit, refer”), from re- + portāre."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "report (plural reports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of information describing, or an account of certain events given or presented to someone, with the most common adpositions being by (referring to creator of the report) and on (referring to the subject).",
                  "examples": [
                    "A report by the telecommunications ministry on the phone network revealed a severe capacity problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reputation.",
                  "examples": [
                    "Certain it is that if he had been daft before, he now ran wild in his pranks, and an evil report of him was in every mouth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) The sharp, loud sound from a gun or explosion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An employee whose position in a corporate hierarchy is below that of a particular manager.",
                  "examples": [
                    "Synonym: subordinate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "report (third-person singular simple present reports, present participle reporting, simple past and past participle reported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To relate details of (an event or incident); to recount, describe (something). [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To repeat (something one has heard), to retell; to pass on, convey (a message, information etc.). [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, reflexive) To take oneself (to someone or something) for guidance or support; to appeal. [15th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(formal, transitive) To notify someone of (particular intelligence, suspicions, illegality, misconduct etc.); to make notification to relevant authorities; to submit a formal report of. [from 15th c.]",
                  "examples": [
                    "For insurance reasons, I had to report the theft to the local police station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a formal statement, especially of complaint, about (someone). [from 19th c.]",
                  "examples": [
                    "If you do that again I'll report you to the boss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To show up or appear at an appointed time; to present oneself. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To write news reports (for); to cover as a journalist or reporter. [from 19th c.]",
                  "examples": [
                    "Andrew Marr reports now on more in-fighting at Westminster.",
                    "Every newspaper reported the war."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be accountable to or subordinate to (someone) in a hierarchy; to receive orders from (someone); to give official updates to (someone who is above oneself in a hierarchy).",
                  "examples": [
                    "The financial director reports to the CEO.",
                    "Now that I've been promoted, I report to Benjamin, whom I loathe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, dated) To return or present as the result of an examination or consideration of any matter officially referred.",
                  "examples": [
                    "The committee reported the bill with amendments, or reported a new bill, or reported the results of an inquiry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take minutes of (a speech, the doings of a public body, etc.); to write down from the lips of a speaker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To refer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete, rare) To return or repeat, as sound; to echo.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}