{
  "word": "depart",
  "etymologies": [
    {
      "description": [
        "From Old French departir, from Late Latin departiō (“to divide”), from dē- (“away from”) +‎ partiō (“part, divide”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "depart",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Division; separation, as of compound substances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A going away; departure.",
                  "examples": [
                    "Of that short Roll of friends writ in my heart",
                    "Which with thy name begins, since their depart,",
                    "Whether in the English Provinces they be,",
                    "Or drinke of Po, Sequan, or Danubie,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "depart (third-person singular simple present departs, present participle departing, simple past and past participle departed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To leave.",
                  "examples": [
                    "The government maintains that if its regulations are too stiff, British bankers will leave the country. It's true that they have been threatening to depart in droves, but the obvious answer is: \"Sod off then.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To set out on a journey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, euphemistic) To die.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To disappear, vanish; to cease to exist.",
                  "examples": [
                    "For youth departs, and pleasure flies,",
                    "And life consumes away,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deviate (from), be different (from), fail to conform.",
                  "examples": [
                    "His latest statements seemed to depart from party policy somewhat.",
                    "to depart from a title or defence in legal pleading"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go away from; to leave.",
                  "examples": [
                    "[...] he [...] did pray them only to do no thing against the honor of God, & rather to depart the territories of his empire, then to suffer their consciences to be forced."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To divide up; to distribute, share.",
                  "examples": [
                    "Then fortified hee his trenches, and departed them in foure quarters, wherein he made good store of fires, in such distance one from another, as are woont to be made in a campe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To separate, part.",
                  "examples": [
                    "Thies be than the causes [...] for the whiche we depart our selues from the Athenyans [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}