{
  "word": "skim",
  "etymologies": [
    {
      "description": [
        "From Middle English skemen, skymen, variants of scumen, from Old French escumer (“to remove scum”), from escume (“froth, foam”), from Frankish *skūm (“froth, foam”), from Proto-Germanic *skūmaz (“foam”), from Proto-Indo-European *skew- (“to cover, conceal”). See scum."
      ],
      "adjectives": [
        {
          "description": "skim (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of milk) Having lowered fat content.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "skim (countable and uncountable, plural skims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cursory reading, skipping the details.",
                  "examples": [
                    "For a first quick appreciation of the approach, we recommend a fast reading of Chapter 1, then a skim through the figures of the next two chapters — glancing at the definitions of key concepts that appear below the figures in Chapters 2 and 3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Skim milk.",
                  "examples": [
                    "Two percent milk has only a fraction less fat than whole milk, so unless you are feeding a child or someone whose diet requires whole milk, skim is best."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of skimming.",
                  "examples": [
                    "Then you could jump 150 years and enjoy a skim across the Solent in Britain's remarkable Hovercraft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is skimmed off.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Theft of money from a business before the transaction has been recorded, thus avoiding detection.",
                  "examples": [
                    "This potential is further increased by the ease of passing on the costs of corruption and racketeering to consumers; a skim of only one percent of a construction project can amount to hundreds of thousands or even millions of dollars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "skim (third-person singular simple present skims, present participle skimming, simple past and past participle skimmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass lightly; to glide along in an even, smooth course; to glide along near the surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pass near the surface of; to brush the surface of; to glide swiftly along the surface of.",
                  "examples": [
                    "Homer describes Mercury as flinging himself from the top of Olympus, and skimming the surface of the ocean."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hasten along with superficial attention.",
                  "examples": [
                    "They skim over a science in a very night superficial survey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put on a finishing coat of plaster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw an object so it bounces on water.",
                  "examples": [
                    "skimming stones"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ricochet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To read quickly, skipping some detail.",
                  "examples": [
                    "I skimmed the newspaper over breakfast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To scrape off; to remove (something) from a surface",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clear (a liquid) from scum or substance floating or lying on it, by means of a utensil that passes just beneath the surface.",
                  "examples": [
                    "to skim milk",
                    "to skim broth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clear a liquid from (scum or substance floating or lying on it), especially the cream that floats on top of fresh milk.",
                  "examples": [
                    "to skim cream"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To steal money from a business before the transaction has been recorded, thus avoiding detection.",
                  "examples": [
                    "Obviously, the longer cash sits around before being recorded, the more likely it is that a skimming fraud will occur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To surreptitiously scan a payment card in order to obtain its information for fraudulent purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become coated over.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}