{
  "word": "drive",
  "etymologies": [
    {
      "description": [
        "From Middle English driven, from Old English drīfan (“to drive, force, move”), from Proto-West Germanic *drīban, from Proto-Germanic *drībaną (“to drive”), from Proto-Indo-European *dʰreybʰ- (“to drive, push”), from Proto-Indo-European *dʰer- (“support, hold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drive (countable and uncountable, plural drives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Planned, usually long-lasting, effort to achieve something; ability coupled with ambition, determination, and motivation.",
                  "examples": [
                    "Synonyms: ambition, grit, push, verve, motivation, get-up-and-go, self-motivation",
                    "Antonyms: inertia, lack of motivation, laziness, phlegm, sloth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Violent or rapid motion; a rushing onward or away; especially, a forced or hurried dispatch of business.",
                  "examples": [
                    "The Murdstonian drive in business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of driving (prompting) game animals forward, to be captured or hunted.",
                  "examples": [
                    "Are you all ready?’ he cried, and set off towards the dead ash where the drive would begin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of driving (prompting) livestock animals forward, to transport a herd.",
                  "examples": [
                    "Synonym: drove"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A sustained advance in the face of the enemy to take a strategic objective.",
                  "examples": [
                    "Synonyms: attack, push",
                    "Napoleon's drive on Moscow was as determined as it was disastrous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanism used to power or give motion to a vehicle or other machine or machine part.",
                  "examples": [
                    "Synonyms: gear, engine, [Term?], motor",
                    "a typical steam drive",
                    "a nuclear drive",
                    "chain drive",
                    "front-wheel drive",
                    "Some old model trains have clockwork drives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trip made in a vehicle (now generally in a motor vehicle).",
                  "examples": [
                    "Synonyms: ride, spin, trip",
                    "It was a long drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A driveway.",
                  "examples": [
                    "Synonyms: approach, driveway",
                    "The mansion had a long, tree-lined drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of public roadway.",
                  "examples": [
                    "Synonyms: avenue, boulevard, road, street",
                    "Beverly Hills’ most famous street is Rodeo Drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A place suitable or agreeable for driving; a road prepared for driving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) Desire or interest.",
                  "examples": [
                    "Synonyms: desire, impetus, impulse, urge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer hardware) An apparatus for reading and writing data to or from a mass storage device such as a disk.",
                  "examples": [
                    "Synonym: disk drive",
                    "Hyponym: floppy drive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer hardware) A mass storage device in which the mechanism for reading and writing data is integrated with the mechanism for storing data.",
                  "examples": [
                    "Hyponyms: hard drive, flash drive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A stroke made with a driver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, tennis) A ball struck in a flat trajectory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A type of shot played by swinging the bat in a vertical arc, through the line of the ball, and hitting it along the ground, normally between cover and midwicket.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) A straight level shot or pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive possession, generally one consisting of several plays and/ or first downs, often leading to a scoring opportunity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A charity event such as a fundraiser, bake sale, or toy drive.",
                  "examples": [
                    "a whist drive",
                    "a beetle drive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(retail) A campaign aimed at selling more of a certain product, e.g. by offering a discount.",
                  "examples": [
                    "vaccination drive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) An impression or matrix formed by a punch drift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A collection of objects that are driven; a mass of logs to be floated down a river.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drive (third-person singular simple present drives, present participle driving, simple past drove or (archaic) drave or (dialectal) driv, past participle driven or (dialectal) druv)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide an impetus for motion or other physical change, to move an object by means of the provision of force thereto.",
                  "examples": [
                    "You drive nails into wood with a hammer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide an impetus for a non-physical change, especially a change in one's state of mind.",
                  "examples": [
                    "My husband's constant harping about the condition of the house threatens to drive me to distraction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To displace either physically or non-physically, through the application of force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause intrinsic motivation through the application or demonstration of force: to impel or urge onward thusly, to compel to move on, to coerce, intimidate or threaten.",
                  "examples": [
                    "[…]  Demosthenes desired them first to put in at Pylos and not to proceed on their voyage until they had done what he wanted. They objected, but it so happened that a storm came on and drove them into Pylos."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (especially of animals) To impel or urge onward by force; to push forward; to compel to move on.",
                  "examples": [
                    "to drive twenty thousand head of cattle from Texas to the Kansas railheads; to drive sheep out of a field"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To direct a vehicle powered by a horse, ox or similar animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause animals to flee out of.",
                  "examples": [
                    "The beaters drove the brambles, causing a great rush of rabbits and other creatures."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (something) by hitting it with great force.",
                  "examples": [
                    "You drive nails into wood with a hammer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a mechanism) to operate.",
                  "examples": [
                    "The pistons drive the crankshaft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To operate (a wheeled motorized vehicle).",
                  "examples": [
                    "drive a car",
                    "This SUV drives like a car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, aviation) To operate (an aircraft).",
                  "examples": [
                    "drive a 737"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To motivate; to provide an incentive for.",
                  "examples": [
                    "What drives a person to run a marathon?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compel (to do something).",
                  "examples": [
                    "Their debts finally drove them to sell the business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to become.",
                  "examples": [
                    "And then to hear a dead man chatter",
                    "Is enough to drive one mad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket, tennis, baseball) To hit the ball with a drive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel by operating a wheeled motorized vehicle.",
                  "examples": [
                    "I drive to work every day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey (a person, etc.) in a wheeled motorized vehicle.",
                  "examples": [
                    "My cousin drove me to the airport."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move forcefully.",
                  "examples": [
                    "Time driveth onward fast,",
                    "And in a little while our lips are dumb."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be moved or propelled forcefully (especially of a ship).",
                  "examples": [
                    "[…]  the Captain  […]  order’d the Cable to be cut, and let the Ship drive nearer the Land, where she soon beat to pieces:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To urge, press, or bring to a point or state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry or to keep in motion; to conduct; to prosecute.",
                  "examples": [
                    "You know the Trade of Life can’t be driven without Partners; there is a reciprocal Dependance between the Greatest and the Least."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clear, by forcing away what is contained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To dig horizontally; to cut a horizontal gallery or tunnel.",
                  "examples": [
                    "If the miners find no ore, they drive or cut a gallery from the pit a short distance at right angles to the direction of the lodes found"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) To put together a drive (n.): to string together offensive plays and advance the ball down the field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To distrain for rent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To separate the lighter (feathers or down) from the heavier, by exposing them to a current of air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be the dominant party in a sex act.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}