{
  "word": "cormorant",
  "etymologies": [
    {
      "description": [
        "From Middle English cormeraunt (“great cormorant (Phalacrocorax carbo); other types of aquatic bird”) [and other forms], from Old French cormaran, cor-maraunt [and other forms] (modern French cormoran), possibly variants of *corp-marin, from Medieval Latin corvus marīnus (literally “sea-raven”), with the ending -morant possibly derived from French moran (“marine, maritime”), from Breton mor (“sea”), with -an corrupted in English to -ant. Latin corvus is ultimately derived from Proto-Indo-European *ḱorh₂wós (“raven”), which is imitative of the harsh cry of the bird; while marīnus (“of or pertaining to the sea, marine”) is from Latin mare (“sea”) (ultimately from Proto-Indo-European *móri (“sea; standing water”), possibly from *mer- (“sea; lake; wetland”)) + -īnus (suffix meaning ‘of or pertaining to’)."
      ],
      "adjectives": [
        {
          "description": "cormorant (comparative more cormorant, superlative most cormorant)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or obsolete) Voracious; aggressively greedy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cormorant (plural cormorants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various medium-large black seabirds of the family Phalacrocoracidae which dive into water for fish and other aquatic animals, found throughout the world except for islands in the centre of the Pacific Ocean; specifically, the great cormorant (Phalacrocorax carbo).",
                  "examples": [
                    "Synonyms: (obsolete) corvorant, (UK dialectal) norie, sea crow, sea raven"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, also attributively, archaic or obsolete) A voracious eater; also, a person who, or thing which, is aggressively greedy for wealth, etc.",
                  "examples": [
                    "(voracious eater): Synonyms: glutton; see also Thesaurus:glutton"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}