{
  "word": "deke",
  "etymologies": [
    {
      "description": [
        "Canadian English, a contraction of decoy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deke (plural dekes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) A feint, fake, or other move made by the player with the puck to deceive a goaltender or defenceman.",
                  "examples": [
                    "Puck carriers will often use the blade of the hockey stick in timing a deke or fake (if one is used) to get around an opponent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As in hockey, a fake or other move to confuse other players on a team.",
                  "examples": [
                    "Simmons casually leaned back as if he was going to let the throw go to third. That momentary hesitation made Correa think he could take off for second. Only problem? Simmons was simply laying in wait. He grabbed the ball and threw to first.... Even though Simmons was never the focal point of the play, one deke, one cutoff, and two throws later, he had tricked the Astros out of an inning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, slang) A quick detour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deke (third-person singular simple present dekes, present participle deking, simple past and past participle deked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) To avoid, go around, or dodge an object, person, or conversation topic; often by using trickery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) To execute a deke in ice hockey or other sports.",
                  "examples": [
                    "The advantage is with the shooter from fifteen to twenty feet, but if you notice a weakness, you may want to fake a shot and \"deke\" to goalie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}