{
  "word": "abject",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Middle English abiect, abject (“expelled, outcast, rejected, wretched”, adjective) [and other forms], from Middle French abject (“worthy of utmost contempt or disgust, despicable, vile; of a person: brought low, cast down; of low social position”) (modern French abject, abjet (obsolete)), and from its etymon Latin abiectus (“abandoned; cast or thrown aside; dejected, downcast; ordinary, undistinguished, unimportant; (by extension) base, sordid; despicable, vile; humble, low; subservient”), an adjective use of the perfect passive participle of abiciō (“to discard, throw away or down; to cast or push away or aside; to abandon, give up; to belittle, degrade, humble; to lower, reduce; to overthrow, vanquish; to undervalue; to waste”), from ab- (prefix meaning ‘away; away from; from’) + iaciō (“to cast, hurl, throw, throw away”) (ultimately from Proto-Indo-European *(H)yeh₁- (“to throw”)).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "abject (comparative abjecter or more abject, superlative abjectest or most abject)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Existing in or sunk to a low condition, position, or state; contemptible, despicable, miserable. [from early 15th c.]",
                  "examples": [
                    "Synonyms: degraded, (archaic) demiss, ignoble, mean, vile, wretched, worthless",
                    "Antonym: unabject"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(chiefly with a negative connotation) Complete; downright; utter.",
                  "examples": [
                    "Synonyms: out-and-out, unmitigated; see also Thesaurus:total",
                    "abject failure   abject nonsense   abject terror"
                  ]
                },
                {
                  "meaning": "(rare) Lower than nearby areas; low-lying.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person: cast down in hope or spirit; showing utter helplessness, hopelessness, or resignation; also, grovelling; ingratiating; servile. [from mid 14th c.]",
                  "examples": [
                    "Synonyms: beggarly, cringing, slavish",
                    "Antonym: unabject"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "abject (plural abjects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person in the lowest and most despicable condition; an oppressed person; an outcast; also, such people as a class. [from early 16th c.]",
                  "examples": [
                    "Synonyms: (rare) heanling, wretch"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Late Middle English abjecten (“to cast out, expel”) [and other forms], from abiect, abject (adjective) (see etymology 1).",
        "Sense 3 (“of a fungus: to give off (spores or sporidia)”) is modelled after German abschleudern (“to give off forcefully”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "abject (third-person singular simple present abjects, present participle abjecting, simple past and past participle abjected) (transitive, chiefly archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cast off or out (someone or something); to reject, especially as contemptible or inferior. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cast down (someone or something); to abase; to debase; to degrade; to lower; also, to forcibly impose obedience or servitude upon (someone); to subjugate. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mycology) Of a fungus: to (forcibly) give off (spores or sporidia).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}