{
  "word": "stretch",
  "etymologies": [
    {
      "description": [
        "From Middle English strecchen, from Old English streċċan (“to stretch, hold out, extend, spread out, prostrate”), from Proto-West Germanic *strakkjan (“to stretch, make taut or tight”), from Proto-Indo-European *(s)treg-, *streg-, *treg- (“stiff, rigid”). Cognate with West Frisian strekke, Dutch strekken (“to stretch, straighten”), German strecken (“to stretch, straighten, elongate”), Danish strække (“to stretch”), Swedish sträcka (“to stretch”), Dutch strak (“taut, tight”), Albanian shtriqem (“to stretch”). More at stark."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stretch (plural stretches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of stretching.",
                  "examples": [
                    "I was right in the middle of a stretch when the phone rang."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to lengthen when pulled.",
                  "examples": [
                    "That rubber band has quite a bit of stretch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A course of thought which diverts from straightforward logic, or requires extraordinary belief or exaggeration.",
                  "examples": [
                    "It's a bit of a stretch to call Boris Karloff a comedian.",
                    "To say crossing the street was brave was quite a stretch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A segment of a journey or route.",
                  "examples": [
                    "It was an easy trip except for the last stretch, which took forever.",
                    "It's a tough stretch of road in the winter, especially without chains."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A segment or length of material.",
                  "examples": [
                    "a stretch of cloth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, archaic) A walk.",
                  "examples": [
                    "In the afternoon I went for a stretch into the country, & about 4 it cleared up pretty well, so I hurried back & we got a cart & drove to Bassano, a little town about 8 miles off, that we wanted to see."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A quick pitching delivery used when runners are on base where the pitcher slides his leg instead of lifting it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A long reach in the direction of the ball with a foot remaining on the base by a first baseman in order to catch the ball sooner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Term of address for a tall person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing) The homestretch, the final straight section of the track leading to the finish.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A length of time.",
              "entries": [
                {
                  "meaning": "(Ireland) Extended daylight hours, especially said of the evening in springtime when compared to the shorter winter days.",
                  "examples": [
                    "There is a grand stretch in the evenings."
                  ]
                },
                {
                  "meaning": "(sports) The period of the season between the trade deadline and the beginning of the playoffs.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A jail or prison term.",
                  "examples": [
                    "He did a seven-year stretch in jail.",
                    "Synonym: stint"
                  ]
                },
                {
                  "meaning": "(slang) A jail or prison term of one year's duration.",
                  "examples": []
                },
                {
                  "meaning": "A single uninterrupted sitting; a turn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stretch limousine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stretch (third-person singular simple present stretches, present participle stretching, simple past and past participle stretched or (obsolete) straught or (obsolete) straight)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lengthen by pulling.",
                  "examples": [
                    "I stretched the rubber band until it almost broke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lengthen when pulled.",
                  "examples": [
                    "The rubber band stretched almost to the breaking point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull tight.",
                  "examples": [
                    "First, stretch the skin over the frame of the drum."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To get more use than expected from a limited resource.",
                  "examples": [
                    "I managed to stretch my coffee supply a few more days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, transitive) To make inaccurate by exaggeration.",
                  "examples": [
                    "To say crossing the street was brave is stretching the meaning of \"brave\" considerably.",
                    "To say he's been to this park a million times is stretching the numbers. The true number is around 30 or 40."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend physically, especially from limit point to limit point.",
                  "examples": [
                    "The beach stretches from Cresswell to Amble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To extend one’s limbs or another part of the body in order to improve the elasticity of one's muscles",
                  "examples": [
                    "Cats stretch with equal ease and agility beyond the point that breaks a man on the rack.",
                    "I always stretch my muscles before exercising.",
                    "When the cat woke up, it yawned and stretched."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To extend to a limit point",
                  "examples": [
                    "His mustache stretched all the way to his sideburns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To increase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, colloquial) To stretch the truth; to exaggerate.",
                  "examples": [
                    "a man apt to stretch in his report of facts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To sail by the wind under press of canvas.",
                  "examples": [
                    "The ship stretched to the eastward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive, archaic) To execute by hanging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make great demands on the capacity or resources of something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}