{
  "word": "chipmunk",
  "etymologies": [
    {
      "description": [
        "1832; alteration (influenced by chipping squirrel) of earlier chitmunk, from older Ojibwe ačitamo˙nˀ (“squirrels”) (modern ajidamoo), literally ‘those who descend headlong’, from ačit- (“headfirst, face-down”) (compare modern ajijibizo (“he falls headfirst”), ajidagoojin (“he hangs upside down”)). The English verb developed due to the high-pitched voices of the American puppet and cartoon chipmunks in the group Alvin and the Chipmunks, who later starred in a popular children's TV show in the 1980s."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chipmunk (plural chipmunks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A squirrel-like rodent of the genus Tamias, native mainly to North America.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chipmunk (third-person singular simple present chipmunks, present participle chipmunking, simple past and past participle chipmunked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speed up (an audio recording, especially a song), to make the voices high-pitched.",
                  "examples": [
                    "The Dipset capo favors breezy, bass-heavy beats instead of chipmunked soul samples to celebrate the 'hood's favorite season."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill (one's mouth or cheeks) with food.",
                  "examples": [
                    "Less than a minute to go and she's chewing almost viciously, her stuffed cheeks all chipmunked out like Dizzy Gillespie's in midsolo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To stuff (food) into one's mouth or cheeks, sometimes as part of competitive eating.",
                  "examples": [
                    "She chipmunked her breakfast into a porcelain cheek."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}