{
  "word": "truck",
  "etymologies": [
    {
      "description": [
        "Perhaps a shortening of truckle, related to Latin trochus (“iron hoop, wheel”) from Ancient Greek τροχός (trokhós)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "truck (countable and uncountable, plural trucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small wheel or roller, specifically the wheel of a gun carriage.",
                  "examples": [
                    "“Put that cannon up once, and I'll answer for it that no Injin faces it. 'Twill be as good as a dozen sentinels,” answered Joel. “As for mountin’, I thought of that before I said a syllable about the crittur. There's the new truck-wheels in the court, all ready to hold it, and the carpenters can put the hinder part to the whull, in an hour or two.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ball on top of a flagpole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) On a wooden mast, a circular disc (or sometimes a rectangle) of wood near or at the top of the mast, usually with holes or sheaves to reeve signal halyards; also a temporary or emergency place for a lookout. \"Main\" refers to the mainmast, whereas a truck on another mast may be called (on the mizzenmast, for example) \"mizzen-truck\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, US, Australia) A heavier motor vehicle designed to carry goods or to pull a semi-trailer designed to carry goods.",
                  "examples": [
                    "Synonyms: rig, (if a lighter truck) pickup truck, (if used to pull a semitrailer) semi-trailer truck, (chiefly British) lorry",
                    "Mexican open-bed trucks haul most of the fresh produce that comes into the United States from Mexico."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(road transport, Singapore, Malaysia) A lorry with a closed or covered carriage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, rail transport) A railroad car, chiefly one designed to carry goods",
                  "examples": [
                    "Synonyms: goods wagon, freight wagon, goods carriage, freight carriage, goods truck, freight truck, (North American English:) freight car"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any smaller wagon/cart or vehicle of various designs, pushed or pulled by hand or (obsolete) pulled by an animal, used to move and sometimes lift goods, like those in hotels for moving luggage or in libraries for moving books.",
                  "examples": [
                    "Hyponyms: hand truck, pallet truck, forklift truck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, rail transport) Abbreviation of railroad truck or wheel truck; a pivoting frame, one attached to the bottom of the bed of a railway car at each end, that rests on the axle and which swivels to allow the axle (at each end of which is a solid wheel) to turn with curves in the track.",
                  "examples": [
                    "Synonym: (British English) bogie"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a skateboard or roller skate that joins the wheels to the deck, consisting of a hanger, baseplate, kingpin, and bushings, and sometimes mounted with a riser in between.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A platform with wheels or casters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Dirt or other messiness.",
                  "examples": [
                    "“Nothing! Look at your hands. And look at your mouth. What is that truck?”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "truck (third-person singular simple present trucks, present participle trucking, simple past and past participle trucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drive a truck.",
                  "examples": [
                    "My father has been trucking for 20 years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey by truck.",
                  "examples": [
                    "Last week, Cletus trucked 100 pounds of lumber up to Dubuque."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, slang) To travel, to proceed. [1960s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, Canada, slang) To persist, to endure. [from 1960s]",
                  "examples": [
                    "Keep on trucking!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, film production) To move a camera parallel to the movement of the subject.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To fight or otherwise physically engage with.",
                  "examples": [
                    "Both deputies were big, made of dense flesh and tough experience. . . . I wouldn't have wanted to truck with either one of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To run over or through a tackler in American football.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English truken, troken, trukien, from Old English trucian (“to fail, run short, deceive, disappoint”), from Proto-West Germanic *trukōn (“to fail, miss, lack”), from Proto-Indo-European *derew-, *derwu- (“to tear, wrap, reap”), from Proto-Indo-European *der- (“to flay, split”). Cognate with Middle Low German troggelen (“to cheat, deceive, swindle”), Dutch troggelen (“to extort”), German dialectal truggeln (“to flatter, fawn”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "truck (third-person singular simple present trucks, present participle trucking, simple past and past participle trucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly dialectal) To fail; run out; run short; be unavailable; diminish; abate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly dialectal) To give in; give way; knuckle under; truckle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now chiefly dialectal) To deceive; cheat; defraud.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From dialectal truck, truk, trokk, probably of North Germanic origin, compare Norwegian dialectal trokka, trakka (“to stamp, trample, go to and fro”), Danish trykke (“to press, press down, crush, squeeze”), Swedish trycka. More at thrutch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "truck (third-person singular simple present trucks, present participle trucking, simple past and past participle trucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Scotland) To tread (down); stamp on; trample (down).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trukien, from unrecorded Anglo-Norman and Old French words, from Latin trocāre, from Frankish *trokan. Related to Etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "truck (plural trucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, often in the plural) Small, humble items; things, often for sale or barter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The practice of paying workers in kind, or with tokens only exchangeable at a shop owned by the employer [forbidden in the 19th century by the Truck Acts].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, often attributive) Garden produce, groceries (see truck garden).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with negative) Social intercourse; dealings, relationships.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "truck (third-person singular simple present trucks, present participle trucking, simple past and past participle trucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trade, exchange; barter.",
                  "examples": [
                    "We will begin by supposing the international trade to be in form, what it always is in reality, an actual trucking of one commodity against another."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in commerce; to barter or deal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have dealings or social relationships with; to engage with.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}