{
  "word": "serve",
  "etymologies": [
    {
      "description": [
        "From Middle English serven, from Old French servir, from Latin serviō (“be a slave; serve”), from Latin servus (“slave; servant”), which perhaps derives from Etruscan (compare Etruscan proper names 𐌔𐌄𐌓𐌅𐌉 (servi), 𐌔𐌄𐌓𐌅𐌄 (serve)), or from Proto-Indo-European *ser- (“watch over, protect”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "serve (plural serves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An act of putting the ball or shuttlecock in play in various games.",
                  "examples": [
                    "Whose serve is it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Australia) A portion of food or drink, a serving.",
                  "examples": [
                    "The night before your event, base your evening meal on high-carbohydrate foods with a small serve of lean protein."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gay slang and African-American Vernacular) An impressive presentation (especially of a person's appearance).",
                  "examples": [
                    "That white eyeliner is such a serve."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "serve (third-person singular simple present serves, present participle serving, simple past and past participle served)",
          "definitionGroups": [
            {
              "group": "(personal) To provide a service (or, by extension, a product, especially food or drink).",
              "entries": [
                {
                  "meaning": "(transitive) To be a formal servant for (a god or deity); to worship in an official capacity. [from 12thc.]",
                  "examples": [
                    "And yet this is not the office of a Priest, but of Him whom the Priest should serve."
                  ]
                },
                {
                  "meaning": "(transitive) To be a servant for; to work for, to be employed by. [from 13thc.]",
                  "examples": [
                    "And, truly, Mrs Abigail, I must needs say, I served my master contentedly while he was living, but I will serve no man living (that is, no man that is not living) without double wages."
                  ]
                },
                {
                  "meaning": "(transitive) To wait upon (someone) at table; to set food and drink in front of, to help (someone) to food, meals etc. [from 13thc.]",
                  "examples": [
                    "That night Annie served him grilled halibut and English peas, plus tomatoes, of course, and a salad."
                  ]
                },
                {
                  "meaning": "(intransitive) To be a servant or worker; to perform the duties of a servant or employee; to render service. [from 14thc.]",
                  "examples": [
                    "They also serve who only stand and wait."
                  ]
                },
                {
                  "meaning": "(transitive) To set down (food or drink) on the table to be eaten; to bring (food, drink) to a person. [from 15thc.]",
                  "examples": [
                    "About twenty minutes after waiters served the soup, a guest got up and left."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To treat (someone) in a given manner. [from 13thc.]",
                  "examples": [
                    "I mock them all who have served me ill of late and chiefly this cheat of Judah, whose temple we have plundered and whose golden vessels are my wash-pots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To be suitor to; to be the lover of. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "To be effective.",
              "entries": [
                {
                  "meaning": "(transitive) To be useful to; to meet the needs of. [from 14thc.]",
                  "examples": [
                    "So, while the sycophantic liberal media calls any and all opposition to Obama racist, they give Obama carte blanche to exploit his race whenever it serves his purpose."
                  ]
                },
                {
                  "meaning": "(intransitive) To have a given use or purpose; to function for something or to do something. [from 14thc.]",
                  "examples": [
                    "The bust also served to remind the public that the Mafia is not harmless."
                  ]
                },
                {
                  "meaning": "(intransitive) To usefully take the place as, instead of something else. [from 14thc.]",
                  "examples": [
                    "Maybe the volcanic eruption will serve as a wake-up call to such companies that they need to modernise their risk management."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, law) To deliver a document.",
              "entries": [
                {
                  "meaning": "To officially deliver (a legal notice, summons etc.). [from 15thc.]",
                  "examples": [
                    "On the morning of February 28, 1993, ATF agents gathered at a staging area near Waco and prepared to serve a search warrant on the Branch Davidians' residence."
                  ]
                },
                {
                  "meaning": "To make legal service upon (a person named in a writ, summons, etc.)",
                  "examples": [
                    "to serve a witness with a subpoena"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, sports) To lead off with the first delivery over the net in tennis, volleyball, ping pong, badminton etc. [from 16thc.]",
                  "examples": [
                    "In women's tennis the need to serve more effectively has become greater in recent years because the game is being played more aggressively, and rallies are becoming shorter as a result."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To copulate with (of male animals); to cover. [from 16thc.]",
                  "examples": [
                    "Conception means that a cow is served by a bull and that she becomes pregnant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in military service. [from 16thc.]",
                  "examples": [
                    "Some reports suggested he would quit the army if he was not allowed to serve abroad in a war zone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To work, to operate (a weapon). [from 18thc.]",
                  "examples": [
                    "John T. Greble, of the 2d regular artillery, was likewise killed instantly by a ball through the head, while serving his gun in the face of the foe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work through (a given period of time in prison, a sentence). [from 19thc.]",
                  "examples": [
                    "The Guangzhou Daily reported that Shi Chunlong, 20, who organised the incident, was sentenced to 15 years in prison. Hou Bin, who pulled out of the attack after helping to plan it, will serve 12 years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To wind spun yarn etc. tightly around (a rope or cable, etc.) so as to protect it from chafing or from the weather.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform (a public obligation).",
                  "examples": [
                    "I've received a summons for jury duty. It says I serve one day or one trial.",
                    "She served the office of mayor five years ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, slang, drugs) To provide crack cocaine (to), usually by selling, dealing, or distributing.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(gay slang and African-American Vernacular) To present an attractive personal appearance.",
              "entries": [
                {
                  "meaning": "(intransitive) To present an attractive personal appearance.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To attractively display something (especially a body part) as part of one's personal appearance.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To evoke something (especially a person) with one's personal appearance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}