{
  "word": "pry",
  "etymologies": [
    {
      "description": [
        "The verb is inherited from Middle English prien, pryen (“to look closely, peer into, pry, spy”) [and other forms], from Old English *prīwan, *prēowian (“to look narrowly, to squint at”), attested by Old English beprīwan, beprēwan (“to wink”); further etymology unknown, but probably akin to Old English *prēowot (“closing of the eyes”), attested only in combination – compare prēowthwīl (“blink or twinkling of an eye, moment”), princ (“a wink”): see prink.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pry (plural pries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of prying; a close and curious look.",
                  "examples": [
                    "Synonym: prying"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is very inquisitive or nosy; a busybody, a nosey parker.",
                  "examples": [
                    "Synonym: (chiefly US) Paul Pry"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pry (third-person singular simple present pries, present participle prying, simple past and past participle pried)",
          "definitionGroups": [
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To peer closely and curiously, especially at something closed or not public.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To inquire into something that does not concern one; to be nosy; to snoop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To peer at (something) closely; also, to look into (a matter, etc.) thoroughly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "The noun is probably a back-formation from prise, prize (“tool for levering, lever”), construed as the plural of pry.",
        "The verb is either derived from the noun, or is a back-formation from prise (“to force open with a lever”), construed as pries, the third-person singular present form of pry."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pry (plural pries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(East Anglia, US) A tool for levering; a crowbar, a lever.",
                  "examples": [
                    "Synonyms: (both chiefly historical) prise, prize, prybar, pry bar"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pry (third-person singular simple present pries, present participle prying, simple past and past participle pried) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use leverage to open, raise, or widen (something); to prise or prize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Usually followed by out (of): to draw out or get (information, etc.) with effort.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}