{
  "word": "chicory",
  "etymologies": [
    {
      "description": [
        "From Late Middle English cicoree, cicory, cicorea, sicory, sycory (“common chicory (Cichorium intybus); heliotrope”), from Old French cicoree (modern French chicorée (“common chicory; endive; coffee substitute made from common chicory”)), or directly from its etymon Medieval Latin cicorea, cichorea, *cichōria, from Latin cichorium, cichoreum (“common chicory; endive”), from Ancient Greek κίχορα (kíkhora), κιχόρεια (kikhóreia), neuter plural of κιχώριον (kikhṓrion, “chicory”). The English word is cognate with Italian cicórea, and is a doublet of succory."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chicory (countable and uncountable, plural chicories)",
          "definitionGroups": [
            {
              "group": "(countable) Either of two plants of the Asteraceae family.",
              "entries": [
                {
                  "meaning": "(chiefly Britain) The common chicory (Cichorium intybus), the source of Belgian endive, radicchio, and sugarloaf.",
                  "examples": [
                    "Synonyms: blue daisy, blue dandelion, blue sailor, blue weed, chicory button, coffeeweed, cornflower, hendibeh, horseweed, ragged sailor, succory, wild bachelor's button, wild endive"
                  ]
                },
                {
                  "meaning": "(chiefly Canada, US) The endive (Cichorium endivia), the source of escarole and frisée.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, cooking) A coffee substitute made from the roasted roots of the common chicory, sometimes used as a cheap adulterant in real coffee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}