{
  "word": "crotchet",
  "etymologies": [
    {
      "description": [
        "From Middle English crochet, from Old French crochet (“small hook”), from croc + -et (diminutive suffix), from Old Norse krókr (“hook”). The musical note was named so because of a small hook on its stem in black notation (in modern notation this hook is on the quaver/eighth note). Doublet of crochet, crocket, and croquet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crotchet (plural crotchets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical note one beat long in 4/4 time.",
                  "examples": [
                    "Synonym: (US) quarter note"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sharp curve or crook; a shape resembling a hook",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surgery, now chiefly historical) A hook-shaped instrument, especially as used in obstetric surgery.",
                  "examples": [
                    "Either Doctor Denman or an old Woman would have waited—but since the horrid death-doing Crotchet has been found out, & its use permitted—Oh! many & many a Life has been flung away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A whim or a fancy.",
                  "examples": [
                    "He ruined himself and all that trusted in him by crotchets that he could never explain to any rational man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forked support; a crotch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) An indentation in the glacis of the covered way, at a point where a traverse is placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The arrangement of a body of troops, either forward or rearward, so as to form a line nearly perpendicular to the general line of battle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A square bracket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crotchet (third-person singular simple present crotchets, present participle crotcheting, simple past and past participle crotcheted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) to play music in measured time",
                  "examples": [
                    "The nimblest crotcheting musician"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Archaic form of crochet (knit by looping)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}