{
  "word": "capitalize",
  "etymologies": [
    {
      "description": [
        "capital +‎ -ize, the first element ultimately from Latin capitālis (“of the head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "capitalize (third-person singular simple present capitalizes, present participle capitalizing, simple past and past participle capitalized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) In writing or editing, to write (something: either an entire word or text, or just the initial letter(s) thereof) in capital letters, in upper case.",
                  "examples": [
                    "In German, all nouns are capitalized."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business, finance) To contribute or acquire capital (money or other resources) for.",
                  "examples": [
                    "Some states require proof that a new venture is properly capitalized before the state will issue a certificate of incorporation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, finance) To convert into capital, i.e., to get cash or similar immediately fungible resources for some less fungible property or source of future income.",
                  "examples": [
                    "If we obtain a loan using the business as collateral, the effect will be to capitalize our next ten years of income, giving us cash today that we can use to buy out our competitor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, accounting, taxation) To treat as capital, not as an expense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To profit or to obtain an advantage.",
                  "examples": [
                    "The home team took several shots on goal but was unable to capitalize until late in the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, followed by on) To seize, as an opportunity; to obtain a benefit from; to invest on something profitable.",
                  "examples": [
                    "The home team appeared to have the advantage throughout the game, and finally capitalized on their opponents' weakness with just two minutes remaining, scoring several points in quick succession."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}