{
  "word": "chip",
  "etymologies": [
    {
      "description": [
        "From Middle English chip, chippe, from Old English ċipp (“chip; small piece of wood”), from Old English *ċippian (“to cut; hew”) – attested in Old English forċippian (“to cut off”) –, from Proto-Germanic *kipp- (“to cut; carve; hack; chop”), from Proto-Indo-European *ǵeyb- (“to split; divide; germinate; sprout”). Related to Dutch kip, keep (“notch; nick; score”), Dutch kippen (“to hatch”), German Low German kippen (“to cut; clip; trim; shorten”), German kipfen (“to chop off the tip; snip”), Old Swedish kippa (“to chop”). Compare also chop.",
        "The formally similar Old English ċipp, ċypp, ċyp (“a beam; log; stock; post”), from Proto-Germanic *kippaz (“log; beam”), whence Old Saxon kip (“post”), Old High German kipfa, chipfa (“axle, stave”) and Old Norse keppr (“cudgel, club”), ultimately from Latin cippus (“stake; pale; post”), is a different, unrelated word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chip (plural chips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece broken from a larger piece of solid material.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A damaged area of a surface where a small piece has been broken off.",
                  "examples": [
                    "This cup has a chip in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(games, gambling) A token used in place of cash.",
                  "examples": [
                    "If the second player does raise three chips, and all the other players drop, the player who opened may stay in by putting three more chips in the pot, for then he will have put in precisely as many chips as the second player."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A sovereign (the coin).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A circuit fabricated in one piece on a small, thin substrate.",
                  "examples": [
                    "But sources close to the company said the chip contains two direct memory access controllers, two interrupt controllers, a timer, a memory mapper from Texas Instruments, and a Motorola Inc. real-time clock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A hybrid device mounted in a substrate, containing electronic circuitry and miniaturised mechanical, chemical and/or biochemical devices.",
                  "examples": [
                    "Fig. 4(a) shows a schematic design of the micropump chip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland, Australia, New Zealand, archaic in Canada, especially in the plural) A fried strip of potato of square or rectangular cross-section; a french fry.",
                  "examples": [
                    "Do you want sauce or mayonnaise on your chips?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, Australia and New Zealand, especially in the plural) A thin, crisp, fried slice of potato, or sometimes another vegetable; a crisp.",
                  "examples": [
                    "they made their own potato chips from scratch, he ate a tortilla chip, served with a side of apple chips"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A shot during which the ball travels more predominantly upwards than in a regular shot, as to clear an obstacle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A takeout that hits a rock at an angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dried piece of dung, often used as fuel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand, northern) A receptacle, usually for strawberries or other fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) A small, near-conical piece of food added in baking.",
                  "examples": [
                    "chocolate chip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small rectangle of colour printed on coated paper for colour selection and matching. A virtual equivalent in software applications.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The triangular piece of wood attached to the log line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Wood or Cuban palm leaf split into slips, or straw plaited in a special manner, for making hats or bonnets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, derogatory) Anything dried up, withered, or without flavour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A low shot that travels further along the ground than it does in the air.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English chippen, from Old English *ċippian (“to cut; hew”) – attested in Old English forċippian (“to cut off”) –, from Proto-Germanic *kipp- (“to cut; carve; hack; chop”), from Proto-Indo-European *ǵey- (“to split; divide; germinate; sprout”). Related to Dutch kippen (“to hatch”), German Low German kippen (“to cut; clip; trim; shorten”), German kipfen (“to chop off the tip; snip”), Old Swedish kippa (“to chop”). Compare also chop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "chip (third-person singular simple present chips, present participle chipping, simple past and past participle chipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To chop or cut into small pieces.",
                  "examples": [
                    "The workers chipped the dead branches into mulch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break small pieces from.",
                  "examples": [
                    "Be careful not to chip the paint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To play a shot hitting the ball predominantly upwards rather than forwards.  In association football specifically, when the shot is a shot on goal, the opposing goalkeeper may be the direct object of the verb, rather than the ball.",
                  "examples": [
                    "Koeman identified Southampton’s third as their finest goal of the game. Jack Cork, the most underrated player at a much-lauded club, swept the ball out wide to Tadic, who waited for Cork to run to the back post before chipping the ball across to him to slam in a deserved goal from close range, despite an attempted block by Vito Mannone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, automotive) to upgrade an engine management system, usually to increase power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become chipped.",
                  "examples": [
                    "This varnish chips easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, card games, often with \"in\") To ante (up).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To fit (an animal) with a microchip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, transitive, often with \"in\") to contribute.",
                  "examples": [
                    "Everyone needs to chip in £1 for George's leaving collection"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also, to chip at) To make fun of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}