{
  "word": "quack",
  "etymologies": [
    {
      "description": [
        "From Middle English *quacken, queken (“to croak like a frog; make a noise like a duck, goose, or quail”), from quack, qwacke, quek, queke (“quack”, interjection and noun), also kek, keke, whec-, partly of imitative origin and partly from Middle Dutch quacken (“to croak, quack”), from Old Dutch *kwaken (“to croak, quack”), from Proto-West Germanic *kwakōn, from Proto-Germanic *kwakaną, *kwakōną (“to croak”), of imitative origin. Cognate with Saterland Frisian kwoakje, kwaakje (“to quack”), Middle Low German quaken (“to quack, croak”), German quaken (“to quack, croak”), Danish kvække (“to croak”), Swedish kväka (“to croak, quackle”), Norwegian kvekke (“to croak”), Icelandic kvaka (“to twitter, chirp, quack”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quack (plural quacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound made by a duck.",
                  "examples": [
                    "Did you hear that duck make a quack?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quack (third-person singular simple present quacks, present participle quacking, simple past and past participle quacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a noise like a duck.",
                  "examples": [
                    "The more breadcrumbs I threw on the ground, the more they quacked.",
                    "Do you hear the ducks quack?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a queen bee: to make a high-pitched sound during certain stages of development.",
                  "examples": [
                    "Coordinate terms: toot, pipe"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of quacksalver, from Middle Dutch kwaksalver (“hawker of salve”) (modern Dutch kwakzalver), from quacken (“to brag, boast; to croak”). Ultimately related to etymology one, above."
      ],
      "adjectives": [
        {
          "description": "quack (comparative more quack or quacker, superlative most quack or quackest) (quacker and quackest are rare, and probably used humorously)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Falsely presented as having medicinal powers.",
                  "examples": [
                    "Don't get your hopes up; that's quack medicine!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "quack (plural quacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A fraudulent healer, especially a bombastic peddler in worthless treatments, a doctor who makes false diagnoses for monetary benefit, or an untrained or poorly trained doctor who uses fraudulent credentials to attract patients [from c. 1630]",
                  "examples": [
                    "That doctor is nothing but a lousy quack!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, derogatory) Any similar charlatan or incompetent professional.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous slang, mildly derogatory) Any doctor.",
                  "examples": [
                    "That quack wants me to quit smoking, eat less, and start exercising. The nerve!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quack (third-person singular simple present quacks, present participle quacking, simple past and past participle quacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To practice or commit quackery (fraudulent medicine).",
                  "examples": [
                    "[…]  it is incredible, and scarce to be imagin’d, how the Posts of Houses, and Corners of Streets were plaster’d over with Doctors Bills, and Papers of ignorant Fellows; quacking and tampering in Physick, and inviting the People to come to them for Remedies;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To make vain and loud pretensions.",
                  "examples": [
                    "Synonym: boast"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}