{
  "word": "brew",
  "etymologies": [
    {
      "description": [
        "Middle English brewen, from Old English brēowan, from Proto-West Germanic *breuwan, from Proto-Germanic *brewwaną, from Proto-Indo-European *bʰrewh₁-.",
        "Cognate with\nDutch brouwen, German brauen, Swedish brygga, Norwegian Bokmål brygge; also Ancient Greek φρέαρ (phréar, “well”), Latin fervēre (“to be hot; to burn; to boil”), Old Irish bruth (“violent, boiling heat”), Sanskrit भुर्वन् (bhurván, “motion of water”). It may be related to English barley"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brew (plural brews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "The mixture formed by brewing; that which is brewed; a brewage, such as tea or beer.",
              "entries": [
                {
                  "meaning": "(slang) A serving of beer.",
                  "examples": [
                    "Synonym: brewski"
                  ]
                },
                {
                  "meaning": "(Britain, slang) A cup of tea.",
                  "examples": [
                    "Landlady: You're not stoppin' for a brew?Gene Hunt: No thanks, love. Better crack on."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brew (third-person singular simple present brews, present participle brewing, simple past and past participle brewed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make tea or coffee by mixing tea leaves or coffee beans with hot water.",
                  "examples": [
                    "Elderly people sat indoors, in the damp. shabby houses, brewing malt coffee or weak tea and talking without animation  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To heat wine, infusing it with spices; to mull.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make a hot soup by combining ingredients and boiling them in water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To make beer by steeping a starch source in water and fermenting the resulting sweet liquid with yeast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To foment or prepare, as by brewing",
                  "examples": [
                    "Synonyms: contrive, plot, hatch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To attend to the business, or go through the processes, of brewing or making beer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an unwelcome event) To be in a state of preparation; to be mixing, forming, or gathering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To boil or seethe; to cook.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Middle English brewe (“eyebrow”), from Old English bru (“eyebrow”). Doublet of brow"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brew (plural brews)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect) An overhanging hill or cliff.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}