{
  "word": "theater",
  "etymologies": [
    {
      "description": [
        "From Middle English theater, theatre, from Old French theatre, from Latin theatrum, from Ancient Greek θέατρον (théatron, “a place for viewing”), from θεάομαι (theáomai, “to see\", \"to watch\", \"to observe”). Doublet of tiatr."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "theater (countable and uncountable, plural theaters) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place or building, consisting of a stage and seating, in which an audience gathers to watch plays, musical performances, public ceremonies, and so on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A region where a particular action takes place; a specific field of action, usually with reference to war.",
                  "examples": [
                    "His grandfather was in the Pacific theater during the war."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lecture theatre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An operating theatre or locale for human experimentation.",
                  "examples": [
                    "This man is about to die, get him into theater at once!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A cinema.",
                  "examples": [
                    "We sat in the back row of the theater and threw popcorn at the screen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Drama or performance as a profession or art form.",
                  "examples": [
                    "I worked in theater for twenty-five years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any place rising by steps like the seats of a theater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, derogatory, often following a noun used attributively) A conspicuous but unproductive display of action.",
                  "examples": [
                    "The Senate confirmation hearings were just theater.",
                    "security theater"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}