{
  "word": "leveller",
  "etymologies": [
    {
      "description": [
        "level +‎ -er"
      ],
      "adjectives": [
        {
          "description": "leveller",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British spelling) comparative form of level: more level",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "leveller (plural levellers) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or thing that levels.",
                  "examples": [
                    "I adjusted the leveller built into each leg of the table, but it still wobbled.",
                    "A soil leveller is used to prepare the field before sowing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that transcends people’s differences (such as social class, wealth, etc.); something that tends to eliminate advantages and disadvantages.",
                  "examples": [
                    "Conversation is not to be met with in large and mixed companies; and a card-table, considered as an universal leveller, may have its use, by placing the weak and timid on a par with the most lively and overbearing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person holding a political opinion in favor of eliminating disparities between the haves and the have-nots.",
                  "examples": [
                    "[…]  there was no sympathy and connection between the upper and the lower people of the Irish. To one who had been bred so much abroad as myself, this difference between Catholic and Protestant was doubly striking; and though as firm as a rock in my own faith, yet I could not help remembering my grandfather held a different one, and wondering that there should be such a political difference between the two. I passed among my neighbours for a dangerous leveller, for entertaining and expressing such opinions  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An equaliser.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}