{
  "word": "beef",
  "etymologies": [
    {
      "description": [
        "From Middle English beef, bef, beof, borrowed from Anglo-Norman beof, Old French buef, boef (“ox”) (modern French bœuf); from Latin bōs (“ox”), from Proto-Italic *gʷōs, ultimately from Proto-Indo-European *gʷṓws. Doublet of cow.",
        "Beef in the sense of “a grudge, argument” was originally an American slang expression:",
        "As to the possible origin of this American usage, it has been suggested that it can be traced back to a British expression for “alarm”, first recorded in 1725:  \"BEEF 'to alarm, as To cry beef  upon us; they have discover'd us, and are in Pursuit of us\". The term \"beef\" in this context would be a Cockney rhyming slang of thief. The continuous use of a similar expression, including its assumed semantic shift to 'complaint' in the United States from the 1880s onwards, needs further clarification though."
      ],
      "adjectives": [
        {
          "description": "beef (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being a bovine animal that is being raised for its meat.",
                  "examples": [
                    "We bought three beef calves this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Producing or known for raising lots of beef.",
                  "examples": [
                    "beef farms",
                    "beef country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consisting of or containing beef as an ingredient.",
                  "examples": [
                    "beef stew"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Beefy; powerful; robust.",
                  "examples": [
                    "Wow, your audio setup is beef!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "beef (countable and uncountable, plural beef or beefs or beeves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(uncountable) The meat from a cow, bull, or other bovine.",
              "entries": [
                {
                  "meaning": "(in the meat industry, on product packaging) The edible portions of a cow (including those which are not meat).",
                  "examples": [
                    "lean finely textured beef",
                    "boneless lean beef trimmings"
                  ]
                },
                {
                  "meaning": "(by extension, slang, uncountable) Muscle or musculature; size, strength or potency.",
                  "examples": [
                    "Put some beef into it! We've got to get the car over the bump.",
                    "We've got to get some beef into the enforcement provisions of that law."
                  ]
                },
                {
                  "meaning": "(figurative, slang, uncountable) Essence, content; the important part of a document or project.",
                  "examples": [
                    "Synonym: meat",
                    "The beef of his paper was a long rant about government."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Bovine animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Canada, US, countable, now uncommon, plural beeves) A bovine (cow or bull) being raised for its meat.",
                  "examples": [
                    "Do you want to raise beeves?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable or countable, plural beefs) A grudge; dislike (of something or someone); lack of faith or trust (in something or someone); a reason for a dislike or grudge. (often + with)",
                  "examples": [
                    "He's got beef over what you said.",
                    "He's got a beef with everyone in the room.",
                    "Remember what happened last fall? That's his beef with me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Dorset) Fibrous calcite or limestone, especially when occurring in a jagged layer between shales in Dorset.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "beef (third-person singular simple present beefs, present participle beefing, simple past and past participle beefed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To complain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To add weight or strength to.",
                  "examples": [
                    "Synonym: beef up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To fart; break wind.",
                  "examples": [
                    "Ugh, who just beefed in here?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, MLE, MTE, intransitive, slang) To feud or hold a grudge against.",
                  "examples": [
                    "Those two are beefing right now – best you stay out of it for now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Yorkshire) To cry.",
                  "examples": [
                    "David was beefing last night after Ruth told him off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To fail or mess up.",
                  "examples": [
                    "I beefed my presentation hard yesterday."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}