{
  "word": "credit",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French crédit (“belief, trust”), from Latin crēditum (“a loan, credit”), neuter of crēditus, past participle of crēdere (“to believe”). The verb is from the noun. Doublet of shraddha, creed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "credit (countable and uncountable, plural credits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reliance on the truth of something said or done; faith; trust.",
                  "examples": [
                    "When Jonathan and the people heard these words they gave no credit into them, nor received them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Recognition, respect and admiration.",
                  "examples": [
                    "I give you credit for owning up to your mistake.",
                    "He arrived five minutes late, but to his credit he did work an extra ten minutes at the end of his shift."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Acknowledgement of a contribution, especially in the performing arts.",
                  "examples": [
                    "She received a singing credit in last year's operetta."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television/film, usually in the plural) Written titles and other information about the TV program or movie shown at the beginning and/or end of the TV program or movie.",
                  "examples": [
                    "They kissed, and then the credits rolled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, law, business, finance) A privilege of delayed payment extended to a buyer or borrower on the seller's or lender's belief that what is given will be repaid.",
                  "examples": [
                    "In view of your payment record, we are happy to extend further credit to you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The time given for payment for something sold on trust.",
                  "examples": [
                    "a long credit or a short credit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, US) A person's credit rating or creditworthiness, as represented by their history of borrowing and repayment (or non payment).",
                  "examples": [
                    "What do you mean my credit is no good?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) An addition to certain accounts; the side of an account on which payments received are entered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tax accounting) A reduction in taxes owed, or a refund for excess taxes paid.",
                  "examples": [
                    "Didn't you know that the IRS will refund any excess payroll taxes that you paid if you use the 45(B) general business credit?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A source of value, distinction or honour.",
                  "examples": [
                    "That engineer is a credit to the team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction) A unit of currency used in a fictional universe or timeframe.",
                  "examples": [
                    "To repair your star cruiser will cost 100,000 credits."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A nominal unit of value assigned outside of a currency system.",
                  "examples": [
                    "Would you like to play? I put in a dollar and I've got two credits left."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Recognition for having taken a course (class).",
                  "examples": [
                    "If you do not come to class, you will not get credit for the class, regardless of how well you do on the final."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A course credit, a credit hour – used as measure if enough courses have been taken for graduation.",
                  "examples": [
                    "Dude, I just need 3 more credits to graduate – I can take socio-linguistics of Swahili if I want."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "credit (third-person singular simple present credits, present participle crediting, simple past and past participle credited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To believe; to put credence in.",
                  "examples": [
                    "Synonyms: accept, believe",
                    "Someone said there were over 100,000 people there, but I can't credit that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, accounting) To add to an account.",
                  "examples": [
                    "Antonym: debit",
                    "Credit accounts receivable with the amount of the invoice.",
                    "For the payroll period credit employees' tips to their wages paid account and debit their minimum wage payable account.",
                    "The full amount of the purchase has been credited to your account."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To acknowledge the contribution of.",
                  "examples": [
                    "I credit the town council with restoring the shopping district.",
                    "Credit the point guard with another assist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring honour or repute upon; to do credit to; to raise the estimation of.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}