{
  "word": "peregrinate",
  "etymologies": [
    {
      "description": [
        "From Latin peregrinari (“to live or travel abroad”). See also peregrine and pilgrim."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "peregrinate (third-person singular simple present peregrinates, present participle peregrinating, simple past and past participle peregrinated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel from place to place, or from one country to another, especially on foot; hence, to sojourn in foreign countries.",
                  "examples": [
                    "He came first to recognise, then finally to know and to feel, that just as the atoms of his own physical body peregrinate by efflux and influx in and out of his body, so does he as a human ‘life-atom’ or human Monad peregrinate by unceasing influx and efflux in and out of the regular series of his earth-lives which succeed one another uninterruptedly during his sojourn in a Planetary Round on this globe Earth of the planetary chain, and much, very much, more."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To travel through a specific place.",
                  "examples": [
                    "History records no popular tumult, except of tongues, about the matter, but Jesse Hand never fully regained the regard of some people, and jealousy and distrust, like a curse, followed his new-fangled equipage; and though he and his generation are long since dead, yet the writer hath knowledge of traditions that, still drawn by attenuated and discouraged equines, a very Wandering Jew of vehicles, Jesse Hand’s carriage still peregrinates, at a toilsome pace, the interminable, sandy, woodland roads of Jersey."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Latin peregrinatus (“having travelled abroad”), past participle of peregrinari."
      ],
      "adjectives": [
        {
          "description": "peregrinate (comparative more peregrinate, superlative most peregrinate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Peregrine; having travelled; exotic, foreign.",
                  "examples": [
                    "Other apprentices on this pilgrimage have been the worldly Squire to the peregrinate Knight to whom are juxtaposed the peregrinate Second Nun to the worldly Prioress."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}