{
  "word": "paternoster",
  "etymologies": [
    {
      "description": [
        "From Middle English paternoster, pater noster, from Old English pater noster, from Latin Pater noster (“our father”) (the first two words of the Oratio Dominica (“the Lord's prayer”)), from pater (“father”) + noster (“our”). The lift and the fishing equipment are named from their resemblance to a rosary."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "paternoster (plural paternosters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The Lord's Prayer, especially in a Roman Catholic context.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slow, continuously moving lift or elevator consisting of a loop of open-fronted cabins running the height of a building.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A bead-like ornament in mouldings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A tackle rig with a heavy sinker at the end of the line, and one or more hooks on traces at right angles spaced above the sinker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, archaic) A string of beads used in counting prayers that are said; a rosary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, archaic) Every eleventh bead in a rosary, at which, while counting the beads, the Lord's Prayer is to be repeated.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, archaic) A medieval artisan who crafted rosary beads or prayer nuts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A patent medicine, so named because salesmen would pray the Lord's Prayer over it before selling it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "paternoster (third-person singular simple present paternosters, present participle paternostering, simple past and past participle paternostered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing, transitive) To try to catch (fish, etc.) with a paternoster rig.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}