{
  "word": "facile",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French facile, from Latin facilis (“easy to do, easy, doable”), from faciō (“I do, make”). Compare Spanish fácil (“easy”)."
      ],
      "adjectives": [
        {
          "description": "facile (comparative more facile, superlative most facile)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Easy, now especially in a disparaging sense; contemptibly easy. [from 15th c.]",
                  "examples": [
                    "as he that is benumbed with cold sits shaking, that might relieve himself with a little exercise or stirring, do they complain, but will not use the facile and ready means to do themselves good […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Amiable, flexible, easy to get along with. [from 16th c.]",
                  "examples": [
                    "His facile disposition made him many friends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Effortless, fluent (of work, abilities etc.). [from 17th c.]",
                  "examples": [
                    "we can learn the impression that he made upon a stranger and a foreigner at this period, thanks to the facile pen of Fannu Burney."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lazy, simplistic (especially of explanations, discussions etc.). [from 19th c.]",
                  "examples": [
                    "There is a facile view that our green commitments – to tackling climate change, avoiding air and water pollution, protecting natural habitats – are an obstacle to growth. The message of the commodity markets is surely different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Of a reaction or other process, taking place readily.",
                  "examples": [
                    "Decarboxylation of beta-keto acids is facile..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}