{
  "word": "whip",
  "etymologies": [
    {
      "description": [
        "From Middle English whippen, wippen (“to flap violently”), from Middle Dutch wippen (“to swing, leap, dance, oscillate”) and Middle Low German wippen (“to move quickly”), from Proto-Germanic *wipjaną (“to move back and forth”). Some similarity to Sanskrit root वेप् (vep, “shake, flourish”), Latin vibrō (“I shake”). (See Swedish vippa and Danish vippe (“to shake”)).",
        "The unetymological wh- is probably expressive of the sound of a whip; compare the same development in whisk and onomatopoeias such as whack and whoosh.",
        "The political senses are from whipper-in (“huntsman who keeps the hounds from wandering”), 18th century hunting terminology."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whip (plural whips)",
          "definitionGroups": [
            {
              "group": "A lash; a pliant, flexible instrument, such as a rod (commonly of cane or rattan) or a plaited or braided rope or thong (commonly of leather) used to create a sharp \"crack\" sound for directing or herding animals.",
              "entries": [
                {
                  "meaning": "The same instrument used to strike a person or animal for corporal punishment or torture.",
                  "examples": [
                    "Once he ran out of appeals, he knew he would soon feel the sting of the whip."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blow administered with a whip.",
                  "examples": [
                    "I had hardly said the word, when Kit jumped into the saddle, and gave his horse a whip and a spur — and off it cantered, as if it were in as great a hurry to be married as Kit himself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) A whipper-in.",
                  "examples": [
                    "From the far side of the wood came the long shrill screech  […]  which signifies that one of the whips has viewed the fox quitting the covert."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A member of a political party who is in charge of enforcing the party's policies in votes; a whipper-in.",
                  "examples": [
                    "I was going to vote against the bill, but the party whip came to see me and made it clear I needed to vote for it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics, with definite article) A document distributed weekly to MPs by party whips informing them of upcoming votes in parliament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics, by extension) The regular status of an MP within a parliamentary party, which can be revoked by the party as a disciplinary measure.",
                  "examples": [
                    "to withdraw the whip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whipped cream.",
                  "examples": [
                    "Did you want to add some whip to your coffee, ma'am?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A purchase in which one block is used to gain a 2:1 mechanical advantage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, MTE) A mode of personal motorized transportation; an automobile, all makes and models including motorcycles, excluding public transportation.",
                  "examples": [
                    "Big whip I'm underground parking"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roller derby) A move in which one player transfers momentum to another.",
                  "examples": [
                    "Hyponym: hip whip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A whipping motion; a thrashing about.",
                  "examples": [
                    "I was startled by the whip of the rope when it finally snapped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of being whiplike or flexible; suppleness, as of the shaft of a golf club.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Any of various pieces that operate with a quick vibratory motion",
              "entries": [
                {
                  "meaning": "A spring in certain electrical devices for making a circuit",
                  "examples": []
                },
                {
                  "meaning": "(music) A wippen, a rocking component in certain piano actions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A coach driver; a coachman.",
                  "examples": [
                    "Lord Carington  […]  led the way with his chestnuts, having a distinguished brother whip, Lord Londesborough, by his side."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whip (third-person singular simple present whips, present participle whipping, simple past and past participle whipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit with a whip.",
                  "examples": [
                    "The rider whipped the horse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To hit with any flexible object.",
                  "examples": [
                    "I whipped her with a newspaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To defeat, as in a contest or game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mix in a rapid aerating fashion, especially food.",
                  "examples": [
                    "to whip eggs or cream"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To urge into action or obedience.",
                  "examples": [
                    "He whipped the department into shape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, politics) To enforce a member voting in accordance with party policy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To bind the end of a rope with twine or other small stuff to prevent its unlaying: fraying or unravelling.",
                  "examples": [
                    "Its string  […] is firmly whipt about with small Gut"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To hoist or purchase by means of a whip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sew lightly; specifically, to form (a fabric) into gathers by loosely overcasting the rolled edge and drawing up the thread.",
                  "examples": [
                    "to whip a ruffle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw or kick an object at a high velocity.",
                  "examples": [
                    "He whipped the ball at me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To fish a body of water especially by making repeated casts.",
                  "examples": [
                    "whipping its rough surface for a trout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To snap back and forth like a whip.",
                  "examples": [
                    "The pennants whipped in the wind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move very fast.",
                  "examples": [
                    "The wind whipped through the valley."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (something) very fast; often with up, out, etc.",
                  "examples": [
                    "He whips out his pocketbook every moment, and writes descriptions of everything he sees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, roller derby) To transfer momentum from one skater to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To lash with sarcasm, abuse, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To thrash; to beat out, as grain, by striking.",
                  "examples": [
                    "to whip wheat"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}