{
  "word": "blackjack",
  "etymologies": [
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blackjack (countable and uncountable, plural blackjacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A common gambling card game in casinos, where the object is to get as close to 21 without going over.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A hand in the game of blackjack consisting of a face card and an ace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A variant of switch where each player is initially dealt the same number of cards, usually seven, and when one player plays a black jack the player whose turn comes next has to pick up that many cards, unless they play a red jack (as this normally cancels a black jack).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The flag (i.e., a jack) traditionally flown by pirate ships; popularly thought to be a white skull and crossed bones on a black field (the Jolly Roger).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A small, flat, blunt, usually leather-covered weapon loaded with heavy material such as lead or ball bearings, intended to inflict a blow to the head that renders the victim unconscious with diminished risk of lasting cranial trauma.",
                  "examples": [
                    "Coordinate terms: baton, cosh, sap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A tool of leather filled with shot (or similar), resembling the weapon, used for shaping sheet metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several species of weed of genus Bidens, such as Bidens pilosa, in the family Compositae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blackjack oak.",
                  "examples": [
                    "A steep slope rose, crested by stunted blackjacks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a series of hard, dark soils, often considered low quality, but suitable for growing certain crops such as cotton.",
                  "examples": [
                    "This man had a brother about six miles off, settled on a rich White River bottom-land farm -- and while a blackjack clay soil yielded seventy bushels to the acre, this fine bottom-land would not average fifty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pharmacology, UK, Australia, rare) Ammonium bituminosulfonate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blackjack (third-person singular simple present blackjacks, present participle blackjacking, simple past and past participle blackjacked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike with a blackjack or similar weapon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}