{
  "word": "literally",
  "etymologies": [
    {
      "description": [
        "From literal +‎ -ly."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "literally (comparative more literally, superlative most literally)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Word for word; not figuratively; not as an idiom or metaphor.",
                  "examples": [
                    "Synonyms: actually, really, unfiguratively, unmetaphorically; see also Thesaurus:actually",
                    "Antonyms: figuratively, metaphorically, virtually",
                    "When I saw on the news that there would be no school tomorrow because of the snowstorm, I literally jumped for joy, and hit my head on the ceiling fan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(degree, figuratively, proscribed, contranym) Used non-literally as an intensifier for figurative statements: virtually, so to speak (often considered incorrect; see usage notes)",
                  "examples": [
                    "Synonym: virtually",
                    "He was so surprised, he literally jumped twenty feet in the air.",
                    "My daughter's pet rabbit had babies, and now we've literally got rabbits coming out of our ears.",
                    "On 9/11 people were literally glued to their TV sets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Used to intensify or dramatize non-figurative statements.",
                  "examples": [
                    "I had no idea, so I was literally guessing.",
                    "I was literally having breakfast when she arrived.",
                    "She was literally like, \"What?\", and I was literally like, \"Yeah\".",
                    "Literally who is this?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Used as a generic downtoner: just, merely.",
                  "examples": [
                    "Synonyms: merely; see also Thesaurus:merely",
                    "It's not even hard⁠ to make—you literally just put it in the microwave for five minutes and it's done.",
                    "It won't take me long to get back, cause the store's literally two blocks away."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}