{
  "word": "pellucid",
  "etymologies": [
    {
      "description": [
        "The adjective is a learned borrowing from Latin pellūcidus, perlucidus (“transparent, pellucid; very bright; very understandable”), from per- (prefix meaning ‘through; throughout; completely, thoroughly’) + lūcidus (“clear; full of light, bright, shining; (figuratively) easily understood, clear, lucid”) (from lūceō (“to shine; to become visible, show through; (figuratively) to be apparent, conspicuous, or evident”) (ultimately from Proto-Indo-European *lewk- (“bright; to see; to shine”)) + -idus (suffix meaning ‘tending to’ forming adjectives)).",
        "The noun is derived from the adjective."
      ],
      "adjectives": [
        {
          "description": "pellucid (comparative more pellucid, superlative most pellucid) (literary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Allowing the passage of light; translucent or transparent.",
                  "examples": [
                    "Synonyms: clear, limpid, lucid, (rare) perspicuous; see also Thesaurus:transparent",
                    "Antonyms: see Thesaurus:opaque"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "Easily understood; clear.",
                  "examples": [
                    "Synonyms: crystal clear, lucid, perspicuous, translucent; see also Thesaurus:comprehensible",
                    "Antonyms: see Thesaurus:incomprehensible"
                  ]
                },
                {
                  "meaning": "Of music or some other sound: not discordant or harsh; clear and pure-sounding.",
                  "examples": []
                },
                {
                  "meaning": "Of a person, their mind, etc.: able to think and understand clearly; not confused; clear, sharp.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Easily recognized or seen through; apparent, obvious.",
                  "examples": [
                    "Synonyms: see Thesaurus:obvious",
                    "Antonyms: see Thesaurus:subtle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pellucid (plural pellucids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Something which allows the passage of light; a translucent or transparent object.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}