{
  "word": "crisp",
  "etymologies": [
    {
      "description": [
        "From Middle English crisp (“curly”), from Old English crisp (“curly”), from Latin crispus (“curly”). Doublet of crêpe."
      ],
      "adjectives": [
        {
          "description": "crisp (comparative crisper, superlative crispest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of something seen or heard) Sharp, clearly defined.",
                  "examples": [
                    "This new television set has a very crisp image."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Brittle; friable; in a condition to break with a short, sharp fracture.",
                  "examples": [
                    "The crisp snow crunched underfoot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Possessing a certain degree of firmness and freshness.",
                  "examples": [
                    "It [laurel] has been plucked nine months, and yet looks as hale and as crisp as if it would last ninety years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of weather, air etc.) Dry and cold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of movement, action etc.) Quick and accurate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of talk, text, etc.) Brief and to the point.",
                  "examples": [
                    "An expert, given a certain query, will often come up with a crisp answer: “yes” or “no”."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of wine) having a refreshing amount of acidity; having less acidity than green wine, but more than a flabby one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Lively; sparking; effervescing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Curling in stiff curls or ringlets.",
                  "examples": [
                    "crisp hair"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Curled by the ripple of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) Not using fuzzy logic; based on a binary distinction between true and false.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "crisp (plural crisps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A very thin slice of potato that has been deep fried, typically packaged and sold as a snack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A baked dessert made with fruit and crumb topping",
                  "examples": [
                    "Synonyms: crumble, crunch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(food) Anything baked or fried in thin slices and eaten as a snack.",
                  "examples": [
                    "kale crisps"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crisp (third-person singular simple present crisps, present participle crisping, simple past and past participle crisped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make crisp.",
                  "examples": [
                    "Synonym: crispen",
                    "to crisp bacon by frying it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become crisp.",
                  "examples": [
                    "Synonym: crispen",
                    "to put celery into ice water to crisp"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To cause to curl or wrinkle (of the leaves or petals of plants, for example); to form into ringlets or tight curls (of hair).",
                  "examples": [
                    "[…]  the brimme therof was as it were the brimme of a chalice, or of a crisped lilie:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To become curled.",
                  "examples": [
                    "[…]  a few shreds of purple bloom on a brown, crisping tuft of self-heal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To cause to undulate irregularly (of water); to cause to ripple.",
                  "examples": [
                    "I would not their vile breath should crisp the stream",
                    "Wherein that image shall for ever dwell;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To undulate or ripple.",
                  "examples": [
                    "Hitherto we haue sayled with a fore-wind, & our sliding ship hath plowed vp the crisping waues of the Sea at ease."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To wrinkle, contort or tense (a part of one's body).",
                  "examples": [
                    "[…]  he consider’d what an infinity of Muscles these laughing Rascals threw into a convulsive motion at the same time; whether we regard the spasms of the Diaphragm and all the muscles of respiration, the horrible rictus of the mouth, the distortion of the lower jaw, the crisping of the nose, twinkling of the eyes, or sphaerical convexity of the cheeks, with the tremulous succussion of the whole human body:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To become contorted or tensed (of a part of the body).",
                  "examples": [
                    "[…]  she gave no sign of the wave of repugnance that swept over her except that her fingers suddenly crisped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, rare) To interweave (of the branches of trees).",
                  "examples": [
                    "[…]  the hot pavement by the playing field where the trees crisp together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To make a sharp or harsh sound.",
                  "examples": [
                    "Synonyms: creak, crunch, crackle, rustle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To colour (something with highlights); to add small amounts of colour to (something).",
                  "examples": [
                    "Synonym: tinge"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}