{
  "word": "harbor",
  "etymologies": [
    {
      "description": [
        "From Middle English herberwe, herber, from Old English herebeorg (“shelter, lodgings, quarters”), from Proto-West Germanic *harjabergu (“army shelter, refuge”) (compare West Frisian herberch (“inn”), Dutch herberg (“inn”), German Herberge), from *harjaz (“army”) + *bergō (“protection”), equivalent to Old English here (“army, host”) + beorg (“defense, protection, refuge”). Cognate with Old Norse herbergi (“a harbour; a room”) (whence Icelandic herbergi), Dutch herberg, German Herberge (“inn, hostel, shelter”), Swedish härbärge. Compare also French auberge (“hostel”). More at here, harry, borrow and bury. Doublet of harbinger."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "harbor (countable and uncountable, plural harbors) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any place of shelter.",
                  "examples": [
                    "The neighborhood is a well-known harbor for petty thieves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, nautical) A sheltered expanse of water, adjacent to land, in which ships may anchor or dock, especially for loading and unloading.",
                  "examples": [
                    "A harbor, even if it is a little harbor, is a good thing, since adventurers come into it as well as go out, and the life in it grows strong, because it takes something from the world, and has something to give in return -  Sarah Orne Jewett"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, glassworking) A mixing box for materials.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) A house of the zodiac, or the mansion of a heavenly body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Shelter, refuge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English herberwen, herbere, from Old English herebeorgian (“to take up one's quarters, lodge”), from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "harbor (third-person singular simple present harbors, present participle harboring, simple past and past participle harbored) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide a harbor or safe place for.",
                  "examples": [
                    "The docks, which once harbored tall ships, now harbor only petty thieves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take refuge or shelter in a protected expanse of water.",
                  "examples": [
                    "The fleet harbored in the south."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive (a hunted stag) to covert.",
                  "examples": [
                    "This is the time that the horseman are flung out, not having the cry to lead them to the death. When quadruped animals of the venery or hunting kind are at rest, the stag is said to be harboured, the buck lodged, the fox kennelled, the badger earthed, the otter vented or watched, the hare formed, and the rabbit set."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold or persistently entertain in one's thoughts or mind.",
                  "examples": [
                    "She harbors a conviction that her husband has a secret, criminal past."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}