{
  "word": "hocus",
  "etymologies": [
    {
      "description": [
        "See hocus-pocus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hocus (plural hocuses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A magician, illusionist, one who practises sleight of hand.",
                  "examples": [
                    "Certainly he was the bravest Ambodexter of his time, and this blinded age, or that ever was among us dull Northern people; and among the multitude of his Tricks, I shall commend to the Hocusses of Bartholomew Fair, for their information and edification, this Legerdemain (for it is supposed it will hardly be practicable any more in the Pulpit;)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who cheats or deceives.",
                  "examples": [
                    "[…]  when thy Brother has lost all that ever he had, and lies languishing, and even gasping under the utmost extremities of poverty and distress, dost thou think thus to lick him whole again, only with thy Tongue? just like that old formal Hocus, who denyed a Beggar a farthing, and put him off with his Blessing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Trick; trickery.",
                  "examples": [
                    "As in almost every Chapter of his Book, so in this Seventh, he has a new Hocus to carry on his old design  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Drugged liquor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hocus (third-person singular simple present hocuses or hocusses, present participle hocusing or hocussing, simple past and past participle hocused or hocussed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To play a trick on, to trick (someone); to hoax; to cheat.",
                  "examples": [
                    "[…]  to contemplate the miseries of a poor Poetick life, or study some well laid plot to Hocus his Landlady into a further credence or belief  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To stupefy (someone) with drugged liquor (especially in order to steal from them).",
                  "examples": [
                    "[…]  but him they intended to disable by a trick then newly introduced amongst robbers, and termed hocussing, i. e., clandestinely drugging the liquor of the victim with laudanum  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To drug (liquor).",
                  "examples": [
                    "[He] served them out three fingers of rum apiece, which the bo’sun took upon himself to hocus. By latest accounts, they’re sleeping it off  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To adulterate (food).",
                  "examples": [
                    "I had a healthy appetite, but the tradition was that all the food was unutterably bad, adulterated, hocussed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}