{
  "word": "supplicate",
  "etymologies": [
    {
      "description": [
        "From Late Middle English supplicaten (“to request (that someone do something)”) [and other forms], borrowed from Latin supplicātus (“prayed”) + Middle English -en (suffix forming the infinitive of verbs). Supplicātus is the perfect passive participle of supplicō (“to pray, supplicate; to beg, humbly beseech”), from sup- (variant of sub- (prefix meaning ‘below, beneath, under’)) + plicō (“to bend, flex; to fold; to roll up”) (ultimately from Proto-Indo-European *pleḱ- (“to fold; to plait, weave”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "supplicate (third-person singular simple present supplicates, present participle supplicating, simple past and past participle supplicated)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To make a humble request to (someone, especially a person in authority); to beg, to beseech, to entreat.",
                  "examples": [
                    "Synonyms: implore, obsecrate, petition, plead, (obsolete) pray, sifflicate, (obsolete) thig"
                  ]
                },
                {
                  "meaning": "(specifically, Oxford University, archaic) Of a member of the university, or an alumnus or alumna of another university seeking a degree ad eundem: to make a formal request (to the university) that an academic degree be awarded to oneself.",
                  "examples": []
                },
                {
                  "meaning": "(specifically, religion) To make a humble request to (a deity or other spiritual being) in a prayer; to entreat as a supplicant.",
                  "examples": [
                    "to supplicate the Deity"
                  ]
                },
                {
                  "meaning": "To ask or request (something) humbly and sincerely, especially from a person in authority; to beg or entreat for.",
                  "examples": [
                    "Synonym: solicit",
                    "to supplicate blessings on Christian efforts to spread the gospel"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To humbly request for something, especially to someone in a position of authority; to beg, to beseech, to entreat.",
                  "examples": [
                    "Synonyms: sifflicate, (obsolete) thig"
                  ]
                },
                {
                  "meaning": "(specifically, Oxford University) Of a member of the university, or an alumnus or alumna of another university seeking a degree ad eundem: to formally request that an academic degree be awarded to oneself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}