{
  "word": "handsel",
  "etymologies": [
    {
      "description": [
        "From Middle English handsell, hanselle, from Old English handselen and/or Old Norse handsal (literally “hand-gift”). Cognate with Scots hansel, Danish handsel."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "handsel (plural handsels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A lucky omen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gift given at New Year, or at the start of some enterprise or new situation, meant to ensure good luck.",
                  "examples": [
                    "their first good handsel of breath in this world"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Price, payment; especially the first installment of a series.",
                  "examples": [
                    "\"I see the first handsel that God gives them on their voyage to the Land of Promise; thirst and bitterness.\"",
                    "(From Contemplations, Book Five, Contemplation 1, The Waters of Marah (Found in volume 1 of The Works of Joseph",
                    "Hall, edited by Peter Hall, published by Talboys, Oxford, 1837, page 88))"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "handsel (third-person singular simple present handsels, present participle handselling or handseling, simple past and past participle handselled or handseled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give a handsel to.",
                  "examples": [
                    "She would leave a gold guinea to hansel the baby."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inaugurate by means of some ceremony; to break in.",
                  "examples": [
                    "And it is better undecently to faile in hanseling the nuptiall bed, full of agitation and fits, by waiting for some or other fitter occasion, and more private opportunitie, lest sudden and alarmed, than to fall into a perpetuall miserie, by apprehending an astonishment and desperation of the first refusall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use or do for the first time, especially so as to make fortunate or unfortunate; to try experimentally.",
                  "examples": [
                    "Indeed there is no contrivance of our body, but some good man in Scripture hath hanselled it with prayer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}