{
  "word": "rhotic",
  "etymologies": [
    {
      "description": [
        "Back-formation from rhotacism, coined in 1968 by John C. Wells."
      ],
      "adjectives": [
        {
          "description": "rhotic (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, of an English accent) That allows the phoneme /ɹ/ even when not followed by a vowel, as in bar (/bɑːɹ/) and bard or barred (/bɑːɹd/); (of an English speaker) who speaks with such an accent.",
                  "examples": [
                    "Rhotic speech is common in Ireland, Scotland, much of the United States, Canada, West Country England, and many parts of the north and west of England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, phonetics, of a phoneme) Having a sound quality associated with the letter R; having the sound of any of certain IPA symbols, including /ɹ/, /ɻ/, /ɚ/, /ɝ/ and /r/.",
                  "examples": [
                    "In the IPA, a rhotic vowel (aka R-coloured vowel, retroflex vowel, vocalic r or rhotacised vowel) is indicated by the affixing of a hook diacritic ( ˞ ) to the right of the regular symbol for the vowel. The rhotic consonants are /r/,  /ɾ/, /ɹ/, /ɻ/, /ʀ/, /ʁ/, /ɽ/ and /ɺ/."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rhotic (plural rhotics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) A rhotic consonant or rhotic vowel (R-coloured vowel).",
                  "examples": [
                    "It is well known that the phonetic realization of rhotics varies considerably from language to language, even from dialect to dialect. Rhotics can be realized as flaps, taps, trills (uvular, coronal or bilabial), or as assibilated or fricative variants."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}