{
  "word": "irrefragable",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Late Latin irrefrāgābilis (“irrefragable”) + English -able (suffix forming adjectives with the sense ‘able or fit to be done’). Irrefrāgābilis is derived from Latin ir- (variant of in- (prefix meaning ‘not’)) + refrāgārī + -bilis (suffix forming adjectives indicating a capacity or worth of being acted upon); while refrāgārī is the present active infinitive of refrāgor (“to oppose, resist; to gainsay, thwart”) (further etymology uncertain, possibly from re- (prefix meaning ‘again’) + fragor (“a breaking, shattering; a crash; din, uproar”) (from frangō (“to break, shatter”), ultimately from Proto-Indo-European *bʰreg- (“to break”))), formed as an antonym of suffrāgōr, the first-person singular present passive indicative of suffrāgō (“to support; to vote for”)."
      ],
      "adjectives": [
        {
          "description": "irrefragable (comparative more irrefragable, superlative most irrefragable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Which cannot be refuted; clearly right, incontrovertible, indisputable, irrefutable. [from 16th c.]",
                  "examples": [
                    "Synonyms: incontestable, indubitable, unanswerable, undeniable, unquestionable; see also Thesaurus:irrefutable",
                    "Antonyms: contestable, controvertible, deniable, disputable, dubitable, questionable, refragable, refutable"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Which cannot or should not be broken; indestructible.",
                  "examples": [
                    "Synonyms: inviolable, irresistible"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of a person: obstinate, stubborn.",
                  "examples": [
                    "Synonyms: see Thesaurus:obstinate",
                    "Antonyms: see Thesaurus:flexible"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}