{
  "word": "glee",
  "etymologies": [
    {
      "description": [
        "From Middle English gle, from Old English glēo, glīġ, glēow, glīw (“glee, pleasure, mirth, play, sport; music; mockery”), from Proto-Germanic *glīwą (“joy, mirth”), from Proto-Indo-European *gʰlew- (“to joke, make fun, enjoy”). Cognate with Scots gle, glie, glew (“game, play, sport, mirth, joy, rejoicing, entertainment, melody, music”), Icelandic glý (“joy, glee, gladness”), Ancient Greek χλεύη (khleúē, “joke, jest, scorn”). A poetic word in Middle English, the word was obsolete by 1500, but revived late 18c."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glee (countable and uncountable, plural glees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Joy; happiness; great delight, especially from one's own good fortune or from another's misfortune.",
                  "examples": [
                    "Synonyms: merriment, mirth, gaiety, gloat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Music; minstrelsy; entertainment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(singing, countable) An unaccompanied part song for three or more solo voices, not necessarily merry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gleen, glewen, from Old English glēowian (“to sing, play an instrument, jest”), from Proto-West Germanic *glīwōn, from Proto-Germanic *glīwōną. Cognate with Icelandic glýja (“to be gleeful”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "glee (third-person singular simple present glees, present participle gleeing, simple past and past participle gleed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sing a glee (unaccompanied part song).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}