{
  "word": "monkery",
  "etymologies": [
    {
      "description": [
        "From monk +‎ -ery."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "monkery (countable and uncountable, plural monkeries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, often derogatory) The practices of monks; the way of life, behavior, etc. characteristic of monks; monastic life.",
                  "examples": [
                    "Even such monkery was confined entirely to the laity; the clergy having cures in villages or in towns, and being therefore precluded from monastic sequestrations. In time, however, monkery found its way among the clergy,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, derogatory) Monasticism.",
                  "examples": [
                    "As the circumstances of their living on barley bread and herbs [...] existed nowhere, that we have seen, but in the monkish imaginations of Jerome and Bellarmine. As the circumstances on which the argument is founded, vanish upon inspection, so does the monkery of Elijah, Elisha, and the sons of the prophets  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, often derogatory or humorous) A monastery.",
                  "examples": [
                    "The sides resemble castellated piles and Gothic cathedrals, so fantastic are the shapes assumed by the natural rock; under St. Saba it became a monkery for all penitents who wished to live a hermit's life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, collectively) Monks, considered as a group. (Compare clergy, laity.)",
                  "examples": [
                    "And furthermore, so long as they do entangle and bind themselves with so many and so perverse and wicked kinds of worshipping as the monkery now-a-days doth contain in it, I may well say that they are not consecrated unto God,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}