{
  "word": "truth",
  "etymologies": [
    {
      "description": [
        "From Middle English trouthe, truthe, trewthe, treowthe, from Old English trēowþ, trīewþ (“truth, veracity, faith, fidelity, loyalty, honour, pledge, covenant”), from Proto-Germanic *triwwiþō (“promise, covenant, contract”), from Proto-Indo-European *drū- (“tree”), from Proto-Indo-European *deru- (“firm, solid”), equivalent to true +‎ -th. Cognate with Norwegian trygd (“trustworthiness, security, insurance”), Icelandic tryggð (“loyalty, fidelity”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "truth (usually uncountable, plural truths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "True facts, genuine depiction or statements of reality.",
                  "examples": [
                    "The truth is that our leaders knew a lot more than they were letting on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conformity to fact or reality; correctness, accuracy.",
                  "examples": [
                    "There was some truth in his statement that he had no other choice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or quality of being true to someone or something.",
                  "examples": [
                    "Truth to one's own feelings is all-important in life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Faithfulness, fidelity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pledge of loyalty or faith.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conformity to rule; exactness; close correspondence with an example, mood, model, etc.",
                  "examples": [
                    "The process of grinding is, in fact, regarded as indispensable wherever truth is required, yet that of scraping is calculated to produce a higher degree of truth than has ever been attained by grinding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is real, in a deeper sense; spiritual or ‘genuine’ reality.",
                  "examples": [
                    "The truth is what is.",
                    "Alcoholism and redemption led me finally to truth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something acknowledged to be true; a true statement or axiom.",
                  "examples": [
                    "Hunger and jealousy are just eternal truths of human existence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, dated) Topness; the property of a truth quark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(games) In the game truth or dare, the choice to truthfully answer a question put forth.",
                  "examples": [
                    "When asked truth or dare, he picked truth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "truth (third-person singular simple present truths, present participle truthing, simple past and past participle truthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To assert as true; to declare; to speak truthfully.",
                  "examples": [
                    "Had they [the ancients] dreamt this, they would have truthed it heaven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make exact; to correct for inaccuracy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nonstandard, intransitive) To tell the truth.",
                  "examples": [
                    "You keep lying, when you oughta be truthin'"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}