{
  "word": "negative",
  "etymologies": [
    {
      "description": [
        "From Middle English negative, negatif, from Old French negatif, from Latin negativus (“that denies, negative”), from negare (“to deny”); see negate."
      ],
      "adjectives": [
        {
          "description": "negative (comparative more negative, superlative most negative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not positive nor neutral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Of electrical charge of an electron and related particles [from the 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(mathematics) Of a number: less than zero",
              "entries": [
                {
                  "meaning": "(weather) Less than zero degrees Celsius or Fahrenheit.",
                  "examples": [
                    "I was out in negative weather today."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, logic) Denying a proposition.",
                  "examples": [
                    "Antonym: affirmative"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Damaging; undesirable; unfavourable.",
                  "examples": [
                    "The high exchange rate will have a negative effect on our profits.",
                    "Customers didn’t like it: feedback was mostly negative."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often used pejoratively) Pessimistic; not tending to see the bright side of things.",
                  "examples": [
                    "I don’t like to hang around him very much because he can be so negative about his petty problems."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or relating to a photographic image in which the colours of the original, and the relations of left and right, are reversed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Metalloidal, nonmetallic; contrasted with positive or basic.",
                  "examples": [
                    "The nitro group is negative."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Age jargon, derogatory) Often preceded by emotion, energy, feeling, or thought: to be avoided, bad, difficult, disagreeable, painful, potentially damaging, unpleasant, unwanted.",
                  "examples": [
                    "Negative feelings can be worked through and their energy converted into positive energy... In crisis, normal patterns of self-organization fail, resulting in anxiety (negative energy)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characterized by the presence of features which do not support a hypothesis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) HIV negative.",
                  "examples": [
                    "We certainly told him at that time that I was negative. We talked about transmission. We told him we don't do anything that would cause me to become positive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) COVID-19 negative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "negative (plural negatives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Refusal or withholding of assents; prohibition, veto [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An unfavorable point or characteristic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A right of veto.",
                  "examples": [
                    "And as to the Constitutionality of laws, that point will come before the Judges in their proper official character. In this character they have a negative on the laws."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) An image in which dark areas represent light ones, and the converse. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A word that indicates negation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A negative quantity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weightlifting) A repetition performed with a weight in which the muscle begins at maximum contraction and is slowly extended; a movement performed using only the eccentric phase of muscle movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The negative plate of a voltaic or electrolytic cell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "negative (third-person singular simple present negatives, present participle negativing, simple past and past participle negatived)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To refuse; to veto.",
                  "examples": [
                    "Poppy earnestly begged to be allowed to go with Jasmine on the roof, but this the good lady negatived with horror."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contradict.",
                  "examples": [
                    "\"A comely maid, that,\" said the other.",
                    "\"True, comely enough. But unless I make a great mistake—\" And he negatived the remainder of the definition forthwith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disprove.",
                  "examples": [
                    "At one time an idea got abroad that the whole tale of her fortune had been a myth;  […]  but the boastings of various servants who declared they had seen her with “rolls on rolls” of banknotes  […]  negatived the truth of this statement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make ineffective; to neutralize, to negate.",
                  "examples": [
                    "Yet he made his largesse daily more lavish, as he saw the king negativing his efforts by taking care of the orphans and showing his remorse for the murder of his sons by his tenderness towards their little ones."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}