{
  "word": "rugby",
  "etymologies": [
    {
      "description": [
        "From the name of Rugby School in Rugby, in Warwickshire, England, United Kingdom, where the modern game was developed in the 19th century. The place name Rugby is attested in the Domesday Book as Old English Rocheberie (probably equivalent to rook (“Corvus frugilegus, a bird of the crow family”) +‎ -by (suffix indicating a village or town)), possibly from *Hrōcebyriġ, dative singular of *Hrōceburh, from hrōc (“rook”) (ultimately from Proto-Indo-European *ker- (“to crow”)) + burh, burg (“castle, fort, stronghold; city; town”) (ultimately from Proto-Indo-European *bʰerǵʰ- (“hill, mountain; high, lofty; to rise”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rugby (countable and uncountable, plural rugbies)",
          "definitionGroups": [
            {
              "group": "(usually uncountable, sports)",
              "entries": [
                {
                  "meaning": "A form of football in which players can hold or kick an ovoid ball; rugby football. The ball cannot be handled forwards and points are scored by touching the ball to the ground in the area past the opponent's territory or by kicking the ball between goalposts and over a crossbar.",
                  "examples": [
                    "Synonym: rugger",
                    "The scrum is a distinctive element of rugby.",
                    "The two rugbies split following a debate about amateurism."
                  ]
                },
                {
                  "meaning": "(specifically) The form of the game known as rugby union (see the usage note).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Ellipsis of rugby shirt (“a shirt of the kind worn by rugby players, usually short-sleeved and with a buttoned opening at the neck like a polo shirt, but with a stiffer collar”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rugby (third-person singular simple present rugbies, present participle rugbying, simple past and past participle rugbied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To play rugby.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Genericized trademark from Rugby, a brand of rubber cement by Bostik."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rugby (plural rugbys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Philippines) Rubber cement, contact cement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}