{
  "word": "corrupt",
  "etymologies": [
    {
      "description": [
        "From Middle English corrupten, derived from Latin corruptus, past participle of corrumpō, corrumpere (“to destroy, ruin, injure, spoil, corrupt, bribe”), from com- (“together”) + rumpere (“to break in pieces”)."
      ],
      "adjectives": [
        {
          "description": "corrupt (comparative more corrupt, superlative most corrupt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Willing to act dishonestly for personal gain; accepting bribes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a depraved state; debased; perverted; morally degenerate; weak in morals.",
                  "examples": [
                    "The government here is corrupt, so we'll emigrate to escape them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abounding in errors; not genuine or correct; in an invalid state.",
                  "examples": [
                    "The text of the manuscript is corrupt.",
                    "It turned out that the program was corrupt - that's why it wouldn't open."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a putrid state; spoiled; tainted; vitiated; unsound.",
                  "examples": [
                    "with such corrupt and pestilent bread to feed them."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "corrupt (third-person singular simple present corrupts, present participle corrupting, simple past and past participle corrupted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make corrupt; to change from good to bad; to draw away from the right path; to deprave; to pervert.",
                  "examples": [
                    "Don't you dare corrupt my son with those disgusting pictures!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, intransitive) To become putrid, tainted, or otherwise impure; to putrefy; to rot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To introduce errors; to place into an invalid state.",
                  "examples": [
                    "Unplugging a flash drive without dismounting it first can corrupt the data stored on the drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To debase or make impure by alterations or additions; to falsify.",
                  "examples": [
                    "to corrupt language, or a holy text",
                    "to corrupt a book"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To waste, spoil, or consume; to make worthless.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}