{
  "word": "county",
  "etymologies": [
    {
      "description": [
        "From Middle English countee, counte, conte, from Anglo-Norman counté, Old French conté (French comté), from Latin comitātus (“jurisdiction of a count”), from comes (“count, earl”). Cognate with Spanish condado (“county”) and Italian contea (“county”). Doublet of comitatus, borrowed directly from Latin. Mostly displaced native Old English sċīr, whence Modern English shire."
      ],
      "adjectives": [
        {
          "description": "county (comparative more county, superlative most county)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic of a ‘county family’; representative of the gentry or aristocracy of a county.",
                  "examples": [
                    "She was a tall girl and county, with Hilary's walk: she seemed to topple even when she sat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "county (countable and uncountable, plural counties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An administrative region of various countries, including Bhutan, Canada, China, Croatia, Ireland, Japan, New Zealand, Norway, Poland, Romania, South Korea, Sweden, the United Kingdom, and 48 of the 50 United States (excluding Alaska and Louisiana).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A definitive geographic region, without direct administrative functions.",
                  "examples": [
                    "traditional county"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, uncountable) A jail operated by a county government.",
                  "examples": [
                    "He can't come; he's up in the county for agg assault."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The land ruled by a count or a countess.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}