{
  "word": "sink",
  "etymologies": [
    {
      "description": [
        "From Middle English synken, from Old English sincan, from Proto-West Germanic *sinkwan, from Proto-Germanic *sinkwaną, from Proto-Indo-European *sengʷ- (“to fall, sink”).",
        "Compare West Frisian sinke, Low German sinken, Dutch zinken, German sinken, Danish and Norwegian Bokmål synke, Swedish sjunka. In the causative sense, it replaced Old English senċan (“make sink”) from Proto-Germanic *sankwijaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sink (plural sinks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A basin used for holding water for washing.",
                  "examples": [
                    "Roy: The work was fiiine. There was nothing wrong with the work. But they caught him... He pissed in the sink.Jen: Oh. Oh!Roy: Yeah...Jen: Which sink?Roy: All the sinks. Yeah, he basically went on a pee parade around the house.Jen: Oh God, I have to fire him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drain for carrying off wastewater.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) A sinkhole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A depression in land where water collects, with no visible outlet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heat sink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place that absorbs resources or energy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecology) A habitat that cannot support a population on its own but receives the excess of individuals from some other source.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(uncountable) Descending motion; descent.",
              "entries": [
                {
                  "meaning": "(baseball) The motion of a sinker pitch.",
                  "examples": [
                    "Jones has a two-seamer with heavy sink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, programming) An object or callback that captures events; an event sink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A destination vertex in a transportation network.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abode of degraded persons; a wretched place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A depression in a stereotype plate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A stage trapdoor for shifting scenery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) An excavation smaller than a shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(game development) One or several systems that remove currency from the game's economy, thus controlling or preventing inflation.",
                  "examples": [
                    "Antonym: faucet"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sink (third-person singular simple present sinks, present participle sinking, simple past sank or sunk, past participle sunk or sunken)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(heading, physical) To move or be moved into something.",
              "entries": [
                {
                  "meaning": "(ergative) To descend or submerge (or to cause to do so) into a liquid or similar substance.",
                  "examples": [
                    "A stone sinks in water.  The sun gradually sank in the west."
                  ]
                },
                {
                  "meaning": "(transitive) To (directly or indirectly) cause a vessel to sink, generally by making it no longer watertight.",
                  "examples": [
                    "An iceberg sank the Titanic.  British battleships sank the Bismarck."
                  ]
                },
                {
                  "meaning": "(transitive) To push (something) into something.",
                  "examples": [
                    "The joint will hold tighter if you sink a wood screw through both boards.  The dog sank its teeth into the delivery man's leg."
                  ]
                },
                {
                  "meaning": "(transitive) To make by digging or delving.",
                  "examples": [
                    "to sink a well in the ground"
                  ]
                },
                {
                  "meaning": "(transitive, snooker, pool, billiards, golf) To pot; hit a ball into a pocket or hole.",
                  "examples": [
                    "My sister beats me at pool in public a second time. I claim some dignity back by potting two of my balls before Tammy sinks the black."
                  ]
                }
              ]
            },
            {
              "group": "(heading, social) To diminish or be diminished.",
              "entries": [
                {
                  "meaning": "(intransitive, figuratively, of the human heart) To experience apprehension, disappointment, dread, or momentary depression.",
                  "examples": [
                    "Peter's heart sank. \"Don't you think it is dreadful?\" he asked."
                  ]
                },
                {
                  "meaning": "(transitive, figurative) To cause to decline; to depress or degrade.",
                  "examples": [
                    "to sink one's reputation"
                  ]
                },
                {
                  "meaning": "(intransitive) To demean or lower oneself; to do something below one's status, standards, or morals.",
                  "examples": [
                    "Who would sink so low as to steal change from veterans?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, archaic) To conceal and appropriate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, archaic) To keep out of sight; to suppress; to ignore.",
                  "examples": [
                    "I say not always dishonorable qualifications, but a certain flexibility of disposition; a certain courtly willingness to sink obnoxious truths, and adapt ourselves to the prejudices of the minds of others […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To drink (especially something alcoholic).",
                  "examples": [
                    "[…]  just thought she was wrecked from all the Diamond White ciders she'd been sinking – I'd even bought her a couple of Blastaways, which in hindsight was a mistake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To pay absolutely.",
                  "examples": [
                    "I have sunk thousands of pounds into this project."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, archaic) To reduce or extinguish by payment.",
                  "examples": [
                    "to sink the national debt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be overwhelmed or depressed; to fail in strength.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To die.",
                  "examples": [
                    "Synonyms: see Thesaurus:die"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To decrease in volume, as a river; to subside; to become diminished in volume or in apparent height.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}