{
  "word": "epithet",
  "etymologies": [
    {
      "description": [
        "From Middle French épithète, from Latin epithetum, epitheton, from Ancient Greek ἐπίθετον (epítheton, “epithet, adjective”), the neuter of ἐπίθετος (epíthetos, “additional”), from ἐπιτίθημι (epitíthēmi, “to add on”), from ἐπι- (epi-, “in addition”) +‎ τίθημι (títhēmi, “to put”) (suf. possibly related to title in the sense of \"ascribed appellation\") (from Proto-Indo-European *dʰeh₁- (“to put, to do”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "epithet (plural epithets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A term used to characterize a person or thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) A term used as a qualifier of the name of a deity in order to designate said deity in a particular aspect or role.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A term used as a descriptive substitute for the name or title of a person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of many formulaic words or phrases used in the Iliad and Odyssey to characterize a person, a group of people, or a thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abusive or contemptuous word or phrase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy) A word in the scientific name of a taxon following the name of the genus or species. This applies only to formal names of plants, fungi and bacteria. In formal names of animals the corresponding term is the specific name.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "epithet (third-person singular simple present epithets, present participle epitheting, simple past and past participle epitheted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To term; to refer to as.",
                  "examples": [
                    "He was epitheted \"the king of fools\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}