{
  "word": "use",
  "etymologies": [
    {
      "description": [
        "Noun from Middle English use, from Old French us, from Latin ūsus (“use, custom, skill, habit”), from past participle stem of ūtor (“use”). Displaced native Middle English note (“use”) (See note) from Old English notu, and Middle English nutte (“use”) from Old English nytt.",
        "Verb from Middle English usen, from Old French user (“use, employ, practice”), from early Medieval Latin usare (“use”), frequentative form of past participle stem of Latin uti (“to use”). Displaced native Middle English noten, nutten (“to use”) (from Old English notian, nēotan, nyttian) and Middle English brouken, bruken (“to use, enjoy”) (from Old English brūcan)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "Noun from Middle English use, from Old French us, from Latin ūsus (“use, custom, skill, habit”), from past participle stem of ūtor (“use”). Displaced native Middle English note (“use”) (See note) from Old English notu, and Middle English nutte (“use”) from Old English nytt. Verb from Middle English usen, from Old French user (“use, employ, practice”), from early Medieval Latin usare (“use”), frequentative form of past participle stem of Latin uti (“to use”). Displaced native Middle English noten, nutten (“to use”) (from Old English notian, nēotan, nyttian) and Middle English brouken, bruken (“to use, enjoy”) (from Old English brūcan).",
          "definitionGroups": []
        },
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "use (countable and uncountable, plural uses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of using.",
                  "examples": [
                    "Synonyms: employment, usage, note, nait",
                    "The use of torture has been condemned by the United Nations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of consuming alcohol or narcotics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, followed by \"of\") Usefulness, benefit.",
                  "examples": [
                    "Synonyms: benefit, good, point, usefulness, utility, note, nait",
                    "What's the use of a law that nobody follows?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A function; a purpose for which something may be employed.",
                  "examples": [
                    "This tool has many uses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Occasion or need to employ; necessity.",
                  "examples": [
                    "I have no further use for these textbooks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) Interest for lent money; premium paid for the use of something; usury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Continued or repeated practice; usage; habit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Common occurrence; ordinary experience.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A special form of a rite adopted for use in a particular context, often a diocese.",
                  "examples": [
                    "the Sarum, or Canterbury, use; the York use; the Ordinariate use"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forging) A slab of iron welded to the side of a forging, such as a shaft, near the end, and afterward drawn down, by hammering, so as to lengthen the forging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "Noun from Middle English use, from Old French us, from Latin ūsus (“use, custom, skill, habit”), from past participle stem of ūtor (“use”). Displaced native Middle English note (“use”) (See note) from Old English notu, and Middle English nutte (“use”) from Old English nytt. Verb from Middle English usen, from Old French user (“use, employ, practice”), from early Medieval Latin usare (“use”), frequentative form of past participle stem of Latin uti (“to use”). Displaced native Middle English noten, nutten (“to use”) (from Old English notian, nēotan, nyttian) and Middle English brouken, bruken (“to use, enjoy”) (from Old English brūcan).",
          "definitionGroups": []
        },
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "use (third-person singular simple present uses, present participle using, simple past and past participle used)",
          "definitionGroups": [
            {
              "group": "To utilize or employ.",
              "entries": [
                {
                  "meaning": "(transitive) To employ; to apply; to utilize.",
                  "examples": [
                    "Use this knife to slice the bread.",
                    "We can use this mathematical formula to solve the problem."
                  ]
                },
                {
                  "meaning": "(transitive, often with up) To expend; to consume by employing.",
                  "examples": [
                    "I used the money they allotted me.",
                    "We should use up most of the fuel.",
                    "She used all the time allotted to complete the test."
                  ]
                },
                {
                  "meaning": "(transitive) To exploit.",
                  "examples": [
                    "You never cared about me; you just used me!"
                  ]
                },
                {
                  "meaning": "(transitive) To consume (alcohol, drugs, etc), especially regularly.",
                  "examples": [
                    "He uses cocaine. I have never used drugs."
                  ]
                },
                {
                  "meaning": "(intransitive) To consume a previously specified substance, especially a drug to which one is addicted.",
                  "examples": [
                    "Richard began experimenting with cocaine last year; now he uses almost every day."
                  ]
                },
                {
                  "meaning": "(transitive, with auxiliary \"could\") To benefit from; to be able to employ or stand.",
                  "examples": [
                    "I could use a drink. My car could use a new coat of paint."
                  ]
                },
                {
                  "meaning": "(transitive, with gender pronouns as object) To suggest or request that other people employ a specific set of gender pronouns when referring to the subject.",
                  "examples": [
                    "I use they/them pronouns."
                  ]
                }
              ]
            },
            {
              "group": "To accustom; to habituate. (Now common only in participial form. Uses the same pronunciation as the noun; see usage notes.)",
              "entries": [
                {
                  "meaning": "(reflexive, obsolete, with \"to\") To accustom oneself.",
                  "examples": [
                    "It is not without some difficulty, that a man born in society can form an idea of such savages, and their condition; and unless he has used himself to abstract thinking, he can hardly represent to himself such a state of simplicity, in which man can have so few desires, and no appetites roving beyond the immediate call of untaught nature  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic or literary except in past tense) To habitually do; to be wont to do. (Now chiefly in past-tense forms; see used to.)",
                  "examples": [
                    "I do not use to let my wife be acquainted with the secret affairs of my state; they are not within a woman's province."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To behave toward; to act with regard to; to treat.",
                  "examples": [
                    "to use an animal cruelly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, obsolete) To behave, act, comport oneself.",
                  "examples": [
                    "They live together lovingly: For no Magistrate is either haughty or fearefull. Fathers they be called, and like fathers they use themselves."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}