{
  "word": "stroke",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English strok, stroke (“blow from a weapon, cut”), from Old English strāc, from Proto-West Germanic *straik, from Proto-Germanic *straikaz (“stroke”), from Proto-Indo-European *streyg- (“to rub, stroke; to shear; to strike”).",
        "Sense 3.6.2.2 (“the oblique, slash, or virgule (‘/’)”) is a contraction of oblique stroke, a variant of oblique which was originally used in telegraphy.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stroke (plural strokes)",
          "definitionGroups": [
            {
              "group": "An act of hitting; a blow, a hit.",
              "entries": [
                {
                  "meaning": "An act of striking with a weapon; a blow.",
                  "examples": []
                },
                {
                  "meaning": "A single movement with a tool; also, an impact of a tool on an object.",
                  "examples": []
                },
                {
                  "meaning": "An act, or the sound, of the clapper or hammer of a clock hitting a bell or other striking mechanism; hence, the time when such a strike occurs.",
                  "examples": [
                    "on the stroke of midnight"
                  ]
                },
                {
                  "meaning": "(ball games) An act of hitting or trying to hit a ball; also, the manner in which this is done.",
                  "examples": []
                },
                {
                  "meaning": "(cricket) The action of hitting the ball with the bat; a shot.",
                  "examples": []
                },
                {
                  "meaning": "(golf) A single act of striking at the ball with a club; also, at matchplay, a shot deducted from a player's score at a hole as a result of a handicapping system.",
                  "examples": []
                },
                {
                  "meaning": "(squash) A point awarded to a player in case of interference or obstruction by the opponent.",
                  "examples": []
                },
                {
                  "meaning": "(tennis) The hitting of a ball with a racket; also, the movement of the racket and arm that produces that impact.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A movement similar to that of hitting.",
              "entries": [
                {
                  "meaning": "One of a series of beats or movements against a resisting medium, by means of which movement through or upon it is accomplished.",
                  "examples": [
                    "the stroke of a bird’s wing in flying"
                  ]
                },
                {
                  "meaning": "(rowing)",
                  "examples": []
                },
                {
                  "meaning": "The movement of an oar or paddle through water, either the pull which actually propels the boat, or a single entire cycle of movement including the pull; also, the manner in which such movements are made; a rowing style.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) The rower who is nearest the stern of the boat, the movement of whose oar sets the rowing rhythm for the other rowers; also, the position in the boat occupied by this rower.",
                  "examples": []
                },
                {
                  "meaning": "(swimming) A specific combination of movements of the arms and legs which, when repeated, causes the swimmer to advance through the water; also, the manner in which such movements are made; a swimming style.",
                  "examples": [
                    "butterfly stroke"
                  ]
                },
                {
                  "meaning": "A beat or throb, as of the heart or pulse.",
                  "examples": [
                    "Synonym: pulsation"
                  ]
                },
                {
                  "meaning": "(technology) A single movement or thrust of a part (such as a piston) of a machine that moves back and forth; also, the length of this movement.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A thrust of the penis during sexual intercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "An act causing hurt or death, especially when seen as divine punishment.",
                  "examples": [
                    "the stroke of death"
                  ]
                },
                {
                  "meaning": "A damaging occurrence, especially if sudden; a blow, a calamity.",
                  "examples": []
                },
                {
                  "meaning": "An amount of work; specifically, a large amount of business or work.",
                  "examples": [
                    "a stroke of business"
                  ]
                },
                {
                  "meaning": "A powerful or sudden effort by which something is done or produced; also, something accomplished by such an effort; an achievement, a feat.",
                  "examples": [
                    "a stroke of genius    a master stroke of policy"
                  ]
                },
                {
                  "meaning": "A movement of a brush in painting, of a chisel in carving, of a pen, pencil, or such implement in drawing or writing, etc., in one direction; hence, a line or mark made on a surface by such an implement.",
                  "examples": []
                },
                {
                  "meaning": "(linguistics) A line making up a written character; specifically, a Chinese, Japanese, or Korean character.",
                  "examples": []
                },
                {
                  "meaning": "(typography)",
                  "examples": []
                },
                {
                  "meaning": "(computing) In Unicode: the formal name of the individual horizontal strikethroughs (as in \"A̶\").",
                  "examples": []
                },
                {
                  "meaning": "(Britain) The oblique, slash, or virgule (\"/\").",
                  "examples": []
                },
                {
                  "meaning": "A distinctive expression in a written composition; a touch. [from 17th c.]",
                  "examples": [
                    "to give some finishing strokes to an essay"
                  ]
                },
                {
                  "meaning": "(chiefly archaic) Influence; power.",
                  "examples": []
                },
                {
                  "meaning": "(professional wrestling) Backstage influence.",
                  "examples": []
                },
                {
                  "meaning": "(turn-based games) A masterful or effective action.",
                  "examples": [
                    "Synonym: masterstroke"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The loss of brain function arising when the blood supply to the brain is suddenly interrupted.",
                  "examples": [
                    "Synonyms: cerebrovascular accident, CVA",
                    "suffer a stroke"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) An individual discharge of lightning, particularly if causing damage.",
                  "examples": [
                    "A flash of lightning may be made up of several strokes. If they are separated by enough time for the eye to distinguish them, the lightning will appear to flicker."
                  ]
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "The effect or result of a striking; affliction or injury; a bruise or wound; soreness.",
                  "examples": []
                },
                {
                  "meaning": "Chiefly in to have a good stroke: appetite.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) A sudden attack of any illness, especially if causing loss of consciousness or movement, or when fatal.",
                  "examples": [
                    "a stroke of apoplexy"
                  ]
                },
                {
                  "meaning": "(music) A bow or pluck of a string or strings of a stringed instrument; also, the manner in which a musical instrument is played; hence, a melody, a tune.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stroke (third-person singular simple present strokes, present participle stroking, simple past and past participle stroked)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To draw the horizontal line across the upright part (of the letter t).",
                  "examples": []
                },
                {
                  "meaning": "Followed by out or through: to draw a line or lines through (text) to indicate that it is deleted; to cancel, to strike or strike out.",
                  "examples": []
                },
                {
                  "meaning": "(poetic, rare) Of a bell or clock: to chime or sound to indicate (the hour, the time, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(rare) To mark (something) with lines or stripes; to stripe.",
                  "examples": []
                },
                {
                  "meaning": "(ball games) To hit or kick (the ball) with a flowing or smooth motion; also, to score (a goal, a point, etc.) by doing so.",
                  "examples": []
                },
                {
                  "meaning": "(rowing)",
                  "examples": [
                    "to stroke a boat"
                  ]
                },
                {
                  "meaning": "Of a rower or a crew: to row at (a rate of a certain number of strokes (“movements of the oar through water”) per minute).",
                  "examples": []
                },
                {
                  "meaning": "To act as the stroke (“rower who is nearest the stern of the boat, the movement of whose oar sets the rowing rhythm for the other rowers”) of (a boat or its crew).",
                  "examples": [
                    "to stroke a boat"
                  ]
                },
                {
                  "meaning": "(swimming) To strike (the water) with one's arms and legs when swimming.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To depict (something) with a paintbrush.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(medicine) Chiefly followed by out: to suffer loss of brain function when the blood supply to the brain is suddenly interrupted; to have a stroke (noun sense 4).",
                  "examples": []
                },
                {
                  "meaning": "(swimming) To swim by making co-ordinated movements with the arms and legs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English stroken, straken (“to caress, fondle, pat, rub, smooth, stroke; to pass something over (someone or something); to brush or rub against;”) [and other forms], from Old English strācian (“to stroke”), from Proto-West Germanic *straikōn (“to caress, stroke”), from *straik (“a line, stroke; a dash”) (see further at etymology 1) + *-ōn (suffix forming verbs from nouns).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stroke (plural strokes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of moving one's hand or an object along a surface in one direction, touching it lightly; a caress.",
                  "examples": [
                    "She gave the cat a stroke."
                  ]
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A gesture of assurance given as encouragement; specifically (psychoanalysis) in transactional analysis: a (generally positive) reaction expressed to a person which fulfils their desires or needs.",
                  "examples": [
                    "Not providing a stroke to a client can sometimes facilitate the client in becoming aware of their neediness or desire for approval. By not giving a stroke, the client's need is brought to the surface, where it is amenable to change,  […]"
                  ]
                },
                {
                  "meaning": "(chiefly US) A flattering or friendly act, comment, etc., done or made to a person to influence them.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stroke (third-person singular simple present strokes, present participle stroking, simple past and past participle stroked) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move one's hand or an object (such as a broom or brush) along (a surface) in one direction, touching it lightly; to caress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) To bring (something) to a certain condition by stroking (sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "(especially psychoanalysis) To give assurance to (someone) through encouragement.",
                  "examples": []
                },
                {
                  "meaning": "(by extension, chiefly US, politics) To influence (someone) by convincing or flattering them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) To milk (a cow or other animal); especially, to squeeze the teat of (a cow, etc.) to extract the last bit of milk from the udder; to strap (dialectal), to strip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(masonry) To give a finely fluted surface to (stone) by carving it with a tool.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "To sharpen (a knife or other cutting instrument) by honing or rubbing it against a surface.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To soothe (someone); also, to flatter or indulge (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}