{
  "word": "insult",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle French insulter (modern French insulter (“to insult”)) or its etymon Latin īnsultāre, present active infinitive of īnsultō (“to spring, leap or jump at or upon; to abuse, insult, revile, taunt”), the frequentative form of īnsiliō (“to bound; to leap in or upon”), from in- (prefix meaning ‘in, inside, within’) + saliō (“to bound, jump, leap; to spring forth; to flow down”) (ultimately from Proto-Indo-European *sel- (“to spring”)).",
        "The noun is derived from Middle French insult (modern French insulte (“insult”)) or its etymon Late Latin insultus (“insult, reviling, scoffing”), from īnsiliō (“to bound; to leap in or upon”); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "insult (countable and uncountable, plural insults)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Action or form of speech deliberately intended to be rude; (countable) a particular act or statement having this effect.",
                  "examples": [
                    "Synonyms: affront, (slang) diss, (obsolete) insultation, (Britain) offence, (US) offense, pejorative, (US, colloquial) slam, slight, slur; see also Thesaurus:offense",
                    "Antonym: compliment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that causes offence (for example, by being of an unacceptable quality).",
                  "examples": [
                    "Synonyms: disgrace, outrage",
                    "The way the orchestra performed tonight was an insult to my ears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable, medicine) Something causing disease or injury to the body or bodily processes; the injury so caused.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, also figuratively, archaic) An assault or attack; (specifically, military, obsolete) an assault, attack, or onset carried out without preparation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) An act of leaping upon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "insult (third-person singular simple present insults, present participle insulting, simple past and past participle insulted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be insensitive, insolent, or rude to (somebody); to affront or demean (someone). [from 17th c.]",
                  "examples": [
                    "Synonyms: disrespect, affront, disgrace, slander, discourtesy, offense",
                    "Antonym: compliment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively, obsolete) To assail, assault, or attack; (specifically, military) to carry out an assault, attack, or onset without preparation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To behave in an obnoxious and superior manner (against or over someone). [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, rare) To leap or trample upon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}