{
  "word": "bagatelle",
  "etymologies": [
    {
      "description": [
        "Borrowed from French bagatelle, from Italian bagattella."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bagatelle (plural bagatelles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trifle; an insubstantial thing.",
                  "examples": [
                    "Sir C. Oh! dear madam, don't ask me, it's a very foolish song—a mere bagatelle.Char. Oh! Sir Callaghan, I will admit of no excuse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literature, music) A short piece of literature or of instrumental music, typically light or playful in character.",
                  "examples": [
                    "One afternoon in 1920. a young pianist sat down in a shuttered room in the capital of defeated Germany and played a Bagatelle by Beethoven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game similar to billiards played on an oblong table with pockets or arches at one end only.",
                  "examples": [
                    "For some time they did nothing save box, but at last they went down to the bagatelle room, and played bagatelle for a bit. They marked this advance in civilization by prodding holes in the ceiling with the bagatelle cues, which gave the ceiling the appearance of a cloth target after a Gatling gun had been shooting at it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several smaller, wooden table top games developed from the original bagatelle in which the pockets are made of pins; also called pin bagatelle, hit-a-pin bagatelle, jaw ball.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bagatelle (third-person singular simple present bagatelles, present participle bagatelling, simple past and past participle bagatelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To meander or move around, in a manner similar to the ball in the game of bagatelle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To bagatellize; to regard as a bagatelle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}