{
  "word": "talk",
  "etymologies": [
    {
      "description": [
        "From Middle English talken, talkien, from Old English tealcian (“to talk, chat”), from Proto-Germanic *talkōną (“to talk, chatter”), frequentative form of Proto-Germanic *talōną (“to count, recount, tell”), from Proto-Indo-European *dol-, *del- (“to aim, calculate, adjust, count”), equivalent to  tell + -k. Cognate with Scots talk (“to talk”), Low German taalken (“to talk”). Related also to Danish tale (“to talk, speak”), Swedish tala (“to talk, speak, say, chatter”), Icelandic tala (“to talk”), Norwegian tale (“speech”), Old English talian (“to count, calculate, reckon, account, consider, think, esteem, value; argue; tell, relate; impute, assign”). More at tale. Despite the surface similarity, unrelated to Proto-Indo-European *telkʷ- (“to talk”), which is the source of loquacious."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "talk (third-person singular simple present talks, present participle talking, simple past and past participle talked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To communicate, usually by means of speech.",
                  "examples": [
                    "Let’s go to my office and talk.  ―  I like to talk with you, Ms. Weaver.\nAudio (US)(file)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To discuss; to talk about.",
                  "examples": [
                    "They sat down to talk business.",
                    "That's enough about work, let's talk holidays!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To speak (a certain language).",
                  "examples": [
                    "We talk French sometimes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, chiefly used in progressive tenses) Used to emphasise the importance, size, complexity etc. of the thing mentioned.",
                  "examples": [
                    "Are you interested in the job? They're talking big money.",
                    "We're not talking rocket science here: it should be easy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang) To confess, especially implicating others.",
                  "examples": [
                    "Suppose he talks?",
                    "She can be relied upon not to talk.",
                    "They tried to make me talk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To criticize someone for something of which one is guilty oneself.",
                  "examples": [
                    "I am not the one to talk.",
                    "She is a fine one to talk.",
                    "You should talk.",
                    "Look who's talking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To gossip; to create scandal.",
                  "examples": [
                    "People will talk.",
                    "Aren't you afraid the neighbours will talk?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, chiefly used in progressive tenses) To influence someone to express something, especially a particular stance or viewpoint or in a particular manner.",
                  "examples": [
                    "You're only sticking up for her because you like her; that's your penis talking.",
                    "That's not like you at all, Jared. The drugs are talking. Snap out of it!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English talk, talke (“conversation; discourse”), from the verb (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "talk (countable and uncountable, plural talks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conversation or discussion; usually serious, but informal.",
                  "examples": [
                    "We need to have a talk about your homework."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lecture.",
                  "examples": [
                    "There is a talk on Shakespeare tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Gossip; rumour.",
                  "examples": [
                    "There's been talk lately about the two of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by the; often qualified by a following of) A major topic of social discussion.",
                  "examples": [
                    "She is the talk of the day.",
                    "The musical is the talk of the town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(preceded by the) A customary conversation by parent(s) or guardian(s) with their (often teenaged) child about a reality of life; in particular:",
              "entries": [
                {
                  "meaning": "A customary conversation in which parent(s) explain sexual intercourse to their child.",
                  "examples": [
                    "Have you had the talk with Jay yet?"
                  ]
                },
                {
                  "meaning": "(US) A customary conversation in which the parent(s) of a black child explain the racism and violence they may face, especially when interacting with police, and strategies to manage it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, not preceded by an article) Empty boasting, promises or claims.",
                  "examples": [
                    "The party leader's speech was all talk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) Meeting to discuss a particular matter.",
                  "examples": [
                    "The leaders of the G8 nations are currently in talks over nuclear weapons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}