{
  "word": "secure",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin securus (“of persons, free from care, quiet, easy; in a bad sense, careless, reckless; of things, tranquil, also free from danger, safe, secure”), from se- (“without”) + cura (“care”); see cure. Doublet of sure and the now obsolete or dialectal sicker (“certain, safe”)."
      ],
      "adjectives": [
        {
          "description": "secure (comparative securer or more secure, superlative securest or most secure)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from attack or danger; protected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from the danger of theft; safe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from the risk of eavesdropping, interception or discovery; secret.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from anxiety or doubt; unafraid.",
                  "examples": [
                    "But thou, secure of soul, unbent with woes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Firm and not likely to fail; stable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from the risk of financial loss; reliable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Confident in opinion; not entertaining, or not having reason to entertain, doubt; certain; sure; commonly used with of.",
                  "examples": [
                    "secure of a welcome"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Overconfident; incautious; careless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Certain to be achieved or gained; assured.",
                  "examples": [
                    "Just when victory seemed secure, they let it slip from their grasp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "secure (third-person singular simple present secures, present participle securing, simple past and past participle secured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make safe; to relieve from apprehensions of, or exposure to, danger; to guard; to protect.",
                  "examples": [
                    "I spread a cloud before the victor's sight, / Sustained the vanquished, and secured his flight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put beyond hazard of losing or of not receiving; to make certain; to assure; frequently with against or from, or formerly with of.",
                  "examples": [
                    "to secure a creditor against loss; to secure a debt by a mortgage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make fast; to close or confine effectually; to render incapable of getting loose or escaping.",
                  "examples": [
                    "to secure a prisoner; to secure a door, or the hatches of a ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To get possession of; to make oneself secure of; to acquire certainly.",
                  "examples": [
                    "to secure an estate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To plight or pledge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}