{
  "word": "creeper",
  "etymologies": [
    {
      "description": [
        "From Middle English crepere, from Old English crēopere, equivalent to creep +‎ -er.\nSlang usage derived from phrase give the creeps or creep out (distinct from merely one who creeps)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "creeper (plural creepers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or a thing that crawls or creeps.",
                  "examples": [
                    "Synonym: crawler"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often in the plural) A one-piece garment for infants designed to facilitate access to the wearer's diaper.",
                  "examples": [
                    "Synonyms: babygro, creepers, diaper shirt, infant bodysuit, snapsuit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device which allows a small child to safely roam around a room from a seated or standing position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A metal plate with spikes, designed to be worn with shoes to prevent slipping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spur-like device strapped to the boot to facilitate climbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) A small low iron, or dog, between the andirons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instrument with iron hooks or claws for dredging up items from a well or other water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any device for causing material to move steadily from one part of a machine to another, such as an apron in a carding machine, or an inner spiral in a grain screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any plant (as ivy or periwinkle) that grows by creeping, especially a climbing plant of the genus Parthenocissus.",
                  "examples": [
                    "Synonym: climber"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A treecreeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A small four-hooked grapnel used to recover objects dropped onto the sea bed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lowest gear of a tractor or truck.",
                  "examples": [
                    "Synonyms: creeper gear, creeper shift"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low-profile wheeled platform whereupon an auto mechanic may lie on their back and gain better access to the underbody of a vehicle.",
                  "examples": [
                    "Synonym: cradle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A person who creeps people out; a creepy person.",
                  "examples": [
                    "Don't go to a nightclub to find a boyfriend. They're all creepers there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of shoe, usually with a suede upper and a thick crepe sole, associated with various 20th-century subcultures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A ball that travels low, near ground level.",
                  "examples": [
                    "May joined Hutton and proceeded to play masterly cricket in which the straight-drive predominated. There was always the possibility that he might be trapped by a creeper, but May watched the ball intently."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}