{
  "word": "impress",
  "etymologies": [
    {
      "description": [
        "From Middle English impressen, from Latin impressus, perfect passive participle of imprimere (“to press into or upon, stick, stamp, or dig into”), from in (“in, upon”) + premere (“to press”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "impress (plural impresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of impressing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An impression; an impressed image or copy of something.",
                  "examples": [
                    "We know that you were pressed for money, that you took an impress of the keys which your brother held  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stamp or seal used to make an impression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An impression on the mind, imagination etc.",
                  "examples": [
                    "Such admonitions, in the English of the Authorized Version, left an indelible impress on imaginations nurtured on the Bible  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Characteristic; mark of distinction; stamp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A heraldic device; an impresa.",
                  "examples": [
                    "It commonly occurred that Knights who , on entering the Lists , wished to conceal their identity , would assume a Device with an allusive Motto , which was designated an IMPRESS"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of impressing, or taking by force for the public service; compulsion to serve; also, that which is impressed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "impress (third-person singular simple present impresses, present participle impressing, simple past and past participle impressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect (someone) strongly and often favourably.",
                  "examples": [
                    "You impressed me with your command of Urdu."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make an impression, to be impressive.",
                  "examples": [
                    "Henderson impressed in his first game as captain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce a vivid impression of (something).",
                  "examples": [
                    "That first view of the Eiger impressed itself on my mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark or stamp (something) using pressure.",
                  "examples": [
                    "We impressed our footprints in the wet cement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To produce (a mark, stamp, image, etc.); to imprint (a mark or figure upon something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To fix deeply in the mind; to present forcibly to the attention, etc.; to imprint; to inculcate.",
                  "examples": [
                    "impress the motives and methods of persuasion upon our own hearts, till we feel the force and power of them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compel (someone) to serve in a military force.",
                  "examples": [
                    "The press gang used to impress people into the Navy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seize or confiscate (property) by force.",
                  "examples": [
                    "The liner was impressed as a troop carrier."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}