{
  "word": "outside",
  "etymologies": [
    {
      "description": [
        "From out +‎ side."
      ],
      "adjectives": [
        {
          "description": "outside (comparative more outside, superlative most outside)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the outer surface, limit or boundary.",
                  "examples": [
                    "The outside surface looks good."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, pertaining to or originating from beyond the outer surface, limit or boundary.",
                  "examples": [
                    "Dogs had a fear of me, for they felt the outside shadow which never left my side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Away from the interior or center of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Originating from, arranged by, or being someone outside an organization, group, etc.",
                  "examples": [
                    "The Board did not trust outside information about their rivals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Extending or going beyond the borders or scope of an organization, group, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, of a pitch) Away (far) from the batter as it crosses home plate.",
                  "examples": [
                    "The first pitch is ... just a bit outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Reaching the extreme or farthest limit, as to extent, quantity, etc; maximum.",
                  "examples": [
                    "an outside estimate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) Positioned towards the central division of a road: towards the right-hand side if one drives on the left, or left-hand side if one drives on the right.",
                  "examples": [
                    "the outside lane of the motorway"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) Positioned towards the shoulder of a road: towards the left-hand side if one drives on the left, or right-hand side if one drives on the right.",
                  "examples": [
                    "the outside lane of the highway"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Not legally married to or related to (e.g. not born in wedlock to), and/or not residing with, a specified other person (parent, child, or partner); (of a marriage, relationship, etc) existing between two such people. (Compare out of wedlock, nonresidential.)",
                  "examples": [
                    "Antonym: inside"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "outside (comparative more outside, superlative most outside)",
          "definitionGroups": [
            {
              "group": "To or in the outdoors or outside; to or in an area that is beyond the scope, limits, or borders of a given place.",
              "entries": [
                {
                  "meaning": "(colloquial) Not in prison.",
                  "examples": [
                    "It is the prison that supports the image of the criminal  […]  he's lost when he's outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Outdoors.",
                  "examples": [
                    "I slept outside last night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "outside (plural outsides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of something that faces out; the outer surface.",
                  "examples": [
                    "He's repainting the outside of his house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The external appearance of someone or something.",
                  "examples": [
                    "Her outside was stern, but inside was a heart of gold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The space beyond some limit or boundary.",
                  "examples": [
                    "Viewed from the outside, the building seemed unremarkable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The furthest limit, as to number, quantity, extent, etc.",
                  "examples": [
                    "It may last a week at the outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a road towards the central division: towards the right if one drives on the left, or towards the left if one drives on the right.",
                  "examples": [
                    "On a motorway, you should always overtake other vehicles on the outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side of a curved road, racetrack etc. that has the longer arc length; the side of a racetrack furthest from the interior of the course or some other point of reference.",
                  "examples": [
                    "On the final bend, the second-place car tried to go around the outside of the leader but spun off into the barrier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) The outer part of the sea, away from the peak of a wave.",
                  "examples": [
                    "When a wave mounds on the outside and takes its shape, a surfer quickly paddles to the peak, positions himself in its evolving momentum, swings his board around, aligns with the peak, and thrusts himself into its cascading shape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, UK, colloquial) A passenger riding on the outside of a coach or carriage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "outside",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On the outside of, not inside (something, such as a building).",
                  "examples": [
                    "In territory outside her European frontiers as fixed by the present Treaty, Germany renounces all rights, titles and privileges whatever in or over territory which belonged to her or to her allies, and all rights, titles and privileges whatever their origin which she held as against the Allied and Associated Powers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Beyond the scope, limits, or borders of.",
                  "examples": [
                    "tourists from outside the country"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Near, but not in.",
                  "examples": [
                    "Up the hill Richmond town was burning briskly; outside the town of Richmond there was no trace of the Black Smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with “of”) Except, apart from.",
                  "examples": [
                    "Outside of winning the lottery, the only way to succeed is through many years of hard work."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [
        {
          "description": "outside (third-person singular simple present outsides, present participle outsiding, simple past and past participle outsided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ostracize or exclude.",
                  "examples": [
                    "Alison affirms that the kingdom of God does not rely on the sort of “outsiding” that most people find necessary to affirm identity. Keenan, echoing this claim, writes, “While the rest of humanity finds its identity in excluding, Jesus works for a sense of inclusiveness that defines him and, hopefully, us.”"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}