{
  "word": "advertise",
  "etymologies": [
    {
      "description": [
        "From Middle English advertisen, from Anglo-Norman advertir (“to inform”), avertir, Middle French advertir, avertir (“to warn, give notice to”), with the ending assimilated to -ise, -ize and probably influenced by the noun advertisement. Compare also advert."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "advertise (third-person singular simple present advertises, present participle advertising, simple past and past participle advertised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give (especially public) notice of (something); to announce publicly. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To provide information about a person or goods and services to influence others. [from 18th c.]",
                  "examples": [
                    "For personal needs, advertise on the internet or in a local newspaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide public information about (a product, service etc.) in order to attract public awareness and increase sales. [from 19th c.]",
                  "examples": [
                    "Over the air, they advertise their product on drive-time radio talk shows and TV news shows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To notify (someone) of something; to call someone's attention to something. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In gin rummy, to discard a card of one's preferred suit so as to mislead the opponent into thinking you do not want it.",
                  "examples": [
                    "The safest time to answer a possible advertisement is when you have no indication as to what suit your opponent wants. Then even if he has advertised, the odds are that your answer is not the card he is looking for."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}