{
  "word": "swell",
  "etymologies": [
    {
      "description": [
        "From Middle English swellen, from Old English swellan (“to swell”), from Proto-Germanic *swellaną (“to swell”), of unknown origin.",
        "Cognate with Old Frisian swella, Low German swellen, Dutch zwellen (“to swell”), German schwellen (“to swell”), Swedish svälla (“to swell”), Icelandic svella. The adjective may derive from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "swell (third-person singular simple present swells, present participle swelling, simple past swelled or swole or swoll, past participle swollen or swelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become bigger, especially due to being engorged.",
                  "examples": [
                    "“If you drinks a drop more, Miss Lucy, you’ll just go like my pore young sister goed,  […]  Pop she did not. She swole … swole and swole.”",
                    "“You mean ‘swelled,’ Cookoo,” corrected Lucille  […]",
                    "“ […]  I say she swole—and what is more she swole clean into a dropsy.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to become bigger.",
                  "examples": [
                    "Rains and dissolving snow swell the rivers in spring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To grow gradually in force or loudness.",
                  "examples": [
                    "The organ music swelled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to grow gradually in force or loudness.",
                  "examples": [
                    "It commenced with a slow crescendo, so irresistibly lugubrious that two of our dogs at once raised their heads and swelled their voices into a responsive tremolo, which may have been heard and appreciated by their distant relatives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise to arrogance; to puff up; to inflate.",
                  "examples": [
                    "to be swelled with pride or haughtiness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be raised to arrogance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be elated; to rise arrogantly.",
                  "examples": [
                    "In all things else above our humble fate",
                    "Your equal mind yet swells not into state,",
                    "But like some mountain in those happy Isles",
                    "Where in perpetual Spring young Nature smiles,",
                    "Your greatnesse shows:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be turgid, bombastic, or extravagant.",
                  "examples": [
                    "swelling words  a swelling style"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To protuberate; to bulge out.",
                  "examples": [
                    "A cask swells in the middle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English swelle, from the verb swellen (modern swell)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swell (countable and uncountable, plural swells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of swelling; increase in size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bulge or protuberance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Increase of power in style, or of rhetorical force.",
                  "examples": [
                    "Concentrated are his arguments, select and distinct and orderly his topics, ready and unfastidious his expressions, popular his allusions, plain his illustrations, easy the swell and subsidence of his periods  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long series of ocean waves, generally produced by wind, and lasting after the wind has ceased.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A gradual crescendo followed by diminuendo.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A device for controlling the volume of a pipe organ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A division in a pipe organ, usually the largest enclosed division.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hillock or similar raised area of terrain.",
                  "examples": [
                    "Off on the crest of a swell a moving figure was seen now and then. \"Antelope,\" said the hunters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) An upward protrusion of strata from whose central region the beds dip quaquaversally at a low angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, dated) A person who is stylish, fancy, or elegant.",
                  "examples": [
                    "It costs him no more to wear all his ornaments about his distinguished person than to leave them at home. If you can be a swell at a cheap rate, why not?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person of high social standing; an important person.",
                  "examples": [
                    "\"I am not in Mr Crosbie's confidence. He is in the General Committee Office, I know; and, I believe, has pretty nearly the management of the whole of it.\"",
                    "\"I'll tell you what he is, Bell; Mr Crosbie is a swell.\" And Lilian Dale was right; Mr Crosbie was a swell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The front brow of a saddle bow, connected in the tree by the two saddle bars to the cantle on the other end.",
                  "examples": [
                    "Synonyms: pommel, fork"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the noun \"swell\" (a person dressed in an elegant manner)."
      ],
      "adjectives": [
        {
          "description": "swell (not generally comparable, comparative sweller, superlative swellest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Fashionable, like a swell or dandy.",
                  "examples": [
                    "We pay the express, $5 a day our new agents are making and wearing the swellest clothes besides; old agents after one season make twice as much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, dated slang) Excellent.",
                  "examples": [
                    "...you are my devoted friend too. You do more and work harder and oh shit I'd get maudlin about how damned swell you are. My god I'd like to see you... You're a hell of a good guy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "swell (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, informal) Very well.",
                  "examples": [
                    "“That lousy ring wasn’t worth no grand. I did swell to get two centuries for it.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}