{
  "word": "derelict",
  "etymologies": [
    {
      "description": [
        "Latin derelictus, perfect passive participle of dērelinquō (“to forsake, abandon”) from dē- + relinquō (“to abandon, relinquish, leave (behind)”), from rē- + linquō (“to leave, quit, forsake, depart from”)."
      ],
      "adjectives": [
        {
          "description": "derelict (comparative more derelict, superlative most derelict)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abandoned, forsaken; given up by the natural owner or guardian; (of a ship) abandoned at sea, dilapidated, neglected; (of a spacecraft) abandoned in outer space.",
                  "examples": [
                    "There was a derelict ship on the island."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Negligent in performing a duty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lost; adrift; hence, wanting; careless; neglectful; unfaithful.",
                  "examples": [
                    "They easily prevailed, so as to seize upon the vacant, unoccupied, and derelict minds of his friends; and instantly they turned the vessel wholly out of the course of his policy."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "derelict (plural derelicts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Property abandoned by its former owner, especially a ship abandoned at sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An abandoned or forsaken person; an outcast.",
                  "examples": [
                    "A rather pathetic figure, the Lady Frances, a beautiful woman, still in fresh middle age, and yet, by a strange chance, the last derelict of what only twenty years ago was a goodly fleet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A homeless and/or jobless person; a person who is (perceived as) negligent in their personal affairs and hygiene. (This sense is a modern development of the preceding sense.)",
                  "examples": [
                    "Hyponym: invalid"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}