{
  "word": "persuasion",
  "etymologies": [
    {
      "description": [
        "From French persuasion and its source, Latin persuāsiō, from persuādēre, from suādēre (“to advise, recommend”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "persuasion (countable and uncountable, plural persuasions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of persuading, or trying to do so; the addressing of arguments to someone with the intention of changing their mind or convincing them of a certain point of view, course of action etc. [from 14th c.]",
                  "examples": [
                    "With the base unleashed, the White House was unable to broker a compromise, either by persuasion or by pressure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An argument or other statement intended to influence one's opinions or beliefs; a way of persuading someone. [from 14th c.]",
                  "examples": [
                    "Sadie curses, weeps, then, infected by Mr. Hamilton's writhing persuasions, prays and becomes penitent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strongly held conviction, opinion or belief. [from 16th c.]",
                  "examples": [
                    "It is his persuasion that abortion should never be condoned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's ability or power to influence someone's opinions or feelings; persuasiveness. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specified religious adherence, a creed; any school of thought or ideology. [from 17th c.]",
                  "examples": [
                    "As a convert from the Baptist persuasion more than 40 years ago, I still feel like an outsider in the church despite the kindness and acceptance of Catholic friends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, often humorous) Another personal, animal or inanimate trait that is not (very) liable to be changed by persuasion, such as sex, gender, ethnicity, origin, profession or nature.",
                  "examples": [
                    "Let us pray that the next generation be all of the male persuasion."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}