{
  "word": "uncast",
  "etymologies": [
    {
      "description": [
        "un- +‎ cast"
      ],
      "adjectives": [
        {
          "description": "uncast (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not having been cast (in various senses).",
                  "examples": [
                    "[…]  if in casting your flie, the line fall into the water before it, the flie were better uncast, because it frights the fish  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "uncast (third-person singular simple present uncasts, present participle uncasting, simple past and past participle uncast)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To detach (a rope, line, etc.).",
                  "examples": [
                    "[…]  the vessel, uncasting the hawser which had detained it, instantly left the ice  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bring back to a standing position (a horse or other large animal that is lying down with its legs under it).",
                  "examples": [
                    "At about one o’clock we finally put Araby in her stall, but she kept getting cast. She would roll over, hitting the side of the stall with her legs and was unable to get up.  […]  We had to uncast her every fifteen minutes from one A.M. until seven the next morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reverse the effects of (a magical spell).",
                  "examples": [
                    "The while it is the fairies’ hour",
                    "The fairies’ tricks are full of power.",
                    "But when the hour is overpast",
                    "By wisdom we their spells uncast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove (an actor) from a role that was previously assigned to them.",
                  "examples": [
                    "‘You CANNOT uncast me, Randy!’ hurtles from the prostrate patient.",
                    "‘Keep calm. I’m not saying you’re gonna get uncast. It’s just that having shot yourself, the insurance people are gonna be problematic. But it’ll be sorted. Trust me.’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}