{
  "word": "horse",
  "etymologies": [
    {
      "description": [
        "From Middle English horse, hors, from Old English hors (“horse”), from Proto-West Germanic *hors, *hross, from Proto-Germanic *hrussą (“horse”), from Proto-Indo-European *ḱr̥sós (“vehicle”), from Proto-Indo-European *ḱers- (“to run”). Cognate with North Frisian hors (“horse”), West Frisian hoars (“horse”), Dutch ros, hors (“horse”), German Ross (“horse”), Danish hors (“horse”), Swedish russ, hors (“horse”), Icelandic hross, hors (“horse”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "horse (plural horses)",
          "definitionGroups": [
            {
              "group": "A hoofed mammal, Equus ferus caballus, often used throughout history for riding and draft work.",
              "entries": [
                {
                  "meaning": "",
                  "examples": [
                    "A cowboy's greatest friend is his horse."
                  ]
                },
                {
                  "meaning": "Any member of the species Equus ferus, including the Przewalski's horse and the extinct Equus ferus ferus.",
                  "examples": []
                },
                {
                  "meaning": "(zoology) Any current or extinct animal of the family Equidae, including zebras and asses.",
                  "examples": [
                    "These bone features, distinctive in the zebra, are actually present in all horses."
                  ]
                },
                {
                  "meaning": "(military, sometimes uncountable) Cavalry soldiers (sometimes capitalized when referring to an official category).",
                  "examples": [
                    "We should place two units of horse and one of foot on this side of the field.",
                    "All the King's horses and all the King's men, couldn't put Humpty together again."
                  ]
                },
                {
                  "meaning": "A component of certain games.",
                  "examples": [
                    "Now just remind me how the horse moves again?"
                  ]
                },
                {
                  "meaning": "(chess, informal) The chess piece representing a knight, depicted as a horse.",
                  "examples": [
                    "Now just remind me how the horse moves again?"
                  ]
                },
                {
                  "meaning": "(xiangqi) A xiangqi piece, that moves and captures one point orthogonally and then one point diagonally.",
                  "examples": []
                },
                {
                  "meaning": "(slang) A large and sturdy person.",
                  "examples": [
                    "Every linebacker they have is a real horse."
                  ]
                },
                {
                  "meaning": "(historical) A timber frame shaped like a horse, which soldiers were made to ride for punishment.",
                  "examples": [
                    "Synonyms: Morgan's mule, Spanish donkey"
                  ]
                }
              ]
            },
            {
              "group": "Equipment with legs.",
              "entries": [
                {
                  "meaning": "In gymnastics, a piece of equipment with a body on two or four legs, approximately four feet high, sometimes (pommel horse) with two handles on top.",
                  "examples": [
                    "She's scored very highly with the parallel bars; let's see how she does with the horse."
                  ]
                },
                {
                  "meaning": "A frame with legs, used to support something.",
                  "examples": [
                    "a clothes horse; a sawhorse"
                  ]
                }
              ]
            },
            {
              "group": "(nautical) Type of equipment.",
              "entries": [
                {
                  "meaning": "A rope stretching along a yard, upon which men stand when reefing or furling the sails; footrope.",
                  "examples": []
                },
                {
                  "meaning": "A breastband for a leadsman.",
                  "examples": []
                },
                {
                  "meaning": "An iron bar for a sheet traveller to slide upon.",
                  "examples": []
                },
                {
                  "meaning": "A jackstay.",
                  "examples": [
                    "The old “horse” has made way for the “foot-rope\", though we still retain the term “Flemish horse\" for the short foot-rope at the top-sail yard-arms"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A mass of earthy matter, or rock of the same character as the wall rock, occurring in the course of a vein, as of coal or ore; hence, to take horse (said of a vein) is to divide into branches for a distance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) An informal variant of basketball in which players match shots made by their opponent(s), each miss adding a letter to the word \"horse\", with 5 misses spelling the whole word and eliminating a player, until only the winner is left. Also HORSE, H-O-R-S-E or H.O.R.S.E. (see  H-O-R-S-E on  Wikipedia.Wikipedia ).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The flesh of a horse as an item of cuisine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison slang) A prison guard who smuggles contraband in or out for prisoners.",
                  "examples": [
                    "This \"horse\" (a slang term for prison officers who smuggle contraband into the institution) was probably able \"to stay in business\" for such a long time because he only \"packed\" for powerful, trustworthy prisoners  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang, among students) A translation or other illegitimate aid in study or examination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang, among students) Horseplay; tomfoolery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English horsen, from Old English horsian (“to horse, provide with horses”) and ġehorsian (“to horse, set or mount on a horse, supply with horses”), from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "horse (third-person singular simple present horses, present participle horsing, simple past and past participle horsed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To frolic, to act mischievously. (Usually followed by \"around\".)",
                  "examples": [
                    "\"Genghis Khan! Abe Lincoln! That’s funny until someone gets hurt.\"But Genghis Khan and Lincoln keep horsing around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play mischievous pranks on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide with a horse; supply horses for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To get on horseback.",
                  "examples": [
                    "He horsed himself well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sit astride of; to bestride.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a male horse) To copulate with (a mare).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take or carry on the back.",
                  "examples": [
                    "keepers, horsing the deer"
                  ]
                }
              ]
            },
            {
              "group": "To place (someone) on the back of another person, or on a wooden horse, chair, etc., to be flogged or punished.",
              "entries": [
                {
                  "meaning": "(by extension) To flog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull, haul, or move (something) with great effort, like a horse would.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) To cram (food) quickly, indiscriminately or in great volume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To urge at work tyrannically.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To charge for work before it is finished.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unknown; probably originally criminals' cant based on the initial letter of both words."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "horse (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Heroin (drug).",
                  "examples": [
                    "Check that shirt. I got a couple of jolts of horse stashed under the collar"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}