{
  "word": "musket",
  "etymologies": [
    {
      "description": [
        "First attested around 1210 as a surname, and later in the 1400s as a word for the sparrowhawk (Middle English forms: musket, muskett, muskete (“sparrow hawk”)), from Middle French mousquet, from Old Italian moschetto (a diminutive of mosca (“fly”), from Latin musca) used to refer initially to a sparrowhawk (given its small size or speckled appearance) and then a crossbow arrow. The name was subsequently adopted for a heavier, shoulder-fired version of an arquebus,  adhering to a pattern of naming firearms and cannons after birds of prey and similar creatures (compare falcon, falconet), a sense which was also borrowed into French and then (around 1580) into English. Cognate to Spanish mosquete, Portuguese mosquete. Smoothbore firearms continued to be called muskets even as they switched from using matchlocks to flintlocks to percussion locks, but with the advent of rifled muskets, the word was finally displaced by rifle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "musket (plural muskets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of firearm formerly carried by the infantry of an army, originally fired by means of a match, or matchlock, for which several mechanical appliances (including the flintlock, and finally the percussion lock) were successively substituted; ultimately superseded by the rifle.",
                  "examples": [
                    "Soldier, soldier, won't you marry me, with your musket, fife and drum.",
                    "Sam, Sam, pick up thy musket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(falconry) A male Eurasian sparrowhawk (Accipiter nisus).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}