{
  "word": "hobby",
  "etymologies": [
    {
      "description": [
        "Shortened from hobby-horse, from Middle English hoby, hobyn, hobin (“small horse, pony”), from Old French hobi, *haubi, haubby, hobin (\"a nag, hobby\"; > Modern French aubin, Italian ubino), of Germanic origin: from Old French hober, ober (“to stir, move”), from Old Dutch hobben (“to toss, move up and down”); or from North Germanic origin related to Danish hoppe (“a mare”), Old Swedish hoppa (“a young mare”), North Frisian hoppe (“horse”); both ultimately from Proto-Germanic *huppōną (“to hop”), from Proto-Indo-European *kewb- (“to bend; a bend, joint”). More at hop, hobble.",
        "The meaning of hobby-horse shifted from \"small horse, pony\" to \"child's toy riding horse\" to \"favorite pastime or avocation\" with the connecting notion being \"activity that doesn't go anywhere\". Possibly originally from a proper name for a horse, a diminutive of Robert or Robin (compare dobbin)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hobby (plural hobbies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An activity that one enjoys doing in one's spare time.",
                  "examples": [
                    "I like to collect stamps from different countries as a hobby.",
                    "take up a hobby",
                    "give up your hobby"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(equestrianism) An extinct breed of horse native to the British Isles, also known as the Irish Hobby",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hoby, hobeye, from Old French hobé, hobei, hobet, from Medieval Latin hopētus, diminutive of harpe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hobby (plural hobbies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of four species of small falcons in the genus Falco, especially Falco subbuteo.",
                  "examples": [
                    "He hawked – from nearby Esher, Richard Fox sent a servant with a hobby, which Henry received enthusiastically – and hunted, sending a present of freshly slaughtered deer to Princess Mary."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}