{
  "word": "plume",
  "etymologies": [
    {
      "description": [
        "From Late Middle English plum, plume (“feather; plumage”), from Anglo-Norman plum, plume and Middle French, Old French plume, plome (“plumage; down used for stuffing pillows, etc.; pen, quill”) (modern French plume (“feather; pen, quill; pen nib; (figurative) writer”)), and directly from its etymon Latin plūma (“feather; plumage; down”) (compare Late Latin plūma (“pen, quill”)), from Proto-Italic *plouksmā, ultimately from Proto-Indo-European *plewk- (“to fly; to flow; to run; to flap with hands; to splash”).",
        "The English word is a doublet of pluma."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plume (plural plumes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary and poetic) A feather of a bird, especially a large or showy one used as a decoration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, literary and poetic) A cluster of feathers worn as an ornament, especially on a helmet; a hackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A token of honour or prowess; that on which one prides oneself; a prize or reward.",
                  "examples": [
                    "Synonym: feather in one's cap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The vane (“flattened, web-like part”) of a feather, especially when on a quill pen or the fletching of an arrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for plume moth (“a small, slender moth of the family Pterophoridae”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "Things resembling a feather.",
              "entries": [
                {
                  "meaning": "A cloud formed by a dispersed substance fanning out or spreading.",
                  "examples": [
                    "After the explosion, a plume of smoke could be seen in the sky for miles around.",
                    "The pollutant creates a contaminant plume within an aquifer."
                  ]
                },
                {
                  "meaning": "An upward spray of mist or water.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy) An arc of glowing material (chiefly gases) erupting from the surface of a star.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A large and flexible panicle of an inflorescence resembling a feather, such as is seen in certain large ornamental grasses.",
                  "examples": []
                },
                {
                  "meaning": "(geology) Short for mantle plume (“an upwelling of abnormally hot molten material from the Earth's mantle which spreads sideways when it reaches the lithosphere”).",
                  "examples": []
                },
                {
                  "meaning": "(zoology) A body part resembling a feather.",
                  "examples": []
                },
                {
                  "meaning": "The furry tail of certain dog breeds (such as the Samoyed) that curls over their backs or stands erect.",
                  "examples": []
                },
                {
                  "meaning": "More fully gill plume: a feathery gill of some crustaceans and molluscs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Sense 1 (“to adorn, cover, or furnish with feathers or plumes”) is derived from Anglo-Norman plumer (“to cover with or provide with feathers”), or its etymon Latin plūmāre, the present active infinitive of plūmō (“to grow feathers, to fledge; to cover with feathers, to feather; to embroider with a feathery pattern”) (and compare Late Latin plūmō (“to attach feathers to arrows; of a hawk: to pluck the feathers from prey; (figurative) to celebrate, praise”)), from plūma (“feather; plumage; down”) (see etymology 1) + -ō (suffix forming regular first-conjugation verbs).",
        "Senses 2–4 (“to arrange and preen the feathers of; to congratulate (oneself) proudly; to strip of feathers”) are from Late Middle English plumen (“to remove the feathers from a bird; of a hawk: to pluck the feathers or the head from prey”) [and other forms], from Anglo-Norman and Middle French plumer (“to remove the feathers from a bird; to pull out (hairs, especially from a moustache); to rob”), from plūma (see etymology 1).",
        "Sense 5 (“to fan out or spread in a cloud”) is derived from plume (noun)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "plume (third-person singular simple present plumes, present participle pluming, simple past and past participle plumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figurative) To adorn, cover, or furnish with feathers or plumes, or as if with feathers or plumes.",
                  "examples": [
                    "Synonyms: feather, fledge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) Chiefly of a bird: to arrange and preen the feathers of, specifically in preparation for flight; hence (figurative), to prepare for (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive, by extension) To congratulate (oneself) proudly, especially concerning something unimportant or when taking credit for another person's effort; to self-congratulate.",
                  "examples": [
                    "He plumes himself on his skill."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, archaic) To strip (a bird) of feathers; to pluck.",
              "entries": [
                {
                  "meaning": "(by extension) To peel, to strip completely; to pillage; also, to deprive of power.",
                  "examples": []
                },
                {
                  "meaning": "(falconry, obsolete) Of a hawk: to pluck the feathers from prey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a dispersed substance such as dust or smoke: to fan out or spread in a cloud.",
                  "examples": [
                    "Smoke plumed from his pipe, then slowly settled towards the floor."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}