{
  "word": "sadism",
  "etymologies": [
    {
      "description": [
        "From French sadisme. Named after the Marquis de Sade, famed for his libertine writings depicting the pleasure of inflicting pain to others. The word for \"sadism\" (sadisme) was coined or acknowledged in the 1834 posthumous reprint of French lexicographer Boiste's Dictionnaire universel de la langue française; it is reused along with \"sadist\" (sadique) in 1862 by French critic Sainte-Beuve in his commentary of Flaubert's novel Salammbô; it is reused (possibly independently) in 1886 by Austrian psychiatrist Krafft-Ebing in Psychopathia Sexualis which popularized it; it is directly reused in 1905 by Freud in Three Essays on the Theory of Sexuality which definitively established the word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sadism (countable and uncountable, plural sadisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly psychiatry) The enjoyment of inflicting pain or humiliation without pity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Achievement of sexual gratification by inflicting pain or humiliation on others, or watching pain or humiliation inflicted on others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(loosely) Deliberate or wanton cruelty, either mental or physical, to other people, or to animals, regardless of whether for (sexual) gratification.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}