{
  "word": "draw",
  "etymologies": [
    {
      "description": [
        "From Middle English drawen, draȝen, dragen (“to drag, pull, push, draw (out), go to, make, add, etc.”), from Old English dragan, from Proto-West Germanic *dragan, from Proto-Germanic *draganą, from Proto-Indo-European *dʰregʰ- (“to draw, pull”). Doublet of drag and draught."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "draw (countable and uncountable, plural draws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of a contest that neither side has won; a tie.",
                  "examples": [
                    "The game ended in a draw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The procedure by which the result of a lottery is determined.",
                  "examples": [
                    "The draw is on Saturday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that attracts e.g. a crowd.",
                  "examples": [
                    "After It, Clara became one of the top box-office draws in Hollywood, but her popularity was short lived."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of drawing.",
                  "examples": [
                    "the Wild West's quick-draw champion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The result of a two-innings match in which at least one side did not complete all their innings before time ran out (as distinguished from a tie).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A golf shot that (for the right-handed player) curves intentionally to the left. See hook, slice, fade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A shot that is intended to land gently in the house (the circular target) without knocking out other stones; cf. takeout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) A dry stream bed that drains surface water only during periods of heavy rain or flooding.",
                  "examples": [
                    "The garden, curiously enough, was a quarter of a mile from the house, and the way to it led up a shallow draw past the cattle corral."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, countable) A bag of cannabis.",
                  "examples": [
                    "So my friends and I would all chip in money to get a bag of weed or a draw."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Cannabis.",
                  "examples": [
                    "Mick spoke to Simon, who was more of a drinker. He said that people who smoked draw were boring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a commission-based job, an advance on future (potential) commissions given to an employee by the employer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) A situation in which one or more players has four cards of the same suit or four out of five necessary cards for a straight and requires a further card to make their flush or straight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archery) The act of pulling back the strings in preparation of firing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The spin or twist imparted to a ball etc. by a drawing stroke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Draft in the sense of the flow through a flue of gasses (smoke) resulting from a combustion process, possibly adjustable with a damper.",
                  "examples": [
                    "She looked in [to the stove] and a tight, dismayed gasp escaped her. She slammed the door shut and adjusted the draw with trembling fingers. For a moment—just a moment—she had seen her old friend Annabelle Frane in the coals."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "draw (third-person singular simple present draws, present participle drawing, simple past drew, past participle drawn or (colloquial and nonstandard) drew)",
          "definitionGroups": [
            {
              "group": "To pull or exert force.",
              "entries": [
                {
                  "meaning": "To pull (something) in a particular manner or direction. [from 8th c.]",
                  "examples": [
                    "He drew a sheaf of papers from his bag."
                  ]
                },
                {
                  "meaning": "To drag (a person, thing, or part of the body), especially along the ground. [from 10th c.]",
                  "examples": [
                    "Seals  […]  throw their bodies forward, drawing their hinder-parts after them."
                  ]
                },
                {
                  "meaning": "(transitive) To pull (a plough, vehicle etc.); to cause (something) to move forwards by pulling it. [from 11th c.]",
                  "examples": []
                },
                {
                  "meaning": "(archery) To pull back (the string of a bow) in preparation for shooting. [from 12th c.]",
                  "examples": []
                },
                {
                  "meaning": "To move (a part of one's body) in a particular direction. [from 13th c.]",
                  "examples": [
                    "She settled in the window seat, drawing her leg up beneath her."
                  ]
                },
                {
                  "meaning": "To pull (a curtain, blinds etc.) open or closed. [from 13th c.]",
                  "examples": [
                    "You should draw the curtains at night."
                  ]
                },
                {
                  "meaning": "(intransitive, now rare) To pull something along; to have force to move anything by pulling. [from 14th c.]",
                  "examples": [
                    "This horse draws well."
                  ]
                },
                {
                  "meaning": "To pull (one's face, features) out of shape, from emotion etc. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now rare) To construct (a wall, canal etc.) from one point to another. [from 15th c.]",
                  "examples": [
                    "the huge Offa's dike which he drew from the mouth of Wye to that of Dee"
                  ]
                },
                {
                  "meaning": "To require (a depth of water) for floating. [from 15th c.]",
                  "examples": [
                    "A ship draws ten feet of water."
                  ]
                },
                {
                  "meaning": "(reflexive) To assume a specific position or attitude. [from 17th c.]",
                  "examples": [
                    "He drew himself to his full height and glowered at the interloper."
                  ]
                },
                {
                  "meaning": "To pull (a belt or other item) so that it tightens or wraps around something more closely. [from 17th c.]",
                  "examples": [
                    "She took a deep breath and drew her corset-strings."
                  ]
                },
                {
                  "meaning": "(curling) To make a shot that lands gently in the house (the circular target) without knocking out other stones. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, now rare) To be pulled along (in a specified way). [from 19th c.]",
                  "examples": [
                    "The carriage draws easily."
                  ]
                },
                {
                  "meaning": "(cricket) To play (a short-length ball directed at the leg stump) with an inclined bat so as to deflect the ball between the legs and the wicket. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(golf) To hit (the ball) with the toe of the club so that it is deflected toward the left. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(billiards) To strike (the cue ball) below the center so as to give it a backward rotation which causes it to take a backward direction on striking another ball. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "To attract, exert an influence on.",
              "entries": [
                {
                  "meaning": "To induce (the mind, eyes, attention etc.) to be directed at or focused on something. [from 9th c.]",
                  "examples": [
                    "From the moment she entered the room, all eyes were drawn to her.",
                    "His mind was drawn back to the events of the preceding morning."
                  ]
                },
                {
                  "meaning": "To cause (someone) to come to a particular place, condition, or course of action; to attract (a person). [from 12th c.]",
                  "examples": []
                },
                {
                  "meaning": "To take (air, smoke etc.) into the lungs; to inhale. [from 13th c.]",
                  "examples": [
                    "I drew a deep breath and wiped my brow."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive) To attract (something) by means of a physical force, especially magnetism or gravity; (figurative) to act as an inducement or enticement. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To cause (something); to bring (something) about as a consequence. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To provoke or attract (a particular response or reaction). [from 16th c.]",
                  "examples": [
                    "The president's comments have drawn strong criticism from rightwing media outlets."
                  ]
                },
                {
                  "meaning": "(intransitive) To have a draught; to allow air to be passed through in order to allow for combustion. [from 18th c.]",
                  "examples": [
                    "The chimney won't draw properly if it's clogged up with soot."
                  ]
                }
              ]
            },
            {
              "group": "To extend, protract.",
              "entries": [
                {
                  "meaning": "(obsolete) To extend the duration of (something); to prolong. [10th–19th c.]",
                  "examples": []
                },
                {
                  "meaning": "To make (wire) by pulling it through an aperture; to stretch (metal) into a wire. [from 13th c.]",
                  "examples": [
                    "to draw a mass of metal into wire"
                  ]
                },
                {
                  "meaning": "To stretch or elongate. [from 14th c.]",
                  "examples": [
                    "The dough was run through the pasta machine and drawn into a long ribbon."
                  ]
                },
                {
                  "meaning": "(intransitive) To become contracted; to shrink. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(nautical) Of a sail, to fill with wind. [from 17th c.]",
                  "examples": [
                    "A ship's sail is said to draw when it is filled with wind."
                  ]
                }
              ]
            },
            {
              "group": "To move, travel, approach.",
              "entries": [
                {
                  "meaning": "(reflexive, now rare) To move in a specific direction. [from 12th c.]",
                  "examples": [
                    "She thought she heard a noise in her chamber, and she drew herself within the casement."
                  ]
                },
                {
                  "meaning": "(intransitive, used with prepositions and adverbs) To move steadily in a particular direction or into a specific position. [from 13th c.]",
                  "examples": [
                    "The runners drew level with each other as they approached the finish line.",
                    "Draw near to the fire and I will tell you a tale.",
                    "The end of the world draws near."
                  ]
                },
                {
                  "meaning": "To come to, towards (a particular moment in time); to approach (a time). [from 14th c.]",
                  "examples": [
                    "As it drew towards evening, I packed up and headed for home."
                  ]
                },
                {
                  "meaning": "(hunting, now rare) To search for game; to track a quarry. [from 16th c.]",
                  "examples": [
                    "On one of my expeditions, after a stormy night, at the end of March, the hounds drew all day without finding a fox."
                  ]
                }
              ]
            },
            {
              "group": "To extract, remove, select.",
              "entries": [
                {
                  "meaning": "To pull out, unsheathe (a sword, firearm etc.). [from 12th c.]",
                  "examples": [
                    "They drew their swords and fought each other."
                  ]
                },
                {
                  "meaning": "To take (water) from a well or other source. [from 13th c.]",
                  "examples": [
                    "draw water from a well"
                  ]
                },
                {
                  "meaning": "To disembowel (someone); to remove the viscera from (an animal), especially before cooking. [from 13th c.]",
                  "examples": [
                    "In private draw your poultry, clean your tripe."
                  ]
                },
                {
                  "meaning": "(transitive, medicine, now rare) To extract (pus, humours, etc.) by means of medical treatment. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To select (an item) at random to decide which of a group of people will receive or undergo something; to select (a person) by this process. [from 14th c.]",
                  "examples": [
                    "Provided magistracies were filled by men freely chosen or drawn."
                  ]
                },
                {
                  "meaning": "To conduct (a lottery); to select (the numbers) for a lottery; to win (a prize) in a lottery. [from 16th c.]",
                  "examples": [
                    "The winning lottery numbers were drawn every Tuesday."
                  ]
                },
                {
                  "meaning": "To extract (a tooth). [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "To extract (juice, fluids etc.) from something by pressure, osmosis or similar. [from 16th c.]",
                  "examples": [
                    "Spirits, by distillations, may be drawn out of vegetable juices, which shall flame and fume of themselves."
                  ]
                },
                {
                  "meaning": "(card games) To take or be dealt (a card) from the deck; to have (a particular hand) as a result of this. [from 16th c.]",
                  "examples": [
                    "At the start of their turn, each player must draw a card."
                  ]
                },
                {
                  "meaning": "(transitive, obsolete) To withdraw. [from 17th c.]",
                  "examples": []
                },
                {
                  "meaning": "(transitive or intransitive) To end a game in a draw (with neither side winning). [from 17th c.]",
                  "examples": [
                    "We drew last time we played.  I drew him last time I played him.  I drew my last game against him."
                  ]
                },
                {
                  "meaning": "(intransitive, transitive) To steep; to leave (tea) temporarily in water to allow the flavour to increase. [from 18th c.]",
                  "examples": [
                    "She made a pot of very strong tea, and while she was waiting for it to draw she opened the kitchen door to inspect her garden."
                  ]
                },
                {
                  "meaning": "(intransitive) To take or be dealt a playing card from the deck. See also draw out.",
                  "examples": [
                    "Jill has four diamonds; she'll try to draw for a flush."
                  ]
                },
                {
                  "meaning": "To run (a bath). [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(analogous) To consume (power).",
                  "examples": [
                    "The circuit draws three hundred watts."
                  ]
                }
              ]
            },
            {
              "group": "To obtain, elicit.",
              "entries": [
                {
                  "meaning": "To take (something) from a particular source, especially of information; to derive. [from 13th c.]",
                  "examples": [
                    "He drew comfort from the thought that he was not the first to suffer this way.",
                    "She draws her subject matter from the events of her own life."
                  ]
                },
                {
                  "meaning": "To call forth (something) from a person, to elicit. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To deduce or infer (a conclusion); to make (a deduction). [from 16th c.]",
                  "examples": [
                    "He tried to draw a conclusion from the facts."
                  ]
                },
                {
                  "meaning": "To receive (a salary); to withdraw (money) from a bank etc. [from 16th c.]",
                  "examples": [
                    "to draw money from a bank"
                  ]
                },
                {
                  "meaning": "To elicit information from (someone); to induce (a person) to speak on some subject. (Now frequently in passive.) [from 19th c.]",
                  "examples": [
                    "He refused to be drawn on the subject"
                  ]
                }
              ]
            },
            {
              "group": "To represent.",
              "entries": [
                {
                  "meaning": "(transitive) To produce (a shape, figure, picture etc.) with pencil, crayon, chalk, or other implement. [from 14th c.]",
                  "examples": [
                    "A crude picture had been drawn on the wall of his poky apartment."
                  ]
                },
                {
                  "meaning": "(transitive) To depict (something) linguistically; to portray in words. [from 14th c.]",
                  "examples": [
                    "Her first novel contained a host of characters who were richly and convincingly drawn."
                  ]
                },
                {
                  "meaning": "(transitive) To draw up, compose (a document). [from 14th c.]",
                  "examples": [
                    "to draw a memorial, a deed, or bill of exchange"
                  ]
                },
                {
                  "meaning": "(intransitive) To produce an image of something by artistic means; to make drawings. [from 15th c.]",
                  "examples": [
                    "When I came in she was drawing on a big piece of coloured paper."
                  ]
                },
                {
                  "meaning": "(transitive) To produce a visual representation of (a person or thing) by lines and marks with pencil, pen, paints etc. [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}