{
  "word": "billhook",
  "etymologies": [
    {
      "description": [
        "Earliest use in weapon (and later, agricultural) sense, bill (a bladed pike) +‎ hook; other senses formed anew from various meanings of bill."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "billhook (plural billhooks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A medieval polearm, fitted to a long handle, sometimes with an L-shaped tine or a spike protruding from the side or the end of the blade for tackling the opponent; a bill",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An agricultural implement often with a curved or hooked end to the blade used for pruning or cutting thick, woody plants.",
                  "examples": [
                    "I worked very hard in the copse of young ash, with my billhook and a shearing-knife; cutting out the saplings where they stooled too close together, making spars to keep for thatching, wall-crooks to drive into the cob, stiles for close sheep hurdles, and handles for rakes, and hoes, and two-bills, of the larger and straighter stuff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Written as bill-hook: a part of the knotting mechanism in a reaper-binder or baler (agricultural machinery).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Written as bill hook: a spiked hook used in offices and shops for hanging bills or other small papers such as receipts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) Written as bill hook: a sharply pointed spike growing from the tip of the upper mandible of the hatchlings of honeyguides, used to destroy the eggs and kill the chicks of the host species.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "billhook (third-person singular simple present billhooks, present participle billhooking, simple past and past participle billhooked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a billhook",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}