{
  "word": "breakdown",
  "etymologies": [
    {
      "description": [
        "From the verb phrase break down."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breakdown (countable and uncountable, plural breakdowns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A failure, particularly mechanical in nature.",
                  "examples": [
                    "Whenever she was behind the wheel, she would panic at the first sign of a breakdown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that has experienced a mechanical failure.",
                  "examples": [
                    "We saw a breakdown by the side of the road."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A physical collapse or lapse of mental stability.",
                  "examples": [
                    "After so much stress, he suffered a breakdown and simply gave up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Listing, division or categorization in great detail.",
                  "examples": [
                    "Looking at the breakdown of the budget, I see a few items we could cut."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A detailed description of a forthcoming project, including the characters and roles required.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Breaking of chemical bonds within a compound to produce simpler compounds or elements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The sudden transition of an electrical insulator to a conductor when subjected to a sufficiently strong voltage, caused by the partial or complete ionization of the insulator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical technique by which the music is stripped down, becoming simpler, varying in heaviness depending on the genre.",
                  "examples": [
                    "And now it's time for a breakdown!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A loss of organization (of the parts of a system).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) A noisy, rapid, shuffling dance engaged in competitively by a number of persons or pairs in succession, common in traditional African American music from the Southern United States.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated) Any noisy dance performed by shuffling the feet, usually by one person at a time.",
                  "examples": [
                    "Don't clear out when the quadrilles are over, for we are going to have a breakdown to wind up with."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Any rapid bluegrass dance tune, especially featuring a five-string banjo.",
                  "examples": [
                    "\"Foggy Mountain Breakdown\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The percussion break of songs chosen by a DJ for use in hip-hop music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}