{
  "word": "sarcophagus",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Latin sarcophagus (“grave; sarcophagus; flesh-eating, carnivorous”), from Ancient Greek σᾰρκοφᾰ́γος (sarkophágos, “sarcophagus; flesh-eating, carnivorous”) (so named from λῐ́θος σᾰρκοφᾰ́γος (líthos sarkophágos, literally “flesh-eating stone”) a type of limestone found at Assos in Troas (now Behramkale, Turkey) thought to consume the flesh of corpses, and thus used to make coffins), from σαρκός (sarkós) (the genitive form of σάρξ (sárx, “flesh; body”), from Proto-Indo-European *twerḱ- (“to carve; to cut off, trim”)) + -φάγος (-phágos, suffix meaning ‘eater (of); eating’) (from ἔφαγον (éphagon, “to devour, eat”) (possibly ultimately from Proto-Indo-European *bʰeh₂g- (“to allot, distribute; to divide”)).",
        "The plural form sarcophagi is borrowed from Latin sarcophagī.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sarcophagus (plural sarcophagi or sarcophaguses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stone coffin, often with its exterior inscribed, or decorated with sculpture.",
                  "examples": [
                    "Synonym: (obsolete) sarcophage"
                  ]
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(informal) The cement and steel structure that encases the destroyed nuclear reactor at the Chernobyl Nuclear Power Plant in Chernobyl, Ukraine.",
                  "examples": []
                },
                {
                  "meaning": "(historical) A type of wine cooler (“a piece of equipment used to keep wine chilled”) shaped like a sarcophagus (sense 1).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except Ancient Greece, historical) A kind of limestone used by the Ancient Greeks for coffins, so called because it was thought to consume the flesh of corpses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sarcophagus (third-person singular simple present sarcophaguses, present participle sarcophagusing, simple past and past participle sarcophagused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose (a corpse, etc.) in a sarcophagus (noun sense 1).",
                  "examples": [
                    "Synonyms: sarcophagise, sarcophagize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}