{
  "word": "recycle",
  "etymologies": [
    {
      "description": [
        "From re- +‎ cycle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "recycle (plural recycles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of recycling.",
                  "examples": [
                    "First, there will be little reaction in the settler so that the concentrations of soluble constituents in the recycle stream are the same as those in the bioreactor. Because all soluble concentrations are the same, the recycle of soluble constituents around the system has no impact on system performance."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "recycle (third-person singular simple present recycles, present participle recycling, simple past and past participle recycled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break down and reuse component materials.",
                  "examples": [
                    "Both paper and plastic can be recycled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reuse as a whole.",
                  "examples": [
                    "Jokes are recycled so frequently, it’s as if comedy writing was eating a hole in the ozone layer: If the audience had a nickel for every time a character on one side of the frame says something could never happen as it simultaneously happens on the other side of the frame, they’d have enough to pay the surcharge for the movie’s badly implemented 3-D."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To collect or place in a bin for recycling.",
                  "examples": [
                    "Most cans, bottles, and jars need to be rinsed, so recycle while you are doing dishes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, ergative) To be recycled.",
                  "examples": [
                    "Sulfur recycles in the sulfur cycle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) To discard into a recycling bin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, transitive) To put (a person) through a course of training again.",
                  "examples": [
                    "Recruits cannot fail this portion of their training and become a Marine. Anyone who fails may be “recycled” through training up to three more times to try again, but will be sent home if success in this program is not achieved."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roller derby) To skate toward the rear of the engagement zone to maximize the time that an opposing jammer must spend before returning to the action.",
                  "examples": [
                    "Synonym: waterfall"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}