{
  "word": "victory",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English victory, victori, victorie (“supremacy, victory; a defeat or vanquishing, conquest; superior military force; might, power, strength; triumphal celebration or procession; monument commemorating a defeat; superior position, dominance; mastery; moral victory, vindication; success, triumph; redemption, salvation; resurrection of Jesus; means of achieving spiritual victory; reward for or token of perseverance in a spiritual struggle”) [and other forms], borrowed from Anglo-Norman victorie and Old French victorie, a variant of victoire (“victory, win”) (modern French victoire), from Latin victōria (“victory”), from victor (“champion, winner, victor; conqueror, vanquisher”) (ultimately from Proto-Indo-European *weyk- (“to contain, envelop; to overcome”)) + -ia (suffix forming feminine abstract nouns). The English word is analysable as victor +‎ -y (suffix forming abstract nouns denoting a condition, quality, or state), and displaced  Middle English siȝe, sye.",
        "The interjection is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "victory (countable and uncountable, plural victories)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The condition or state of having won a battle or competition, or having succeeded in an effort; (countable) an instance of this.",
                  "examples": [
                    "Synonyms: triumph, win",
                    "Antonyms: defeat, loss",
                    "It was a great victory on the battlefield."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman mythology) Alternative letter-case form of Victory (“(uncountable) the Roman goddess of victory, the counterpart of the Greek goddess Nike; also (countable), an artistic depiction of her, chiefly as a winged woman”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English victorien (“to overcome, vanquish”), from Old French victorier, or from Medieval Latin victōriāre, from Latin victōria (noun); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "victory (third-person singular simple present victories, present participle victorying, simple past and past participle victoried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To defeat or triumph over (someone or something).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}