{
  "word": "retract",
  "etymologies": [
    {
      "description": [
        "From Late Middle English retracten, retract (“to absorb, draw in”), from Latin retractus (“withdrawn”), the perfect passive participle of Latin retrahō (“to draw or pull back, withdraw; to bring back; to compel to turn back; to recall; to get back, recover; to hold back, restrain, withhold; to remove, take away; to bring to light again; (Late Latin) to delay”), from re- (prefix meaning ‘again’) + trahō (“to drag, pull; to extract, withdraw”) (apparently ultimately from Proto-Indo-European *tregʰ- (“to drag, pull (?)”), a variant of *dʰregʰ- (“to drag, pull; to run”)). Doublet of retreat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "retract (third-person singular simple present retracts, present participle retracting, simple past and past participle retracted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To pull (something) back or back inside.",
                  "examples": [
                    "Synonym: pull back",
                    "An airplane retracts its wheels for flight."
                  ]
                },
                {
                  "meaning": "(specifically, zoology) To draw (an extended body part) back into the body.",
                  "examples": [
                    "Antonyms: extend, protrude",
                    "A cat can retract its claws."
                  ]
                },
                {
                  "meaning": "(rare) To avert (one's eyes or a gaze).",
                  "examples": []
                },
                {
                  "meaning": "(phonetics) To pronounce (a sound, especially a vowel) farther to the back of the vocal tract.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To hold back (something); to restrain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To draw back; to draw up; to withdraw.",
                  "examples": [
                    "The bus was stuck at the stop as its wheelchair ramp wouldn’t retract after use.",
                    "Muscles retract after amputation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Partly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "retract (plural retracts) (obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of retracting or withdrawing (a mistake, a statement, etc.); a retraction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pulling back, especially (military) of an army or military troops; a pull-back, a retreat; also, a signal for this to be done.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of retreat (“an act of accidentally injuring a horse's foot by incorrectly nailing it during shoeing”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French rétracter (“to annul; to reconsider; to withdraw”) (modern French rétracter (“to retract; to contract”)), and from its etymon Latin retractāre, the present active infinitive of retractō (“to retract, withdraw; to annul, revoke; to detract from; to undertake again; to reconsider; to remember; to decline, refuse”), from re- (prefix meaning ‘again’) + tractō (“to drag, haul, tug”) (from trahō (“to drag, pull; to extract, withdraw”) (see further at etymology 1) + -tō (frequentative suffix forming verbs))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "retract (third-person singular simple present retracts, present participle retracting, simple past and past participle retracted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To cancel or take back (something, such as an edict or a favour or grant previously bestowed); to rescind, to revoke.",
                  "examples": []
                },
                {
                  "meaning": "To break or fail to keep (a promise, etc.); to renege.",
                  "examples": []
                },
                {
                  "meaning": "To take back or withdraw (something that has been said or written); to disavow, to repudiate.",
                  "examples": [
                    "Synonyms: unsay, (rare) unspeak, walk back, withcall, withdraw; see also Thesaurus:recant",
                    "Antonyms: affirm, confirm, maintain",
                    "I retract all the accusations I made about the senator and sincerely hope he won’t sue me."
                  ]
                },
                {
                  "meaning": "(games) Originally in chess and now in other games as well: to take back or undo (a move); specifically (card games) to take back or withdraw (a card which has been played).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To decline or fail to do something promised; to break one's word.",
                  "examples": []
                },
                {
                  "meaning": "Of something said or written (such as published academic work): to take back or withdraw.",
                  "examples": []
                },
                {
                  "meaning": "(card games, archaic) To change one's mind after declaring an intention to make a certain move.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}