{
  "word": "hybrid",
  "etymologies": [
    {
      "description": [
        "Known in English since 1601, but rare before c.1850. From Latin hybrida, a variant of hibrida (“a mongrel; specifically, offspring of a tame sow and a wild boar”)."
      ],
      "adjectives": [
        {
          "description": "hybrid (comparative more hybrid, superlative most hybrid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consisting of diverse components.",
                  "examples": [
                    "a hybrid mix of jazz and punk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a car) Running on both fuel (gasoline/diesel) and electricity (battery or energy from the sun).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hybrid (plural hybrids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Offspring resulting from cross-breeding different entities, e.g. two different species or two purebred parent strains.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something of mixed origin or composition; often, a tool or technology that combines the benefits of formerly separate tools or technologies.",
              "entries": [
                {
                  "meaning": "(linguistics) A word whose elements are derived from different languages.",
                  "examples": []
                },
                {
                  "meaning": "A hybrid vehicle (especially a car), one that runs on both fuel (gasoline/diesel) and electricity (battery or energy from the sun).",
                  "examples": [
                    "All our family drive hybrids because they're greener."
                  ]
                },
                {
                  "meaning": "(cycling) A bicycle that is a compromise between a road bike and a mountain bike.",
                  "examples": []
                },
                {
                  "meaning": "(golf) A golf club that combines the characteristics of an iron and a wood.",
                  "examples": []
                },
                {
                  "meaning": "An electronic circuit constructed of individual devices bonded to a substrate or PCB.",
                  "examples": []
                },
                {
                  "meaning": "A computer that is part analog computer and part digital computer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}