{
  "word": "cardinal",
  "etymologies": [
    {
      "description": [
        "From Middle French cardinal, from Latin cardinālis (“pertaining to a hinge, hence applied to that on which something turns or depends, important, principal, chief”), from cardō (“hinge”) + -ālis, adjectival suffix."
      ],
      "adjectives": [
        {
          "description": "cardinal (comparative more cardinal, superlative most cardinal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of fundamental importance; crucial, pivotal.",
                  "examples": [
                    "a cardinal rule"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Of or relating to the cardinal directions (north, south, east and west).",
                  "examples": [
                    "a cardinal mark"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Describing a \"natural\" number used to indicate quantity (e.g., zero, one, two, three), as opposed to an ordinal number indicating relative position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a bright red color (from the color of a Catholic cardinal's cassock).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cardinal (plural cardinals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) One of the officials appointed by the pope in the Roman Catholic Church, ranking only below the pope and the patriarchs, constituting the special college which elects the pope. (See Wikipedia article on Catholic cardinals.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of a genus of songbirds of the finch family, Cardinalis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various related passerine birds of the family Cardinalidae (See Wikipedia article on cardinals) and other similar birds that were once considered to be related.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(color) A deep red color, somewhat less vivid than scarlet, the traditional colour of a Catholic cardinal's cassock. (same as cardinal red)",
                  "examples": [
                    "cardinal:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Short for cardinal number, a number indicating quantity, or the size of a set (e.g., 0, 1, 2, 3). (See Cardinal_number.)",
                  "examples": [
                    "This cardinal number is the smallest of the infinite cardinal numbers; it is the one to which Cantor has appropriated the Hebrew aleph with the suffix 0, to distinguish it from larger infinite cardinals. Thus the name of the smallest of infinite cardinals is 0א."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Short for cardinal numeral, a word used to represent a cardinal number.",
                  "examples": [
                    "The commonest numerals in Latin, as in English, are the \"cardinals\" […] and the \"ordinals\" […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for cardinal flower (Lobelia cardinalis), a flowering plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for cardinal tetra (Paracheirodon axelrodi), a freshwater fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A woman's short cloak with a hood, originally made of scarlet cloth.",
                  "examples": [
                    "She has valuables of mine; besides, my cardinal and veil are in her room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Mulled red wine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}