{
  "word": "swidden",
  "etymologies": [
    {
      "description": [
        "From English dialect, probably from Middle English *swiden, swithen, past participle of Middle English swithen (“to burn, scorch, singe”), from Old Norse svíða (“to singe, burn”). Compare also Old Norse sviðinn (“burned, singed”, past participle).",
        "Alternatively, from Middle English *swithnen, *swithenen, from Old Norse sviðna (“to be burned”), related to the verb above.",
        "More specifically, on how the Swedish scholar Karl Gustaf Izikowitz revived the old English term in modern scholarship, we may cite Guido Sprenger (\"Out of the ashes: Swidden cultivation in highland Laos\", in Anthropology Today 22.4, August 2006, page 9:",
        "\"It’s not that Karl Gustav Izikowitz (1903-1985) invented swidden. When the Swedish anthropologist did fieldwork in northern Laos, he focused mainly on economic issues. In his view, the Rmeet (which he spelled Lamet, according to lowland Lao pronunciation) had a particularly ancient type of agriculture, characterized by the burning of a plot in the forest each year and allowing fallow periods of 10-15 years for the soil to recover. After his return to Sweden in 1938, Izikowitz recalled a similar technique practised in his home country, called svedja, meaning ‘to burn a field’ (as verb) or ‘burnt field’ (as noun). With the help of Professor Eilert Ekwall, he located an old dialectal word in English for it: swidden (Izikowitz 1979 [1951]). Both the term and the research initiated by Izikowitz have come a long way since the middle of the last century. ‘Swidden’ has entered anthropological jargon, denoting not only a practice widespread in non-state societies, but also a problem. Izikowitz’ volume Lamet appeared in 1951 and became more than a classic study of swidden techniques and rituals […] \""
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "swidden (plural swiddens)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area of land that has been cleared by cutting the vegetation and burning it; slash and burn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "swidden (third-person singular simple present swiddens, present participle swiddening, simple past and past participle swiddened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clear an area of land by cutting and burning.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}