{
  "word": "article",
  "etymologies": [
    {
      "description": [
        "From Middle English article, from Old French article, from Latin articulus (“a joint, limb, member, part, division, the article in grammar, a point of time”), from Latin artus, from Proto-Indo-European *h₂értus (“that which is fit together; juncture, ordering”), from the root *h₂er- (“to join, fit (together)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "article (plural articles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of nonfictional writing such as a story, report, opinion piece, or entry in a newspaper, magazine, journal, dictionary, encyclopedia, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object, a member of a group or class.",
                  "examples": [
                    "an article of clothing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A part of speech that indicates, specifies and limits a noun (a, an, or the in English). In some languages the article may appear as an ending (e.g. definite article in Swedish) or there may be none (e.g. Russian, Pashto).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of a legal document, bylaws, etc. or, in the plural, the entire document seen as a collection of these.",
                  "examples": [
                    "The Articles of War are a set of regulations […] to govern the conduct of […] military […] forces"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A genuine article.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part or segment of something joined to other parts, or, in combination, forming a structured set.",
                  "examples": [
                    "Each of the chelicerae is composed of two articles, forming a powerful pincer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, dated) A person; an individual.",
                  "examples": [
                    "a shrewd article"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A wench.",
                  "examples": [
                    "She's a prime article (whip slang), she's a devilish good piece, a hell of a goer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Subject matter; concern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A distinct part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A precise point in time; a moment.",
                  "examples": [
                    "[…]  who has more opportunities of acquiring the knowledge, than a physician? He is admitted into the dwellings of all ranks of people, and into the innermost parts of them; he sees them by their fireside, at their tables, and in their beds; he sees them at work, and at their recreations; he sees them in health, in sickness, and in the article of death;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "article (third-person singular simple present articles, present participle articling, simple past and past participle articled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bind by articles of apprenticeship.",
                  "examples": [
                    "to article an apprentice to a mechanic"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To accuse or charge by an exhibition of articles or accusations.",
                  "examples": [
                    "[…] if the Captain of any Merchant ship under convoy shall wilfully disobey Signals […] he shall be liable to be articled against in the High Court of Admiralty […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To formulate in articles; to set forth in distinct particulars.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}