{
  "word": "substitute",
  "etymologies": [
    {
      "description": [
        "From Middle English substituten, from Latin substitutus, past participle of substituō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "substitute (plural substitutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A replacement or stand-in for something that achieves a similar result or purpose.",
                  "examples": [
                    "Synonyms: substituend, surrogate; see also Thesaurus:substitute",
                    "Antonyms: substituend, substituendum"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A player who is available to replace another if the need arises, and who may or may not actually do so.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) One who enlists for military service in the place of a conscript.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) Abbreviation of substitute good.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "substitute (third-person singular simple present substitutes, present participle substituting, simple past and past participle substituted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use in place of something else, with the same function.",
                  "examples": [
                    "I had no shallots so I substituted onion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, in the phrase \"substitute X for Y\") To use X in place of Y.",
                  "examples": [
                    "I had to substitute new parts for the old ones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, formerly proscribed, in the phrase \"substitute X with/by Y\") To use Y in place of X; to replace X with Y.",
                  "examples": [
                    "I had to substitute old parts with the new ones."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To remove (a player) from the field of play and bring on another in his place.",
                  "examples": [
                    "He was playing poorly and was substituted after twenty minutes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To serve as a replacement (for someone or something).",
                  "examples": [
                    "Accumulation of wealth by this route may substitute for personal saving."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}