{
  "word": "house",
  "etymologies": [
    {
      "description": [
        "From Middle English hous, hus, from Old English hūs (“dwelling, shelter, house”), from Proto-West Germanic *hūs, from Proto-Germanic *hūsą (compare Scots hoose, West Frisian hûs, Dutch huis, German Haus, German Low German Huus, Danish hus, Faroese hús, Icelandic hús, Norwegian Bokmål hus, Norwegian Nynorsk hus and Swedish hus), possibly from Proto-Indo-European *(s)kews-, from *(s)kewH- (“to cover, hide”). Eclipsed non-native Middle English meson, measoun (“house”), borrowed from Old French maison (“house”). More at hose.",
        "The uncommon plural form housen is from Middle English husen, housen. (The Old English nominative plural was simply hūs.)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "house (countable and uncountable, plural houses or (dialectal) housen or (chiefly humorous) hice)",
          "definitionGroups": [
            {
              "group": "A structure built or serving as an abode of human beings. [from 9th c.]",
              "entries": [
                {
                  "meaning": "(Hong Kong, only used in names) An apartment building within a public housing estate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Size and quality of residential accommodations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A building intended to contain a single household, as opposed to an apartment or condominium or building containing these.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The people who live in a house; a household. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "A building used for something other than a residence (typically with qualifying word). [from 10th c.]",
              "entries": [
                {
                  "meaning": "A place of business; a company or organisation, especially a printing press, a publishing company, or a couturier. [from 10th c.]",
                  "examples": [
                    "A small publishing house would have a contract with an independent fulfillment house."
                  ]
                },
                {
                  "meaning": "A place of public accommodation or entertainment, especially a public house, an inn, a restaurant, a theatre, or a casino; or the management thereof. [from 10th c.]",
                  "examples": [
                    "One more, sir, then I'll have to stop serving you – rules of the house, I'm afraid.",
                    "The house always wins."
                  ]
                },
                {
                  "meaning": "(historical) A workhouse.",
                  "examples": [
                    "To this the pauper replied that he did not want that, and that rather than be sent to the house he would look out for work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The audience for a live theatrical or similar performance. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A theatre.",
                  "examples": [
                    "After her swan-song, there wasn't a dry eye in the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A building where a deliberative assembly meets; whence the assembly itself, particularly a component of a legislature. [from 10th c.]",
                  "examples": [
                    "The petition was so ridiculous that the house rejected it after minimal debate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dynasty; a family with its ancestors and descendants, especially a royal or noble one. [from 10th c.]",
                  "examples": [
                    "A curse lay upon the House of Atreus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A place of rest or repose. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grouping of schoolchildren for the purposes of competition in sports and other activities. [from 19th c.]",
                  "examples": [
                    "I was a member of Spenser house when I was at school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal's shelter or den, or the shell of an animal such as a snail, used for protection. [from 10th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) One of the twelve divisions of an astrological chart. [from 14th c.]",
                  "examples": [
                    "Since there was a limited number of planets, houses and signs of the zodiac, the astrologers tended to reduce human potentialities to a set of fixed types and to postulate only a limited number of possible variations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartomancy) The fourth Lenormand card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess, now rare) A square on a chessboard, regarded as the proper place of a piece. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) The four concentric circles where points are scored on the ice. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lotto; bingo. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A children's game in which the players pretend to be members of a household.",
                  "examples": [
                    "As the babysitter, Emma always acted as the mother whenever the kids demanded to play house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialect) A small stand of trees in a swamp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sudoku) A set of cells in a Sudoku puzzle which must contain each digit exactly once, such as a row, column, or 3×3 box in classic Sudoku.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English housen, from Old English hūsian, from Proto-Germanic *hūsōną (“to house, live, dwell”), from the noun (see above). Compare Dutch huizen (“to live, dwell, reside”), German Low German husen (“to live, dwell, reside”), German hausen (“to live, dwell, reside”), Norwegian Nynorsk husa (“to house”), Faroese húsa (“to house”), Icelandic húsa (“to shelter, house”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "house (third-person singular simple present houses, present participle housing, simple past and past participle housed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep within a structure or container.",
                  "examples": [
                    "The car is housed in the garage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To admit to residence; to harbor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take shelter or lodging; to abide; to lodge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, astrology) To dwell within one of the twelve astrological houses.",
                  "examples": [
                    "Where Saturn houses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contain or cover mechanical parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contain one part of an object for the purpose of locating the whole.",
                  "examples": [
                    "The joists were housed into the side walls, rather than being hung from them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To drive to a shelter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To deposit and cover, as in the grave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To stow in a safe place; to take down and make safe.",
                  "examples": [
                    "to house the upper spars"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, slang, transitive) To eat.",
                  "examples": [
                    "All you wanna do is drink a fifth, house a lasagna, and hide in a dumpster until that baby stops crying."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from The Warehouse, a nightclub in Chicago, Illinois, USA, where the music became popular around 1985."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "house (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) House music.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}