{
  "word": "practical",
  "etymologies": [
    {
      "description": [
        "From Middle English practical, practicale, praktycall, from Medieval Latin practicālis."
      ],
      "adjectives": [
        {
          "description": "practical (comparative more practical, superlative most practical)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to, or based on, practice or action rather than theory or hypothesis.",
                  "examples": [
                    "Jack didn't get an engineering degree, but has practical knowledge of metalworking.",
                    "Modern engineering applies science to practical problems."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being likely to be effective and applicable to a real situation; able to be put to use.",
                  "examples": [
                    "Jack's knowledge has the practical benefit of giving us useful prototype parts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person, having skills or knowledge that are practical.",
                  "examples": [
                    "All in all, Jack's a very practical chap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater, not comparable) Of a prop: having some degree of functionality, rather than being a mere imitation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) Light fixtures used for set lighting and seen in the frame of a shot as part of the scenery.",
                  "examples": [
                    "Practical lighting can help sell the illusion that the film is a real situation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "practical (plural practicals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A part of an exam or series of exams in which the candidate has to demonstrate their practical ability",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A prop that has some degree of functionality, rather than being a mere imitation.",
                  "examples": [
                    "Practicals are used onstage as they would be used in real life. If the sound cue is to be from a radio or television, give qualities to the recording that will maintain the sense of the medium."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) A light fixture used for set lighting and seen in the frame of a shot as part of the scenery.",
                  "examples": [
                    "A naturalistic set is normally dressed with all the furnishings and props to be found in a real room. This includes electric light fittings which, when they actually light, are known as practicals."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Laboratory experiment, test or investigation",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}