{
  "word": "junction",
  "etymologies": [
    {
      "description": [
        "From Latin iūnctiō (“union, joining, uniting”), from iungō (“join, attach together”). Equivalent to join +‎ -tion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "junction (plural junctions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of joining, or the state of being joined.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where two things meet, especially where two roads meet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The boundary between two physically different materials, especially between conductors, semiconductors, or metals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The place where a distributary departs from the main stream.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A place where two or more railways or railroads meet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio, television) A point in time between two unrelated consecutive broadcasts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, Microsoft Windows) A kind of symbolic link to a directory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) In the Raku programming language, a construct representing a composite of several values connected by an operator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) electrical junction: a point or area where multiple conductors or semiconductors make physical contact.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "junction (third-person singular simple present junctions, present participle junctioning, simple past and past participle junctioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of roads or tracks) To form a junction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}