{
  "word": "bag",
  "etymologies": [
    {
      "description": [
        "From Middle English bagge, from Old Norse baggi (“bag, pack, satchel, bundle”) (whence also Old French bague (“bundle, package, sack”)); related to Old Norse bǫggr (“harm, shame; load, burden”), of uncertain origin. Perhaps from Proto-Indo-European *bʰak- (compare Welsh baich (“load, bundle”), Ancient Greek βάσταγμα (bástagma, “load”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bag (plural bags)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft container made out of cloth, paper, thin plastic, etc. and open at the top, used to hold food, commodities, and other goods.",
                  "examples": [
                    "Synonyms: (obsolete) poke, sack, tote"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container made of leather, plastic, or other material, usually with a handle or handles, in which you carry personal items, or clothes or other things that you need for travelling. Includes shopping bags, schoolbags, suitcases, and handbags.",
                  "examples": [
                    "Hyponyms: sack, pouch, tote, bindle, purse, backpack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) One's preference.",
                  "examples": [
                    "Synonyms: cup of tea, thing; see also Thesaurus:predilection",
                    "Acid House is not my bag: I prefer the more traditional styles of music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) An ugly woman.",
                  "examples": [
                    "Synonyms: dog, hag"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(LGBT, slang, US, derogatory) A fellow gay man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The cloth-covered pillow used for first, second, and third base.",
                  "examples": [
                    "The grounder hit the bag and bounced over the fielder’s head."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) First, second, or third base.",
                  "examples": [
                    "He headed back to the bag."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by \"the\") A breathalyzer, so named because it formerly had a plastic bag over the end to measure a set amount of breath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A collection of objects, disregarding order, but (unlike a set) in which elements may be repeated.",
                  "examples": [
                    "Synonym: multiset",
                    "A bag of three apples could be represented symbolically as {a,a,a}. Or, letting 'r' denote 'red apple' and 'g' denote 'green apple', then a bag of three red apples and two green apples could be denoted as {r,r,r,g,g}."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sac in animal bodies, containing some fluid or other substance.",
                  "examples": [
                    "the bag of poison in the mouth of some serpents",
                    "the bag of a cow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A pouch tied behind a man's head to hold the back-hair of a wig; a bag wig.",
                  "examples": [
                    "He had on a suit of Manchester velvet, Lined with white satten, a Bag, lace Ruffles, and a very handsome sword which the King had given to him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quantity of game bagged in a hunt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar) The scrotum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A unit of measure of cement equal to 94 pounds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) A dark circle under the eye, caused by lack of sleep, drug addiction etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A small envelope that contains drugs, especially narcotics.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(MLE, slang) £1000, a grand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A large number or amount.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bag (third-person singular simple present bags, present participle bagging, simple past and past participle bagged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put into a bag.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To take with oneself, to assume into one's score",
              "entries": [
                {
                  "meaning": "(informal) To catch or kill, especially when fishing or hunting.",
                  "examples": [
                    "We bagged three deer yesterday."
                  ]
                },
                {
                  "meaning": "To gain possession of something, or to make first claim on something.",
                  "examples": []
                },
                {
                  "meaning": "(slang) To steal.",
                  "examples": [
                    "\"I am sure nobody would mind,\" said Susan. \"It isn't as if we wanted to take them out of the house; we shan't take them even out of the wardrobe.\"\"I never thought of that, Su,\" said Peter. \"Of course, now you put it that way, I see. No one could say you had bagged a coat as long as you leave it in the wardrobe where you found it. And I suppose this whole country is in the wardrobe.\""
                  ]
                },
                {
                  "meaning": "(slang, African-American Vernacular) To take a woman away with one as a romantic or sexual interest.",
                  "examples": []
                },
                {
                  "meaning": "(slang) To arrest.",
                  "examples": [
                    "Synonym: nick"
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To furnish or load with a bag.",
              "entries": [
                {
                  "meaning": "(transitive, medicine) To provide with artificial ventilation via a bag valve mask (BVM) resuscitator.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, medicine) To fit with a bag to collect urine.",
                  "examples": [
                    "The patient was bagged for a urine analysis and stat electrolytes were drawn."
                  ]
                }
              ]
            },
            {
              "group": "To expose exterior shape or physical behaviour resembling that of a bag",
              "entries": [
                {
                  "meaning": "(obsolete, transitive, intransitive) To (cause to) swell or hang down like a full bag.",
                  "examples": [
                    "The skin bags from containing morbid matter.",
                    "The brisk wind bagged the sails."
                  ]
                },
                {
                  "meaning": "To hang like an empty bag.",
                  "examples": [
                    "And this uniform did not even fit me so well. But what is a little bagging on the waist and tightness under the arm when you are a gallant member of the British Royal Air Force?"
                  ]
                },
                {
                  "meaning": "(nautical, intransitive) To drop away from the correct course.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, intransitive) To become pregnant.",
                  "examples": [
                    "Venus shortly bagged, and ere long was Cupid bread"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To forget, ignore, or get rid of.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To show particular puffy emotion",
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To swell with arrogance.",
                  "examples": [
                    ""
                  ]
                },
                {
                  "meaning": "(slang, African American Vernacular) To laugh uncontrollably.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, slang) To criticise sarcastically.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}