{
  "word": "solecism",
  "etymologies": [
    {
      "description": [
        "Borrowed from French solécisme, from Latin soloecismus, from Ancient Greek σολοικισμός (soloikismós), from σόλοικος (sóloikos, “speaking incorrectly”), from Σόλοι (Sóloi), an ancient Athenian colony in Cilicia whose inhabitants spoke a dialect regarded by Athenians as a corrupted and barbarous form of Attic Greek. Compare Atticism."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "solecism (plural solecisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An erroneous or improper usage.",
                  "examples": [
                    "[…] to suppose that the general concern of this Country can be directed by thirteen heads, or one head without competent powers, is a solecism, the bad effects of which every Man who has had the practical knowledge to judge from, that I have, is fully convinced of; tho' none perhaps has felt them in so forcible, and distressing a degree."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Error in the use of language.",
                  "examples": [
                    "The \"simple\" metaphor, such as the instance given, becomes the \"continued\" metaphor when the analogy or similitude is worked out in a series of phrases and expressions based on the primary metaphor; it is in such \"continued metaphors\" that the solecism of \"mixed\" metaphors is likely to occur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A faux pas or breach of etiquette; a transgression against the norms of expected behavior.",
                  "examples": [
                    "Synonyms: see Thesaurus:error"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}