{
  "word": "redress",
  "etymologies": [
    {
      "description": [
        "From Middle English redressen, from Anglo-Norman radresser, redrescer, redrescier and Middle French redresser (“to stand (someone or something) up; to stand up again; to rebuild, to repair something damaged, to rectify, to restore; to obtain redress; to cure; (of hair) to stand on end; to revise a judgment”) (modern French redresser), from Old French redrecier (“to stand (someone or something) up; to stand up again”), from Old French re- (“prefix meaning ‘again, once more’”) (from Latin re-, from Proto-Italic *wre (“again”); further etymology uncertain) + Old French drechier, drecier, dresser (“to dress; to stand up”) (from Vulgar Latin *drēctiāre, a contracted form of *dirēctiāre, from Latin dīrectus (“straight”)).",
        "Compare Catalan redreçar, Spanish redreçar (obsolete), Italian redreçare, redrezare, redricciare, ridirizzare (all obsolete), ridrizzare, Late Latin redressare (“to repair; to set right”), Old Occitan redreisar, redresar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redress (countable and uncountable, plural redresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of redressing; a making right; amendment; correction; reformation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A setting right, as of injury, oppression, or wrong, such as the redress of grievances; hence, indemnification; relief; remedy; reparation.",
                  "examples": [
                    "Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who, or that which, gives relief; a redresser.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "redress (third-person singular simple present redresses, present participle redressing, simple past and past participle redressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put in order again; to set right; to revise.",
                  "examples": [
                    "Let us divide our labours; thou, where choice / Leads thee, or where most needs, whether to wind / The woodbine round this arbour, or direct / The clasping ivy where to climb; while I, / In yonder spring of roses intermixed / With myrtle, find what to redress till noon:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To set right (a wrong); to repair, (an injury); to make amends for; to remedy; to relieve from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make amends or compensation to; to relieve of anything unjust or oppressive; to bestow relief upon.",
                  "examples": [
                    "[Magna Charta] [I]f we, our justiciary, our bailiffs, or any of our officers, shall in any circumstance fail in the performance of them, towards any person, or shall break through any of these articles of peace and security, and the offence be notified to four barons chosen out of the five-and-twenty before mentioned, the said four barons shall repair to us, or our justiciary, if we are out of the realm, and laying open the grievance, shall petition to have it redressed without delay: and if it be not redressed by us, or if we should chance to be out of the realm, if it should not be redressed by our justiciary, within forty days,  […]  the said five-and-twenty barons, together with the community of the whole kingdom, shall distrain and distress us all the ways possible, by seizing our castles, lands, possessions, and in other manner they can, till the grievance is redressed according to their pleasure;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To put upright again; to restore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "re- +‎ dress."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redress (plural redresses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) The redecoration of a previously existing film set so that it can double for another set.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "redress (third-person singular simple present redresses, present participle redressing, simple past and past participle redressed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dress again.",
                  "examples": [
                    "I talked with her mother whenever she was in the room while I redressed the wound."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film) To redecorate a previously existing film set so that it can double for another set.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}