{
  "word": "parenchyma",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek παρέγχῠμα (parénkhuma, “anything poured in beside”), from πᾰρᾰ- (para-, “beside”) +‎ ἔγχῠμα (énkhuma, “instillation, content of a vessel”), given by the Greek anatomist Erasistratus to the peculiar substance of the lungs, liver, kidneys, and spleen, as if formed separately by the veins that run into them."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parenchyma (countable and uncountable, plural parenchymas or parenchymata)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The functional tissue of an organ as distinguished from the connective and supporting tissue.",
                  "examples": [
                    "Previously blood and air had been thought to mingle freely in the fleshy parenchyma of the lungs, but the microscope now revealed the membranous alveoli at the ends of the tracheo-bronchial ramifications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) The cellular tissue, typically soft and succulent, found chiefly in the softer parts of leaves, pulp of fruits, bark and pith of stems, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Cellular tissue lying between the body wall and the organs of invertebrate animals lacking a coelom, such as flatworms.",
                  "examples": [
                    "[I]n a Sponge, the Parenchyma, it seems, is but a kind of mucous gelly, which is very easily and cleerly wash'd away."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}