{
  "word": "hat",
  "etymologies": [
    {
      "description": [
        "From Middle English hat, from Old English hætt, from Proto-Germanic *hattuz (“hat”), from Proto-Indo-European *kadʰ- (“to guard, cover, care for, protect”). Cognate with North Frisian hat (“hat”), Danish hat (“hat”), Swedish hatt (“hat”), Icelandic hattur (“hat”), Latin cassis (“helmet”), Lithuanian kudas (“bird's crest or tuft”), Avestan 𐬑𐬀𐬊𐬛𐬀‎ (xaoda, “hat”), Persian خود‎ (xud, “helmet”), Welsh cadw (“to provide for, ensure”). Compare also hood."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hat (plural hats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A covering for the head, often in the approximate form of a cone, dome or  cylinder closed at its top end, and sometimes having a brim and other decoration.",
                  "examples": [
                    "There was a neat hat-and-umbrella stand, and the stranger's weary feet fell soft on a good, serviceable dark-red drugget, which matched in colour the flock-paper on the walls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A particular role or capacity that a person might fill.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively) Any receptacle from which numbers/names are pulled out in a lottery.",
              "entries": [
                {
                  "meaning": "(figuratively, by extension) The lottery or draw itself.",
                  "examples": [
                    "We're both in the hat: let's hope we come up against each other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A hat switch.",
                  "examples": [
                    "The third type of function allows you to check on the state of the joystick's buttons, axes, hats, and balls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, nonstandard, rare) The háček symbol.",
                  "examples": [
                    "I’lll have to leave it up to antiques experts to tell you when objects were marked that way, but I can tell you it’s called a “hacek” (with the hat over the “c” and pronounced “hacheck”.) It is used to show that a “c” is pronounced as “ch” and an “s” as “sh.” Sometimes linguists just call it the “hat.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming, informal) The caret symbol ^.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) User rights on a website, such as the right to edit pages others cannot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Cambridge University slang, obsolete) A student who is also the son of a nobleman (and so allowed to wear a hat instead of a mortarboard).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hat (third-person singular simple present hats, present participle hatting, simple past and past participle hatted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place a hat on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appoint as cardinal.",
                  "examples": [
                    "It was truly a breathtaking rise. From the quiet school, Pope Pius XI had jumped Father Verdier over the heads of innumerable Bishops, made him Archbishop of Paris. Soon he was to be hatted a Prince of the Church and put in charge of the Cathedral of Notre-Dame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shop for hats.",
                  "examples": [
                    "We might just go hatting this afternoon  […]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hat",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England or obsolete) simple past tense of hit",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}