{
  "word": "encounter",
  "etymologies": [
    {
      "description": [
        "From Middle English encountren, from Anglo-Norman encountrer, Old French encontrer (“to confront”), from encontre (“against, counter to”), from Late Latin incontrā (“in front of”) itself from Latin in (“in”) + contrā (“against”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "encounter (plural encounters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meeting, especially one that is unplanned or unexpected.",
                  "examples": [
                    "Their encounter was a matter of chance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hostile, often violent meeting; a confrontation, skirmish, or clash, as between combatants.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A match between two opposing sides.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sexuality) A sexual encounter; sexual activity, especially unplanned or unexpected, between people not in a sexual relationship, that usually does not lead to the establishment of a relationship, and may or may not happen again. A sexual encounter could be consensual or non-consensual; in the latter case, it is a sexual assault. A consensual sexual encounter that happens only once is commonly known as a one-night stand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) An extrajudicial killing or execution.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "encounter (third-person singular simple present encounters, present participle encountering, simple past and past participle encountered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To meet (someone) or find (something), especially unexpectedly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To confront (someone or something) face to face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To engage in conflict, as with an enemy.",
                  "examples": [
                    "Three armies encountered at Waterloo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, India) To execute someone extrajudicially.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}