{
  "word": "catalogue",
  "etymologies": [
    {
      "description": [
        "From Middle English cathaloge, from Old French catalogue, from Late Latin catalogus, itself from Ancient Greek κατάλογος (katálogos, “enrollment, register”), from καταλέγω (katalégō, “to recount, make a list”), from κατα- (kata-, “downwards, towards”) + λέγω (légō, “to say, to speak, to tell”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "catalogue (plural catalogues) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A systematic list of books, names, pictures, etc.",
                  "examples": [
                    "He intended to publish a flora of the island, and drafted out a synonymic catalogue, into which he inserted from time to time elaborate descriptions drawn up from living specimens of the species which he was able to procure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A complete (usually alphabetical) list of items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A list of all the publications in a library.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A retailer's magazine detailing the products they sell, allowing the reader to order them for delivery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A book printed periodically by a college, university, or other institution that gives a definitive description of the institution, its history, courses and degrees offered, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, dated) A directory listing.",
                  "examples": [
                    "The program generates a catalogue of the files on the cartridge selected by the user, reads the catalogue into memory and erases the cartridge copy, so that an up-to-date copy is always generated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A complete list of a recording artist's or a composer's songs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(singular) A series of unwelcome or unpleasant things, often similar.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "catalogue (third-person singular simple present catalogues, present participle cataloguing, simple past and past participle catalogued) (British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put into a catalogue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make a catalogue of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To add items (e.g. books) to an existing catalogue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) to value or sort stamps using a catalogue",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}