{
  "word": "decern",
  "etymologies": [
    {
      "description": [
        "First attested in late Middle English circa 1425; from the French décerner, from the Latin dēcernō (“I decide, pronounce a decision”), from dē (“of, from, away from”) + cernō (“I separate, distinguish”), whence the English cern. In Old French, the forms of décerner were frequently conflated with those of descerner, discerner; the two verbs were not clearly distinguished until the 16th century; hence, in English also, decern is found with the sense discern."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "decern (third-person singular simple present decerns, present participle decerning, simple past and past participle decerned)",
          "definitionGroups": [
            {
              "group": "Decide; determine; decree.",
              "entries": [
                {
                  "meaning": "(obsolete, transitive) Decide; determine (a matter disputed or doubtful).",
                  "examples": []
                },
                {
                  "meaning": "with simple object",
                  "examples": []
                },
                {
                  "meaning": "with infinitive or object clause",
                  "examples": []
                },
                {
                  "meaning": "intransitive",
                  "examples": []
                },
                {
                  "meaning": "(transitive) Decree by judicial sentence. Now a technical term of Scottish judicature; the use of the word decerns being necessary to constitute a decree.",
                  "examples": [
                    "He purſued Andrew Houſtoun upon his promiſe, to give him the like Sallary for the next year, and in abſence obtained him to be holden as confeſt and Decerned."
                  ]
                },
                {
                  "meaning": "with simple object",
                  "examples": []
                },
                {
                  "meaning": "Decree by judicial sentence that something be done.",
                  "examples": []
                },
                {
                  "meaning": "Decree a person etc. to be or to do something by judicial sentence.  (in the phrase “to decern in”, obsolete) To mulct in by decree of court.",
                  "examples": [
                    "He purſued Andrew Houſtoun upon his promiſe, to give him the like Sallary for the next year, and in abſence obtained him to be holden as confeſt and Decerned."
                  ]
                },
                {
                  "meaning": "intransitive",
                  "examples": []
                },
                {
                  "meaning": "transferred sense",
                  "examples": []
                }
              ]
            },
            {
              "group": "Discern.",
              "entries": [
                {
                  "meaning": "(obsolete, transitive) Distinguish or separate by their differences (things that differ, one thing from another).",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) Distinguish; discriminate between.",
                  "examples": []
                },
                {
                  "meaning": "See distinctly (with the eyes or the mind); distinguish (an object or fact); discern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}