{
  "word": "barbarian",
  "etymologies": [
    {
      "description": [
        "From Middle English barbarian, borrowed from Medieval Latin barbarinus (“Berber, pagan, foreigner”), from Latin barbaria (“foreign country”), from barbarus (“foreigner, savage”), from Ancient Greek βάρβαρος (bárbaros, “foreign, non-Greek, strange”), possibly onomatopoeic (mimicking foreign languages, akin to English blah blah). Cognate to Sanskrit बर्बर (barbara, “barbarian, non-Aryan, stammering, blockhead”)."
      ],
      "adjectives": [
        {
          "description": "barbarian (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to people, countries, or customs perceived as uncivilized or inferior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "barbarian (plural barbarians)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A non-Greek or a non-Roman citizen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An uncivilized or uncultured person, originally compared to the hellenistic Greco-Roman civilisation; often associated with fighting or other such shows of strength.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A person destitute of culture; a Philistine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Someone from a developing country or backward culture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A warrior, clad in fur or leather, associated with sword and sorcery stories.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cruel, savage, inhumane, brutal person; one without pity or empathy.",
                  "examples": [
                    "Thou fell barbarian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A foreigner, especially with barbaric qualities as in the above definitions.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}