{
  "word": "vignette",
  "etymologies": [
    {
      "description": [
        "First attested in 1751. From French vignette, diminutive of vigne (“vine”), from Latin vīnea, from vīnum (“wine”). Replaced earlier Middle English vynet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vignette (plural vignettes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A running ornament consisting of leaves and tendrils, used in Gothic architecture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A decorative design, originally representing vine branches or tendrils, at the head of a chapter, of a manuscript or printed book, or in a similar position.",
                  "examples": [
                    "Coordinate terms: colophon, coronis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Any small borderless picture in a book, especially an engraving, photograph, or the like, which vanishes gradually at the edge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A short story or anecdote that presents a scene or tableau, or paints a picture.",
                  "examples": [
                    "Synonyms: account, anecdote, depiction, portrayal, representation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) The central pictorial image on a postage stamp.",
                  "examples": [
                    "At the top of the stamp and centered slightly to the right is the wording, “U. S.  Postage,” in white Gothic. Below the vignette are the words, “Little White House,” in quotations, with “Warm Springs,” centered directly below in dark Gothic,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) The characteristic of a camera lens, either by deficiency in design or by mismatch of the lens with the film format, to produce an image smaller than the film's frame with a crudely focused border. Photographers may deliberately choose this characteristic for a special effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) Any effect in a photographic picture where qualities vanish towards the edges.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer graphics) A hardware deficiency (even occurring in most expensive models) of a computer display wherein the picture slants towards a colour or brightness towards the edges especially if viewed from an angle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A small sticker affixed to a vehicle windscreen to indicate that tolls have been paid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vignette (third-person singular simple present vignettes, present participle vignetting, simple past and past participle vignetted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make, as an engraving or a photograph, with a border or edge gradually fading away.",
                  "examples": [
                    "Long minutes afterwards the sun disclosed itself, high above the earth's rim, over a vignetted bank of edgeless mist."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}