{
  "word": "maniple",
  "etymologies": [
    {
      "description": [
        "From Late Middle English maniple, manyple (“scarf worn as vestment, maniple”), borrowed from Middle French, Old French maniple, manipule (“handful; troop of soldiers; scarf worn as vestment”) (modern French manipule), from Latin manipulus (“bundle, handful; troop of soldiers”), from manus (“hand”) (ultimately from Proto-Indo-European *(s)meh₂- (“to beckon, signal”)) + the weakened root of pleō (“to fill; to fulfil”) (ultimately from Proto-Indo-European *pleh₁- (“to fill”)). The English word is cognate with Italian manipulo (“scarf worn as vestment”) (obsolete), manipolo (“handful; troop of soldiers; scarf worn as vestment”).",
        "Sense 2 (“part of a priest’s vestments”) is probably from the fact that the item was originally carried in the hand. It may originate from a handkerchief or napkin worn by Roman consuls as an indication of rank."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "maniple (plural maniples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Rome, military) A division of the Roman army numbering 120 (or sometimes 60) soldiers exclusive of officers; (generally, obsolete) any small body of soldiers.",
                  "examples": [
                    "Coordinate terms: century, cohort",
                    "Holonym: legion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, chiefly historical) In Western Christianity, an ornamental band or scarf worn upon the left arm as a part of the vestments of a priest in the Roman Catholic Church, and sometimes the Church of England.",
                  "examples": [
                    "Synonym: (one sense) fanon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, informal) A hand; a fist.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from Late Latin manipulus (“bundle, handful; drachm”) (see further at etymology 1), modelled on Ancient Greek δράγμα (drágma, “bundle, handful; sheaf”) which was confused with δραχμή (drakhmḗ, “drachm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "maniple (plural maniples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A handful.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}