{
  "word": "buck",
  "etymologies": [
    {
      "description": [
        "From Middle English bukke, bucke, buc, from Old English buc, bucc, bucca (“he-goat, stag”), from Proto-West Germanic *bukk, *bukkō, from Proto-Germanic *bukkaz, *bukkô (“buck”), from Proto-Indo-European *bʰuǵ- (“ram”). Doublet of puck (billy goat).",
        "Currency-related senses hail from American English, a clipping of buckskin as a unit of trade among Indians and Europeans in frontier days (attested from 1748).",
        "The idea of rigidly standing implements is instilled by Dutch bok (“sawhorse”) as in zaagbok (“sawbuck”).",
        "The sense of an object indicating someone’s turn then occurred in American English, possibly originating from the game poker, where a knife (typically with a hilt made from a stag horn) was used as a place-marker to signify whose turn it was to deal. The place-marker was commonly referred to as a buck, which reinforced the term “pass the buck” used in poker, and eventually a silver dollar was used in place of a knife, which also led to a dollar being referred to as a buck."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buck (plural bucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male deer, antelope, sheep, goat, rabbit, hare, and sometimes the male of other animals such as the hamster, ferret and shad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) An uncastrated sheep, a ram.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A young buck; an adventurous, impetuous, dashing, or high-spirited young man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, obsolete) A fop or dandy.",
                  "examples": [
                    "This pusillanimous creature thinks himself, and would be thought, a buck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dated, derogatory) A black or Native American man.",
                  "examples": [
                    "She got so she'd rather have a buck nigger than me!"
                  ]
                }
              ]
            },
            {
              "group": "A unit of a particular currency",
              "entries": [
                {
                  "meaning": "(US, Australia, New Zealand, Canada, informal) A dollar (one hundred cents).",
                  "examples": [
                    "Can I borrow five bucks?"
                  ]
                },
                {
                  "meaning": "(South Africa, informal) A rand (currency unit).",
                  "examples": []
                },
                {
                  "meaning": "(UK, slang, obsolete) A sixpence.",
                  "examples": [
                    "three and a buck, i.e. three shillings and sixpence"
                  ]
                },
                {
                  "meaning": "(informal, rare) A euro.",
                  "examples": [
                    "2010 December 14,  Robert Hernandez,  Slurp:Killer Wine‎[1], page 129:Those fools are all probably sitting outside the pork store, recalling the incident about losing a thousand bucks with the fake Gajas, and chewing on their soggy stogies."
                  ]
                },
                {
                  "meaning": "(by extension, Australia, South Africa, US, informal) Money.",
                  "examples": [
                    "Corporations will do anything to make a buck."
                  ]
                },
                {
                  "meaning": "(finance) One million dollars.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) One hundred.",
                  "examples": [
                    "The police caught me driving a buck forty [140 miles per hour] on the freeway.",
                    "That skinny guy? C'mon, he can't weigh more than a buck and a quarter [125 pounds]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clipping of buckshot.",
                  "examples": [
                    "He loaded the shotgun with two rounds of double-ought buck."
                  ]
                }
              ]
            },
            {
              "group": "An implement the body of which is likened to a male sheep’s body due maintaining a stiff-legged position as if by stubbornness.",
              "entries": [
                {
                  "meaning": "(UK, dialect) The body of a post mill, particularly in East Anglia. See Wikipedia:Windmill machinery.",
                  "examples": []
                },
                {
                  "meaning": "A frame on which firewood is sawed; a sawhorse; a sawbuck.",
                  "examples": []
                },
                {
                  "meaning": "A leather-covered frame used for gymnastic vaulting.",
                  "examples": []
                },
                {
                  "meaning": "A wood or metal frame used by automotive customizers and restorers to assist in the shaping of sheet metal bodywork.",
                  "examples": [
                    "Plans in hand, Frank first paid his friend Raniero a visit, and the artisan quickly went to work on a fortified wood buck that would serve as a form for the Griffith 600 Series, as the car was formally known and marketed by Griffith Motors."
                  ]
                },
                {
                  "meaning": "(dated) An object of various types, placed on a table to indicate turn or status; such as a brass object, placed in rotation on a US Navy wardroom dining table to indicate which officer is to be served first, or an item passed around a poker table indicating the dealer or placed in the pot to remind the winner of some privilege or obligation when his or her turn to deal next comes.",
                  "examples": [
                    "pass the buck",
                    "the buck stops here"
                  ]
                },
                {
                  "meaning": "(by extension in the US, in certain metaphors or phrases) Blame; responsibility; scapegoating; finger-pointing.",
                  "examples": [
                    "pass the buck",
                    "the buck stops here"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, dated, dance) Synonym of buck dance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of mule (“type of cocktail with ginger ale etc.”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A kind of large marble in children's games.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buck (third-person singular simple present bucks, present participle bucking, simple past and past participle bucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To copulate, as bucks and does.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle Low German bucken (“to bend”) or Middle Dutch bucken, bocken (“to bend”), intensive forms of Old Saxon būgan and Old Dutch *būgan (“to bend, bow”), both from Proto-West Germanic *beugan, from Proto-Germanic *būganą (“to bend”), from Proto-Indo-European *bʰūgʰ- (“to bend”). Influenced in some senses by buck “male goat” (see above).",
        "Compare bow and elbow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "buck (third-person singular simple present bucks, present participle bucking, simple past and past participle bucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bend; buckle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a horse or similar saddle or pack animal) To leap upward arching its back, coming down with head low and forelegs stiff, forcefully kicking its hind legs upward, often in an attempt to dislodge or throw a rider or pack.",
                  "examples": [
                    "At the same time we got speared, the horses got speared too, and jumped and bucked all about, and got into the swamp."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a horse or similar saddle or pack animal) To throw (a rider or pack) by bucking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To subject to a mode of punishment which consists of tying the wrists together, passing the arms over the bent knees, and putting a stick across the arms and in the angle formed by the knees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To resist obstinately; oppose or object strongly.",
                  "examples": [
                    "The vice president bucked at the board's latest solution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, by extension) To move or operate in a sharp, jerking, or uneven manner.",
                  "examples": [
                    "The motor bucked and sputtered before dying completely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To overcome or shed (e.g., an impediment or expectation), in pursuit of a goal; to force a way through despite (an obstacle); to resist or proceed against.",
                  "examples": [
                    "The plane bucked a strong headwind.",
                    "Our managers have to learn to buck the trend and do the right thing for their employees.",
                    "John is really bucking the odds on that risky business venture. He's doing quite well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(riveting) To press a reinforcing device (bucking bar) against (the force of a rivet) in order to absorb vibration and increase expansion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry) To saw a felled tree into shorter lengths, as for firewood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) To output a voltage that is lower than the input voltage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, humorous or euphemistic) To fuck.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See beech."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buck (plural bucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) The beech tree.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bouken (“steep in lye”), ultimately related to the root of beech. Cognate with Middle High German büchen, Swedish byka, Danish byge and Low German būken."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buck",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lye or suds in which cloth is soaked in the operation of bleaching, or in which clothes are washed.",
                  "examples": [
                    "[…]  when you find the scurf to fall off, wash the Neck and other parts with Buck Lye made blood warm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cloth or clothes soaked or washed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buck (third-person singular simple present bucks, present participle bucking, simple past and past participle bucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To soak, steep or boil in lye or suds, as part of the bleaching process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wash (clothes) in lye or suds, or, in later usage, by beating them on stones in running water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To break up or pulverize, as ores.",
                  "examples": [
                    "This [ore mixture] was bucked or cobbed down to a 'peasy' size (i.e. the size of a pea) or less, using a flat-bottomed bucking hammer, and then riddled into coarse peasy and finer (sand-sized) 'smitham' grades."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bouk (“belly, trunk, body, hull of a ship, fishtrap, container”), from Old English būc (“belly, container”), from Proto-West Germanic *būk, from Proto-Germanic *būkaz. Doublet of bucket."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buck (plural bucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal) The body of a cart or waggon, especially the front part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, anatomy) Belly, breast, chest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal) Size.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buck (third-person singular simple present bucks, present participle bucking, simple past and past participle bucked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialectal, intransitive) To swell out.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}