{
  "word": "situation",
  "etymologies": [
    {
      "description": [
        "From Middle English situacioun, situacion, from Middle French situation, from Medieval Latin situatio (“position, situation”), from situare (“to locate, place”), from Latin situs (“a site”). Equivalent to situate +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "situation (plural situations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The combination of circumstances at a given moment; a state of affairs.",
                  "examples": [
                    "The United States is in an awkward situation with debt default looming."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The way in which something is positioned vis-à-vis its surroundings.",
                  "examples": [
                    "The Botanical Gardens are in a delightful situation on the river bank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place in which something is situated; a location.",
                  "examples": [
                    "[Hibíscus] speciòsus is the most splendid, and deserves a situation in every garden."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Position or status with regard to conditions and circumstances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) A position of employment; a post.",
                  "examples": [
                    "You take a morning paper from the top of the stack",
                    "And read the situations from the front to the back",
                    "The only job that's open need a man with a knack",
                    "So put it right back in the rack Jack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A difficult or unpleasant set of circumstances; a problem.",
                  "examples": [
                    "Synonyms: see Thesaurus:difficult situation",
                    "Boss, we've got a situation here…"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, film industry) An individual movie theater.",
                  "examples": [
                    "This survey includes all key situations (including Paramount Gulf Theaters) as well as suburban runs and small-town situations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An outfit, garment, or look.",
                  "examples": [
                    "She is working some sort of amazing burgundy chiffon situation with gold piping."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}