{
  "word": "efficient",
  "etymologies": [
    {
      "description": [
        "1398, “making,” from Old French, from Latin efficientem, nominative efficiēns, participle of efficere (“work out, accomplish”) (see effect). Meaning “productive, skilled” is from 1787. Efficiency apartment is first recorded 1930, American English."
      ],
      "adjectives": [
        {
          "description": "efficient (comparative more efficient, superlative most efficient)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "making good, thorough, or careful use of resources; not consuming extra. Especially, making good use of time or energy",
                  "examples": [
                    "An efficient process would automate all the routine work.",
                    "Our cleaners are almost too efficient: they throw away anything left out on a desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "expressing the proportion of consumed energy that was successfully used in a process; the ratio of useful output to total input",
                  "examples": [
                    "The motor is only 20% efficient at that temperature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "causing effects, producing results; bringing into being; initiating change (rare except in philosophical and legal expression efficient cause = causative factor or agent)",
                  "examples": [
                    "It was well said of Plotinus, that the stars were significant, but not efficient."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(proscribed, old use) effective, efficacious",
                  "examples": [
                    "The Efficient Cause is that from which emanates the force that produces the Effect"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "efficient (plural efficients)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) a cause; something that causes an effect",
                  "examples": [
                    "Some are without efficient, as God; others without matter, as Angels […]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}