{
  "word": "secular",
  "etymologies": [
    {
      "description": [
        "From Middle English seculer, from Old French seculer, from Latin saeculāris (“of the age”), from saeculum."
      ],
      "adjectives": [
        {
          "description": "secular (comparative more secular, superlative most secular)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not specifically religious; lay or civil, as opposed to clerical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Temporal; worldly, or otherwise not based on something timeless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Not bound by the vows of a monastic order.",
                  "examples": [
                    "secular clergy in Catholicism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Happening once in an age or century.",
                  "examples": [
                    "The secular games of ancient Rome were held to mark the end of a saeculum and the beginning of the next."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Continuing over a long period of time, long-term.",
                  "examples": [
                    "The long-term growth in population and income accounts for most secular trends in economic phenomena.",
                    "on a secular basis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) Centuries-old, ancient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrophysics, geology) Relating to long-term non-periodic irregularities, especially in planetary motion or magnetic field.",
                  "examples": [
                    "Laplace (1749–1827) \"saved the world\" by using probability theory to estimate the parameters accurately enough to show that the drift of Jupiter was not secular after all; the observations at hand had covered only a fraction of a cycle of an oscillation with a period of about 880 years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(atomic physics) Unperturbed over time.",
                  "examples": [
                    "The secular A and nonsecular B parts of hyperfine interaction for any particular frequencies να and νβ are derived from eqn.(21) by ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "secular (plural seculars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A secular ecclesiastic, or one not bound by monastic rules.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A church official whose functions are confined to the vocal department of the choir.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A layman, as distinguished from a clergyman.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}