{
  "word": "camouflage",
  "etymologies": [
    {
      "description": [
        "Borrowed from French camouflage, from camoufler (“to veil, disguise”), alteration (due to camouflet (“smoke blown in one's face”)) of Italian camuffare (“to muffle the head”), from ca- (from Italian capo (“head”)) + muffare (“to muffle”), from Medieval Latin muffula, muffla (“muff”). This Medieval Latin, from which there is also English muffle, is either derived from a Frankish *molfell (“soft garment made of hide”) from *mol (“softened, forworn”) (akin to Old High German molawēn (“to soften”), Middle High German molwic (“soft”)) + *fell (“hide, skin”), from Proto-Germanic *fellą (“skin, film, fleece”), or, an alternate etymology traces it to a Frankish *muffël (“a muff, wrap, envelope”) composed of *mauwa (“sleeve, wrap”) from Proto-Germanic *mawwō (“sleeve”) + *fell (“skin, hide”) from Proto-Germanic *fellą (“skin, film, fleece”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "camouflage (countable and uncountable, plural camouflages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disguise or covering up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of disguising.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The use of natural or artificial material on personnel, objects, or tactical positions with the aim of confusing, misleading, or evading the enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(textiles) A pattern on clothing consisting of irregularly shaped patches that are either greenish/brownish, brownish/whitish, or bluish/whitish, as used by ground combat forces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Resemblance of an organism to its surroundings for avoiding detection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clothes made from camouflage fabric, for concealment in combat or hunting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "camouflage (third-person singular simple present camouflages, present participle camouflaging, simple past and past participle camouflaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hide or disguise something by covering it up or changing the way it looks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}