{
  "word": "patriarch",
  "etymologies": [
    {
      "description": [
        "From Middle English patriark, patriarche, from Late Latin patriarcha; later reinforced by Old French patriarche, from Byzantine Greek πατριάρχης (patriárkhēs, “the founder of the tribe/family”), from Ancient Greek πατριά (patriá, “generation, ancestry, descent, tribe, family”) + -ᾰ́ρχης (-árkhēs, “-arch”), with some senses likely influenced directly by Latin pāter (“father”) or Ancient Greek πᾰτήρ (patḗr, “father”). Compare matriarch. Surface analysis patri- +‎ -arch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patriarch (plural patriarchs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The highest form of bishop, in the ancient world having authority over other bishops in the province but now generally as an honorary title; in Roman Catholicism, considered a bishop second only to the Pope in rank. [from 9th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In Biblical contexts, a male leader of a family, tribe or ethnic group, especially one of the twelve sons of Jacob (considered to have created the twelve tribes of Israel) or (in plural) Abraham, Isaac and Jacob. [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A founder of a political or religious movement, an organization or an enterprise. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An old leader of a village or community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male progenitor of a genetic or tribal line, or of a clan or extended family.",
                  "examples": [
                    "Synonyms: ancestor, forebear, forefather"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male head of a household or nuclear family.",
                  "examples": [
                    "Synonyms: highfather, paterfamilias"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}