{
  "word": "prawn",
  "etymologies": [
    {
      "description": [
        "First attested early 1400s as various Middle English forms prayne, prane, praune, and prawne, which present no clear cognates in languages other than English.  The forms suggest a hypothetical Old English form *prægn, where *æg would have evolved into Middle English *ay, but it is unclear if the word is of Germanic origin, from another European language, or loaned from a substrate. In the Isle of Wight, a word prankle (\"prawn\") is recorded and thought to be related. Century, following Skeat, suggested transposition of an unrecorded Old French *parne, *perne related to Spanish perna (“a flat shellfish”), Old Italian perna and diminutive pernochie, parnocchie, glossed as \"shrimps or prawne, fishes\" by John Florio, but the OED considers Florio's entry incorrect and the suggested connection semantically and phonologically implausible.",
        "(woman with toned body but unattractive face): From the idea of discarding the head of a prawn before eating it."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prawn (countable and uncountable, plural prawn or prawns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crustacean of the suborder Dendrobranchiata.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Commonwealth) A crustacean, sometimes confused with shrimp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, colloquial, derogatory) Synonym of butterface: A woman with an attractive body but an unattractive face.",
                  "examples": [
                    "She's a prawn!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, slang) A fool, an idiot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "prawn (third-person singular simple present prawns, present participle prawning, simple past and past participle prawned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fish for prawns.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Alternate spelling of pron (pronounced identically with cot-caught merger), which in turn is a corrupted spelling of porn."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prawn (plural prawns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of porn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}