{
  "word": "egg",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English eg, egg, egge (“egg of a domestic or wild fowl; egg of a snake”)  [and other forms]  (originally Northern England and Northeast Midlands), from Old Norse egg (“egg”), from Proto-Germanic *ajją (“egg”) (by Holtzmann’s law), from Proto-Indo-European *h₂ōwyóm (“egg”), probably from *h₂éwis (“bird”), from *h₂ew- (“to clothe oneself, dress; to be dressed”) (in the sense of an animal clothed in feathers). Doublet of huevo, oeuf, and ovum.",
        "The native English ey  [and other forms]  (plural eyren) (obsolete), from Old English ǣġ, is also derived from Proto-Germanic *ajją. It survived into the 16th century before being fully displaced by egg.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "egg (countable and uncountable, plural eggs)",
          "definitionGroups": [
            {
              "group": "(countable, zoology)",
              "entries": [
                {
                  "meaning": "An approximately spherical or ellipsoidal body produced by birds, insects, reptiles, and other animals, housing the embryo within a membrane or shell during its development.",
                  "examples": [
                    "Synonyms: (obsolete) ey, (Castilianism) huevo, (humorous, or in French cooking) oeuf",
                    "We made a big omelette with three eggs. (countable)",
                    "I should determine the minimal amount of egg required to make good mayonnaise. (uncountable)",
                    "The farmer offered me some fresh eggs, but I told him I was allergic to egg. (countable, uncountable)"
                  ]
                },
                {
                  "meaning": "(specifically, countable) The edible egg (sense 1.1) of a domestic fowl such as a duck, goose, or, especially, a chicken; (uncountable) the contents of such an egg or eggs used as food.",
                  "examples": [
                    "Synonyms: (obsolete) ey, (Castilianism) huevo, (humorous, or in French cooking) oeuf",
                    "We made a big omelette with three eggs. (countable)",
                    "I should determine the minimal amount of egg required to make good mayonnaise. (uncountable)",
                    "The farmer offered me some fresh eggs, but I told him I was allergic to egg. (countable, uncountable)"
                  ]
                },
                {
                  "meaning": "(by extension, countable) A food item shaped to resemble an egg (sense 1.1.1), such as a chocolate egg.",
                  "examples": []
                },
                {
                  "meaning": "(also cytology) Synonym of ovum (“the female gamete of an animal”); an egg cell.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) A thing which looks like or is shaped like an egg (sense 1.1).",
              "entries": [
                {
                  "meaning": "A swelling on one's head, usually large or noticeable, resulting from an injury.",
                  "examples": [
                    "Synonym: (Canada, US, informal) goose egg"
                  ]
                },
                {
                  "meaning": "(architecture) Chiefly in egg and dart: an ornamental oval moulding alternating in a row with dart or triangular shapes.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly sports) A score of zero; specifically (cricket), a batter's failure to score; a duck egg or duck's egg.",
                  "examples": [
                    "Synonyms: (Canada, US, informal) goose egg, (billiards, racquet sports (especially tennis)) love"
                  ]
                },
                {
                  "meaning": "(military, dated) A bomb or mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, figuratively)",
              "entries": [
                {
                  "meaning": "Senses relating to people.",
                  "examples": [
                    "a bad egg    a good egg    a tough egg    Cheerio, old egg!"
                  ]
                },
                {
                  "meaning": "(informal, dated) A person; a fellow.",
                  "examples": [
                    "a bad egg    a good egg    a tough egg    Cheerio, old egg!"
                  ]
                },
                {
                  "meaning": "(derogatory, ethnic slur, rare) A white person considered to be overly infatuated with East Asia.",
                  "examples": [
                    "Hypernym: race traitor",
                    "Hyponyms: Koreaboo, wapanese, weeaboo, weeb, wumao"
                  ]
                },
                {
                  "meaning": "(Internet slang, derogatory, dated) A user of the microblogging service Twitter identified by the default avatar (historically an image of an egg (sense 1.1.1)) rather than a custom image; hence, a newbie or noob.",
                  "examples": []
                },
                {
                  "meaning": "(transgender slang) A person regarded as having not yet realized they are transgender, who has not yet come out as transgender, or who is in the early stages of transitioning; also, one's lack of awareness that one is transgender.",
                  "examples": [
                    "to crack someone’s egg (to cause someone to realize they are transgender)"
                  ]
                },
                {
                  "meaning": "(New Zealand, derogatory) A foolish or obnoxious person.",
                  "examples": [
                    "Shut up, you egg!"
                  ]
                },
                {
                  "meaning": "(derogatory, obsolete) A young person.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Something regarded as containing a (usually bad) thing at an early stage.",
                  "examples": []
                },
                {
                  "meaning": "(computing) One of the blocks of data injected into a program's address space for use by certain forms of shellcode, such as \"omelettes\".",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "egg (third-person singular simple present eggs, present participle egging, simple past and past participle egged)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To throw (especially rotten) eggs (noun sense 1.1.1) at (someone or something).",
                  "examples": [
                    "The angry demonstrators egged the riot police.",
                    "The students were caught egging the principal’s car as a prank."
                  ]
                },
                {
                  "meaning": "To inadvertently or intentionally distort (the circular cross-section of something, such as tube) to an elliptical or oval shape.",
                  "examples": [
                    "After I cut the tubing, I found that I had slightly egged it in the vise."
                  ]
                },
                {
                  "meaning": "(cooking) To coat (a food ingredient) with or dip (a food ingredient) in beaten egg (noun sense 1.1.1) during the process of preparing a dish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To collect the eggs (noun sense 1.1) of wild birds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English eggen (“to urge on; to entice, incite, lure, tempt; to encourage, exhort, stimulate; (reflexive) to bestir (oneself); to challenge, taunt; to enrage, irritate”), from Old Norse eggja (“to incite, egg on”), from egg (“an edge”), from Proto-Germanic *agjō (“a corner; an edge”), ultimately from Proto-Indo-European *h₂eḱ- (“sharp”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "egg (third-person singular simple present eggs, present participle egging, simple past and past participle egged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete except in egg on) To encourage, incite, or urge (someone).",
                  "examples": [
                    "Synonyms: (obsolete) edge, provoke, tempt"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}