{
  "word": "gloze",
  "etymologies": [
    {
      "description": [
        "From Middle English glosen, from Old French gloser, from Medieval Latin glossa. More at gloss."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gloze (plural glozes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A comment in the margin; explanatory note; gloss; commentary.",
                  "examples": [
                    "So we o’ershroud stars and roses,",
                    "Cherub and trophy and garland.",
                    "Nothings grow something which quietly closes",
                    "Heaven’s earnest eye,—not a glimpse of the far land",
                    "Gets through our comments and glozes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Flattery.",
                  "examples": [
                    "[…]  if Virtue aught may crave, or Heav’n,",
                    "Beware, alike, of factious leagues, impure,",
                    "And courtly glozes vile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(False) appearance.",
                  "examples": [
                    "We have flattered thee, O Lord, with our tongues, and dissembled in our double hearts like the Israelites, whom thou hast fearfully punished in the sight of all the world, and saluted thee long with Judas kiss; to wit, with a vizard and show of religion, with the gloze of outward profession, drawing near thee with our lips, but our hearts far from thee  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specious show, a deceit.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gloze (third-person singular simple present glozes, present participle glozing, simple past and past participle glozed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary) To extenuate, explain away, gloss over.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use flattering language.",
                  "examples": [
                    "As he pretended, struck, then stern and silent,",
                    "Till presently assuming, like his father,",
                    "A courtesy minute and over-studied,",
                    "He glozed us with his thanks:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To smooth over; to palliate by specious explanation.",
                  "examples": [
                    "On this ground it is that Christianity works its way in Christianizing a community—if only it have free scope. It does this, not by glozing the evil that is in the world; not by extenuating, or by exaggerating the damage which human nature has sustained; but it does so by raising, in all minds, the ideal of human nature  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give a shine to (something or someone).",
                  "examples": [
                    "The scanty light glozed them with the glory of day, and, forgetful of pain and thirst and hunger, and of the menace of death, they sank upon the floor and cried, keeping fast hold of each other the while."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}