{
  "word": "friend",
  "etymologies": [
    {
      "description": [
        "From Middle English frend, freend, from Old English frēond (“friend”, literally “loving[-one], lover”), from Proto-West Germanic *friund, from Proto-Germanic *frijōndz (“lover, friend”), from Proto-Indo-European *preyH- (“to like, love”), equivalent to free +‎ -nd.",
        "Cognate with Saterland Frisian Fjund, Früünd (“friend”), West Frisian freon, froen, freondinne (“friend”), Dutch vriend (“friend”), Low German Frund, Fründ (“friend, relative”), Luxembourgish Frënd (“friend”), German Freund (“friend”), Danish frænde (“kinsman”), Swedish frände (“kinsman, relative”), Icelandic frændi (“kinsman”), Gothic 𐍆𐍂𐌹𐌾𐍉𐌽𐌳𐍃 (frijōnds, “friend”). More at free.",
        "Other cognates include Russian приятель (prijatelʹ, “friend”) and Sanskrit प्रिय (priyá-, “beloved”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "friend (plural friends)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, typically someone other than a family member, spouse or lover, whose company one enjoys and towards whom one feels affection.",
                  "examples": [
                    "The only reward of virtue is virtue; the only way to have a friend is to be one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An associate who provides assistance.",
                  "examples": [
                    "The Automobile Association is every motorist's friend.   The police is every law-abiding citizen's friend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person with whom one is vaguely or indirectly acquainted.",
                  "examples": [
                    "a friend of a friend;  I added him as a friend on Facebook, but I hardly know him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who backs or supports something.",
                  "examples": [
                    "I’m not a friend of cheap wine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) An object or idea that can be used for good.",
                  "examples": [
                    "Fruit is your friend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, ironic, used only in the vocative) Used as a form of address when warning someone.",
                  "examples": [
                    "You’d better watch it, friend."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(object-oriented programming) A function or class granted special access to the private and protected members of another class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) A spring-loaded camming device.",
                  "examples": [
                    "Since they were introduced in the 1970s, friends have revolutionized climbing, making protection possible in previously impossible places  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) A lover; a boyfriend or girlfriend.",
                  "examples": [
                    "Time has been, when a gentleman wanted a friend, I could supply him with choice in an hour; but the market is spoiled, and a body might as soon produce a hare or a partridge  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, obsolete) A relative, a relation by blood or marriage.",
                  "examples": [
                    "Friends agree best at a distance.",
                    "Make friends of framet folk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, usually preceded by \"and\") Used to refer collectively to a group of associated individuals, especially those comprising a cast, company, or crew",
                  "examples": [
                    "Synonyms: and company, et al.",
                    "Meanwhile on The View, Whoopi Goldberg and friends continue to issue forced apologies for their assumptive comments regarding non-profit organisation Turning Point USA..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "friend (third-person singular simple present friends, present participle friending, simple past and past participle friended)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To act as a friend to, to befriend; to be friendly to, to help.",
                  "examples": [
                    "Lo sluggish Knight the victors happie pray: / So fortune friends the bold [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add (a person) to a list of friends on a social networking site; to officially designate (someone) as a friend.",
                  "examples": [
                    "The difference between responses to the statement, \"If someone friends me, I will friend them,\" and \"If I friend someone, I expect them to friend me back,\" is telling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}