{
  "word": "scramble",
  "etymologies": [
    {
      "description": [
        "Origin uncertain. Perhaps from earlier dialectal scramble, scrammel (“to collect or rake together with the hands”), from scramb (“to pull or scrape together with the hands”) +‎ -le (frequentative suffix) (compare Dutch schrammen (“to graze, brush, scratch”)); or alternatively from a nasalised form of scrabble (“to scrape or scratch quickly”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scramble (plural scrambles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rush or hurry, especially making use of the limbs against a surface.",
                  "examples": [
                    "a last-minute scramble to the finish line"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) An emergency defensive air force mission to intercept attacking enemy aircraft.",
                  "examples": [
                    "There goes the siren that warns of the air raid / Then comes the sound of the guns sending flak / Out for the scramble we've got to get airborne / Got to get up for the coming attack."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A motocross race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any frantic period of competitive activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gridiron football) An impromptu maneuver or run by a quarterback, attempting to gain yardage or avoid being tackled behind the line of scrimmage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A statistic used in assessing a player's short game, consisting of a chip or putt from under 50 yards away that results in requiring one putt or less on the green.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A variant of golf in which each player in a team tees off on each hole, and the players decide which shot was best. Every player then plays their second shot from within a club length of where the best ball has come to rest, and the procedure is repeated until the hole is finished.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scramble (third-person singular simple present scrambles, present participle scrambling, simple past and past participle scrambled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move hurriedly to a location, especially by using all limbs against a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proceed to a location or an objective in a disorderly manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of food ingredients, usually including egg) To thoroughly combine and cook as a loose mass.",
                  "examples": [
                    "I scrambled some eggs with spinach and cheese."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To process (telecommunication signals) to make them unintelligible to an unauthorized listener.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To quickly deploy (vehicles, usually aircraft) to a destination in response to an alert, usually to intercept an attacking enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, military) To be quickly deployed in this manner.",
                  "examples": [
                    "As the planes scrambled, four of his veterans went up: Tom Lanphier, Rex Barber, Joe Moore and Jim McLanahan. They had waited with other Lightnings at 30,000 feet and dived on a formation of eleven Zeroes far below, working in pairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, sports) To partake in motocross.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To ascend rocky terrain as a leisure activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To gather or collect by scrambling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To struggle eagerly with others for something thrown upon the ground; to go down upon all fours to seize something; to catch rudely at what is desired.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw something down for others to compete for in this manner.",
                  "examples": [
                    "[…]  Father Boniface standing on the verandah of the Monastery on a Sunday afternoon “scrambling” lollies to the kids  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}