{
  "word": "purge",
  "etymologies": [
    {
      "description": [
        "From Middle English purgen, from Old French purgier, from Latin pūrgō (“I make pure, I cleanse”), from pūrus (“clean, pure”) + agō (“I make, I do”). Related to fire. (See further etymology there)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purge (plural purges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of purging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An evacuation of the bowels or a vomiting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cleansing of pipes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forcible removal of people, for example, from political activity.",
                  "examples": [
                    "Stalin liked to ensure that his purges were not reversible."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which purges; especially, a medicine that evacuates the intestines; a cathartic.",
                  "examples": [
                    "he prescribes a Purge or a Vomit"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "purge (third-person singular simple present purges, present participle purging, simple past and past participle purged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean thoroughly; to cleanse; to rid of impurities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, religion) To free from sin, guilt, or the burden or responsibility of misdeeds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove by cleansing; to wash away.",
                  "examples": [
                    "Purge away our sins, for thy name’s sake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, medicine) To void or evacuate (the bowels or the stomach); to defecate or vomit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, medicine) To cause someone to purge, operate on (somebody) as or with a cathartic or emetic, or in a similar manner.",
                  "examples": [
                    "\"What did they die of?” I asked.\"Fevers. The doctor came and bled them and purged them, but they still died.\"\"He bled and purged babies?\"\"They were two and three. He said it would break the fever. And it did. But they … they died anyway.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a person) To forcibly remove, e.g., from political activity.",
                  "examples": [
                    "Deng Xiaoping was purged twice during the Cultural Revolution, but managed to return to power after Mao's death."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of an organization, by extension) To forcibly remove people from.",
                  "examples": [
                    "Cromwell had Colonel Pride purge Parliament of royalists who opposed Charles I's execution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To clear of a charge, suspicion, or imputation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clarify; to clear the dregs from (liquor).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become pure, as by clarification.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have or produce frequent evacuations from the intestines, as by means of a cathartic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trim, dress, or prune.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}