{
  "word": "blather",
  "etymologies": [
    {
      "description": [
        "From Middle English bletheren, bloderen, from Old Norse blaðra (“to speak inarticulately, talk nonsense”). Cognate with Scots blether, bladder, bledder (“to blather”), dialectal German bladdern (“to talk nonsense, blather”), Norwegian bladra (“to babble, speak imperfectly”), Icelandic blaðra (“to twaddle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blather (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) Nonsensical or foolish talk.",
                  "examples": [
                    "That is the worst of being in an Irish regiment, nothing can be done widout ever so much blather;"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blather (third-person singular simple present blathers, present participle blathering, simple past and past participle blathered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, derogatory) To talk rapidly without making much sense.",
                  "examples": [
                    "On and on he blathered, taking refuge in the one thing he felt lent him superiority: words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, derogatory) To say (something foolish or nonsensical); to say (something) in a foolish or overly verbose way.",
                  "examples": [
                    "Then, just before the wedding, the old man feels he’s honor bound to tell his future son-in-law the secret of his past; so the damned idiot blathers the whole story of his killing the man and breaking jail!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blather (plural blathers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of bladder.",
                  "examples": [
                    "[…]  on Vlisses Circe did bestowe",
                    "A blather, where the windes imboweld were,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}