{
  "word": "not",
  "etymologies": [
    {
      "description": [
        "From Middle English not, nat, variant of noght, naht (“not, nothing”), from Old English *nōht, nāht (“nought, nothing”), short for nōwiht, nāwiht (“nothing”, literally “not anything”), corresponding to ne (“not”) + ōwiht, āwiht (“anything”), corresponding to ā (“ever, always”) + wiht (“thing, creature”).",
        "Cognate with Scots nat, naucht (“not”), Saterland Frisian nit (“not”), West Frisian net (“not”), Dutch niet (“not”), German nicht (“not”). Compare nought, naught and aught. More at no, wight, whit.",
        "Alternatively, from Middle English ne (“not”) or none + oughte (“ought, should”), with the latter reinforcing the former."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "not (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Negates the meaning of the modified verb.",
                  "examples": [
                    "People have got to know whether or not their president is a crook. Well, I'm not a crook. I've earned everything I've got."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To no degree.",
                  "examples": [
                    "That is not red; it's green.",
                    "It's not you, it's me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(understatement, litotes) Used to indicate the opposite or near opposite, often in a form of understatement.",
                  "examples": [
                    "That day was not the best day of my life. (meaning the day was bad or awful)",
                    "It was not my favorite movie of all time. (meaning the speaker dislikes or strongly dislikes the movie)",
                    "In the not too distant future my view on the matter might be not a million miles away from yours."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "not (plural nots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of NOT",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}