{
  "word": "itch",
  "etymologies": [
    {
      "description": [
        "From Middle English icche, ȝicche, from Old English ġiċċe (“an itch”), from Proto-Germanic *jukjǭ (“an itch”), of unknown origin. Cognate with Scots yeuk (“an itch, itchiness”), Dutch jeuk (“an itch”), German jucken."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "itch (plural itches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sensation felt on an area of the skin that causes a person or animal to want to scratch said area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A constant teasing desire or want.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English icchen, ȝicchen, from Old English ġiċċan, ġyċċan (“to itch”), from Proto-West Germanic *jukkjan (“to itch”), of unknown origin. Cognate with Scots yeuk (“to itch”), West Frisian jûkje (“to itch”), Dutch jeuken (“to itch”), Low German jocken (“to itch”), German jucken (“to itch”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "itch (third-person singular simple present itches, present participle itching, simple past and past participle itched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative) To feel itchy; to feel a need to be scratched.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a constant, teasing urge; to feel strongly motivated; to want or desire something.",
                  "examples": [
                    "He started learning to drive and he has been itching for opportunities to practice ever since."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to feel an itch.",
                  "examples": [
                    "My head is suddenly itching me like mad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To scratch or rub so as to relieve an itch.",
                  "examples": [
                    "\"What makes you suspect him?\" Max asked as he itched his neck."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}