{
  "word": "copper",
  "etymologies": [
    {
      "description": [
        "From Middle English coper, from Old English coper, copor (“copper”), from Late Latin cuprum (“copper”), contraction of Latin aes Cyprium (literally “Cyprian brass”), from Ancient Greek Κύπρος (Kúpros, “Cyprus”). Cognate with Dutch koper (“copper”), German Kupfer (“copper”), Icelandic kopar (“copper”)."
      ],
      "adjectives": [
        {
          "description": "copper (comparative more copper, superlative most copper)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made of copper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the reddish-brown colour/color of copper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "copper (countable and uncountable, plural coppers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A reddish-brown, malleable, ductile metallic element with high electrical and thermal conductivity, symbol Cu, and atomic number 29.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The reddish-brown colour/color of copper.",
                  "examples": [
                    "copper:"
                  ]
                }
              ]
            },
            {
              "group": "(countable, dated) Any of various specialized items that are made of copper, where the use of copper is either traditional or vital to the function of the item.",
              "entries": [
                {
                  "meaning": "(countable) A copper coin, typically of a small denomination, such as a penny.",
                  "examples": [
                    "\"I don't want to spoil any comparison you are going to make,\" said Jim, \"but I was at Winchester and New College.\" ¶ \"That will do,\" said Mackenzie. \"I was dragged up at the workhouse school till I was twelve. Then I ran away and sold papers in the streets, and anything else that I could pick up a few coppers by—except steal. […].\""
                  ]
                },
                {
                  "meaning": "(UK, Australia, dated) A large pot, often used for heating water or washing clothes over a fire. In Australasia at least, it could also be a fixed installation made of copper, with a fire underneath and its own chimney. Generally made redundant by the advent of the washing machine.",
                  "examples": [
                    "Mum would heat the water in a copper in the kitchen and transfer it to the tin bath.",
                    "I explain that socks can’t be boiled up in the copper with the sheets and towels or they shrink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various lycaenid butterflies with copper-coloured upperwings, especially those of the genera Lycaena and Paralucia.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "copper (third-person singular simple present coppers, present participle coppering, simple past and past participle coppered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sheathe or coat with copper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From cop (“to take, capture, seize”) +‎ -er (agent noun suffix)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "copper (plural coppers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, law enforcement) A police officer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}