{
  "word": "pitchfork",
  "etymologies": [
    {
      "description": [
        "From Middle English pichfork, pycchefork, pychforke, pikeforke, pikkforke, pic-forcke, equivalent to pitch +‎ fork."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pitchfork (plural pitchforks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An agricultural tool comprising a fork with sparse, light tines, attached to a long handle, used for pitching hay (especially loose hay) high up onto a stack (as on a wagon or haystack, or into a haymow).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A similar fork with slightly more and heavier tines, used for mucking stalls and pitching soiled bedding into a wagon or manure spreader.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(casual, loosely) Any fork used for farm labor, even a digging fork (but such usage is often considered ignorant by experienced farmers).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) A tuning fork.",
                  "examples": [
                    "I went around with a pitchfork [tuning fork]  in my pocket, and I'd hit it whenever I thought of it, and I developed perfect pitch  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pitchfork (third-person singular simple present pitchforks, present participle pitchforking, simple past and past participle pitchforked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To toss or carry with a pitchfork.",
                  "examples": [
                    "The hay was soon pitchforked onto the wagon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To throw suddenly.",
                  "examples": [
                    "We have taken an age-old country, and we have suddenly, in 30 years, pitchforked it into the middle of the factory system."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}