{
  "word": "stifle",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Late Middle English stuflen (“to have difficulty breathing due to heat, stifle; to suffocate by drowning, drown”) [and other forms]; further etymology uncertain, perhaps from stuffen (“to kill by suffocation; to stifle from heat; to extinguish, suppress (body heat, breath, humour, etc.); to deprive a plant of the conditions necessary for growth, choke”) + -el- (derivational infix in verbs, often denoting diminutive, intensive, or repetitive actions or events). Stuffen is derived from Old French estofer, estouffer (“to choke, strangle, suffocate; (figuratively) to inhibit, prevent”) [and other forms] (modern French étouffer), a variant of estoper, estuper (“to block, plug, stop up; to stiffen, thicken”) (modern French étouper (“to caulk”)), influenced by estofer (“to pad, stuff; to upholster”) (modern French étoffer). Estoper is derived from Vulgar Latin *stuppāre, from Latin stuppa (“coarse flax, tow”) (as a stuffing material; from Ancient Greek στύπη (stúpē), στύππη (stúppē) (compare στυππεῖον (stuppeîon)); probably from Pre-Greek ) + -āre. According to the Oxford English Dictionary a derivation from Old Norse stífla (“to dam; to choke, stop up”) “appears untenable on the ground both of form and sense”.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stifle (plural stifles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) An act or state of being stifled.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stifle (third-person singular simple present stifles, present participle stifling, simple past and past participle stifled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To make (an animal or person) unconscious or cause (an animal or person) death by preventing breathing; to smother, to suffocate.",
                  "examples": [
                    "I took my leave, being half stifled with the closeness of the room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, hyperbolic) To cause (someone) difficulty in breathing, or a choking or gagging feeling.",
                  "examples": [
                    "The heat was stifling the children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To prevent (a breath, cough, or cry, or the voice, etc.) from being released from the throat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (something) unable to be heard by blocking it with some medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive, figuratively)",
              "entries": [
                {
                  "meaning": "(transitive) To keep in, hold back, or repress (something).",
                  "examples": [
                    "Synonyms: hinder, restrain, smother, suppress, throttle",
                    "The army stifled the rebellion."
                  ]
                },
                {
                  "meaning": "(transitive) To prevent (something) from being revealed; to conceal, to hide, to suppress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, agriculture (sericulture)) To treat (a silkworm cocoon) with steam as part of the process of silk production.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To die of suffocation.",
                  "examples": [
                    "Two firemen tragically stifled in yesterday’s fire when trying to rescue an old lady from her bedroom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, hyperbolic) To feel smothered; to find it difficult to breathe.",
                  "examples": [
                    "The heat felt stifling."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is derived from Middle English stifle (“joint between the femur and tibia of a quadruped”) [and other forms]; further etymology uncertain, probably derived from Anglo-Norman estive (“leg”), and Old French estive (“leg”) (compare Old French estival (“boot, shoe”)).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stifle (plural stifles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zootomy) The joint between the femur and tibia in the hind leg of various four-legged mammals, especially horses, corresponding to the knee in humans.",
                  "examples": [
                    "Synonym: stifle joint"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(veterinary medicine) A bone disease of this region.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stifle (third-person singular simple present stifles, present participle stifling, simple past and past participle stifled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a dog, horse, or other four-legged mammal) to dislocate or sprain its stifle joint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}