{
  "word": "taenia",
  "etymologies": [
    {
      "description": [
        "From Latin taenia, from Ancient Greek ταινία (tainía, “ribbon, tape”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "taenia (plural taenias or taeniae)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A ribbon worn in the hair in ancient Greece.",
                  "examples": [
                    "Taenia and ivy leaves are added by hand. Figure wears a taenia horizontally over her brow and a spray of ivy in her hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture, Doric architecture) A band between the frieze and architrave in the Doric order.",
                  "examples": [
                    "The height of the taenia was likewise determined with regard to the total height of the epistyle, and again, although we should not expect a proportion of less than one-twelfth of the total height (as in the Parthenon), it is reduced to one-thirteenth, executed as 0.089-0.090 m."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Any of several ribbon-like bands of tissue.",
                  "examples": [
                    "Each taenia traverses one of the following surfaces of the colon: the anterior surface, the posteroinferior surface, and the posterosuperior surface."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Any species of the genus Taenia of tapeworms.",
                  "examples": [
                    "About an hour after the last dose, that is, in three hours after commencing the remedy, an entire tænia was voided alive, no other effect than a slight nausea having been experienced by the patient. […] On plunging living tæniae either into the decoction, or into the mixture of the pomegranate bark and water, they writhe and manifest great suffering."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}