{
  "word": "septuple",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "septuple (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Seven times as much; sevenfold.",
                  "examples": [
                    "[Japan] will not remember our American and English missionaries as she remembers even now those great Chinese priests who once educated her youth. And she will not preserve relics of our sojourn, carefully wrapped in septuple coverings of silk, and packed way in dainty whitewood boxes, because we had no new lesson of beauty to teach her,—nothing by which to appeal to her emotions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "septuple (plural septuples)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of seven.",
                  "examples": [
                    "If we suppose the limited region of Central Asia, where man existed, to have been deluged, and pairs and septuples of the most common animals in that region only to have been kept alive in the ark, the entire account will harmonize with natural history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sevenfold measure.",
                  "examples": [
                    "Frozen, the vodka poured like heavy glass. A septuple? Why not."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "septuple (third-person singular simple present septuples, present participle septupling, simple past and past participle septupled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To multiply by seven.",
                  "examples": [
                    "[…]  hee is rid of the Deuill. Now he that is quit of so bad a Guest, shall septuple his owne woes by his re-entertainment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To increase by a factor of seven.",
                  "examples": [
                    "[…]  Levi Strauss had caught a wave. Between 1962 and 1970, its sales and net profits grew fivefold and between 1970 and 1977 its sales again quintupled while profits almost septupled."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}