{
  "word": "support",
  "etymologies": [
    {
      "description": [
        "From Middle English supporten, from Old French supporter, from Latin supportō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "support (third-person singular simple present supports, present participle supporting, simple past and past participle supported)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To keep from falling.",
                  "examples": [
                    "Don’t move that beam! It supports the whole platform.",
                    "Synonyms: bestand, stut, undergird, underprop, upbear, upgird, uphold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To answer questions and resolve problems regarding something sold.",
                  "examples": [
                    "Sure they sell the product, but do they support it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To back a cause, party, etc., mentally or with concrete aid.",
                  "examples": [
                    "I support France in the World Cup.",
                    "Antonym: oppose"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To help, particularly financially.",
                  "examples": [
                    "The government supports the arts in several ways."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To verify; to make good; to substantiate; to establish; to sustain.",
                  "examples": [
                    "The testimony is not sufficient to support the charges.",
                    "The evidence will not support the statements or allegations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To serve, as in a customer-oriented mindset; to give support to.",
                  "examples": [
                    "The IT Department supports the research organization, but not the sales force.",
                    "I don't make decisions, but I support those who do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be designed (said of machinery, electronics, or computers, or their parts, accessories, peripherals, or programming) to function compatibly with or provide the capacity for.",
                  "examples": [
                    "Early personal computers did not support voice-recognition hardware or software."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be accountable for, or involved with, but not responsible for.",
                  "examples": [
                    "I support the administrative activities of the executive branch of the organization."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To endure without being overcome; bear; undergo; to tolerate.",
                  "examples": [
                    "This fierce demeanour and his insolence / The patience of a god could not support."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To assume and carry successfully, as the part of an actor; to represent or act; to sustain.",
                  "examples": [
                    "to support the character of King Lear"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English support, from Anglo-Norman and Middle French support. Displaced Old English wraþu."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "support (countable and uncountable, plural supports)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes attributive) Something which supports.",
                  "examples": [
                    "Don't move that beam! It's a support for the whole platform."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Financial or other help.",
                  "examples": [
                    "The government provides support to the arts in several ways."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Answers to questions and resolution of problems regarding something sold.",
                  "examples": [
                    "Sure they sell the product, but do they provide support?",
                    "Hyponyms: first-level support, second-level support, third-level support"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) in relation to a function, the set of points where the function is not zero, or the closure of that set.",
                  "examples": [
                    "Antonym: kernel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fuzzy set theory) A set whose elements are at least partially included in a given fuzzy set (i.e., whose grade of membership in that fuzzy set is strictly greater than zero).",
                  "examples": [
                    "If the membership function of a fuzzy set is continuous, then that fuzzy set's support is an open set."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Evidence.",
                  "examples": [
                    "The new research provides further support for our theory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Compatibility and functionality for a given product or feature.",
                  "examples": [
                    "This game has no mouse support."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An actor playing a subordinate part with a star.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accompaniment in music.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gymnastics) Clipping of support position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(structural analysis) Horizontal, vertical or rotational support of structures: movable, hinged, fixed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}