{
  "word": "debate",
  "etymologies": [
    {
      "description": [
        "From Middle English debaten, from Old French debatre (“to fight, contend, debate, also literally to beat down”), from Romanic desbattere, from Latin dis- (“apart, in different directions”) + battuere (“to beat, to fence”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "debate (countable and uncountable, plural debates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An argument, or discussion, usually in an ordered or formal setting, often with more than two people, generally ending with a vote or other decision.",
                  "examples": [
                    "After a four-hour debate, the committee voted to table the motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An informal and spirited but generally civil discussion of opposing views.",
                  "examples": [
                    "The debate over the age of the universe is thousands of years old.",
                    "There was a bit of a debate over who should pay for the damaged fence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Discussion of opposing views.",
                  "examples": [
                    "There has been considerable debate concerning exactly how to format these articles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(frequently in the French form débat) A type of literary composition, taking the form of a discussion or disputation, commonly found in the vernacular medieval poetry of many European countries, as well as in medieval Latin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Strife, discord.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "debate (third-person singular simple present debates, present participle debating, simple past and past participle debated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To participate in a debate; to dispute, argue, especially in a public arena. [from 14th c.]",
                  "examples": [
                    "He presents that great soul debating upon the subject of life and death with his intimate friends."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To fight. [14th–17th c.]",
                  "examples": [
                    "To change your day of youth to sullied night"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To engage in combat for; to strive for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consider (to oneself), to think over, to attempt to decide",
                  "examples": [
                    "He was debating where he'd spend his holiday."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}