{
  "word": "presentative",
  "etymologies": [
    {
      "description": [
        "The adjective is derived from Late Latin praesentativus (“that presents for consideration”) + English -ive (suffix signifying belonging or relating to, of the nature of, serving to, or tending to, forming adjectives). Praesentativus is from Latin praesentātus (“presented, exhibited, or shown”) + -īvus (suffix forming adjectives); while praesentātus is the perfect passive participle of praesentō (“to present, exhibit, or show”), from praesēns (“at hand, present; existing; immediate; prompt; propitious; (grammar) present”) (the present active participle of praesum (“to be before something; to be in charge of; to command, lead; to preside or rule over”), from prae- (prefix meaning ‘before, in front; in charge’) (ultimately from Proto-Indo-European *preh₂- (“before; in front”)) + sum (“to be, exist, have”) (ultimately from Proto-Indo-European *h₁es- (“to be”))) + -tō (frequentative suffix). The English word is analysable as present +‎ -ative.",
        "The noun sense (“construct that serves to present something, or draw it to the attention of the interlocutor”) is derived from adjective sense 3 (“serving to present something, or draw it to the attention of the interlocutor”)."
      ],
      "adjectives": [
        {
          "description": "presentative (comparative more presentative, superlative most presentative)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Presenting, or able to represent, an idea in the mind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical law) Of a benefice, or the advowsons, tithes, etc., associated with a benefice: that a patron has the right to present.",
                  "examples": [
                    "Antonym: donative"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Serving to present something, or draw it to the attention of the interlocutor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metaphysics, psychology) Of or pertaining to a presentation (“an image formed in the mind after an object is perceived”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "Synonym of representative (“representing another, or representing a larger group”)",
                  "examples": []
                },
                {
                  "meaning": "(rare) Of or pertaining to an act of presenting or giving an object to someone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "presentative (plural presentatives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A construct that serves to present something, or draw it to the attention of the interlocutor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}