{
  "word": "drogue",
  "etymologies": [
    {
      "description": [
        "Uncertain; probably related to drag in some way."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drogue (plural drogues)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(whaling) A floating object attached to the end of a harpoon line to slow a whale down and prevent it from diving.",
                  "examples": [
                    "through the sash window I could see the black truck pulling up the drive towards the main road, the silver caravan coming behind like a drogue that was preventing the gypsies from submerging, escaping into the very centre of the earth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A type of bag pulled behind a boat to stop it from broaching to.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) A conical parachute used as a brake for some kinds of aircraft, or as a means of extracting and deploying a larger parachute, or to slow a rapidly-moving vehicle to a speed where it can safely deploy a larger parachute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aeronautics) A conical basket or device used variously as a target for gunnery practice, and as a docking point for aerial refuelling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wind cone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "drogue (third-person singular simple present drogues, present participle droguing, simple past and past participle drogued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To harpoon or spear (a whale) with a weapon that has a drogue attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use a drogue with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To act as a drogue, slowing down and stabilizing a drifting object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To transport small loads along the coastline to larger ports, where they can be added to the cargo of larger ships that make longer journeys.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}