{
  "word": "wipe",
  "etymologies": [
    {
      "description": [
        "From Middle English wipen, from Old English wīpian (“to wipe, rub, cleanse”), from Proto-West Germanic *wīpōn (“to wipe”), from Proto-Indo-European *weyp- (“to twist, wind around”). Cognate with German wippen (“to bob”), Swedish veva (“to turn, wind, crank”), Gothic 𐍅𐌴𐌹𐍀𐌰𐌽 (weipan, “to wreathe, crown”), Old English swīfan (“to revolve, sweep, wend, intervene”), Sanskrit वेपते (vépate, “to tremble”). More at swivel, swift."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wipe (plural wipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of wiping something.",
                  "examples": [
                    "multiple wipes of a computer's hard disk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft piece of cloth or cloth-like material used for wiping.",
                  "examples": [
                    "Hyponym: wet wipe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A handkerchief.",
                  "examples": [
                    "\"Now, my kiveys, shy up your castors, tie your bird's-eye wipes to the stakes, and go to work.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of film transition where one shot replaces another by travelling from one side of the frame to another or with a special shape.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A sarcastic remark; a reproof, a jibe.",
                  "examples": [
                    "I could not help giving Metcalfe a wipe for his lamentations, observing I should have thought he had enough to attend to at home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A blow or swipe; the act of striking somebody or something.",
                  "examples": [
                    "He rode close up to a French officer, and so much in advance of his men that the Frenchman thought he was going to surrender, and dropped his sword, when Penrice gave him a wipe over his head."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wipe (third-person singular simple present wipes, present participle wiping, simple past and past participle wiped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move an object over, maintaining contact, with the intention of removing some substance from the surface. (Compare rub.)",
                  "examples": [
                    "Melissa wiped her glasses with her shirt.",
                    "I wiped the sweat from my brow with the back of my hand.",
                    "Tom started to wipe his eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove by rubbing; to rub off; to obliterate; usually followed by away, off, or out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To cheat; to defraud; to trick; usually followed by out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To clean (the buttocks) after defecation.",
                  "examples": [
                    "I had nothing to wipe my bum with.",
                    "This is what happens if you never wipe. Your butthole gets dirty!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To erase.",
                  "examples": [
                    "I accidentally wiped my hard drive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, plumbing) To make (a joint, as between pieces of lead pipe), by surrounding the junction with a mass of solder, applied in a plastic condition by means of a rag with which the solder is shaped by rubbing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To remove an expression from one's face.",
                  "examples": [
                    "Please wipe that look out of your eyes, it's bribing me to doubt myself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deperm (a ship).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Compare Swedish vipa, Danish vibe (“lapwing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wipe (plural wipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lapwing, especially a northern lapwing (Vanellus vanellus).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From wipe out (verb) and wipeout (noun) by shortening."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wipe (plural wipes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games, video games) An instance of all members of a party dying in a single campaign, event, or battle; a wipeout.",
                  "examples": [
                    "Synonym: TPK"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wipe (third-person singular simple present wipes, present participle wiping, simple past and past participle wiped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, role-playing games, video games) To have all members of a party die in a single campaign, event, or battle; to be wiped out.",
                  "examples": [
                    "If you try to fight that boss underprepared, you're definitely gonna wipe."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}