{
  "word": "apprise",
  "etymologies": [
    {
      "description": [
        "Borrowed from French appris, apprise, the past participle form of apprendre (“to learn; to teach”), from Middle French apprendre, aprendre (“to learn”), from Old French aprendre, aprandre (“to learn; to educate, teach”), from Latin apprēndere, a variant of apprehendere, adprehendere, the present active infinitives of apprehendō, adprehendō (“to lay hold upon, grab, grasp, seize, take; to apprehend, arrest; to grasp with the mind, comprehend, understand; (Medieval Latin) to learn; to inform; to teach”), from ad- (prefix meaning ‘to; towards’) + prehendō (“to lay hold of, grab, grasp, seize, take; (figuratively, rare) of the mind: to apprehend, comprehend, grasp, seize”) (ultimately from Proto-Indo-European *gʰed- (“to find; to hold; to seize, take”)). Doublet of apprehend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "apprise (third-person singular simple present apprises, present participle apprising, simple past and past participle apprised) (transitive, reflexive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To make (someone or oneself) aware of some information; to inform, to notify.",
                  "examples": [
                    "Synonyms: acquaint, keep (someone) abreast of, keep someone posted; see also Thesaurus:inform",
                    "The ears apprise the brain of sound."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) To formally impart (information) to someone; to advise, to notify.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English aprisen, apprisen (“to determine or estimate the value of (something), to appraise, evaluate; to regard (something) as important, valuable, or worthy, to esteem, prize; to praise or worship (God)”), and then either:",
        "Pretium (“cost, price; value, worth”) is ultimately from Proto-Indo-European *per- (“before, in front; first”). The English word is a doublet of appraise, appreciate, praise, price, and prize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "apprise (third-person singular simple present apprises, present participle apprising, simple past and past participle apprised) (transitive, archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of appraise (“to determine the value or worth of (something)”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically, Scotland, law) To put a price on (something) for the purpose of sale; to appraise.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}