{
  "word": "effloresce",
  "etymologies": [
    {
      "description": [
        "From Latin efflōrēscere, present active infinitive of efflōrēscō (“to bloom, blossom; to flourish”) + -ere (suffix forming infinitives). Efflōrēscō is derived from ef- (variant of ex- (prefix meaning ‘away; out’)) + flōrēscō (“to blossom, flower; to begin to flourish or prosper”) (from flōreō (“to bloom, blossom, flower; to flourish, prosper”) (from flōs (“blossom, flower”) (ultimately from Proto-Indo-European *bʰleh₃- (“bloom, flower”)) + -scō (suffix forming verbs having the sense of beginning something))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "effloresce (third-person singular simple present effloresces, present participle efflorescing, simple past and past participle effloresced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete except figuratively) To burst into bloom; to flower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) Of something hidden: to come forth, to emerge; also, to reach full glory or power.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive, chemistry) Senses relating to chemistry.",
              "entries": [
                {
                  "meaning": "Of a substance: to change from being crystalline to powdery by losing water of crystallization.",
                  "examples": []
                },
                {
                  "meaning": "Of a salt: to seep through some material (bricks, concrete, earth, rock, etc.) in a dissolved state, and then crystallize on a surface in a powdery form.",
                  "examples": []
                },
                {
                  "meaning": "Of the surface of a material: to become covered with a powdery salt (as described in sense 3.2).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}