{
  "word": "angle",
  "etymologies": [
    {
      "description": [
        "From Middle English angle, angul, angule, borrowed from Middle French angle, from Latin angulus (“corner, remote area”), from Proto-Indo-European *h₂engulos < *h₂eng- (“corner, hirn”). Cognate with Old High German ancha (“nape of the neck”), Middle High German anke (“joint of the foot, nape of neck”). Doublet of angulus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "angle (plural angles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A figure formed by two rays which start from a common point (a plane angle) or by three planes that intersect (a solid angle).",
                  "examples": [
                    "the angle between lines A and B"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The measure of such a figure. In the case of a plane angle, this is the ratio (or proportional to the ratio) of the arc length to the radius of a section of a circle cut by the two rays, centered at their common point. In the case of a solid angle, this is the ratio of the surface area to the square of the radius of the section of a sphere.",
                  "examples": [
                    "The angle between lines A and B is π/4 radians, or 45 degrees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A corner where two walls intersect.",
                  "examples": [
                    "an angle of a building"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change in direction.",
                  "examples": [
                    "The horse took off at an angle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A viewpoint; a way of looking at something.",
                  "examples": [
                    "For example, if I was trying to repitch an idea to a producer who had already turned it down, I would say something like, \"I remember you said you didn't like my idea because there was no women's angle. Well, here's a great one that both of us must have missed during our first conversation.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(media) The focus of a news story.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various hesperiid butterflies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, professional wrestling) A storyline between two wrestlers, providing the background for and approach to a feud.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An ulterior motive; a scheme or means of benefitting from a situation, usually hidden, often immoral",
                  "examples": [
                    "His angle is that he gets a percentage, but mostly in trade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A projecting or sharp corner; an angular fragment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) Any of the four cardinal points of an astrological chart: the Ascendant, the Midheaven, the Descendant and the Imum Coeli.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English anglen (“to meet at an angle, converge”), from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "angle (third-person singular simple present angles, present participle angling, simple past and past participle angled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often in the passive) To place (something) at an angle.",
                  "examples": [
                    "The roof is angled at 15 degrees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To change direction rapidly.",
                  "examples": [
                    "The five ball angled off the nine ball but failed to reach the pocket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To present or argue something in a particular way or from a particular viewpoint.",
                  "examples": [
                    "How do you want to angle this when we talk to the client?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, cue sports) To hamper (oneself or one's opponent) by leaving the cue ball in the jaws of a pocket such that the surround of the pocket (the \"angle\") blocks the path from cue ball to object ball.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English angel (“fishhook”), from Old English angel (“hook, fishhook”), from Proto-West Germanic *angul, from Proto-Germanic *angulaz (“hook”), from Proto-Indo-European *h₂enk- (“to make crooked, bend”). Cognate with West Frisian angel (“fishing rod, stinger”), Dutch angel (“fishhook”), German Angel (“fishing pole”), Icelandic öngull (“fishhook”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "angle (plural angles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fishhook; tackle for catching fish, consisting of a line, hook, and bait, with or without a rod.",
                  "examples": [
                    "A fisher next his trembling angle bears."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English anglen (“to fish, fish with a hook”, literally “to fish-hook”), perhaps from Old English *anglian, from Proto-West Germanic *anglōn (“to hook”). Cognate with Saterland Frisian ongelje (“to fish, angle”), Dutch hengelen (“to fish, angle”), German Low German angeln (“to fish, angle”), German angeln (“to fish, angle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "angle (third-person singular simple present angles, present participle angling, simple past and past participle angled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To try to catch fish with a hook and line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with for) To attempt to subtly persuade someone to offer a desired thing.",
                  "examples": [
                    "He must be angling for a pay rise."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}