{
  "word": "roundhouse",
  "etymologies": [
    {
      "description": [
        "From round +‎ house."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "roundhouse (plural roundhouses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular prison, especially a small local lockup or station house. [from 15th c.]",
                  "examples": [
                    "[T]he gentlemen in the coffee room insisted upon the watch being called, or a constable. With considerable difficulty the two heroes were carried off to the round-house, and there lodged for the night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, now chiefly historical) The uppermost room or cabin of any note upon the stern of a ship. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, now historical) A privy near the bow of a vessel, especially as reserved for officers. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A circular building in which locomotives are housed. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A prehistoric dwelling typical of northwest Europe in the Iron Age and Bronze Age. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A punch or kick delivered with an exaggerated sweeping movement. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In the game of pinochle, a meld consisting of a queen and king in each of the four suits.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "roundhouse (third-person singular simple present roundhouses, present participle roundhousing, simple past and past participle roundhoused)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To punch or kick with an exaggerated sweeping movement.",
                  "examples": [
                    "I'm on my feet and my fist is roundhousing and I feel flesh. I hit again, and teeth crack under my fist. I hear voices and they're shouting and a light burns into my face."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}