{
  "word": "pass",
  "etymologies": [
    {
      "description": [
        "From Middle English passen, from Old French passer (“to step, walk, pass”), from Vulgar Latin *passāre (“step, walk, pass”), derived from Latin passus (“a step”), from pandere (“spread, unfold, stretch”), from Proto-Italic *patnō, from Proto-Indo-European *pth₂noh₂, from Proto-Indo-European *peth₂- (“to spread, stretch out”). Cognate with Old English fæþm (“armful, fathom”). More at fathom."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pass (third-person singular simple present passes, present participle passing, simple past and past participle passed)",
          "definitionGroups": [
            {
              "group": "To change place.",
              "entries": [
                {
                  "meaning": "(intransitive) To move or be moved from one place to another.",
                  "examples": [
                    "They passed from room to room.",
                    "Synonyms: go, move"
                  ]
                },
                {
                  "meaning": "(transitive) To go past, by, over, or through; to proceed from one side to the other of; to move past.",
                  "examples": [
                    "Synonyms: overtake, pass by, pass over",
                    "You will pass a house on your right."
                  ]
                },
                {
                  "meaning": "(ditransitive) To cause to move or go; to send; to transfer from one person, place, or condition to another.",
                  "examples": [
                    "Synonyms: deliver, give, hand, make over, send, transfer, transmit",
                    "The waiter passed biscuits and cheese.",
                    "John passed Suzie a note.",
                    "The torch was passed from hand to hand."
                  ]
                },
                {
                  "meaning": "(intransitive, transitive, medicine) To eliminate (something) from the body by natural processes.",
                  "examples": [
                    "Synonyms: evacuate, void",
                    "He was passing blood in both his urine and his stool.",
                    "The poison had been passed by the time of the autopsy."
                  ]
                },
                {
                  "meaning": "(transitive, nautical) To take a turn with (a line, gasket, etc.), as around a sail in furling, and make secure.",
                  "examples": []
                },
                {
                  "meaning": "(sports) To make various kinds of movement.",
                  "examples": [
                    "Iaquinta passes it coolly into the right-hand corner as Paston dives the other way."
                  ]
                },
                {
                  "meaning": "(transitive, soccer) To kick (the ball) with precision rather than at full force.",
                  "examples": [
                    "Iaquinta passes it coolly into the right-hand corner as Paston dives the other way."
                  ]
                },
                {
                  "meaning": "(transitive) To move (the ball or puck) to a teammate.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, fencing) To make a lunge or swipe.",
                  "examples": [
                    "Synonym: thrust"
                  ]
                },
                {
                  "meaning": "(intransitive, American football) To throw the ball, generally downfield, towards a teammate.",
                  "examples": [
                    "The Patriots passed on third and long."
                  ]
                },
                {
                  "meaning": "(intransitive) To go from one person to another.",
                  "examples": []
                },
                {
                  "meaning": "(transitive) To put in circulation; to give currency to.",
                  "examples": [
                    "Synonyms: circulate, pass around",
                    "pass counterfeit money"
                  ]
                },
                {
                  "meaning": "(transitive) To cause to obtain entrance, admission, or conveyance.",
                  "examples": [
                    "Synonyms: admit, let in, let past",
                    "pass a person into a theater or over a railroad"
                  ]
                },
                {
                  "meaning": "(transitive, cooking) To put through a sieve.",
                  "examples": [
                    "When it's finished cooking, you should pass the sauce to get rid of any lumps."
                  ]
                }
              ]
            },
            {
              "group": "To change in state or status",
              "entries": [
                {
                  "meaning": "(intransitive) To progress from one state to another; to advance.",
                  "examples": [
                    "He passed from youth into old age."
                  ]
                },
                {
                  "meaning": "(intransitive) To depart, to cease, to come to an end.",
                  "examples": [
                    "At first, she was worried, but that feeling soon passed."
                  ]
                },
                {
                  "meaning": "(intransitive) To die.",
                  "examples": [
                    "Synonyms: pass away, pass on, pass over; see also Thesaurus:die",
                    "His grandmother passed yesterday."
                  ]
                },
                {
                  "meaning": "(intransitive, transitive) To achieve a successful outcome from.",
                  "examples": [
                    "He attempted the examination, but did not expect to pass.",
                    "Of the Ancient Wonders, only the pyramids have passed the test of time."
                  ]
                },
                {
                  "meaning": "(intransitive, transitive) To advance through all the steps or stages necessary to become valid or effective; to obtain the formal sanction of (a legislative body).",
                  "examples": [
                    "Synonym: be accepted by",
                    "Despite the efforts of the opposition, the bill passed.",
                    "The bill passed both houses of Congress.",
                    "The bill passed the Senate, but did not pass in the House."
                  ]
                },
                {
                  "meaning": "(intransitive, law) To be conveyed or transferred by will, deed, or other instrument of conveyance.",
                  "examples": [
                    "The estate passes by the third clause in Mr Smith's deed to his son.",
                    "When the old king passed away with only a daughter as an heir, the throne passed to a woman for the first time in centuries."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to advance by stages of progress; to carry on with success through an ordeal, examination, or action; specifically, to give legal or official sanction to; to ratify; to enact; to approve as valid and just.",
                  "examples": [
                    "Synonyms: approve, enact, ratify",
                    "He passed the bill through the committee."
                  ]
                },
                {
                  "meaning": "(intransitive, law) To make a judgment on or upon a person or case.",
                  "examples": [
                    "And within three dayes twelve knyghtes passed uppon hem; and they founde Sir Palomydes gylty, and Sir Saphir nat gylty, of the lordis deth."
                  ]
                },
                {
                  "meaning": "(transitive) To utter; to pronounce; to pledge.",
                  "examples": [
                    "Synonyms: pronounce, say, speak, utter"
                  ]
                },
                {
                  "meaning": "(intransitive) To change from one state to another (without the implication of progression).",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move through time.",
              "entries": [
                {
                  "meaning": "(intransitive, of time) To elapse, to be spent.",
                  "examples": [
                    "Synonyms: elapse, go by; see also Thesaurus:elapse",
                    "Their vacation passed pleasantly."
                  ]
                },
                {
                  "meaning": "(transitive, of time) To spend.",
                  "examples": [
                    "What will we do to pass the time?"
                  ]
                },
                {
                  "meaning": "(transitive) To go by without noticing; to omit attention to; to take no note of; to disregard.",
                  "examples": [
                    "Synonyms: disregard, ignore, take no notice of; see also Thesaurus:ignore"
                  ]
                },
                {
                  "meaning": "(intransitive) To continue.",
                  "examples": [
                    "Synonyms: continue, go on"
                  ]
                },
                {
                  "meaning": "(intransitive) To proceed without hindrance or opposition.",
                  "examples": [
                    "You're late, but I'll let it pass."
                  ]
                },
                {
                  "meaning": "(transitive) To live through; to have experience of; to undergo; to suffer.",
                  "examples": [
                    "Synonyms: bear, endure, suffer, tolerate, undergo; see also Thesaurus:tolerate"
                  ]
                },
                {
                  "meaning": "(intransitive) To happen.",
                  "examples": [
                    "Synonyms: happen, occur; see also Thesaurus:happen",
                    "It will soon come to pass."
                  ]
                }
              ]
            },
            {
              "group": "To be accepted.",
              "entries": [
                {
                  "meaning": "(intransitive, stative) To be tolerated as a substitute for something else, to \"do\".",
                  "examples": [
                    "It isn't ideal, but it will pass."
                  ]
                },
                {
                  "meaning": "(intransitive, stative, sociology) To be accepted by others as a member of a race, sex, or other group to which one does not belong or would not have originally appeared to belong; especially to be considered white although one has black ancestry, or a woman although one was assigned male at birth or vice versa.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To refrain from doing something.",
              "entries": [
                {
                  "meaning": "(intransitive) To decline something that is offered or available.",
                  "examples": [
                    "Coordinate terms: pass on, pass up",
                    "He asked me to go to the cinema with him, but I think I'll pass."
                  ]
                },
                {
                  "meaning": "(transitive) To reject; to pass up.",
                  "examples": [
                    "Instead, the board voted to suspend the dividend, giving Orton his way at last. They passed the dividend again in June 1870  […]"
                  ]
                },
                {
                  "meaning": "(intransitive) To decline or not attempt to answer a question.",
                  "examples": [
                    "I haven't any idea of the answer, so I'll have to pass."
                  ]
                },
                {
                  "meaning": "(intransitive) In turn-based games, to decline to play in one's turn.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, card games) In euchre, to decline to make the trump.",
                  "examples": []
                }
              ]
            },
            {
              "group": "To do or be better.",
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To go beyond bounds; to surpass; to be in excess.",
                  "examples": [
                    "Synonyms: exceed, surpass"
                  ]
                },
                {
                  "meaning": "(transitive) To transcend; to surpass; to excel; to exceed.",
                  "examples": [
                    "Synonyms: better, exceed, excel, outdo, surpass, transcend; see also Thesaurus:exceed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To take heed, to have an interest, to care.",
                  "examples": [
                    "Synonyms: take heed, take notice; see also Thesaurus:pay attention"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English pas, pase, pace, from passen (“to pass”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pass (plural passes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening, road, or track, available for passing; especially, one through or over some dangerous or otherwise impracticable barrier such as a mountain range; a passageway; a defile; a ford.",
                  "examples": [
                    "Synonyms: gap, notch",
                    "mountain pass"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A channel connecting a river or body of water to the sea, for example at the mouth (delta) of a river.",
                  "examples": [
                    "the passes of the Mississippi"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single movement, especially of a hand, at, over, or along anything.",
                  "examples": [
                    "[The bear] made a pass at the dog, but he swung out and above him  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single passage of a tool over something, or of something over a tool.",
                  "examples": [
                    "Synonym: transit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attempt.",
                  "examples": [
                    "My first pass at a career of writing proved unsuccessful."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Success in an examination or similar test.",
                  "examples": [
                    "I gained three passes at A-level, in mathematics, French, and English literature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) A thrust or push; an attempt to stab or strike an adversary.",
                  "examples": [
                    "Synonym: thrust"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A thrust; a sally of wit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sexual advance.",
                  "examples": [
                    "Synonyms: proposition, come on, hit on",
                    "The man kicked his friend out of the house after he made a pass at his wife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The act of moving the ball or puck from one player to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A passing of two trains in the same direction on a single track, when one is put into a siding to let the other overtake it.",
                  "examples": [
                    "Antonym: meet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Permission or license to pass, or to go and come.",
                  "examples": [
                    "A ship sailing under the flag and pass of an enemy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A document granting permission to pass or to go and come; a passport; a ticket permitting free transit or admission",
                  "examples": [
                    "a railroad pass; a theater pass; a military pass"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) An intentional walk.",
                  "examples": [
                    "Smith was given a pass after Jones' double."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The act of overtaking; an overtaking manoeuvre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of things; condition; predicament; impasse.",
                  "examples": [
                    "Synonyms: condition, predicament, state"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Estimation; character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) The area in a restaurant kitchen where the finished dishes are passed from the chefs to the waiting staff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of declining to play one's turn in a game, often by saying the word \"pass\".",
                  "examples": [
                    "A pass would have seen her win the game, but instead she gave a wrong answer and lost a point, putting her in second place."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A run through a document as part of a translation, compilation or reformatting process.",
                  "examples": [
                    "Most Pascal compilers process source code in a single pass."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Short for password."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pass (plural passes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, slang) A password (especially one for a restricted-access website).",
                  "examples": [
                    "Anyone want to trade passes?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}