{
  "word": "mastership",
  "etymologies": [
    {
      "description": [
        "From Middle English masterchippe, maisterschipe, equivalent to master +‎ -ship. Compare Dutch meesterschap, German Meisterschaft."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mastership (countable and uncountable, plural masterships)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or office of a master.",
                  "examples": [
                    "[...] wee haue one in heauen who is maister of vs all, as sainct Paule sayeth: there will be no accepting of persons, there shall bee no more bondage or mastershippe for men too alleage before God."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mastery: dominion, superiority, control.",
                  "examples": [
                    "[...] you may begin to dig your ground in the beginning, so all along Winter till the very day of setting, and then you must keep it with weeding and hoing till it have got the mastership of the weeds and then it being a weed of it self wil destroy all other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mastery: superior skill.",
                  "examples": [
                    "Some swallow every thing whole and unmix’d; so that it may rather be call’d a Heap, than a Pudding. Others are so Squeamish, the greatest Mastership in Cookery is requir’d to make the Pudding Palatable [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Chief work; masterpiece.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A title of respect, sometimes ironic.",
                  "examples": [
                    "Thus hath Master More a full a[n]swere both to his scriptures which were to farre wrested out of their places and also to his awne apparent reasons. How be it if his mastershippe be not fullye pacyfyed let him more groundlye open his minde and bringe for his purposse all that he thinketh to make for it and I shall by goddes grace shortlye make him an answere and guyet his minde."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}