{
  "word": "film",
  "etymologies": [
    {
      "description": [
        "From Middle English filme, from Old English filmen (“film, membrane, thin skin, foreskin”), from Proto-West Germanic *filmīn-, from Proto-Germanic *filmīn- (“thin skin, membrane”) (compare Proto-Germanic *felma- (“skin, hide”)), from Proto-Indo-European *pél-mo- (“membrane”), from *pel- (“to cover, skin”). Cognate with Old Frisian filmene (“thin skin, human skin”), Middle Dutch velm, vilm (“fleece, film, membrane”), Old High German felm (“peel, skin, wrap”), Old English *felma (in ǣġerfelma (“egg membrane”)). Related also to Dutch vel (“sheet, skin”), German Fell (“skin, hide, fur”), Swedish fjäll (“fur blanket, cloth, scale”), Norwegian fille (“rag, cloth”), Lithuanian plėvē (“membrane, scab”), Russian плева́ (plevá, “membrane”), Ancient Greek πέλμα (pélma, “sole of the foot”). More at fell. Sense of a thin coat of something is 1577, extended by 1845 to the coating of chemical gel on photographic plates. By 1895 this also meant the coating plus the paper or celluloid."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "film (countable and uncountable, plural films)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin layer of some substance; a pellicle; a membranous covering, causing opacity.",
                  "examples": [
                    "a clear plastic film for wrapping food"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(photography) A medium used to capture images in a camera.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A visual art form that consists of a sequence of still images preserved on a recording medium to give the illusion of motion; movies generally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slender thread, such as that of a cobweb.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "film (third-person singular simple present films, present participle filming, simple past and past participle filmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To record (activity, or a motion picture) on photographic film.",
                  "examples": [
                    "A Hollywood studio was filming on location in NYC.",
                    "I tried to film the UFO as it passed overhead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To visually record (activity, or a motion picture) in general, with or without sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover or become covered with a thin skin or pellicle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}