{
  "word": "wallpaper",
  "etymologies": [
    {
      "description": [
        "wall +‎ paper"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wallpaper (countable and uncountable, plural wallpapers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Decorative paper-like material used to cover the inner walls of buildings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A roll of such paper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A style or design of such material.",
                  "examples": [
                    "He is letting her select the wallpapers for the whole house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figurative, sometimes attributive) Anything that serves as a background or part of the surroundings.",
                  "examples": [
                    "This was not the wallpaper television that flickered away in the background in every dealing room but was not really watched. This was finely targeted and timely broadcast of stuff dealers would want to drop everything to watch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, countable, uncountable) An image or tiled pattern used as the background of a computer desktop.",
                  "examples": [
                    "You can design your own wallpaper using Paintbrush. A wallpaper appears on your desktop in tiles. The number of tiles that are needed to cover the desktop depends on the size of the canvas you use to create a wallpaper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television, slang) Generic footage of a building or location that may be used in the background of a related news report.",
                  "examples": [
                    "Scripts that include brief reference to a picture turn stock footage from 'wallpaper' to illustration."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately, informal) Gaudy mass-produced stamps, typically of little or no value and only produced for sale to collectors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(CB radio slang) A radio operator's collection of awards and QSL cards.",
                  "examples": [
                    "Some of my wallpaper includes ORS, OPS  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wallpaper (third-person singular simple present wallpapers, present participle wallpapering, simple past and past participle wallpapered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover (a wall, a room, etc) with wallpaper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}