{
  "word": "abacus",
  "etymologies": [
    {
      "description": [
        "From Late Middle English abacus, abagus, agabus (“abacus; art of counting with an abacus”), from Latin abacus, abax (“sideboard or table with a slab at the top; slab at the top of a column; counting board, sand table; board for playing games”) (compare Late Latin abacus (“art of arithmetic”)), from Ancient Greek ἄβαξ (ábax, “counting board; board covered with sand for drawing; plate; dice-board”). Doublet of abaque.",
        "The plural form abaci is reinforced from Latin abacī."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abacus (plural abaci or abacuses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, obsolete) A table or tray scattered with sand which was used for calculating or drawing. [attested from c. 1387]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used for performing arithmetical calculations; (rare) a table on which loose counters are placed, or (more commonly) an instrument with beads sliding on rods, or counters in grooves, with one row of beads or counters representing units, the next tens, etc. [from late 17th c.]",
                  "examples": [
                    "I’ve heard merchants still use an abacus for adding things up in China."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) The uppermost portion of the capital of a column immediately under the architrave, in some cases a flat oblong or square slab, in others more decorated. [from mid 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ancient Greece, Ancient Rome, historical) A board, tray, or table, divided into perforated compartments for holding bottles, cups, or the like; a kind of buffet, cupboard, or sideboard. [from late 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}