{
  "word": "primate",
  "etymologies": [
    {
      "description": [
        "From French primate, from Latin primas (“one of the first, chief, excellent, noble”). So named due to the belief that primates are the “highest” order of mammals/animals. First attested in  1876."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "primate (plural primates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) A mammal of the order Primates, including simians and prosimians.",
                  "examples": [
                    "Primates range from lemurs to gorillas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A simian anthropoid; an ape, human or monkey.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English primate, primat, from Old French primat, from Late Latin prīmās (“chief bishop”), substantivisation of prīmās, an alternative form of prīmus (“prime, first rank”). Compare English primus, of similar derivation and meaning. First attested in c. 1200."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "primate (plural primates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) In the Catholic Church, a rare title conferred to or claimed by the sees of certain archbishops, or the highest-ranking bishop of a present or historical, usually political circumscription.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) In the Orthodox Church, the presiding bishop of an ecclesiastical jurisdiction or region. Usually, the expression primate refers to the first hierarch of an autocephalous or autonomous Orthodox church. Less often, it is used to refer to the ruling bishop of an archdiocese or diocese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ecclesiastical) In the Anglican Church, an archbishop, or the highest-ranking bishop of an ecclesiastic province.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}