{
  "word": "avatar",
  "etymologies": [
    {
      "description": [
        "Attested 1784, borrowed from Hindustani अवतार / اوتار‎ (avtār), from Sanskrit अवतार (avatāra, “descent of a deity from a heaven”), a compound of अव (ava, “off, away, down”) and the vṛddhi-stem of the root √तॄ (√tṝ, “to cross”).",
        "In computing use, saw some use in 1980s videos games – 1985 online role-playing game Habitat by Lucasfilm Games (today LucasArts), by Chip Morningstar and Randy Farmer, later versions of the Ultima series (following religious use in 1985 Ultima IV: Quest of the Avatar), and 1989 pen and paper role-playing game Shadowrun. Popularized by the 1992 novel Snow Crash by Neal Stephenson."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "avatar (plural avatars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hinduism) An incarnation of a deity, particularly Vishnu.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The embodiment of an idea or concept; an instantiation, especially a personification or incarnation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games, metaverse) A complex and dynamic digital representation of a person or being in the form of a digital model, used online as a simulation or emulation of a person, or as a person's online alter ego, in a virtual world, virtual chat room, or metaverse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games) A simple and static or nearly static digital representation of a person or being in the form of a small digital object, used online as a simulacrum or token of a person or that person's online alter ego, in any digital environment but especially in non-virtual, non-metaversal ones.",
                  "examples": [
                    "Hyponyms: profile picture, user pic",
                    "Coordinate term: icon"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}