{
  "word": "homage",
  "etymologies": [
    {
      "description": [
        "From Middle English homage, from Old French homage, hommage, from Vulgar Latin *homināticum (“homage, the service of a vassal or 'man'”), from Latin homō (“a man, in Medieval Latin a vassal”) + -āticum (noun-forming suffix). The American pronunciations in /-ɑːʒ/ and with silent h are due to confusion with the nearly synonymous doublet hommage, which is indeed pronounced /oʊˈmɑːʒ/."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "homage (countable and uncountable, plural homages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) A demonstration of respect, such as towards an individual after their retirement or death",
                  "examples": [
                    "It’s appropriate that we pay homage to them and the sacrifices they made."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An artistic work imitating another in a flattering style.",
                  "examples": [
                    "He likes to tell people that it's a Hitchcockian thriller, but that's kind of like saying Happy Gilmore is a homage to Woody Allen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In feudalism, the formal oath of a vassal to honor his or her lord's rights.",
                  "examples": [
                    "Synonym: manred (obsolete)"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "homage (third-person singular simple present homages, present participle homaging, simple past and past participle homaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pay reverence to by external action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To cause to pay homage.",
                  "examples": [
                    "The Austrian Crowns and Romes seven Hills she shook; >br>To her great Neptune Homag'd all his Streams"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}