{
  "word": "premier",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French premier (adjective), from Latin prīmārius. Doublet of primary."
      ],
      "adjectives": [
        {
          "description": "premier (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Foremost; first or highest in quality or degree.",
                  "examples": [
                    "This failure, for a team associated with one of the premier Australian Rules Football teams with the longest of traditions, is truly enormous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) Most ancient.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "premier (plural premiers)",
          "definitionGroups": [
            {
              "group": "(politics, UK, Westminster system) The head of government in parliament and leader of the cabinet.",
              "entries": [
                {
                  "meaning": "(politics, UK parliament) The prime minister.",
                  "examples": [
                    "Mr. Gladstone had literally no option. Not to coerce the Lords was to coerce the Commons to continue purchase in spite of their repeated votes for its abolition, and this the Premier had as little the power as the will to do."
                  ]
                },
                {
                  "meaning": "(politics, Australia, Canada, South Africa) The leader of a state or provincial government and cabinet.",
                  "examples": [
                    "More surprising than the company′s activities and interests were those of the premier of Ontario, Mitchell Hepburn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, non-Westminster) The government leader in a legislative congress or leader of a government-level administrative body; the head of government.",
                  "examples": [
                    "This shows that our policy of strengthening friendly ties with Africa as developed by Chairman Mao Zedong and Premier Zhou Enlai is a correct one and that it has won popular support in Africa."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, slang) The first lieutenant or other second-in-command officer of a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, sporting) The champion team of a particular season (especially as used in Australian rules football).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "premier (third-person singular simple present premiers, present participle premiering, simple past and past participle premiered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform, display or exhibit for the first time.",
                  "examples": [
                    "The composer invited all his friends when they premiered the movie he orchestrated, we got to see it before anyone but the crew."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To govern in the role of premier.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}