{
  "word": "hedge",
  "etymologies": [
    {
      "description": [
        "From Middle English hegge, from Old English heċġ, from Proto-West Germanic *haggju, from Proto-Germanic *hagjō, from Proto-Indo-European *kagʰyóm (“enclosure”).",
        "Cognate with Dutch heg, German Hecke.  Doublet of quay. More at haw."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hedge (plural hedges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thicket of bushes or other shrubbery, especially one planted as a fence between two portions of land, or to separate the parts of a garden.",
                  "examples": [
                    "He trims the hedge once a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A barrier (often consisting of a line of persons or objects) to protect someone or something from harm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, West Country, chiefly Devon and Cornwall) A mound of earth, stone- or turf-faced, often topped with bushes, used as a fence between any two portions of land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pragmatics) A non-committal or intentionally ambiguous statement.",
                  "examples": [
                    "Coordinate term: weasel word"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Contract or arrangement reducing one's exposure to risk (for example the risk of price movements or interest rate movements).",
                  "examples": [
                    "The asset class acts as a hedge.",
                    "A hedge is an investment position intended to offset potential losses/gains that may be incurred by a companion investment. In simple language, a hedge is used to reduce any substantial losses/gains suffered by an individual or an organization."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Ireland, noun adjunct) Used attributively, with figurative indication of a person's upbringing, or professional activities, taking place by the side of the road; third-rate.",
                  "examples": [
                    "He then traced them from place to place, till at last he found two of them drinking together, with a third person, at a hedge-tavern near Aldersgate."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English heggen, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hedge (third-person singular simple present hedges, present participle hedging, simple past and past participle hedged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To enclose with a hedge or hedges.",
                  "examples": [
                    "to hedge a field or garden"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To obstruct or surround.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, finance) To offset the risk associated with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To avoid verbal commitment.",
                  "examples": [
                    "He carefully hedged his statements with weasel words."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To construct or repair a hedge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, finance) To reduce one's exposure to risk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}