{
  "word": "heretic",
  "etymologies": [
    {
      "description": [
        "From Middle English heretyk, heretike, from Old French eretique, from Medieval Latin or Ecclesiastical Latin haereticus, from Ancient Greek αἱρετικός (hairetikós, “able to choose, factious”), itself from Ancient Greek αἱρέω (hairéō, “I choose”)."
      ],
      "adjectives": [
        {
          "description": "heretic (comparative more heretic, superlative most heretic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Heretical; of or pertaining to heresy or heretics.",
                  "examples": [
                    "Antonym: orthodox"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "heretic (plural heretics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who believes contrary to the fundamental tenets of a religion they claim to belong to.",
                  "examples": [
                    "In the framework of traditional medical ethics, the patient deserves humane attention only insofar as he is potentially healthy and is willing to be healthy—just as in the framework of traditional Christian ethics, the heretic deserved humane attention only insofar as he was potentially a true believer and was willing to become one. In the one case, people are accepted as human beings only because they might be healthy citizens; in the other, only because they might be faithful Christians. In short, neither was heresy formerly, nor is sick- ness now, given the kind of humane recognition which, from the point of view of an ethic of respect and tolerance, they deserve."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who does not conform to generally accepted beliefs or practices",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}