{
  "word": "cart",
  "etymologies": [
    {
      "description": [
        "From Middle English cart, kart, from Old Norse kartr (“wagon; cart”), akin to Old English cræt (“a chariot; cart”), from Proto-Germanic *krattaz, *krattijô, *kradō, from Proto-Indo-European *gret- (“tracery; wattle; cradle; cage; basket”), from *ger- (“to turn, wind”).",
        "Cognate with West Frisian kret (“wheelbarrow for hauling dung”), Dutch krat, kret (“crate; wheelbarrow for hauling dung”), German Krätze (“basket; pannier”). Wider cognates include Sanskrit ग्रन्थ (grantha, “a binding”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cart (plural carts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, open, wheeled vehicle, drawn or pushed by a person or animal, more often used for transporting goods than passengers.",
                  "examples": [
                    "The grocer delivered his goods by cart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small motor vehicle resembling a car; a go-cart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A shopping cart.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cart (third-person singular simple present carts, present participle carting, simple past and past participle carted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To carry or convey in a cart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To carry goods.",
                  "examples": [
                    "I've been carting these things around all day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove, especially involuntarily or for disposal.",
                  "examples": [
                    "On August 4, 1927, Della was carted away to the Norwalk State Hospital, suffering from acute myocarditis, a general term for inflammation of the heart and surrounding tissues."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To expose in a cart by way of punishment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Clipping of cartridge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cart (plural carts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(radio, informal) A tape cartridge used for pre-recorded material such as jingles and advertisements.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, video games, informal) A cartridge for a computer or video game system.",
                  "examples": [
                    "My Final Fantasy cart on the NES is still alive and kicking."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}