{
  "word": "paramount",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman paramont, paramount (“paramount, pre-eminent; above”), from Old French par, per (“by”) + amont, amunt (“upward”). Par is derived from Latin per (“by means of, through”), from Proto-Indo-European *per- (“to go through; to carry forth, fare”); amont and amunt are from Latin ad montem (“to the mountain; upward”), from ad (“up to”) (ultimately from Proto-Indo-European *h₂éd (“at; to”)) + montem (the accusative singular of mōns (“mount, mountain”), ultimately from Proto-Indo-European *men- (“to stand out, tower”))."
      ],
      "adjectives": [
        {
          "description": "paramount (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often postpositive) Highest, supreme; also, chief, leading, pre-eminent.",
                  "examples": [
                    "Synonym: utmost",
                    "Antonym: paravail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the highest importance.",
                  "examples": [
                    "Synonyms: crucial, imperative; see also Thesaurus:important",
                    "Antonyms: see Thesaurus:insignificant",
                    "Getting those credit cards paid off is paramount."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Of a law, right, etc.: having precedence over or superior to another.",
                  "examples": [
                    "Synonyms: see Thesaurus:superior"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "paramount (plural paramounts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chief or superior; (specifically, chiefly South Africa) an African chief having the highest status in a region; a paramount chief.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A supreme ruler; an overlord; (specifically, historical) in the feudal system, a landowner who did not derive ownership of the land from anyone else, and who was able to grant fees to others; a lord paramount.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}