{
  "word": "dig",
  "etymologies": [
    {
      "description": [
        "From Middle English diggen (“to dig”), alteration of Old English dīcian (“to dig a ditch, to mound up earth”) (compare Old English dīcere (“digger”)) from dīc, dīċ (“dike, ditch”) from Proto-Germanic *dīkaz, *dīkiją (“pool, puddle”), from Proto-Indo-European *dʰīgʷ-, *dʰeygʷ- (“to stab, dig”). Additionally, Middle English diggen may derive from an unrecorded suffixed variant, *dīcgian. Akin to Danish dige (“to dig, raise a dike”), Swedish dika (“to dig ditches”). Related to Middle French diguer (“to dig”), from Old French dikier, itself a borrowing of the same Germanic root (from Middle Dutch dijc). More at ditch, dike."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dig (plural digs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An archeological or paleontological investigation, or the site where such an investigation is taking place.",
                  "examples": [
                    "Synonym: excavation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thrust; a poke.",
                  "examples": [
                    "Synonym: jab",
                    "He guffawed and gave me a dig in the ribs after telling his latest joke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) A defensive pass of the ball that has been attacked by the opposing team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) An innings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cutting, sarcastic remark.",
                  "examples": [
                    "Synonym: jibe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The occupation of digging for gold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, colloquial, dated) A plodding and laborious student.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect, dated) A tool for digging.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, slang) A rare or interesting vinyl record bought second-hand.",
                  "examples": [
                    "a £1 charity shop dig"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dig (third-person singular simple present digs, present participle digging, simple past and past participle dug or (archaic) digged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To move hard-packed earth out of the way, especially downward to make a hole with a shovel. Or to drill, or the like, through rocks, roads, or the like. More generally, to make any similar hole by moving material out of the way.",
                  "examples": [
                    "They dug an eight-foot ditch along the side of the road.",
                    "In the wintertime, heavy truck tires dig into the road, forming potholes.",
                    "If the plane can't pull out of the dive it is in, it'll dig a hole in the ground.",
                    "My seven-year-old son always digs a hole in the middle of his mashed potatoes and fills it with gravy before he starts to eat them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get by digging; to take from the ground; often with up.",
                  "examples": [
                    "to dig potatoes",
                    "to dig up gold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) To take ore from its bed, in distinction from making excavations in search of ore.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) To work like a digger; to study ploddingly and laboriously.",
                  "examples": [
                    "Peter dug at his books all the harder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To investigate, to research, often followed by out or up.",
                  "examples": [
                    "to dig up evidence",
                    "to dig out the facts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated, originally African-American, widespread from 1930s until early 1960s, remains in jazz musician slang) To understand, to like.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To thrust; to poke.",
                  "examples": [
                    "He dug an elbow into my ribs and guffawed at his own joke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(volleyball) To defend against an attack hit by the opposing team by successfully passing the ball",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From African American Vernacular English; due to lack of writing of slave speech, etymology is difficult to trace, but it has been suggested that it is from Wolof dëgg, dëgga (“to understand, to appreciate”). It has also been suggested that it is from Irish dtuig. Others do not propose a distinct etymology, instead considering this a semantic shift of the existing English term (compare dig in/dig into)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dig (third-person singular simple present digs, present participle digging, simple past and past participle dug)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated slang) To understand.",
                  "examples": [
                    "You dig?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated slang, transitive) To appreciate, or like.",
                  "examples": [
                    "Baby, I dig you."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Shortening."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dig (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, colloquial) Digoxin.",
                  "examples": [
                    "dig toxicity"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}