{
  "word": "yellow",
  "etymologies": [
    {
      "description": [
        "From Middle English yelwe, yelou, from Old English ġeolwe, oblique form of Old English ġeolu, from Proto-West Germanic *gelu, from  Proto-Germanic *gelwaz, from Proto-Indo-European *ǵʰelh₃wos, from *ǵʰelh₃- (“gleam, yellow”).",
        "Compare Welsh gwelw (“pale”), Latin helvus (“dull yellow”), Irish geal (“white, bright”), Italian giallo (“yellow”) Lithuanian žalias (“green”), Ancient Greek χλωρός (khlōrós, “light green”), Persian زرد‎ (zard, “yellow”), Sanskrit हरि (hari, “greenish-yellow”). Cognate with German gelb (“yellow”), Dutch geel (“yellow”).",
        "The verb is from Old English ġeolwian, from the adjective."
      ],
      "adjectives": [
        {
          "description": "yellow (comparative yellower or more yellow, superlative yellowest or most yellow)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having yellow as its color.",
                  "examples": [
                    "There's a one-eyed yellow idol / To the north of Kathmandu; / There's a little marble cross below the town; / And a brokenhearted woman / Tends the grave of 'Mad' Carew, / While the yellow god for ever gazes down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Lacking courage.",
                  "examples": [
                    "You yellow bastards! Come back here and take what's coming to you!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(publishing, journalism) Characterized by sensationalism, lurid content, and doubtful accuracy.",
                  "examples": [
                    "The denizens of the gossipy world of the pink press, purple prose and yellow tabloids are shivering over disputed photographs of Princess Caroline of Monaco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly derogatory, offensive, ethnic slur) Of the skin, having the colour traditionally attributed to Far East Asians, especially Chinese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly derogatory, offensive, ethnic slur) Far East Asian (relating to Asian people).",
                  "examples": [
                    "Imagine that awful being, and you have a mental picture of Dr. Fu-Manchu, the yellow peril incarnate in one man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, Australia, offensive) Of mixed Aboriginal and Caucasian ancestry.",
                  "examples": [
                    "\"Eh, Oscar—you hear about your yeller nephew?\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, US) Synonym of high yellow",
                  "examples": [
                    "Charley threw her over for a yellow gal named Nancy: he never forgave Vashti for the vanishing from his life of a menace that had come to mean more to him than Vashti herself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics) Related to the Liberal Democrats.",
                  "examples": [
                    "yellow constituencies"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Related to the Free Democratic Party; a political party in Germany.",
                  "examples": [
                    "the black-yellow coalition"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "yellow (plural yellows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The colour of gold, cheese, or a lemon; the colour obtained by mixing green and red light, or by subtracting blue from white light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) The intermediate light in a set of three traffic lights, the illumination of which indicates that drivers should stop short of the intersection if it is safe to do so.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) One of the colour balls used in snooker, with a value of 2 points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pocket billiards) One of two groups of object balls, or a ball from that group, as used in the principally British version of pool that makes use of unnumbered balls (the (yellow(s) and red(s)); contrast stripes and solids in the originally American version with numbered balls).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A yellow card.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various pierid butterflies of the subfamily Coliadinae, especially the yellow coloured species. Compare sulphur.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yellow (third-person singular simple present yellows, present participle yellowing, simple past and past participle yellowed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become yellow or more yellow.",
                  "examples": [
                    "Then suddenly, with the least warning, the sky yellows and the Chergui blows in from the Sahara, stinging the eyes and choking with its sandy, sticky breath."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (something) yellow or more yellow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}