{
  "word": "redundancy",
  "etymologies": [
    {
      "description": [
        "redundant +‎ -cy"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "redundancy (countable and uncountable, plural redundancies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being redundant",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A superfluity; something redundant or excessive; a needless repetition in language",
                  "examples": [
                    "[…] the fulneſs of the creature is limited, it ariſeth juſt to ſuch a degree and proportion, but Gods fulneſs is infinite, as it hath its Reſplendency, ſo its Redundancy, it knows neither bounds nor bottom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Duplication of components or circuits to provide survival of the total system in case of failure of single components.",
                  "examples": [
                    "Staff redundancy is needed in the event that a supervisor and key unit supervisors are not present or unable to act in an emergency."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Duplication of parts of a message to guard against transmission errors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia, New Zealand) The state of being unemployed because one's job is no longer necessary; the dismissal of such an employee; a layoff.",
                  "examples": [
                    "Has he received any representation from Air New Zealand management about redundancy proposals for Air New Zealand staff; and, if so, do these proposals include redundancy agreements?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) surplusage inserted in a pleading which may be rejected by the court without impairing the validity of what remains.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}