{
  "word": "patent",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English patent (“document granting an office, property, right, title, etc.; document granting permission, licence; papal indulgence, pardon”) [and other forms], which is either:",
        "For the derivation of Anglo-Norman and Middle French patente (adjective) in lettre patente, see etymology 2 below.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "patent (countable and uncountable, plural patents)",
          "definitionGroups": [
            {
              "group": "(law)",
              "entries": [
                {
                  "meaning": "An official document granting an appointment, privilege, or right, or some property or title; letters patent.",
                  "examples": [
                    "Philip of Spain had offered a reward of 25,000 crowns, a patent of nobility, and immunity for all past crimes, to the assassinator of the Prince of Orange."
                  ]
                },
                {
                  "meaning": "(specifically)",
                  "examples": []
                },
                {
                  "meaning": "(originally) A grant of a monopoly over the manufacture, sale, and use of goods.",
                  "examples": []
                },
                {
                  "meaning": "A declaration issued by a government agency that the inventor of a new invention has the sole privilege of making, selling, or using the claimed invention for a specified period.",
                  "examples": []
                },
                {
                  "meaning": "(US, historical) A specific grant of ownership of a piece of real property; a land patent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A product in respect of which a patent (sense 1.2.2) has been obtained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Short for patent leather (“a varnished, high-gloss leather typically used for accessories and shoes”).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively)",
              "entries": [
                {
                  "meaning": "A licence or (formal) permission to do something.",
                  "examples": []
                },
                {
                  "meaning": "A characteristic or quality that one possesses; in particular (hyperbolic) as if exclusively; a monopoly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) The combination of seven bets on three selections, offering a return even if only one bet comes in.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "patent (third-person singular simple present patents, present participle patenting, simple past and past participle patented)",
          "definitionGroups": [
            {
              "group": "(transitive, law)",
              "entries": [
                {
                  "meaning": "To (successfully) register (a new invention) with a government agency to obtain the sole privilege of its manufacture, sale, and use for a specified period.",
                  "examples": []
                },
                {
                  "meaning": "(US, historical) To obtain (over a piece of real property) a specific grant of ownership.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To be closely associated or identified with (something); to monopolize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English patent, patente (“wide open; clear, unobstructed; unlimited; of a document: available for public inspection”) [and other forms], from Anglo-Norman and Middle French patent (modern French patent), and directly from their etymon Latin patēns (“open; accessible, passable; evident, manifest; exposed, vulnerable”), the present active participle of pateō (“to be open; to be accessible, attainable; to be exposed, vulnerable; of frontiers or land: to extent, increase”), from Proto-Indo-European *peth₂- (“to spread out; to fly”)."
      ],
      "adjectives": [
        {
          "description": "patent (comparative more patent, superlative most patent)",
          "definitionGroups": [
            {
              "group": "Conspicuous; open; unconcealed.",
              "entries": [
                {
                  "meaning": "(baking) Of flour: fine, and consisting mostly of the inner part of the endosperm of the grain from which it is milled.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) Open, unobstructed; specifically, especially of the ductus arteriosus or foramen ovale in the heart, having not closed as would have happened in normal development.",
                  "examples": [
                    "She has a patent ductus arteriosus that will require surgery to close."
                  ]
                },
                {
                  "meaning": "(medicine, veterinary medicine) Of an infection: in the phase when the organism causing it can be detected by clinical tests.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Explicit and obvious.",
                  "examples": [
                    "Synonyms: express, monosemous, unambiguous; see also Thesaurus:explicit, Thesaurus:obvious",
                    "Those claims are patent nonsense."
                  ]
                }
              ]
            },
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "Especially of a document conferring some privilege or right: open to public perusal or use.",
                  "examples": [
                    "letters patent"
                  ]
                },
                {
                  "meaning": "Appointed or conferred by letters patent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Of a branch, leaf, etc.: outspread; also, spreading at right angles to the axis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Protected by a legal patent.",
                  "examples": [
                    "Synonym: patented",
                    "a patent right    patent medicines"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figuratively) To which someone has, or seems to have, a claim or an exclusive claim; also, inventive or particularly suited for.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}