{
  "word": "cracker",
  "etymologies": [
    {
      "description": [
        "crack +‎ -er. From crack (verb), the sound made when one is broken.",
        "Hard “bread/biscuit” sense first attested in 1739.",
        "Computing senses of cracker, crack, and cracking were promoted in the 1980s as an alternative to hacker, by programmers concerned about negative public associations of hack, hacking (“creative computer coding”). See Citations:cracker.",
        "Various theories exist regarding the term's application to poor white Southerners. One theory holds that it originated with disadvantaged corn and wheat farmers (corncrackers), who cracked their crops rather than taking them to the mill. Another theory asserts that it was applied due to Georgia and Florida settlers (Florida crackers) who cracked loud whips to drive herds of cattle, or, alternatively, from the whip cracking of plantation slave drivers. Yet another theory maintains that the term cracker was in use in Elizabethan times to describe braggarts (see crack (“to boast”)); a letter from 1766 supports this theory."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cracker (plural crackers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dry, thin, crispy baked bread (usually salty or savoury, but sometimes sweet, as in the case of graham crackers and animal crackers).",
                  "examples": [
                    "Synonym: (UK, Australia) biscuit",
                    "Coordinate terms: biscuit, brittle, cookie, chip, crisp, hardtack, snap, toast, wafer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short piece of twisted string tied to the end of a whip that creates the distinctive sound when the whip is thrown or cracked.",
                  "examples": [
                    "Synonyms: popper, snapper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A firecracker.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A person or thing that cracks, or that cracks a thing (e.g. whip cracker; nutcracker).",
              "entries": [
                {
                  "meaning": "The final section of certain whips, which is made of a short, thin piece of unravelled rope and produces a cracking sound.",
                  "examples": [
                    "Synonym: popper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Christmas cracker.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Refinery equipment used to pyrolyse organic feedstocks. If catalyst is used to aid pyrolysis it is informally called a cat-cracker",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, chiefly Britain, Australia, New Zealand) A fine, great thing or person (crackerjack).",
                  "examples": [
                    "She's an absolute cracker!",
                    "The show was a cracker!",
                    "A cracker of a day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ambitious or hard-working person (i.e. someone who arises at the 'crack' of dawn).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) One who cracks (i.e. overcomes) computer software or security restrictions.",
                  "examples": [
                    "Synonyms: black-hat hacker, black hat, hacker",
                    "Coordinate term: script kiddie"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A noisy boaster; a swaggering fellow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, derogatory, ethnic slur, offensive) An impoverished white person from the southeastern United States, originally associated with Georgia and parts of Florida; (by extension) any white person.",
                  "examples": [
                    "Synonyms: corn-cracker, honky, peckerwood, redneck, trailer trash, white trash, whitey, wonderbread; see also Thesaurus:white person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Florida, slang, derogatory) A police officer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A northern pintail, species of dabbling duck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pair of fluted rolls for grinding caoutchouc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}