{
  "word": "adjective",
  "etymologies": [
    {
      "description": [
        "From Middle English adjectif, adjective, from Old French adjectif, from Latin adiectivus, from adiciō + -īvus, from ad- (“to, towards, at”) + iaciō (“throw”). The Latin word adiectivus in turn was a calque of Ancient Greek ἐπιθετικόν (epithetikón, “added”), a derivative of the compound verb ἐπιτίθημι (epitíthēmi), from which also comes epithet."
      ],
      "adjectives": [
        {
          "description": "adjective (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Adjectival; pertaining to or functioning as an adjective.",
                  "examples": [
                    "Synonym: adjectival"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Applying to methods of enforcement and rules of procedure.",
                  "examples": [
                    "Synonym: procedural",
                    "Antonym: substantive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, of a dye) Needing the use of a mordant to be made fast to that which is being dyed.",
                  "examples": [
                    "Antonym: substantive"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, reflected in the chemical sense, but extinct as a general sense) Incapable of independent function.",
                  "examples": [
                    "In fact, God is of not so much importance in Himself, but as the end towards which man tends. That irreverent person who said that Browning uses “God” as a pigment made an accurate criticism of his theology. In Browning, God is adjective to man."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "adjective (plural adjectives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A word that modifies a noun  or noun phrase or describes a noun’s referent.",
                  "examples": [
                    "The words “big” and “heavy” are English adjectives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dependent; an accessory.",
                  "examples": [
                    "it must be an adjective of dain"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "adjective (third-person singular simple present adjectives, present participle adjectiving, simple past and past participle adjectived)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make an adjective of; to form or convert into an adjective.",
                  "examples": [
                    "Language has as much occasion to adjective the distinct signification of the verb, and to adjective also the mood, as it has to adjective time. It has  […]  adjectived all three."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly as a participle) To characterize with an adjective; to describe by using an adjective.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}