{
  "word": "suicide",
  "etymologies": [
    {
      "description": [
        "Attested in 1651 as New Latin suīcīdium (“killing of oneself”), probably originating in English. See -cide. Displaced native Old English selfcwalu (literally “self-slaughter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "suicide (countable and uncountable, plural suicides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Intentional killing of oneself.",
                  "examples": [
                    "Synonyms: (rare) autohomicide, self-blood, (Internet slang, humorous, euphemistic) self-deletion, self-killing, self-murder, self-slaughter, self-slaying"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A particular instance of a person intentionally killing themself, or of multiple people doing so.",
                  "examples": [
                    "There had been half a dozen mysterious suicides which had been investigated by Scotland Yard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person who has intentionally killed themself.",
                  "examples": [
                    "Synonyms: (Internet slang) an hero, self-killer, self-murderer, self-slayer, suicidee, (nonstandard) suicider"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An action that could cause the literal or figurative death of a person or organization, although death is not the aim of the action.",
                  "examples": [
                    "political suicide"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, US, slang) A beverage combining all available flavors at a soda fountain.",
                  "examples": [
                    "Synonyms: graveyard, swamp water"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A diabolo trick where one of the sticks is released and allowed to rotate 360° round the diabolo until it is caught by the hand that released it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A run comprising a series of sprints of increasing lengths, each followed immediately by a return to the start, with no pause between one sprint and the next.",
                  "examples": [
                    "The coach makes us run suicides at the end of each basketball practice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A children's game of throwing a ball against a wall and at other players, who are eliminated by being struck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive) Pertaining to a suicide bombing.",
                  "examples": [
                    "suicide belt",
                    "suicide vest"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "suicide (third-person singular simple present suicides, present participle suiciding, simple past and past participle suicided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To kill oneself intentionally.",
                  "examples": [
                    "\"Her husband suicided three years ago. Just like a man!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To kill (someone) and make their death appear to have been a suicide rather than a homicide (now especially as part of a conspiracy).",
                  "examples": [
                    "Have bought The Shanghai Chopsticks. Proprietor at first refused to sell, but when I ordered the boiling oil he became more reasonable. Editor reports that circulation is not what it ought to be.  […]  Will publish proclaimation, \"Any person found not in possession of The Shanghai Chopsticks (current number) will be suicided.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To self-destruct.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}