{
  "word": "pore",
  "etymologies": [
    {
      "description": [
        "From Middle English pore, from Old French pore, from Latin porus, from Ancient Greek πόρος (póros, “passage”). Displaced native English sweat hole from Middle English swet hole, which might have been a reformation of Old English swātþȳrel (literally “sweat hole”), which competed with līcþēote (literally “body pipe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pore (plural pores)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tiny opening in the skin.",
                  "examples": [
                    "Synonym: sweat hole",
                    "I could sense the sweat dripping out of all my pores."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By extension any small opening or interstice, especially one of many, or one allowing the passage of a fluid.",
                  "examples": [
                    "the pores of a rock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English poren, pouren, puren (“to gaze intently, look closely”), from Old English *purian, suggested by Old English spyrian (“to investigate, examine”). Akin to Middle Dutch poren (“to pore, look”), Dutch porren (“to poke, prod, stir, encourage, endeavour, attempt”), Low German purren (“to poke, stir”), Danish purre (“to poke, stir, rouse”), dialectal Swedish pora, pura, påra (“to work slowly and gradually, work deliberately”), Old English spor (“track, trace, vestige”). Compare also Middle English puren, piren (“to look, peer”). See peer."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pore (third-person singular simple present pores, present participle poring, simple past and past participle pored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to study meticulously; to go over again and again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to meditate or reflect in a steady way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}