{
  "word": "interact",
  "etymologies": [
    {
      "description": [
        "inter- +‎ act"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "interact (plural interacts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A short act or piece between others, as in a play; a break between acts.",
                  "examples": [
                    "Synonyms: interlude, entracte, intermission"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Intermediate employment or time.",
                  "examples": [
                    "Play, in good company, is only play, and not gaming; not deep, and consequently not dangerous nor dishonourable. It is only the inter-acts of other amusements."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social sciences) A pair or series of acts involving more than one person.",
                  "examples": [
                    "Inasmuch as it is impossible to analyze the contents of an entire interpersonal relationship, it is helpful to conceptualize a given communication event as consisting of a series of subevents. Any one subevent may be pulled out as a basic unit for analysis in the study of interpersonal communication; this basic unit may then be called an interact.  […]  each interact is a distinctive attempt to conceal, repeat, or disclose information and/or to influence the relationship."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "interact (third-person singular simple present interacts, present participle interacting, simple past and past participle interacted)",
          "definitionGroups": [
            {
              "group": "(intransitive) To act upon each other.",
              "entries": [
                {
                  "meaning": "(of people) To engage in communication and other shared activities (with someone).",
                  "examples": [
                    "The way staff interact with each other during breaks can play an important role in the workplace."
                  ]
                },
                {
                  "meaning": "(of two or more things) To affect each other.",
                  "examples": [
                    "This medication can interact with alcohol, so it's best to avoid drinking while you're taking it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}