{
  "word": "glove",
  "etymologies": [
    {
      "description": [
        "From Middle English glove, glofe, from Old English glōf, *glōfe, *glōfa, (\"glove\"; weak forms attested only in plural form glōfan (“gloves”)), from Proto-Germanic *galōfô (“glove”), from Proto-Germanic *ga- (“collective and associative prefix”) + Proto-Germanic *lōfô (“flat of the hand, palm”), from Proto-Indo-European *lāp-, *lēp-, *lep- (“flat”). Cognate with Scots gluve, gluive (“glove”), Icelandic glófi (“glove”). Related to Middle English lofe, lufe (“palm of the hand”). More at loof."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "glove (plural gloves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An item of clothing, covering all or part of the hand and fingers, but usually allowing independent movement of the fingers.",
                  "examples": [
                    "I wore gloves to keep my hands warm.",
                    "The boxing champ laced on his gloves before the big bout."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A baseball mitt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, figuratively) The ability to catch a hit ball.",
                  "examples": [
                    "Frederico had a great glove, but he couldn't hit a curveball, so he never broke into the pros."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A condom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with definite article) A challenge from one to another.",
                  "examples": [
                    "to throw down the glove, i.e. to offer a challenge; to take up the glove, to accept it"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "glove (third-person singular simple present gloves, present participle gloving, simple past and past participle gloved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, transitive) To catch the ball in a baseball mitt.",
                  "examples": [
                    "He gloved the line drive for the third out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put a glove or gloves on.",
                  "examples": [
                    "Maxwell gloved his hand so that he wouldn't leave fingerprints, then pulled the trigger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) To touch a delivery with one's glove while the gloved hand is on the bat. Under the rules of cricket, the batsman is deemed to have hit the ball.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}