{
  "word": "uproot",
  "etymologies": [
    {
      "description": [
        "From up- (prefix indicating a higher direction or position) +‎ root (“to tear up by the roots; (figuratively) to remove forcibly from a place; to eradicate, exterminate”, verb). Root is derived from root (“underground part of a plant”, noun), from Middle English rote, from Old English rōt, rōte, from Old Norse rót, from Proto-Germanic *wrōts, ultimately from Proto-Indo-European *wréh₂ds (“root”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "uproot (plural uproots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of uprooting something.",
                  "examples": [
                    "With the uproot of the Chinese commercial system in the 1890s such a crisis was bound to surface."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "uproot (third-person singular simple present uproots, present participle uprooting, simple past and past participle uprooted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To tear up (a plant, etc.) by the roots, or as if by the roots; to extirpate, to root up.",
                  "examples": [
                    "Synonyms: deracinate, disroot, grub up, outroot, rout, unroot"
                  ]
                },
                {
                  "meaning": "(figuratively) To destroy (something) utterly; to eradicate, exterminate.",
                  "examples": [
                    "Synonyms: annihilate, obliterate; see also Thesaurus:destroy"
                  ]
                },
                {
                  "meaning": "(figuratively) To remove (someone or something) from a familiar circumstance, especially suddenly and unwillingly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, reflexive) Of oneself or someone: to move away from a familiar environment (for example, to live elsewhere).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From up- (prefix indicating a higher direction or position) +‎ root (“of a pig or other animal: to dig or turn up with the snout; to search as if by digging in soil, rummage”, verb). Root is derived from Middle English wroten (“to dig or turn up with the snout; to remove soil, dig up”), from Old English wrōtan (“to dig or turn up with the snout”), from Proto-Germanic *wrōtaną (“to dig or turn up with the snout”); further etymology uncertain."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "uproot (third-person singular simple present uproots, present participle uprooting, simple past and past participle uprooted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of a pig or other animal: to dig up (something in the ground) using the snout; to rummage for (something) in the ground; to grub up, to root, to rout.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}