{
  "word": "resurrectionist",
  "etymologies": [
    {
      "description": [
        "From resurrection (“the act of rising from the dead and becoming alive again”) +‎ -ist (“forms agents of cause; forms adherents of a belief”), coined alongside resurrection man."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "resurrectionist (plural resurrectionists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic, historical) One who sells cadavers to anatomists, surgeons, etc., especially by exhuming corpses from graves; a graverobber.",
                  "examples": [
                    "One... who makes open profession of dealing in dead bodies and is well known by the name of the Resurrectionist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) A believer in a future bodily resurrection.",
                  "examples": [
                    "Those who make the rest of the dead... to be the same with the remnant slain by the sword... to be consistent, ought to make the first resurrectionists the same with the armies in heaven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who resurrects an abandoned idea, practice, etc.; a revivalist.",
                  "examples": [
                    "We have no taste for enacting the part of literary resurrectionists."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous, obsolete) One who sells repaired or reconditioned goods; a refurbisher.",
                  "examples": [
                    "Some of the habitual buyers [of ostrich feathers] have nicknames, and those who do a local business and buy for re-selling are known as ‘resurrectionists’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(equestrianism, humorous, obsolete) A racehorse that (once or numerously) suddenly recovers its stamina midrace.",
                  "examples": [
                    "There is a class of horses called ‘resurrectionists’... and they either recover early form... or... become animated, when they were supposed to be gone altogether, with... life and vigour."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}