{
  "word": "pristine",
  "etymologies": [
    {
      "description": [
        "From Middle French pristin, borrowed from Latin prīstinus."
      ],
      "adjectives": [
        {
          "description": "pristine (comparative more pristine, superlative most pristine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unspoiled; still with its original purity; uncorrupted or unsullied.",
                  "examples": [
                    "The beach back is in pristine condition after a council-led cleanup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Primitive, pertaining to the earliest state of something.",
                  "examples": [
                    "Thus fable reports that the fair Grimalkin, whom Venus, at the desire of a passionate lover, converted from a cat into a fine woman, no sooner perceived a mouse than, mindful of her former sport, and still retaining her pristine nature, she leaped from the bed of her husband to pursue the little animal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Perfect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Ancient Greek πρίστης (prístēs, “a saw, one that saws”)."
      ],
      "adjectives": [
        {
          "description": "pristine (comparative more pristine, superlative most pristine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to sawfishes of the family Pristidae.",
                  "examples": [
                    "This indicates that the present levels of genetic diversity in P. microdon are not unusually low, although the amount of diversity to be expected in pristine populations of coastal species of elasmobranch remains elusive because all populations investigated to date have suffered some degree of decline (e.g. Sandoval-Castillo et al. 2004, Keeney et al. 2005, Hoelzel et al. 2006, Stow et al. 2006, Lewallen et al. 2007)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}