{
  "word": "palm",
  "etymologies": [
    {
      "description": [
        "From Middle English palme, from Old English palm, palma (“palm-tree, palm-branch”), from Latin palma (“palm-tree, palm-branch, palm of the hand”), from Proto-Indo-European *pl̥h₂meh₂, *pl̥h₂emeh₂ (“palm of the hand”), from Proto-Indo-European *pleh₂- (“flat”). Cognate with Dutch palm, German Palme, Danish palme, Icelandic pálmur (“palm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "palm (plural palms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various evergreen trees from the family Palmae or Arecaceae, which are mainly found in the tropics.",
                  "examples": [
                    "Synonym: palm tree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A branch or leaf of the palm, anciently borne or worn as a symbol of victory or rejoicing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, by extension) Triumph; victory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scouting) Any of 23 awards that can be earned after obtaining the Eagle Scout rank, but generally only before turning 18 years old.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English palme, paume, from Old French palme, paulme, paume (“palm of the hand, ball, tennis”), from Latin palma (“palm of the hand, hand-breadth”), from Proto-Indo-European *pl̥h₂(e)meh₂ (“palm of the hand”), from Proto-Indo-European *pleh₂- (“flat”). Doublet of palmo, palma, and pam. Cognate with Ancient Greek παλάμη (palámē, “palm of the hand”), Old English folm (“palm of the hand”), Old Irish lám (“hand”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "palm (plural palms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The inner and somewhat concave part of the human hand that extends from the wrist to the bases of the fingers.",
                  "examples": [
                    "The open palm of desire wants everything."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The corresponding part of the forefoot of a lower mammal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Synonym of hand, any of various units of length notionally derived from the breadth of the palm, formalized in England as 4 inches and now chiefly used for the height of horses",
                  "examples": [
                    "He found it to be ninety-five fathoms wide, and five palms deep at a place of average depth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Any of various units of length notionally derived from the length of the palm from the wrist to the base of the fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sailmaking) A metallic disk attached to a strap and worn in the palm of the hand; used to push the needle through the canvas, in sewing sails, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The broad flattened part of an antler, as of a full-grown fallow deer; so called as resembling the palm of the hand with its protruding fingers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The flat inner face of an anchor fluke.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "palm (third-person singular simple present palms, present participle palming, simple past and past participle palmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold or conceal something in the palm of the hand, e.g, for an act of sleight of hand or to steal something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold something without bending the fingers significantly.",
                  "examples": [
                    "John palmed the ball."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move something with the palm of the hand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}