{
  "word": "taste",
  "etymologies": [
    {
      "description": [
        "From Middle English tasten, borrowed from Old French taster, from assumed Vulgar Latin *tastāre, from assumed Vulgar Latin *taxitāre, a new iterative of Latin taxāre (“to touch sharply”), from tangere (“to touch”), ultimately from Proto-Indo-European *teh₂g-. Almost displaced native Middle English smaken, smakien (“to taste”) (from Old English smacian (“to taste”)), Middle English smecchen (“to taste, smack”) (from Old English smæċċan (“to taste”)) (whence Modern English smack), Middle English buriȝen (“to taste”) (from Old English byrigan, birian (“to taste”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "taste (countable and uncountable, plural tastes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the sensations produced by the tongue in response to certain chemicals; the quality of giving this sensation.",
                  "examples": [
                    "He had a strange taste in his mouth.",
                    "Venison has a strong taste."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sense that consists in the perception and interpretation of this sensation.",
                  "examples": [
                    "His taste was impaired by an illness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small sample of food, drink, or recreational drugs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) A person's implicit set of preferences, especially esthetic, though also culinary, sartorial, etc.",
                  "examples": [
                    "Dr. Parker has good taste in wine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Personal preference; liking; predilection.",
                  "examples": [
                    "I have developed a taste for fine wine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, figuratively) A small amount of experience with something that gives a sense of its quality as a whole.",
                  "examples": [
                    "Such anecdotes give one a taste of life on a trauma ward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of narrow and thin silk ribbon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "taste (third-person singular simple present tastes, present participle tasting, simple past and past participle tasted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sample the flavor of something orally.",
                  "examples": [
                    "when the ruler of the feast had tasted the water that was made wine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To have a taste; to excite a particular sensation by which flavor is distinguished.",
                  "examples": [
                    "The chicken tasted great, but the milk tasted like garlic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To identify (a flavor) by sampling something orally.",
                  "examples": [
                    "I can definitely taste the marzipan in this cake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To experience.",
                  "examples": [
                    "I tasted in her arms the delights of paradise.",
                    "They had not yet tasted the sweetness of freedom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take sparingly.",
                  "examples": [
                    "Age but tastes of pleasures, youth devours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To try by eating a little; to eat a small quantity of.",
                  "examples": [
                    "I tasted a little of this honey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To try by the touch; to handle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}