{
  "word": "summer",
  "etymologies": [
    {
      "description": [
        "From Middle English somer, sumer, from Old English sumor (“summer”), from Proto-West Germanic *sumar, from Proto-Germanic *sumaraz (“summer”), from Proto-Indo-European *sm̥-h₂-ó-, oblique of *semh₂- (“summer, year”).",
        "Cognate with Scots somer, sumer, simer (“summer”), West Frisian simmer (“summer”), Saterland Frisian Suumer (“summer”), Dutch zomer (“summer”), Low German Sommer (“summer”), German Sommer (“summer”),  Danish and Norwegian Bokmål sommer (“summer”), Swedish sommar (“summer”), Norwegian Nynorsk and Icelandic sumar (“summer”), Welsh haf (“summer”), Armenian ամ (am, “year”), ամառ (amaṙ, “summer”), Sanskrit समा (sámā, “a half-year, season, weather, year”), Northern Kurdish havîn (“summer”), Central Kurdish ھاوین‎ (hawîn, “summer”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "summer (countable and uncountable, plural summers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of four seasons, traditionally the second, marked by the longest and typically hottest days of the year due to the inclination of the Earth and thermal lag. Typically regarded as being from June 21 to September 22 or 23 in parts of the USA, the months of June, July and August in the United Kingdom and the months of December, January and February in the Southern Hemisphere.",
                  "examples": [
                    "the heat of summer"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poetic or humorous) year; used to give the age of a person, usually a young one.",
                  "examples": [
                    "He was barely eighteen summers old.",
                    "She had seen not more than twenty summers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, fashion) Someone with light, pinkish skin that has a blue undertone, light hair and eyes, seen as best suited to certain colors of clothing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "summer (third-person singular simple present summers, present participle summering, simple past and past participle summered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To spend the summer, as in a particular place on holiday.",
                  "examples": [
                    "We like to summer in the Mediterranean."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English somer, from Anglo-Norman summer, sumer, from Vulgar Latin saumārius, for Late Latin sagmārius, from Latin sagma (“sum”). Compare sumpter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "summer (plural summers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A horizontal beam supporting a building.",
                  "examples": [
                    "Synonyms: summerbeam, summertree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pack-horse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "sum +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "summer (plural summers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who sums.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine or algorithm that sums.",
                  "examples": [
                    "A basic feedback system consists of ... and a  summing point (comparator or summer)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}