{
  "word": "smearer",
  "etymologies": [
    {
      "description": [
        "smear +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "smearer (plural smearers)",
          "definitionGroups": [
            {
              "group": "Someone who smears.",
              "entries": [
                {
                  "meaning": "Someone who spreads a substance across a surface.",
                  "examples": [
                    "The walls, strongly built of stones, are still breast-high, and the marks of the smearers’ fingers on the plaster inside plainly visible."
                  ]
                },
                {
                  "meaning": "(derogatory) Someone who tries to damage another's reputation through slander or innuendo.",
                  "examples": [
                    "Synonyms: libeler, slanderer, vilifier"
                  ]
                },
                {
                  "meaning": "(derogatory) An unskillful painter.",
                  "examples": [
                    "Synonym: dauber"
                  ]
                },
                {
                  "meaning": "(Scotland, agriculture, historical) A worker employed to apply a tar-based salve to sheep to protect their skin during the winter.",
                  "examples": [
                    "[…]  when the smearer had inlaid with his mixture of butter and tar, that number of the fleeces of the living flock which it was his daily task thus to cover from the cold,"
                  ]
                },
                {
                  "meaning": "(obsolete, derogatory) A person without skill or education who attempts to cure diseases.",
                  "examples": [
                    "Synonym: quack"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something used for smearing.",
                  "examples": [
                    "The polished edge of a slide held between thumb and fingers is touched to a medium-sized fresh drop of blood and pressed against another slide near its end. As soon as the blood spreads across the edge of the smearer, draw it gently and evenly along the lower slide till the drop is exhausted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A circuit used to eliminate the overshoot of a pulse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}