{
  "word": "breeze",
  "etymologies": [
    {
      "description": [
        "From the earlier (nautical) term brise, brize (“breeze”), from Middle English brees (“wind”). Ultimate origin obscure.",
        "Variously supposed to derive from a Germanic source like Saterland Frisian Briese (“breeze”), West Frisian brys (“a cool wind”), Dutch bries (“breeze”), early Dutch brysen (“to blow cool and fresh”), or from Spanish brisa (“northeast wind”).",
        "The earliest attestations are in Middle English brees (1460), Catalan brisa, and Italian brezza (all in 15th century), with Spanish (1504) and Portuguese briza (16th century) following closely after. The aforementioned Dutch cognates and French brise, however, are attested later than the term in English. The only internal hypothesis for any of those languages is a corruption of Old Occitan bisa (“strong wind”), which is not widely accepted.",
        "Compare also Albanian breshër (“hail”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breeze (plural breezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light, gentle wind.",
                  "examples": [
                    "The breeze rustled the papers on her desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any activity that is easy, not testing or difficult.",
                  "examples": [
                    "After studying Latin, Spanish was a breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) Wind blowing across a cricket match, whatever its strength.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An excited or ruffled state of feeling; a flurry of excitement; a disturbance; a quarrel.",
                  "examples": [
                    "The discovery produced a breeze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief workout for a racehorse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "breeze (third-person singular simple present breezes, present participle breezing, simple past and past participle breezed) (intransitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with along) To move casually, in a carefree manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weather) To blow gently.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take a horse on a light run in order to understand the running characteristics of the horse and to observe it while under motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of fish) To swim near the surface of the water, causing ripples in the surface.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English brese, from Old English brēosa, variant of Old English brimsa (“gadfly”), from Proto-Germanic *bremusī (“gadfly”), from Proto-Indo-European *bʰerem- (“to make a noise, buzz, hum”). Cognate with Dutch brems (“horsefly, warblefly”), German Bremse (“gadfly, horsefly”), Danish bremse (“gadfly, horsefly”), Swedish broms (“gadfly, horsefly”). Related also to Middle English brimse (“gadfly”), French brize (“gadfly”), Old English bremman (“to rage, roar”), Latin fremō (“roar, snort, growl, grumble”). See also bream."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breeze (plural breezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gadfly; a horsefly; a strong-bodied dipterous insect of the family Tabanidae.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "breeze (third-person singular simple present breezes, present participle breezing, simple past and past participle breezed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To buzz.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably from French braise (“burning coals”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breeze (plural breezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ashes and residue of coal or charcoal, usually from a furnace. See Wikipedia article on Clinker.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}