{
  "word": "nursery",
  "etymologies": [
    {
      "description": [
        "From Middle English noricerie, norserye (“children's nursery; state of being fostered or nursed; education, upbringing”) [and other forms], from Old French norricerie, nourricerie, from norrice, nourrice (modern French nourrice (“childminder, nanny; wet nurse”)) + -erie (suffix forming feminine nouns). Norrice and nourrice are derived from Late Latin nūtrīcia (“wet nurse”), from Latin nūtrīcius (“that nurses or suckles; nourishing”), from nūtriō (“to breastfeed, nurse, suckle”), possibly ultimately from Proto-Indo-European *(s)neh₂- (“to flow”). The English word may be analysed as nourice, nurse  +‎ -ery (suffix forming nouns meaning ‘place of’)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nursery (countable and uncountable, plural nurseries)",
          "definitionGroups": [
            {
              "group": "(countable) A place where nursing (“breastfeeding”) or the raising of children is carried on.",
              "entries": [
                {
                  "meaning": "(by extension) Especially in European countries: a room or area in a household set apart for the care of children.",
                  "examples": []
                },
                {
                  "meaning": "A place where the pre-school children of working parents are supervised during the day; a crèche, a daycare centre.",
                  "examples": []
                },
                {
                  "meaning": "A nursery school (“a school where pre-school children learn and play at the same time”).",
                  "examples": []
                },
                {
                  "meaning": "(Philippines) The first year of pre-school.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, also figuratively) A place where anything is fostered and growth promoted.",
              "entries": [
                {
                  "meaning": "(agriculture, zoology) A place where animals breed, or where young animals are naturally or artificially reared (for example, on a farm).",
                  "examples": []
                },
                {
                  "meaning": "(horticulture) A place where young shrubs, trees, vines, etc., are cultivated for transplanting, or (more generally) made available for public sale, a garden centre; also (obsolete) a plantation of young trees.",
                  "examples": []
                },
                {
                  "meaning": "(sports) A club or team for developing the skills of young players.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something which educates and nurtures.",
                  "examples": [
                    "Commerce is the nursery of seamen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, billiards) Short for nursery cannon (“a carom shot involving balls that are very close together”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete, rare) Someone or something that is nursed; a nursling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) The act of nursing or rearing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}