{
  "word": "marriage",
  "etymologies": [
    {
      "description": [
        "From Middle English mariage, from Old French mariage, from marier (“to marry”), from Latin marītō (“marry”, verb, literally “give in marriage”), from maritus (“lover”, “nuptial”), from mas (“male, masculine, of the male sex”). Equivalent to marry +‎ -age. Doublet of maritage. Displaced native Old English sinsċipe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "marriage (countable and uncountable, plural marriages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being married. [from 14th c.]",
                  "examples": [
                    "You should enter marriage for love."
                  ]
                }
              ]
            },
            {
              "group": "A union of two or more people that creates a family tie and carries legal, social, and/or religious rights and responsibilities. [from 14th c.]",
              "entries": [
                {
                  "meaning": "(sometimes specifically) The union of only two people, to the exclusion of all others.",
                  "examples": [
                    "\"I have a patient right now whose marriage proved to be a tragedy. She wanted love, sexual gratification, children, and social prestige; but life blasted all her hopes. Her husband didn't love her. He refused even to eat with her, and forced her to serve his meals in his room upstairs. She had no children, no social standing. She went insane; and, in her imagination, she divorced her husband and resumed her maiden name. She now believes she has married into the English aristocracy, and she insists on being called Lady Smith."
                  ]
                },
                {
                  "meaning": "(often specifically) The union of two people of opposite sex, to the exclusion of all others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wedding; a ceremony in which people wed. [from 14th c.]",
                  "examples": [
                    "You are cordially invited to the marriage of James Smith and Jane Doe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A close union. [from 15th c.]",
                  "examples": [
                    "And this marriage of poetry and history remained a solid relationship throughout the classical period."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A joining of two parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A king and a queen, when held as a hand in some versions of poker or melded in pinochle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In solitaire or patience games, the placing a card of the same suit on the next one above or below it in value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prison slang) A homosexual relationship between male prisoners.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}