{
  "word": "yaw",
  "etymologies": [
    {
      "description": [
        "Unknown, first attested in the mid-16th century. Compare to yar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yaw (plural yaws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rotation of an aircraft, ship, or missile about its vertical axis so as to cause the longitudinal axis of the aircraft, ship, or missile to deviate from the flight line or heading in its horizontal plane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The angle between the longitudinal axis of a projectile at any moment and the tangent to the trajectory in the corresponding point of flight of the projectile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A vessel's motion rotating about the vertical axis, so the bow yaws from side to side; a characteristic of unsteadiness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The extent of yawing; the rotation angle about the vertical axis.",
                  "examples": [
                    "the yaw of an aircraft"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yaw (third-person singular simple present yaws, present participle yawing, simple past and past participle yawed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, aviation) To turn about the vertical axis while maintaining course.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To swerve off course to port or starboard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To steer badly, zigzagging back and forth across the intended course of a boat; to go out of the line of course.",
                  "examples": [
                    "Just as he would lay the ship's course, all yawing being out of the question."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rise in blisters, breaking in white froth, as cane juice in the clarifiers in sugar works.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yaw (plural yaws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single tumor in the disease called yaws.",
                  "examples": [
                    "Sometimes there remains one large Yaw, high and knobbed, red and moist; this is called the master Yaw;  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}