{
  "word": "summon",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman somoundre, from Old French sumundre, from Latin summonēre, itself from sub + monēre, ultimately from Proto-Indo-European *monéyeti, causative from *men- (“to think”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "summon (plural summons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games) A creature magically summoned to do the summoner's bidding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "call, command, order",
                  "examples": [
                    "The deceased was 58 years of age, was the picture of health even five or six hours prior to his death, when suddenly the grim messenger came with a summon from a Higher Tribunal, calling him to duties above."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "summon (third-person singular simple present summons, present participle summoning, simple past and past participle summoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To call people together; to convene.",
                  "examples": [
                    "Silence is primary, summoning presence to itself; so it's a connection to the realm of origin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ask someone to come; to send for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To order (goods) and have delivered",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rouse oneself to exert a skill.",
                  "examples": [
                    "Synonyms: summon up, muster, muster up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy, transitive) To call a resource by magic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, transitive) To summons; convene.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Borrowed from Malay saman (“fine, financial penalty”), which is itself borrowed from English summons (“notice summoning someone to appear in court”). This sense re-emerged in English as summon likely due to the erroneous belief that the original singular English word summons is plural. Doublet of summons and saman."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "summon (plural summons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Malaysia, colloquial, slang) A fine; a fee or monetary penalty incurred for breaking the law; usually for a minor offence such as a traffic violation.",
                  "examples": [
                    "Synonyms: summons, saman",
                    "You better pay off the parking summon tomorrow before you kena interest on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Malaysia, colloquial, slang) A notice of an infringement of the law, usually incurring such a penalty; a citation or ticket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "summon (third-person singular simple present summons, present participle (rare) summoning, simple past and past participle summoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Malaysia, colloquial, slang) To impose such a fine or penalty, or to issue a notice thereof.",
                  "examples": [
                    "The police summoned the driver for speeding.",
                    "They kena summoned for littering."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}