{
  "word": "inside",
  "etymologies": [
    {
      "description": [
        "From Middle English ynneside; equivalent to in- +‎ side.",
        "Compare German Innenseite (“inside”), Danish inderside (“inside”), Swedish insida (“inside”), Dutch binnenzijde (“inside”), German Low German Binnensied, Binnersied (“inside”), Saterland Frisian Binnersiede (“inside”)."
      ],
      "adjectives": [
        {
          "description": "inside (comparative more inside, superlative most inside)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of or pertaining to the inner surface, limit or boundary.",
                  "examples": [
                    "The inside surface of the cup is unpainted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nearer to the interior or centre of something.",
                  "examples": [
                    "Because of the tighter bend, it's harder to run in an inside lane.",
                    "All the window seats were occupied, so she took an inside seat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Originating from, arranged by, or being someone inside an organisation.",
                  "examples": [
                    "The reporter had received inside information about the forthcoming takeover.",
                    "The robbery was planned by the security guard: it was an inside job.",
                    "They wanted to know the inside story behind the celebrity's fall from grace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Legally married to or related to (e.g. born in wedlock to), and/or residing with, a specified other person (parent, child, or partner); (of a marriage, relationship, etc) existing between two such people.",
                  "examples": [
                    "Antonym: outside"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, of a pitch) Toward the batter as it crosses home plate.",
                  "examples": [
                    "The first pitch is ... just a bit inside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At or towards or the left-hand side of the road if one drives on the left, or right-hand side if one drives on the right.",
                  "examples": [
                    "the inside lane of the motorway"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "inside (comparative more inside, superlative most inside)",
          "definitionGroups": [
            {
              "group": "Within or towards the interior of something; within the scope or limits of something (a place), especially a building.",
              "entries": [
                {
                  "meaning": "(colloquial) In or to prison.",
                  "examples": [
                    "He spent ten years inside, doing a stretch for burglary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Indoors.",
                  "examples": [
                    "It was snowing, so the children stayed inside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intimately, secretly; without expressing what one is feeling or thinking.",
                  "examples": [
                    "Are you laughing at us inside?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "inside (plural insides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The interior or inner part.",
                  "examples": [
                    "The inside of the building has been extensively restored."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The left-hand side of a road if one drives on the left, or right-hand side if one drives on the right.",
                  "examples": [
                    "On a motorway, you should never pass another vehicle on the inside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side of a curved road, racetrack etc. that has the shorter arc length; the side of a racetrack nearer the interior of the course or some other point of reference.",
                  "examples": [
                    "The car in front drifted wide on the bend, so I darted up the inside to take the lead."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) (in the plural) The interior organs of the body, especially the guts.",
                  "examples": [
                    "Eating that stuff will damage your insides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, UK, colloquial) A passenger within a coach or carriage, as distinguished from one upon the outside.",
                  "examples": [
                    "So down thy hill, romantic Ashbourne, glides / The Derby dilly, carrying three insides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The inside scoop; information known only to certain involved people.",
                  "examples": [
                    "Anyone got the inside on the new ratings? The book is out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "inside",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Within the interior of something, closest to the center or to a specific point of reference.",
                  "examples": [
                    "He placed the letter inside the envelope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Within a period of time.",
                  "examples": [
                    "The job was finished inside two weeks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}