{
  "word": "ambition",
  "etymologies": [
    {
      "description": [
        "From Middle English ambicioun, from Old French ambition, from Latin ambitiō (“ambition, a striving for favor, literally 'a going around', especially of candidates for office in Rome soliciting votes”), from ambiō (“I go around, solicit votes”). See ambient, issue."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ambition (countable and uncountable, plural ambitions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable) Eager or inordinate desire for some object that confers distinction, as preferment, honor, superiority, political power, or fame; desire to distinguish one's self from other people.",
                  "examples": [
                    "My son, John, wants to be a firefighter very much. He has a lot of ambition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An object of an ardent desire.",
                  "examples": [
                    "My ambition is to own a helicopter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A desire, as in (sense 1), for another person to achieve these things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A personal quality similar to motivation, not necessarily tied to a single goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of going about to solicit or obtain an office, or any other object of desire; canvassing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ambition (third-person singular simple present ambitions, present participle ambitioning, simple past and past participle ambitioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To seek after ambitiously or eagerly; to covet.",
                  "examples": [
                    "Pausanias, ambitioning the sovereignty of Greece, bargains with Xerxes for his daughter in marriage."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}