{
  "word": "marker",
  "etymologies": [
    {
      "description": [
        "From mark +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "marker (plural markers)",
          "definitionGroups": [
            {
              "group": "Someone or something that creates marks, particularly",
              "entries": [
                {
                  "meaning": "A felt-tipped pen, a marker pen.",
                  "examples": [
                    "Don't use the permanent marker on the whiteboard."
                  ]
                },
                {
                  "meaning": "A scorekeeper, especially one who tallies billiard scores.",
                  "examples": []
                },
                {
                  "meaning": "(paintball) A device that fires a paintball.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Someone or something used to mark a position or amount, particularly",
              "entries": [
                {
                  "meaning": "A real or virtual objective, something to be aimed for.",
                  "examples": [
                    "Pellegrini insisted this was a game City had to win - this they did and with the sort of performance that put down a marker for how the Chilean wants his team to play."
                  ]
                },
                {
                  "meaning": "(US, slang) Synonym of IOU, an informal record of a debt.",
                  "examples": []
                },
                {
                  "meaning": "(linguistics) A free or bound morpheme indicating a grammatical function.",
                  "examples": []
                },
                {
                  "meaning": "(linguistics) Short for discourse marker.",
                  "examples": []
                },
                {
                  "meaning": "(biology) A gene or DNA sequence with a known location on a chromosome that can be used to identify individuals or species.",
                  "examples": []
                },
                {
                  "meaning": "(biology, medicine) A substance used as an indicator for diagnosis or other analysis, a biomarker.",
                  "examples": []
                },
                {
                  "meaning": "(military) The soldier who forms the pilot of a wheeling column or marks the direction of an alignment.",
                  "examples": []
                },
                {
                  "meaning": "A sewing machine attachment that creases the fabric to mark a line",
                  "examples": []
                },
                {
                  "meaning": "A counter, especially one used in card games.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) Someone who assigns marks on tests, examinations, etc.; a grader.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The ink marks or residue of a felt-tipped pen.",
                  "examples": [
                    "Susie got marker all over the walls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A personal favor owed to someone, whether written or not.",
                  "examples": [
                    "We may not be able to do this alone. Maybe it’s time to call in some of our markers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(competition law) A formal certification that a company was the first to approach a competition authority to reveal the existence of a cartel, generally entitling it to greater leniency during the cartel's dissolution and punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A player on defense used to mark one or more offensive players.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A player employed by a private club to compete against members.",
                  "examples": [
                    "The Court itself, with its rent, the wages of the Marker and the tips to the Marker, the rackets and the balls, the baths and the flannels and the washing of the flannels, do much to account for the costliness of play."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "marker (third-person singular simple present markers, present participle markering, simple past and past participle markered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark or write on (something) using a marker",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}