{
  "word": "sidebar",
  "etymologies": [
    {
      "description": [
        "From side +‎ bar."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sidebar (plural sidebars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short news story printed alongside a larger one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A block of information placed at the side of a printed page.",
                  "examples": [
                    "The tables in the sidebar can be used to determine “average” height and weight, and to provide a slight random variation if desired."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A block of information placed at the side of a webpage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law) a short conference, between a judge and the attorneys of a case, held outside the hearing of the jury and the spectators at the court",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, law) the place in the courtroom where such a conference happens.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accessory side note or aside made during a conversation, without changing the scope of the audience.",
                  "examples": [
                    "Well, when Charlotte had her mini-death, she went to Hell. Forest haunted her Hell loop and now is haunting her nightmares -- which, sidebar, Dan is also a part of, so things are heating up."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short conversation between a smaller portion of a group held outside the hearing of the rest of the group.",
                  "examples": [
                    "May we have a moment to discuss your proposition? Sidebar!Let's pick a topic. Sidebar!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sidebar (third-person singular simple present sidebars, present participle sidebarring, simple past and past participle sidebarred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to place (information) into a sidebar, or as if into a sidebar",
                  "examples": [
                    "Morgan \"One of them was called Alexandria and then there was a place called the Kingdom. It actually had a king.\"Althea \"A king?\"Morgan \"Even had a pet tiger.\"Althea \"All right, we're gonna have to sidebar that one. These settlements, were they good places to live?\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}