{
  "word": "affection",
  "etymologies": [
    {
      "description": [
        "From Middle English affection, affeccion, affeccioun, from Old French affection, from Latin affectiōnem, from affectiō; equivalent to affect +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "affection (countable and uncountable, plural affections)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of affecting or acting upon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being affected, especially: a change in, or alteration of, the emotional state of a person or other animal, caused by a subjective affect (a subjective feeling or emotion), which arises in response to a stimulus which may result from either thought or perception.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attribute; a quality or property; a condition.",
                  "examples": [
                    "A Porism is a proposition in which it is proposed to demonstrate that some one thing, or more things than one, are given, to which, as also to each of innumerable other things, not given indeed, but which have the same relation to those which are given, it is to be shewn that there belongs some common affection described in the proposition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emotion; a feeling or natural impulse acting upon and swaying the mind.",
                  "examples": [
                    "It is known that each individual has a variety of affections, one affection when in joy, another when in grief, another when in sympathy and compassion, another when in sincerity and truth, another when in love and charity, another when in zeal or in anger, another when in simulation and deceit, another when in quest of honor and glory, and so on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A feeling of love or strong attachment.",
                  "examples": [
                    "I have a lot of affection for my little sister.",
                    "The marriage therapist suggested they show each other more affection."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, archaic) A disease; a morbid symptom; a malady.",
                  "examples": [
                    "A heavy clay soil is bad for all neuralgics, and the house should be dry, and on a sandy or gravel soil. The desideratum for all neuralgic affections is perpetual summer  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "affection (third-person singular simple present affections, present participle affectioning, simple past and past participle affectioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To feel affection for. [from 16th c.]",
                  "examples": [
                    "Why, truth is truth, I do not think my lady Isabella ever much affectioned my young lord, your son: yet he was a sweet youth as one should see."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}