{
  "word": "slumber",
  "etymologies": [
    {
      "description": [
        "From Middle English slombren, slomren, frequentative of Middle English slummen, slumen (“to doze”), probably from Middle English slume (“slumber”), from Old English slūma, from Proto-Germanic *slūm- (“slack, loose, limp, flabby”), from Proto-Indo-European *(s)lew- (“loose, limp, flabby”), equivalent to sloom +‎ -er. Cognate with West Frisian slommerje, slûmerje (“to slumber”), Dutch sluimeren (“to slumber”), German schlummern (“to slumber, doze”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slumber (plural slumbers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very light state of sleep, almost awake.",
                  "examples": [
                    "He at last fell into a slumber, and thence into a fast sleep, which detained him in that place until it was almost night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A state of ignorance or inaction.",
                  "examples": [
                    "Marcel Duchamp's urinal and readymades seemed in the beginning to be insider jokes or jokelike paradoxes meant to awaken people from their aesthetic slumbers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, as used by Magnavox clock radios) The snooze button on an alarm clock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slumber (third-person singular simple present slumbers, present participle slumbering, simple past and past participle slumbered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in a very light state of sleep, almost awake.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be inactive or negligent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To lay to sleep.",
                  "examples": [
                    "slumber his conscience"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To stun; to stupefy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}