{
  "word": "stocker",
  "etymologies": [
    {
      "description": [
        "stock +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stocker (plural stockers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture) livestock that is wintered and then sold in the spring; often contrasted with a feeder when the focus is on intended disposition.",
                  "examples": [
                    "When sheep are shipped as stockers from the ranges, the numbers are such usually as to admit of grading the animals before they are shipped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(automotive) A racecar in certain classes of auto racing whose origins are nominally or notionally related to factory-stock autos, such as stock car racing or super-stock drag racing.",
                  "examples": [
                    "For a starter, a complete technical analysis of the winningest NASCAR stocker of all time, Richard Petty’s 1967 Plymouth Belvedere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who crafts gun stocks",
                  "examples": [
                    "We mean by this that a man who has become great as a stocker would not necessarily know anything about barrel-boring, anything about actioning, anything about lock-making, nor anything about shooting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who stocks shelves with inventory",
                  "examples": [
                    "I worked for two winters at Kmart in Arizona as a stocker and security guard. I was a stocker for Payless Drugs for two winters in West Seattle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who supplies raw material to a machine",
                  "examples": [
                    "_ has been working as a stocker at a rolling mill (a stocker keeps material on hand for the heaters)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}