{
  "word": "phlegm",
  "etymologies": [
    {
      "description": [
        "From Middle English flewme, fleume, fleme, from Old French fleume, Middle French flemme (French flegme), and their source, Latin phlegma, from Ancient Greek φλέγμα (phlégma, “flame; inflammation; clammy humor in the body”), from φλέγειν (phlégein, “to burn”). Compare phlox, flagrant, flame, bleak (adjective), fulminate. Spelling later altered to resemble the word's Latin and Greek roots."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phlegm (usually uncountable, plural phlegms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) One of the four humors making up the body in ancient and mediaeval medicine; said to be cold and moist, and often identified with mucus. [from 13th c.]",
                  "examples": [
                    "Each person's unique mixture of these substances determines his temperament: a predominance of blood gives a sanguine temperament; a predominance of phlegm makes one phlegmatic; yellow bile, bilious (or choleric); and black bile, melancholic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Viscid mucus produced by the body, later especially mucus expelled from the bronchial passages by coughing. [from 14th c.]",
                  "examples": [
                    "\"Even some members of the new bourgeoisie indulge in conspicuously boorish behavior, like hawking phlegm onto the pavement or picking their noses at business meetings.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, chemistry, alchemy) A watery distillation, especially one obtained from plant matter; an aqueous solution. [from 16th c.]",
                  "examples": [
                    "The attempts made to analyse vegetable substances previous to 1720, merely produced their resolution into the supposed elements of the chemists of those days, namely, salts, Earths, phlegm, and sulphur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Calmness of temperament, composure; also seen negatively, sluggishness, indifference. [from 16th c.]",
                  "examples": [
                    "But Swedish Nazis also talked of the necessity of saving Sweden from Bolshevism, and with the menacing Berlin radio gnawing in their ears many Swedes lost their Scandinavian phlegm."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}