{
  "word": "etiquette",
  "etymologies": [
    {
      "description": [
        "1740, from French étiquette (“property, a little piece of paper, or a mark or title, affixed to a bag or bundle, expressing its contents, a label, ticket”), from Middle French estiquette (“ticket, memorandum”), from the Old French verb estechier, estichier, estequier (“to attach, stick”), (compare Picard estiquier (“to stick, pierce”)), from Frankish *stekan, *stikkan, *stikjan (“to stick, pierce, sting”), from Proto-Germanic *stikaną, *stikōną, *staikijaną (“to be sharp, pierce, prick”), from Proto-Indo-European *(s)teyg- (“to be sharp, to stab”).",
        "Akin to Old High German stehhan (“to stick, attach, nail”) (German stechen (“to stick”)), Old English stician (“to pierce, stab, be fastened”).",
        "The French Court of Louis XIV at Versailles used étiquettes (literally “little cards”) to remind courtiers to keep off of the grass and similar rules. More at stick (verb) and stitch. Doublet of ticket."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "etiquette (countable and uncountable, plural etiquettes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The forms required by a good upbringing, or prescribed by authority, to be observed in social or official life; observance of the proprieties of rank and occasion; conventional decorum; ceremonial code of polite society.",
                  "examples": [
                    "Much shock was expressed in the British press about the Palace’s utter failure to control the Markles and the Markles’ lack of etiquette."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The customary behavior of members of a profession, business, law, or sports team towards each other.",
                  "examples": [
                    "Cycling's complex etiquette contains an unwritten rule that riders in contention for a race win should not be penalised for sheer misfortune."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A label used to indicate that a letter is to be sent by airmail.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}