{
  "word": "football",
  "etymologies": [
    {
      "description": [
        "From Middle English fotbal, footbal, equivalent to foot +‎ ball, which may refer to the act of kicking a ball with the feet. The name for the briefcase is a play on “dropkick”, the code name of an early version of the nuclear war plan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "football (countable and uncountable, plural footballs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(general) A sport played on foot in which teams attempt to get a ball into a goal or zone defended by the other team.",
                  "examples": [
                    "Roman and medieval football matches were more violent than any modern type of football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, uncountable) Association football: a game in which two teams each contend to get a round ball into the other team's goal primarily by kicking the ball. Known as soccer in Canada, the United States, Australia, and New Zealand.",
                  "examples": [
                    "Synonyms: see Thesaurus:football",
                    "Each team scored three goals when they played football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, uncountable) American football: a game played on a field of 100 yards long and 53 1/3 yards wide in which two teams of 11 players attempt to get an ovoid ball to the end of each other's territory.",
                  "examples": [
                    "Synonyms: see Thesaurus:football",
                    "Each team scored two touchdowns when they played football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, uncountable) Canadian football: a game played on a field of 110 yards long and 65 yards wide in which two teams of 12 players attempt to get an ovoid ball to the end of each other's territory.",
                  "examples": [
                    "Synonyms: see Thesaurus:football",
                    "They played football in the snow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Victoria, South Australia, Western Australia, Tasmania, Northern Territory, southern New South Wales, uncountable) Australian rules football.",
                  "examples": [
                    "Synonyms: see Thesaurus:football"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, uncountable) Gaelic football: a field game played with similar rules to hurling, but using hands and feet rather than a stick, and a ball, similar to, yet smaller than a soccer ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New South Wales, Queensland, uncountable) rugby league.",
                  "examples": [
                    "Synonyms: see Thesaurus:football"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Ireland, New Zealand, uncountable) rugby union.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The ball used in any game called \"football\".",
                  "examples": [
                    "Synonyms: see Thesaurus:football",
                    "The player kicked the football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Practice of these particular games, or techniques used in them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, countable) An item of discussion, particularly in a back-and-forth manner",
                  "examples": [
                    "That budget item became a political football."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US military slang, countable) The leather briefcase containing classified nuclear war plans which is always near the US President.",
                  "examples": [
                    "Synonyms: nuclear football, atomic football, black box, black bag",
                    "Coordinate term: Cheget"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "football (third-person singular simple present footballs, present participle footballing, simple past and past participle footballed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare) To play football.",
                  "examples": [
                    "It was an announcement of the outbreak of what is now termed World War I. Some of us lads were footballing when we heard the news. It left us bewildered."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}