{
  "word": "fulminate",
  "etymologies": [
    {
      "description": [
        "From Latin fulminātus, past participle of fulminō (“lighten, hurl or strike with lightning”), from fulmen (“lightning which strikes and sets on fire, thunderbolt”), from earlier *fulgmen, *fulgimen, from fulgeō, fulgō (“flash, lighten”). Doublet of fulmine. More at fulgent."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fulminate (plural fulminates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Any salt or ester of fulminic acid, mostly explosive.",
                  "examples": [
                    "On 19 February a jubilant Bigeard announced that his 3rd R.P.C. had seized eighty-seven bombs, seventy kilos of explosive, 5,120 fulminate of mercury detonators, 309 electric detonators, etc."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fulminate (third-person singular simple present fulminates, present participle fulminating, simple past and past participle fulminated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To make a verbal attack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To issue as a denunciation.",
                  "examples": [
                    "They fulminated the most hostile of all decrees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To thunder or make a loud noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To strike with lightning; to cause to explode.",
                  "examples": [
                    "the present owners couldn't afford the electric bills anymore, several amateur gaffers, sad to say, having already been fulminated trying to bootleg power in off the municipal lines."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}