{
  "word": "burnish",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English burnishen, burnysshen (“to polish, burnish; (figuratively) to brighten, give lustre to; to clean (something) until shiny; to decorate (with something shiny), adorn”) [and other forms], from burniss-, a stem of Old French burnir (compare, for example, the first-person present singular indicative form burnis), a variant of brunir (“to make clean and shiny, polish; to make brown”) (modern French brunir), from Frankish *brūnijan (“to polish, make resplendent”), from Proto-Germanic *brūnijaną (“to decorate; tan”), from Proto-Germanic *brūnaz (“brown”, adjective), possibly from Proto-Indo-European *bʰerH- (“brown”, adjective). Doublet of brown and brunneous.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "burnish (countable and uncountable, plural burnishes)",
          "definitionGroups": [
            {
              "group": "(countable)",
              "entries": [
                {
                  "meaning": "A shine of something which has been polished; a lustre, a polish.",
                  "examples": []
                },
                {
                  "meaning": "A shiny layer applied to a surface or other thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The making of something bright, shiny, and smooth by, or (by extension) as if by, rubbing; (countable) an instance of this; a burnishing, a polishing, a shining.",
                  "examples": [
                    "With a good burnish, the old table should fetch a higher price."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "burnish (third-person singular simple present burnishes, present participle burnishing, simple past and past participle burnished)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To make (something, such as a surface) bright, shiny, and smooth by, or (by extension) as if by, rubbing; to polish, to shine.",
                  "examples": [
                    "Synonyms: buff, furbish; see also Thesaurus:rub",
                    "In pottery, a stone is sometimes used to burnish a pot before firing, giving it a smooth, shiny look."
                  ]
                },
                {
                  "meaning": "Of a stag: to remove the velvet (“skin and fine fur”) from (its antlers) by rubbing them against something; to velvet.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To make (someone or something) appear positive and highly respected.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To become bright, glossy, and smooth; to brighten, to gleam, to shine forth.",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To appear positive and highly respected.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English barnishen, barnish (“to grow big (with child), to become pregnant; to grow stout or strong”); further etymology uncertain, possibly from barn (“child, offspring; infant; unborn child; human being, person; male person, man (especially a young man or young warrior)”). (from Old English bearn (“child”), from Proto-West Germanic *barn (“child”), from Proto-Germanic *barną (“child”), from Proto-Indo-European *bʰer- (“to bear, carry”)) + -ishen (suffix forming verbs)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "burnish (third-person singular simple present burnishes, present participle burnishing, simple past and past participle burnished) (intransitive, obsolete except Britain, dialectal)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a person's body: to grow large or stout; to fatten, to fill out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Of a thing: to increase in size; to expand, to spread out, to swell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}