{
  "word": "seed",
  "etymologies": [
    {
      "description": [
        "From Middle English seed, sede, side, from Old English sēd, sǣd (“seed, that which is sown”), from Proto-West Germanic *sād, from Proto-Germanic *sēdą, from Proto-Indo-European *seh₁- (“to sow, throw”). Cognate with West Frisian sied (“seed”), Dutch zaad (“seed”), Low German Saad (“seed”), German Saat (“sowing; seed”), Icelandic sæði (“seed”), Danish sæd (“seed”), Swedish säd (“seed”), Latin satiō (“seeding, time of sowing, season”). More at sow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "seed (countable and uncountable, plural seeds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, botany) A fertilized and ripened ovule, containing an embryonic plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any small seed-like fruit.",
                  "examples": [
                    "If you plant a seed in the spring, you may have a pleasant surprise in the autumn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, agriculture) Any propagative portion of a plant which may be sown, such as true seeds, seed-like fruits, tubers, or bulbs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, collective) An amount of seeds that cannot be readily counted.",
                  "examples": [
                    "The entire field was covered with geese eating the freshly sown seed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A fragment of coral.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Semen.",
                  "examples": [
                    "A man must use his seed to start and raise a family."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figurative) A precursor.",
                  "examples": [
                    "Synonym: germ",
                    "the seed of an idea; which idea was the seed (idea)?"
                  ]
                }
              ]
            },
            {
              "group": "(countable) The initial state, condition or position of a changing, growing or developing process; the ultimate precursor in a defined chain of precursors.",
              "entries": [
                {
                  "meaning": "The initial position of a competitor or team in a tournament. (seed position)",
                  "examples": [
                    "The team with the best regular season record receives the top seed in the conference tournament."
                  ]
                },
                {
                  "meaning": "The competitor or team occupying a given seed. (seed position)",
                  "examples": [
                    "The rookie was a surprising top seed."
                  ]
                },
                {
                  "meaning": "Initialization state of a pseudorandom number generator (PRNG). (seed number)",
                  "examples": [
                    "If you use the same seed you will get exactly the same pattern of numbers."
                  ]
                },
                {
                  "meaning": "Commercial message in a creative format placed on relevant sites on the Internet. (seed idea or seed message)",
                  "examples": [
                    "The latest seed has attracted a lot of users in our online community."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) Offspring, descendants, progeny.",
                  "examples": [
                    "the seed of Abraham"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Race; generation; birth.",
                  "examples": [
                    "Of mortal seed they were not held."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small bubble formed in imperfectly fused glass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "seed (third-person singular simple present seeds, present participle seeding, simple past and past participle seeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plant or sow an area with seeds.",
                  "examples": [
                    "I seeded my lawn with bluegrass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover thinly with something scattered; to ornament with seedlike decorations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To start; to provide, assign or determine the initial resources for, position of, state of.",
                  "examples": [
                    "A venture capitalist seeds young companies.",
                    "The tournament coordinator will seed the starting lineup with the best competitors from the qualifying round.",
                    "The programmer seeded fresh, uncorrupted data into the database before running unit tests."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, gaming) To allocate a seeding to a competitor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, transitive) To leave (files) available for others to download through peer-to-peer file sharing protocols (e.g. BitTorrent).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be qualified to compete, especially in a quarter-final, semi-final, or final.",
                  "examples": [
                    "The tennis player seeded into the quarters."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce seed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To grow to maturity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, vulgar) To ejaculate inside the penetratee during intercourse, especially in the rectum.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "see +‎ -d (“past tense suffix; variant of -ed”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "seed",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) simple past tense and past participle of see",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}