{
  "word": "cherub",
  "etymologies": [
    {
      "description": [
        "From Middle English cherub, cherube, cherubin, cherubine, cherubym, cherubyn, cherybin, gerubin, jerubin (“angel of the second highest order; depiction of such an angel”), from Old English cerubin, cerubim, ceruphin, cherubin, from Latin cherūbīn, cherūbīm, from Ancient Greek χερουβίν (kheroubín), χερουβείν (kheroubeín), χερουβίμ (kheroubím), from Hebrew כְּרוּבִים‎ (k'ruvím); further etymology uncertain.",
        "The English and Middle English word cherub(e) is derived from Latin cherub (“cherub”) (the singular form of cherūbīm, cherūbīn), from Ancient Greek χερούβ (kheroúb), ultimately from Hebrew כְּרוּב‎ (kerúv). Because it was not always clear from Bible passages whether a single being or group of beings was being referred to, cherubin was used both as a singular word (plural cherubins) and plural word up to the 18th century. However, in Bible translations particularly from the 16th century onward cherub began to be favoured as the singular form, and from the 17th century cherubim as the plural form (influenced by Hebrew כְּרוּבִים‎ (k'ruvím)).",
        "The English word is cognate with French chérubin, Italian cherubino, Old Spanish cherubin (modern Spanish querubín), Galician querubín, Portuguese querubim."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cherub (plural cherubs or cherubim or cherubims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biblical) A winged creature attending God, described by Pseudo-Dionysius the Areopagite (c. 5th–6th century) as the second highest order of angels, ranked above thrones and below seraphim; similar to a lamassu in the pre-exilic texts of the Hebrew Bible, more humanoid in later texts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artistic depiction of such a being, typically in the form of a winged child or a child's head with wings but no body.",
                  "examples": [
                    "Synonyms: amoretto, cupid, putto"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A person, especially a child, seen as being particularly angelic or innocent.",
                  "examples": [
                    "Synonyms: angel, innocent"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}