{
  "word": "bigot",
  "etymologies": [
    {
      "description": [
        "From French bigot (“a sanctimonious person; a religious hypocrite”), from Middle French bigot, from Old French bigot, of disputed origin. It is most often believed to have derived from the identical Old French derogatory term bigot applied to the overly religious Normans, said to be known for frequently swearing Middle English bi God (“by God”) (compare Old English bī god, Middle High German bī got, Middle Dutch bi gode), which is also thought to be the origin of the surname Bigott, Bygott. (Compare the French use of \"goddamns\" to refer to the English in Joan of Arc's time, and les sommobiches (see son of a bitch) during World War I). From meaning \"someone overly religious\" it came to mean \"someone overly devoted to their own religious opinion\", and then to its current sense.",
        "The French Centre National de Ressources Textuelles et Lexicales supports the Germanic origin theory above. Liberman however opines that this has \"too strong a taste of a folk etymological guess invented in retrospect\" and prefers Grammont et al.'s theory that it derives from Albigot (“inhabitant of Albi”), named after the commune in southern France where Catharism (also known as Albigensianism) is thought to have originated. Etymology.com, however, does not list Grammont and Liberman's theory among their possible origins."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bigot (plural bigots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who is narrow-mindedly devoted to their own ideas and groups, and intolerant of (people of) differing ideas, races, genders, religions, politics, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who is overly pious in matters of religion, often hypocritically or else superstitiously so.",
                  "examples": [
                    "He is no bigot or hypocrite, he is not torn and divided betwixt reality and appearance, no wretch of a rugged and peevish disposition, but honest, jovial, resolute, and a good fellow."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}