{
  "word": "kickback",
  "etymologies": [
    {
      "description": [
        "kick +‎ back."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kickback (countable and uncountable, plural kickbacks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A backward kick, a retrograde movement of an extremity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) A covert, often illegal, payment in return for a favor consisting of providing an opportunity of chargeable transaction; a kind of bribe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, firearms, machinery) recoil; a sudden backward motion, usually in the direction of the operator.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, machinery) An accident where an object being cut by a rotating blade or disk, such as a circular saw, is caught by the blade and thrown outward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(machinery, forestry) An accident wherein the upper tip of the bar of a running chainsaw contacts a relatively immovable object, forcing the bar upwards and pressing the running chain more firmly against the object, causing the saw to be hurled upwards and backwards into the operator's face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(oil industry) A dangerous buildup of gas pressure at the wellhead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, bowling) The board separating one bowling lane from another at the pit end.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, bridge) In contract bridge, an ace asking convention initiated by the first step above four of the agreed trump suit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pinball) A feature that saves the ball from draining and propels it back into play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A relaxed party.",
                  "examples": [
                    "Synonym: kicker"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}