{
  "word": "forward",
  "etymologies": [
    {
      "description": [
        "From Middle English foreward, from Old English foreweard (“forward, inclined to the front, fore, early, former”), from Proto-Germanic *fura- (“fore-”), *warþaz (“turned”), equivalent to fore +‎ -ward. Cognate with Dutch voorwaarts (“forward”), German vorwärts (“forward”)."
      ],
      "adjectives": [
        {
          "description": "forward (comparative more forward, superlative most forward)",
          "definitionGroups": [
            {
              "group": "Situated toward or at the front of something.",
              "entries": [
                {
                  "meaning": "(of troops, guns etc.) Situated toward or near the enemy lines.",
                  "examples": [
                    "The forward battalion took a hammering."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Acting in or pertaining to the direction in which someone or something is facing.",
                  "examples": [
                    "My forward vision is fine, but my peripheral vision is poor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Acting in or pertaining to the direction of travel or movement.",
                  "examples": [
                    "forward motion, forward thrust, forward momentum"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Moving in the desired direction of progress.",
                  "examples": [
                    "This is an important forward step for the country."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the usual order or sequence.",
                  "examples": [
                    "The front of the fire engine has backward writing, that can be read in a mirror, as well as forward writing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, commerce) Expected or scheduled to take place in the future.",
                  "examples": [
                    "The stock price is currently 12 times forward earnings.",
                    "The price for forward delivery is presently higher than the spot price."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Advanced beyond the usual degree; advanced for the season; precocious.",
                  "examples": [
                    "These students are very forward in their learning.",
                    "The grass is forward, or forward for the season. We have a forward spring."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without customary restraint or modesty; bold, cheeky, pert, presumptuous or pushy.",
                  "examples": [
                    "She is a very forward young lady, not afraid to speak her mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Ready; prompt; ardently inclined; in a bad sense, eager or hasty. [to 19th century]",
                  "examples": [
                    "Only they would that we should remember the poor; the same which I also was forward to do."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "forward (comparative further forward, superlative furthest forward)",
          "definitionGroups": [
            {
              "group": "At, near or towards the front of something.",
              "entries": [
                {
                  "meaning": "(nautical) At, near, or towards the bow of a vessel (with the frame of reference within the vessel).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the direction in which someone or something is facing.",
                  "examples": [
                    "I leant forward  to get a better look.",
                    "The grandfather clock toppled forward and crashed to the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the desired or usual direction of movement or progress, physically or figuratively; onwards.",
                  "examples": [
                    "After spending an hour stuck in the mud, we could once again move forward.",
                    "Wind the film forward a few frames.",
                    "Don't forget to put the clocks forward by one hour tonight!",
                    "We need to move this project forward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "So that front and back are in the usual orientation.",
                  "examples": [
                    "Don't wear your baseball cap backward; turn it forward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the usual order or sequence.",
                  "examples": [
                    "A palindrome reads the same backward as forward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Into the future.",
                  "examples": [
                    "From this day forward, there will be no more brussels sprouts at the cafeteria."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To an earlier point in time. See also bring forward.",
                  "examples": [
                    "The meeting has been moved forward an hour. It was at 3 o'clock; now it's at 2 o'clock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "forward (plural forwards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) One of the eight players (comprising two props, one hooker, two locks, two flankers and one number eight, collectively known as the pack) whose primary task is to gain and maintain possession of the ball (compare back).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) A player on a team in football (soccer) in the row nearest to the opposing team's goal, who are therefore principally responsible for scoring goals.",
                  "examples": [
                    "Synonyms: attacker, centre forward, striker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ice hockey) An umbrella term for a centre or winger in ice hockey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) The small forward or power forward position; two frontcourt positions that are taller than guards but shorter than centers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The front part of a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) An e-mail message that is forwarded to another recipient or recipients; an electronic chain letter.",
                  "examples": [
                    "When you receive your new pen-pal's email address, do not automatically put it in your address book and use the email Addy to send 'forwards' to. Not every pen pal likes 'forwards', especially jokes and meaningless emails."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A direct agreement between two parties to buy or sell an asset at a specific point in the future; distinguished from a futures contract in that the latter is standardized and traded on an exchange.",
                  "examples": [
                    "Synonym: forward contract"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of foreword (“preface or introduction”)..",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "forward (third-person singular simple present forwards, present participle forwarding, simple past and past participle forwarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To advance, promote.",
                  "examples": [
                    "He did all he could to forward the interests of the school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (a letter, email etc.) on to a third party.",
                  "examples": [
                    "I'll be glad to forward your mail to you while you're gone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, bookbinding) To assemble (a book) by sewing sections, attaching cover boards, and so on.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English foreward, from Old English foreweard (“condition, bargain, agreement, contract, treaty, assurance”), equivalent to fore- +‎ ward (“ward, keeping”). Cognate with Scots forward (“covenant, compact”), Dutch voorwaarde (“condition, terms, proviso, stipulation”). More at fore-, ward."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forward (plural forwards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal or obsolete) Agreement; covenant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}