{
  "word": "appear",
  "etymologies": [
    {
      "description": [
        "From Middle English apperen, aperen, borrowed from Old French aparoir (French apparoir, apparaître), from Latin appāreō (“I appear”), from ad (“to”) + pāreō (“I come forth, I become visible”), ultimately from Proto-Indo-European *peh₂-s- (“watch, see”), s-present of *peh₂- (“protect”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "appear (third-person singular simple present appears, present participle appearing, simple past and past participle appeared)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come or be in sight; to be in view; to become visible.",
                  "examples": [
                    "And God […] said, Let […] the dry land appear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come before the public.",
                  "examples": [
                    "A great writer appeared at that time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stand in presence of some authority, tribunal, or superior person, to answer a charge, plead a cause, etc.; to present oneself as a party or advocate before a court, or as a person to be tried.",
                  "examples": [
                    "We must all appear before the judgment seat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become visible to the apprehension of the mind; to be known as a subject of observation or comprehension, or as a thing proved; to be obvious or manifest.",
                  "examples": [
                    "It doth not yet appear what we shall be."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To seem; to have a certain semblance; to look.",
                  "examples": [
                    "He appeared quite happy with the result."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring into view.",
                  "examples": [
                    "[Angelo] is yet a devil / His filth within being cast, he would appear / A pond as deep as hell."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}