{
  "word": "tind",
  "etymologies": [
    {
      "description": [
        "From earlier tend, from Middle English tenden, teenden, from Old English tendan (“to kindle”) (usually attested in compounds); related to Danish tænde, German zünden, Norwegian bokmål tenne. More at tend (sense 3)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "tind (third-person singular simple present tinds, present participle tinding, simple past and past participle tinded or tind)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To ignite, kindle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English tind, tynd, from Old English tind (“tine, prong, tooth”), from Proto-West Germanic *tind, from Proto-Germanic *tindaz (“prong, pinnacle”), from Proto-Indo-European *h₃dénts (“tooth, projection”). Cognate with Dutch tinne (“battlement”), German Zinne (“pinnacle, battlement”), Danish tinde (“pinnacle, battlement”), Dutch tinne (“tooth of a rake”), Icelandic tindur (“spike, tooth of a rake or harrow, pinnacle, peak, battlement”). Cf. the related tine. Also more distantly related to Dutch tand (“tooth, tine”), English tooth."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tind (plural tinds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prong or something projecting like a prong; an animal's horn; a branch or limb of a tree; a protruding arm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Scotland) A branch of a deer's antler; the horn of a unicorn; a tooth of a harrow; a spike.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}