{
  "word": "dart",
  "etymologies": [
    {
      "description": [
        "From Middle English dart, from Old French dart, dard (“dart”), from Medieval Latin dardus, from Frankish *darōþu (“dart, spear”), from Proto-Germanic *darōþuz (“dart, spear”), from Proto-Indo-European *dʰerh₃- (“to leap, spring”); compare Old High German tart (“javelin, dart”), Old English daroþ, dearod (“javelin, spear, dart”), Swedish dart (“dart, dagger”), Icelandic darraður, darr, dör (“dart, spear”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dart (plural darts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed missile weapon, intended to be thrown by the hand; for example, a short lance or javelin.",
                  "examples": [
                    "Then said Joab, I may not tarry thus with thee. And he took three darts in his hand, and thrust them through the heart of Absalom, while he was yet alive in the midst of the oak."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sharp-pointed missile weapon, such as an arrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes figurative) Anything resembling such a missile; something that pierces or wounds like such a weapon.",
                  "examples": [
                    "The artful inquiry, whose venom′d dart / Scarce wounds the hearing while it stabs the heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small object with a pointed tip at one end and feathers at the other,  which is thrown at a target in the game of darts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Canada, colloquial) A cigarette.",
                  "examples": [
                    "The Tigers will also face Jesse Hogan, still smarting from missing a couple of games but not life inside the AFL bubble, where you can’t even light up a dart at a music festival without someone filming it and sending it to the six o’clock news."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A dart-shaped target towed behind an aircraft to train shooters.",
                  "examples": [
                    "Fighter aircraft also use restricted areas for target shooting at darts towed 1500 feet behind another aircraft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, obsolete) A plan or scheme.",
                  "examples": [
                    "Trucking′s my dart too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden or fast movement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) A fold that is stitched on a garment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fish, the dace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various species of hesperiid butterfly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English darten, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dart (third-person singular simple present darts, present participle darting, simple past and past participle darted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To throw with a sudden effort or thrust; to hurl or launch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send forth suddenly or rapidly; to emit; to shoot.",
                  "examples": [
                    "The sun darts forth his beams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoot with a dart, especially a tranquilizer dart.",
                  "examples": [
                    "They had to dart the animal to get close enough to help"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fly or pass swiftly, like a dart; to move rapidly in one direction; to shoot out quickly.",
                  "examples": [
                    "The flying man darted eastward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To start and run with speed; to shoot rapidly along.",
                  "examples": [
                    "The deer darted from the thicket."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}