{
  "word": "morality",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman moralité, Middle French moralité, from Late Latin mōrālitās (“manner, characteristic, character”), from Latin mōrālis (“relating to manners or morals”), from mōs (“manner, custom”). equivalent to moral +‎ -ity."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "morality (countable and uncountable, plural moralities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Recognition of the distinction between good and evil or between right and wrong; respect for and obedience to the rules of right conduct; the mental disposition or characteristic of behaving in a manner intended to produce morally good results.",
                  "examples": [
                    "Without morality, intellect were impossible for him; a thoroughly immoral man could not know anything at all! To know a thing, what we can call knowing, a man must first love the thing, sympathize with it: that is, be virtuously related to it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A set of social rules, customs, traditions, beliefs, or practices which specify proper, acceptable forms of conduct.",
                  "examples": [
                    "He smiled a little. \"Morality is the average conduct of the average man at a given time and place. It is based on custom and expediency.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A set of personal guiding principles for conduct or a general notion of how to behave, whether respectable or not.",
                  "examples": [
                    "His morality was such as naturally proceeds from loose opinions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, archaic) A lesson or pronouncement which contains advice about proper behavior.",
                  "examples": [
                    "\"She had done her duty\"—\"she left the matter to them that had a charge anent such things\"—and \"Providence would bring the mystery to light in his own fitting time\"—such were the moralities with which the good dame consoled herself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A morality play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, rare) Moral philosophy, the branch of philosophy which studies the grounds and nature of rightness, wrongness, good, and evil.",
                  "examples": [
                    "Robinson sums up the conclusion of the first part of his book as being \"that the task of the moralist is to set in their proper relation to one another the three different types of moral judgment . . . and so reveal the field of morality as a single self-coherent system\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, rare) A particular theory concerning the grounds and nature of rightness, wrongness, good, and evil.",
                  "examples": [
                    "Hume's morality which ‘implies some sentiment common to all mankind’; Kant's morality for all rational beings; Butler's morality with its presupposition of ‘uniformity of conscience’."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}