{
  "word": "moderator",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Latin moderātor. First attested as Middle English moderatour."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "moderator (plural moderators)",
          "definitionGroups": [
            {
              "group": "Someone who moderates.",
              "entries": [
                {
                  "meaning": "An arbitrator or mediator.",
                  "examples": []
                },
                {
                  "meaning": "The chair or president of a meeting, etc.",
                  "examples": []
                },
                {
                  "meaning": "(Internet) A person who enforces the rules of a discussion forum by deleting posts, banning users, etc.",
                  "examples": [
                    "Synonym: mod"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The person who presides over a synod of a Presbyterian Church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nuclear physics) A substance (often water or graphite) used to decrease the speed of fast neutrons in a nuclear reactor and hence increase likelihood of fission.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device used to deaden some of the noise from a firearm, although not to the same extent as a suppressor or silencer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) An examiner at Oxford and Cambridge universities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) At the University of Dublin, either the first (senior) or second (junior) in rank in an examination for the degree of Bachelor of Arts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) Someone who supervises and monitors the setting and marking of examinations by different people to ensure consistency of standards.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical arrangement for regulating motion in a machine, or producing equality of effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A kind of lamp in which the flow of the oil to the wick is regulated.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}