{
  "word": "disposition",
  "etymologies": [
    {
      "description": [
        "From Middle English disposicioun, from Middle French disposition, from Latin dispositiōnem, accusative singular of dispositiō, from dispōnō; surface analysis, dispose +‎ -ition. Doublet of dispositio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "disposition (countable and uncountable, plural dispositions)",
          "definitionGroups": [
            {
              "group": "The way in which something or someone is disposed or disposed of (in any sense of those terms); thus:",
              "entries": [
                {
                  "meaning": "Control over something, or the results produced by the exercise of such control; thus:",
                  "examples": [
                    "The scouts reported on the disposition of the enemy troops."
                  ]
                },
                {
                  "meaning": "The arrangement or placement of certain things.",
                  "examples": [
                    "The scouts reported on the disposition of the enemy troops."
                  ]
                },
                {
                  "meaning": "Control over something, especially with regard to disposing or dispensing with an action item (disposal of a concern, allocation of disbursed funds) or control over the arrangement or placement of certain things.",
                  "examples": [
                    "You will have full disposition of these funds."
                  ]
                },
                {
                  "meaning": "(law) Transfer or relinquishment to the care or possession of another.",
                  "examples": [
                    "The court ordered the disposition of all assets.",
                    "Synonyms: assignment, conveyance"
                  ]
                },
                {
                  "meaning": "(law) Final decision or settlement.",
                  "examples": [
                    "The disposition of the case will be announced tomorrow."
                  ]
                },
                {
                  "meaning": "(medicine) The destination of a patient after medical treatment, especially after emergency triage, first line treatment, or surgery; the choice made for the next venue of care.",
                  "examples": [
                    "The patient was given a disposition for outpatient care, as ward admission was not indicated."
                  ]
                },
                {
                  "meaning": "(music) The set of choirs of strings on a harpsichord.",
                  "examples": [
                    "This small harpsichord has a 1 x 4' disposition."
                  ]
                },
                {
                  "meaning": "Tendency or inclination under given circumstances.",
                  "examples": [
                    "I have little disposition now to do as you say.",
                    "Salt has a disposition to dissolve in water."
                  ]
                },
                {
                  "meaning": "Temperamental makeup or habitual mood.",
                  "examples": [
                    "She has a sunny disposition.",
                    "He has such a foul disposition."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "disposition (third-person singular simple present dispositions, present participle dispositioning, simple past and past participle dispositioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove or place in a different position.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}