{
  "word": "dashboard",
  "etymologies": [
    {
      "description": [
        "From dash (“to sprinkle; to splatter”) +‎ board for meaning 1. Possibly expanded meaning later."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dashboard (plural dashboards)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A panel beneath the windshield of a vehicle or aircraft containing indicator gauges, compartments, and sometimes controls and indicator lights.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) An upturned screen of wood or leather placed on the front of a horse-drawn carriage, sleigh or other vehicle that protected the driver from mud, debris, water and snow thrown up by the horse's hooves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graphical user interface, video games) A graphical user interface in the form of or resembling a motor car dashboard.",
                  "examples": [
                    "Log in to the dashboard to change your account settings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The float of a paddle wheel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) The personalized feed of a Tumblr user, consisting of recent posts by blogs they follow.",
                  "examples": [
                    "It's so addictive, I all too often find myself just scrolling down my dashboard on Tumblr, finding things that other people have reblogged that appeal to me, reblogging, then continuing to scroll."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dashboard (third-person singular simple present dashboards, present participle dashboarding, simple past and past participle dashboarded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To organize in a dashboard format.",
                  "examples": [
                    "Dashboarding your work can enhance productivity."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}