{
  "word": "warranty",
  "etymologies": [
    {
      "description": [
        "From Middle English warantye, warantie, from Anglo-Norman warrantie, an Old Northern French variant of Old French guarantie (Modern French garantie). Doublet of guarantee and guaranty. More at warrant."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "warranty (countable and uncountable, plural warranties)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A guarantee that a certain outcome or obligation will be fulfilled; security.",
                  "examples": [
                    "Those who have had the care and government of politic societies introduced coinage, as a remedy of those two inconveniences. The stamp was a warranty of the public, that, under such a denomination, they should receive a piece of such a weight, and such a fineness;  […]"
                  ]
                }
              ]
            },
            {
              "group": "(countable, law, real estate, obsolete) An obsolete legal agreement that was a real covenant and ran with the land, whereby the grantor and his heirs of a piece of real estate held in freehold were required to officially guarantee their claim and plead one’s case for the title. If evicted by someone with a superior claim (paramount title) they were also required to hand over other real estate of equal value in recompense. It has now been replaced by personal covenants and the covenant of warranty.",
              "entries": [
                {
                  "meaning": "(law, countable, real estate) A covenant, also called the covenant of warranty, whereby the grantor assures the grantee that he or she not be subject to the claims of someone with a paramount title, thereby guaranteeing the status of the title that is being conveyed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law) A legal agreement, either written or oral (an expressed warranty) or implied through the actions of the buyer and seller (an implied warranty), which states that the goods or property in question will be in exactly the same state as promised, such as in a sale of an item or piece of real estate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A written guarantee, usually over a fixed period, provided to someone who buys a product or item, which states that repairs will be provided free of charge in case of damage or a fault.",
                  "examples": [
                    "I took out an extended warranty on my television for five years at a cost of $100.",
                    "I made sure to check the terms of my warranty for my computer to ensure I was covered in case it broke down.",
                    "It's always a good idea to get a good warranty on anything you buy that you think may break down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, insurance law) A stipulation of an insurance policy made by an insuree, guaranteeing that the facts of the policy are true and the insurance risk is as stated, which if not fulfilled renders the policy void.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, rare) Justification or mandate to do something, especially in terms of one’s personal conduct.",
                  "examples": [
                    "[…]  Since, if they disobey any precept, that is no excuse to us, nor gives us any warranty for companies fake to disobey likewise."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "warranty (third-person singular simple present warranties, present participle warrantying, simple past and past participle warrantied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To warrant; to guarantee.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}