{
  "word": "articulation",
  "etymologies": [
    {
      "description": [
        "From Middle English articulacioun, from Old French articulacion, from Medieval Latin articulatio. Equivalent to articulate +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "articulation (countable and uncountable, plural articulations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable or uncountable) A joint or the collection of joints at which something is articulated, or hinged, for bending.",
                  "examples": [
                    "The articulation allowed the robot to move around corners."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A manner or method by which elements of a system are connected.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The quality, clarity or sharpness of speech.",
                  "examples": [
                    "His volume is reasonable, but his articulation could use work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The manner in which a phoneme is pronounced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, uncountable) The manner in which something is articulated (tongued, slurred or bowed).",
                  "examples": [
                    "The articulation in this piece is tricky because it alternates between legato and staccato."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) The interrelation and congruence of the flow of data between financial statements of an entity, especially between the income statement and balance sheet.",
                  "examples": [
                    "At the time the outstanding distinction that could be seen between Copeland-Fed on the one hand and Goldsmith-Friend on the other was that the flow-of-funds system explicitly included nonfinancial transactions in the statistical structure in direct articulation with financial flows and stocks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) The induction of a pupil into a new school or college.",
                  "examples": [
                    "The latter reason ranked first in Item 1 as the reason for liking high school this year, giving emphasis to the fact that differences in the new school level may be either a factor of articulation, depending somewhat on how well informed the student is about his new level."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}