{
  "word": "clicker",
  "etymologies": [
    {
      "description": [
        "From click +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clicker (plural clickers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The remote-control device used to change settings on a television set, VCR, or other electronic equipment.",
                  "examples": [
                    "We have a clicker for the TV, one for the VCR, one for the DVD player and another one that does it all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An electronic device used by individual students in the classroom to respond to multiple-choice questions, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who cuts out the uppers of shoes from pieces of leather using a flexible knife that clicks as it changes direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A machine that cuts materials using a steel rule die. The name comes from the sound (click) when the material is cut. May be hand, pneumatic, or hydraulic powered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A signalling device used by military forces. Pressed between thumb and fingers, it makes a small but distinctive click understood by other members of a unit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small mechanical device that produces a clicking sound, used in dog training.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who clicks, for example using a computer mouse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete) Someone who stands by a shop door to invite people to buy; a tout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, obsolete) One who has charge of the work of a companionship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) An employee who locks the type in the form to make it ready for printing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}