{
  "word": "yawn",
  "etymologies": [
    {
      "description": [
        "Partly from Middle English yanen, yonen, yenen (“to yawn”), from Old English ġinian (“to yawn, gape”), from Proto-Germanic *ginōną (“to yawn”); and partly from Middle English gonen (“to gape, yawn”), from Old English gānian (“to yawn, gape”), from Proto-Germanic *gainōną (“to yawn, gape”); both from Proto-Indo-European *ǵʰi-, *ǵʰeyh₁- (“to yawn, gape”). Cognate with North Frisian jåne (“to yawn”), Saterland Frisian jaanje, joanje (“to yawn”), Middle Dutch genen, ghenen (“to yawn”), German Low German jahnen (“to yawn”), German gähnen (“to yawn, gape”), dialectal Swedish gana (“to gape, gawk”), dialectal Norwegian gina (“to gape”).",
        "Compare also Old Church Slavonic зѣѭ (zějǫ) (Russian зи́нуть (zínutʹ), зия́ть (zijátʹ)), Greek χαίνω (khaínō)), Latin hiō, Tocharian A śew, Tocharian B kāyā, Lithuanian žioti, Sanskrit जेह् (jeh)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "yawn (plural yawns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The action of yawning; opening the mouth widely and taking a long, rather deep breath, often because one is tired or bored.",
                  "examples": [
                    "But Mrs. MacWhirr, in the drawing-room  […] , stifled a yawn—perhaps out of self-respect—for she was alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A particularly boring event.",
                  "examples": [
                    "The slideshow we sat through was such a yawn. I was glad when it finished."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "yawn (third-person singular simple present yawns, present participle yawning, simple past and past participle yawned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To open the mouth widely and take a long, rather deep breath, often because one is tired or bored, and sometimes accompanied by pandiculation.",
                  "examples": [
                    "I could see my students yawning, so I knew the lesson was boring them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To say while yawning.",
                  "examples": [
                    "“I haven’t the least idea what I want to do,” he yawned."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To present a wide opening; gape.",
                  "examples": [
                    "The canyon yawns as it has done for millions of years, and we stand looking, dumbstruck.",
                    "Death yawned before us, and I hit the brakes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To open the mouth, or to gape, through surprise or bewilderment.",
                  "examples": [
                    "[…]  Hell being vnder euerie one of their Stages, the Players (if they had owed him a spight) might with a false Trappe doore haue slipt him downe, and there kept him, as a laughing stocke to al their yawning Spectators."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be eager; to desire to swallow anything; to express desire by yawning.",
                  "examples": [
                    "to yawn for fat livings"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}