{
  "word": "process",
  "etymologies": [
    {
      "description": [
        "From Middle English proces, from Old French procés (“journey”), from Latin prōcessus, from prōcēdō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "process (plural processes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A series of events which produce a result (the product).",
                  "examples": [
                    "This product of last month's quality standards committee is quite good, even though the process was flawed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) A set of procedures used to produce a product, most commonly in the food and chemical industries.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A path of succession of states through which a system passes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Successive physiological responses to keep or restore health.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Documents issued by a court in the course of a lawsuit or action at law, such as a summons, mandate, or writ.",
                  "examples": [
                    "But if either at Calling by the Clerk, after the Session Bell, or before the Ordinary by the Roll, an Advocat compears, and craves to be Marked for the Defender, and to see the Process; The Clerk in the first Case, and the Judge in the second, will allow him to see it"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An outgrowth of tissue or cell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A structure that arises above a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An executable task or program.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The centre mark that players aim at in the game of squails.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "process (third-person singular simple present processes, present participle processing, simple past and past participle processed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To perform a particular process on a thing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To retrieve, store, classify, manipulate, transmit etc. (data, signals, etc.), especially using computer techniques.",
                  "examples": [
                    "We have processed the data using our proven techniques, and have come to the following conclusions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To think about a piece of information, or a concept, in order to assimilate it, and perhaps accept it in a modified state.",
                  "examples": [
                    "I didn't know she had a criminal record. That will take me a while to process."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, photography, film) To develop photographic film.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To take legal proceedings against.",
                  "examples": [
                    "When I saw that he would not let me alone, I processed him for £12. My mother was with his brother John, and he allowed her six guineas for clothes; and if she did not want the money, he would allow it to me in the rent, and I made him pay that when he would not leave me alone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Back-formation from procession."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "process (third-person singular simple present processes, present participle processing, simple past and past participle processed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk in a procession",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}