{
  "word": "jaw",
  "etymologies": [
    {
      "description": [
        "From Middle English jawe, jowe, geowe, alteration of *chawe (in early Modern English chawe, chaw), from Proto-West Germanic *kauā (compare Middle Dutch kauwe (“fish jaw”), kouwe (“mouth cavity”), dialectal German Käu, Keu (“jaw, donkey jowl”)), gradation-variant of *keuā (compare Old English ċīan (pl.) ‘gills’, West Frisian kiuw (“gill”), Dutch kieuw (“gill”)), noun from Proto-West Germanic *keuwan (compare English chew). More at chew. Alteration probably influenced by Middle English jolle, chaul (“jowl”), which it replaced (see jowl)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jaw (plural jaws)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the bones, usually bearing teeth, which form the framework of the mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of the face below the mouth.",
                  "examples": [
                    "His jaw dropped in amazement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Anything resembling the jaw of an animal in form or action; especially plural, the mouth or way of entrance.",
                  "examples": [
                    "the jaws of a pass; the jaws of darkness; the jaws of death."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A notch or opening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A notched or forked part, adapted for holding an object in place.",
                  "examples": [
                    "the jaw of a railway-car pedestal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a pair of opposing parts which are movable towards or from each other, for grasping or crushing anything between them.",
                  "examples": [
                    "the jaws of a vise; the jaws of a stone-crushing machine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The inner end of a boom or gaff, hollowed in a half circle so as to move freely on a mast.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Impudent, abusive or worthless talk.",
                  "examples": [
                    "Give me the boy, now, and no more of your jaw. I am going to take the boy home with me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Axle guard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker) The curved part of the cushion marking the entry to the pocket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jaw (third-person singular simple present jaws, present participle jawing, simple past and past participle jawed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assail or abuse by scolding.",
                  "examples": [
                    "He built the Summit, so as to have no neighbours. And Lady Warren couldn't abide It. She was always jawing him about it, and they had one awful quarrel, in his study."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To scold; to clamor.",
                  "examples": [
                    "[…]  he waked him, which put him in a main high passion, and he swore woundily at the lieutenant, and called him lousy Scotch son of a whore  […] , and swab, and lubber, whereby the lieutenant returned the salute, and they jawed together fore and aft a good spell, till at last the captain turned out, and, laying hold of a rattan, came athwart Mr. Bowling's quarter: whereby he told the captain that, if he was not his commander, he would heave him overboard  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To talk; to converse.",
                  "examples": [
                    "Today the beastly boat is level at last and the sun’s out and we have all been jawing about what to do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, transitive, intransitive) (of a ball) To stick in the jaws of a pocket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain, see Jew's harp for more."
      ],
      "adjectives": [
        {
          "description": "jaw (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used in certain set phrases like jaw harp, jaw harpist and jaw's-trump)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}