{
  "word": "alone",
  "etymologies": [
    {
      "description": [
        "From Middle English allone, from earlier all oon (“alone”, literally “all one”), contracted from the Old English phrase eall ān (“completely alone”), equivalent to al- (“all”) +‎ one. Cognate with Scots alane (“alone”), Saterland Frisian alleene (“alone”), West Frisian allinne (“alone”), Dutch alleen (“alone”), Low German alleen (“alone”), German allein (“alone”), Danish alene (“alone”), Swedish allena (“alone”). More at all and one. Regarding the different phonological development of alone and one, see the note in one."
      ],
      "adjectives": [
        {
          "description": "alone (comparative more alone, superlative most alone)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By oneself, solitary.",
                  "examples": [
                    "I can't ask for help because I am alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(predicatively, chiefly in the negative) Lacking peers who share one's beliefs, experiences, practices, etc.",
                  "examples": [
                    "Senator Craddock wants to abolish the estate tax, and she's not alone.",
                    "I always organize my Halloween candy before eating it. Am I alone in this?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Apart from, or exclusive of, others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Mere; consisting of nothing further.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Unique; rare; matchless.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "alone (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "By oneself; apart from, or exclusive of, others; solo.",
                  "examples": [
                    "Synonyms: by one's lonesome, solitarily, solo; see also Thesaurus:solitarily",
                    "She walked home alone."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without outside help.",
                  "examples": [
                    "Synonyms: by oneself, by one's lonesome, singlehandedly; see also Thesaurus:by oneself",
                    "The job was too hard for me to do alone."
                  ]
                }
              ]
            },
            {
              "group": "Focus adverb, typically modifying a noun and occurring immediately after it.",
              "entries": [
                {
                  "meaning": "Not permitting anything further; exclusively.",
                  "examples": [
                    "Synonyms: entirely, solely; see also Thesaurus:solely",
                    "The president alone has the power to initiate a nuclear launch."
                  ]
                },
                {
                  "meaning": "Not requiring anything further; merely.",
                  "examples": [
                    "Oral antibiotics alone won't clear the infection."
                  ]
                },
                {
                  "meaning": "(by extension) Used to emphasize the size or extent of something by selecting a subset.",
                  "examples": [
                    "Her wardrobe is huge. She has three racks for blazers alone.",
                    "The first sentence alone sold me on the book."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}