{
  "word": "folio",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin foliō, the ablative singular form of folium (“a leaf; a sheet or leaf of paper”). Doublet of foil and folium, and distantly related with phyllo and phyllon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "folio (plural folios)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a leaf of a book or manuscript",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A page of a book, that is, one side of a leaf of a book.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A page number. The even folios are on the left-hand pages and the odd folios on the right-hand pages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(paper) A sheet of paper folded in half.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(books) A book made of sheets of paper each folded in half (two leaves or four pages to the sheet); hence, a book of the largest kind, exceeding 30 cm in height.",
                  "examples": [
                    "A rare copy of Shakespeare’s First Folio."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) A page in an account book; sometimes, two opposite pages bearing the same serial number.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, dated, 19th to early 20th century) A leaf containing a certain number of words; hence, a certain number of words in a writing, as in England, in law proceedings 72, and in chancery, 90; in New York, 100 words.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wrapper for loose papers.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "folio (third-person singular simple present folios, present participle folioing, simple past and past participle folioed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to put a serial number on each folio or page of (a book); to page",
                  "examples": [
                    "Synonym: foliate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}