{
  "word": "holiday",
  "etymologies": [
    {
      "description": [
        "From Middle English halyday, holyday, halidei, haliȝdei, from Old English hāliġdæġ (“holy day, Sabbath”), equivalent to holy +‎ day. Compare West Frisian hjeldei (“holiday”), Danish helligdag (“holiday”), Norwegian helligdag (“holiday”), Swedish helgdag (“holiday, feast”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "holiday (plural holidays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A day on which a festival, religious event, or national celebration is traditionally observed.",
                  "examples": [
                    "Synonyms: feast day, holy day",
                    "Today is a Wiccan holiday!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A day declared free from work by the state or government.",
                  "examples": [
                    "Synonyms: (UK) bank holiday, national holiday"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia) A period of one or more days taken off work for leisure and often travel; often plural.",
                  "examples": [
                    "Synonyms: leave, time off, (US) vacation; see also Thesaurus:vacation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK, Australia) A period during which pupils do not attend their school; often plural; rarely used for students at university (usually: vacation).",
                  "examples": [
                    "Synonym: (US) vacation",
                    "I want to take a French course this summer holiday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) A period during which, by agreement, the usual payments are not made.",
                  "examples": [
                    "a mortgage payment holiday"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gap in coverage, e.g. of paint on a surface, or sonar imagery.",
                  "examples": [
                    "Synonym: lacuna"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "holiday (third-person singular simple present holidays, present participle holidaying, simple past and past participle holidayed) (chiefly Britain)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take a period of time away from work or study.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, intransitive) To spend a period of time in recreational travel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}