{
  "word": "bluestone",
  "etymologies": [
    {
      "description": [
        "blue +‎ stone"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bluestone (countable and uncountable, plural bluestones)",
          "definitionGroups": [
            {
              "group": "Any of several bluish grey varieties of stone used for construction:",
              "entries": [
                {
                  "meaning": "(UK) A form of dolerite which appears blue when wet or freshly broken.",
                  "examples": []
                },
                {
                  "meaning": "(UK) Any of the several (massive) kinds of non-local stone (particularly dolerite) used to construct Stonehenge.",
                  "examples": []
                },
                {
                  "meaning": "(US, Canada) A feldspathic sandstone found in the US and Canada.",
                  "examples": []
                },
                {
                  "meaning": "(US) A form of limestone found in the Shenandoah Valley and some other places.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, New Zealand) A bluish grey basalt or olivine basalt.",
                  "examples": []
                },
                {
                  "meaning": "(Australia, South Australia) Slate, such as comes from quarries in or near Adelaide.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Either of two related copper- and sulfur-based bright blue stones:",
              "entries": [
                {
                  "meaning": "Copper(II) sulfate, CuSO4(H2O)x where x is 0-5, used as a coloring agent in glass-making and pottery and for other purposes.",
                  "examples": [
                    "This consists of thoroughly spraying the plants with Bordeaux mixture once in ten days or two weeks after they have begun to run. Bordeaux mixture is made by bringing together the milk of lime and a solution of copper sulphate (bluestone)."
                  ]
                },
                {
                  "meaning": "Chalcanthite, a water-soluble sulfate mineral, CuSO4·5H2O.",
                  "examples": [
                    "This belt is about 1,000 feet wide at the McConnell Mine, and ends a few hundred yards north of the Bluestone.  […]  It was worked about 30 years ago, and for a time supplied natural bluestone (chalcanthite) to the amalgamating mills ..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lapis lazuli, or its core constituent, lazurite.",
                  "examples": [
                    "From Cyprus were  brought bricks of lead, with bluestone and elephant's tusks, and the vases were  carved in fanciful designs, with the heads of goats, lions, bulls, and eagles."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}