{
  "word": "squid",
  "etymologies": [
    {
      "description": [
        "Unknown. Perhaps a sailors' alteration of squirt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squid (plural squids or squid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several carnivorous marine cephalopod mollusks, of the order Teuthida, having a mantle, eight arms, and a pair of tentacles",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fishhook with a piece of bright lead, bone, or other substance fastened on its shank to imitate a squid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, slang, mildly derogatory) A sailor in the Navy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, humorous, rare) A quid; one pound sterling.",
                  "examples": [
                    "Can you lend me five squid? I feel like a bacon sarnie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squid (third-person singular simple present squids, present participle squidding, simple past and past participle squidded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) To fish with the kind of hook called a squid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(parachuting) To cause squidding (an improper, partial, parachute inflation, that results in the sides of the parachute folding in on the center, and pulsating back and forth).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly a blend of stupid and quick; \"stupid, quick, under-dressed and imminently dead\", a claimed origin, is probably a backronym."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squid (plural squids)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, motorcycling, derogatory) A motorcyclist, especially a sport biker, characterized by reckless riding and lack of protective gear.",
                  "examples": [
                    "\"In my mind, a street squid is anyone who races on the street. Period.\"1",
                    "\"squid: a cocky motorcyclist who darts very aggressively through traffic\"2"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}