{
  "word": "tea",
  "etymologies": [
    {
      "description": [
        "Circa 1650, from Dutch thee, from Hokkien 茶 (tê) (Amoy dialect), from Old Chinese, ultimately from Proto-Sino-Tibetan *s-la (“leaf, tea”).",
        "Introduced to English and other Western European languages by the Dutch East India Company, who sourced their tea in Amoy; compare Malay teh along the same trade route. Doublet of chai and cha (and, distantly, lahpet), from same Proto-Sino-Tibetan root; see discussion of cognates."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tea (countable and uncountable, plural teas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The tea plant (Camellia sinensis); (countable) a variety of this plant.",
                  "examples": [
                    "Darjeeling tea is grown in India."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The dried leaves or buds of the tea plant; (countable) a variety of such leaves.",
                  "examples": [
                    "Go to the supermarket and buy some Darjeeling tea.",
                    "Not for all the tea in China."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The drink made by infusing these dried leaves or buds in hot water.",
                  "examples": [
                    "Would you like some tea?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any similar drink made by infusing parts of various other plants.",
                  "examples": [
                    "camomile tea; mint tea"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, in combination) Meat stock served as a hot drink.",
                  "examples": [
                    "beef tea"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Commonwealth, northern US) A cup or (East Asia, Southern US) glass of any of these drinks, often with milk, sugar, lemon, and/or tapioca pearls.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, UK) A light midafternoon meal, typically but not necessarily including tea.",
                  "examples": [
                    "But the gorge of the Rush was not at all a nice place for travelling either. I mean, it was not a nice place for people in a hurry. For an afternoon's ramble ending in a picnic tea it would have been delightful."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Commonwealth) Synonym of supper, the main evening meal, whether or not it includes tea.",
                  "examples": [
                    "The family were sitting round the table, eating their tea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The break in play between the second and third sessions.",
                  "examples": [
                    "Australia were 490 for 7 at tea on the second day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Synonym of marijuana.",
                  "examples": [
                    "So they were evidence. Evidence of what? That a man occasionally smoked a stick of tea, a man who looked as if any touch of the exotic would appeal to him. On the other hand lots of tough guys smoked marijuana  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, especially gay slang and African-American Vernacular) Information, especially gossip.",
                  "examples": [
                    "Spill the tea on that drama, hon."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tea (third-person singular simple present teas, present participle teaing, simple past and past participle teaed or tea'd or tead)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To drink tea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take afternoon tea (the light meal).",
                  "examples": [
                    "The wind was high and the hills ditto, and both being against us we were late in reaching Hitchin (30 from Cambridge), so giving up the idea of reaching Oxford we toiled on through Luton, on to Dunstable (47), where we teaed moderately  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give tea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Chinese 茶 (chá, “tea”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tea (plural teas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A moment, a historical unit of time from China, about the amount of time needed to quickly drink a traditional cup of tea. It is now found in Chinese-language historical fiction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}