{
  "word": "calends",
  "etymologies": [
    {
      "description": [
        "From Middle English calendes, calendas, calendis, kalandes, kalendas, kalendes, kalendez, kalendis, kalendus (also in the singular forms calende, kalend, kalende), from Latin kalendās, accusative plural of kalendae (“first day of a Roman month”), an archaic variant of calandae, from calandus (“which is to be called or announced solemnly”), the future passive participle of calō (“to call, announce solemnly”) (referring to the Roman practice of proclaiming the first days of the lunar month upon seeing the first signs of a new crescent moon), from Proto-Indo-European *kelh₁- (“to call, cry, summon”). Although the singular form calend (now obsolete, rare) appeared in English (and compare Old English calend, kalendus (“calends; a month”)), no singular form was used in Latin as recurring days of the calendar were always referred to in the plural.",
        "Sense 2 (“a day for settling debts and other accounts”) refers to the Roman practice of fixing the calends as the day for debts to be paid."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "calends pl (plural only)",
          "definitionGroups": [
            {
              "group": "Often with initial capital: the first day of a month",
              "entries": [
                {
                  "meaning": "(historical, Ancient Rome) the first day of a month of the Roman calendar.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A day for settling debts and other accounts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, biblical, Judaism, obsolete) Synonym of Rosh Hodesh (“the Jewish festival of the new moon, which begins the months of the Hebrew calendar”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Synonym of calendar; (figuratively) an account, a record.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, obsolete) The first day of something; a beginning.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "calends",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) plural of calend",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}