{
  "word": "holk",
  "etymologies": [
    {
      "description": [
        "From Middle English holk, from Old English holc, holoc (“hole, cavity”), from Proto-West Germanic *holuk, from Proto-Germanic *hulukaz (“a hollow”), from Proto-Indo-European *ḱel- (“to cover, hide”). Equivalent to hole +‎ -ock (diminutive ending).",
        "Cognate with Low German holke, hölke (“small hole”), German Holk (“a type of flat-bottomed barge”), Swedish holk (“nest, birdhouse”), dialectal Norwegian holk, hylke (“wooden barrel, cask”), Icelandic hólkur (“hollow cylinder or tube”). Related to hulk."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "holk (plural holks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) A hollow cavity.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English holken, from Old English *holcian (attested in āholcian, āhlocian (“to dig out”), from Proto-West Germanic *holukōn, derived from the noun above. Cognate with Middle Low German holken, hȫlken (“to hollow out”), German Low German uthöhlken (“to hollow out”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "holk (third-person singular simple present holks, present participle holking, simple past and past participle holked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To dig out; make hollow; hollow out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To dig; dig into; pierce; penetrate; investigate; poke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal) To dig up; excavate.",
                  "examples": [
                    "The Sessioune perceiving gryt perell through the burieing of people in the kirkyaird of thair perroche kirk and within the kirk itself by raising of grene graivis and holking under the kirk vall undermynding of the samyne ordanis fra this furth that na persone presume to mak graivis within the precinct thairof or yit to burie any persone within the boundis of the samine."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}