{
  "word": "storey",
  "etymologies": [
    {
      "description": [
        "From Middle English story, via Medieval Latin historia (“narrative, illustraton, frieze”) from Ancient Greek ἱστορίᾱ (historíā, “learning through research”), from ἱστορέω (historéō, “to research, inquire (and record)”), from ἵστωρ (hístōr, “the knowing, wise one”), from Proto-Indo-European *weyd- (“to see, know”). The current sense arose from narrative friezes on upper levels of medieval buildings, esp. churches.",
        "An alternative etymology derives Middle English story from Old French *estoree (“a thing built, building”), from estoree (“built”), feminine past participle of estorer (“to build”), from Latin instaurare (“to construct, build, erect”), but this seems unlikely since historia already had the meaning \"storey of a building\" in Anglo-Latin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "storey (plural storeys) (British spelling, Canadian spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A floor or level of a building or ship.",
                  "examples": [
                    "Synonyms: floor, level, (US) story",
                    "Coordinate term: deck",
                    "For superstitious reasons, many buildings number their 13th storey as 14, bypassing 13 entirely.",
                    "a multi-storey car park"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A vertical level in certain letters, such as a and g.",
                  "examples": [
                    "The IPA symbol for a voiced velar stop is the single-storey , not the double-storey ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A building; an edifice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}