{
  "word": "insular",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin insularis (“of or belonging to an island”), from insula (“an island”), perhaps, from in (“in”) + salum (“the main sea”)."
      ],
      "adjectives": [
        {
          "description": "insular (comparative more insular, superlative most insular)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, pertaining to, being, or resembling an island or islands.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Situated on an island.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Separate or isolated from the surroundings; having little interaction with external parties; provincial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having an inward-looking, standoffish, or withdrawn manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Relating to the insula in the brain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biochemistry) Relating to insulin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) (often with a capital letter) Relating to the varieties of a language or languages spoken chiefly on islands. Insular Latin, Latin as it was spoken in Britain and Ireland. Insular Celtic, the Celtic languages of Britain, Ireland and also Brittany, as opposed to those spoken in mainland Europe other than Brittany. Insular Scandinavian, relating to the Icelandic and Faroese languages as opposed to the ones spoken in Sweden, Denmark and Norway.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "insular (plural insulars)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An islander.",
                  "examples": [
                    "these insulars in general live in a gross saline air , and their vessels being less elastic are consequently less able to subdue and cast off what their bodies as sponges draw in"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}