{
  "word": "plank",
  "etymologies": [
    {
      "description": [
        "From Middle English plank, planke, borrowed from Old French planke, Old Northern French planque (compare French planche, from Old French planche), from Vulgar Latin planca, from palanca, from Latin phalanga. The Latin term derives from the Ancient Greek φάλαγξ (phálanx), so it is thus a doublet of phalange and phalanx. Compare also the doublet planch, borrowed later from Middle French."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plank (plural planks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long, broad and thick piece of timber, as opposed to a board which is less thick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A political issue that is of concern to a faction or a party of the people and the political position that is taken on that issue.",
                  "examples": [
                    "Holonym: platform",
                    "Germanization was a central plank of German conservative thinking in the 19th and 20th centuries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Physical exercise in which one holds a pushup position for a measured length of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) A stupid person, idiot.",
                  "examples": [
                    "Synonyms: see Thesaurus:idiot"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which supports or upholds.",
                  "examples": [
                    "His charity is a better plank than the faith of an intolerant and bitter-minded bigot."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plank (third-person singular simple present planks, present participle planking, simple past and past participle planked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover something with planking.",
                  "examples": [
                    "to plank a floor or a ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bake (fish, etc.) on a piece of cedar lumber.",
                  "examples": [
                    "Along the lower river, planked shad dinners (baked and broiled) were highly popular during the late nineteenth and early twentieth centuries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To lay down, as on a plank or table; to stake or pay cash.",
                  "examples": [
                    "to plank money in a wager"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To harden, as hat bodies, by felting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To splice together the ends of slivers of wool, for subsequent drawing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pose for a photograph while lying rigid, face down, arms at side, in an unusual place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}