{
  "word": "mean",
  "etymologies": [
    {
      "description": [
        "From Middle English menen (“to intend; remember; lament; comfort”), from Old English mǣnan (“to mean, complain”), Proto-West Germanic *mainijan, from Proto-Germanic *mainijaną (“to mean, think; complain”), from Proto-Indo-European *meyn- (“to think”), or perhaps from Proto-Indo-European *meyno-, extended form of Proto-Indo-European *mey-.",
        "Germanic cognates include West Frisian miene (“to deem, think”) (Old Frisian mēna (“to signify”)), Dutch menen (“to believe, think, mean”) (Middle Dutch menen (“to think, intend”)), German meinen (“to think, mean, believe”), Old Saxon mēnian. Indo-European cognates include Old Irish mían (“wish, desire”) and Polish mienić (“to signify, believe”). Related to moan."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "mean (third-person singular simple present means, present participle meaning, simple past and past participle meant)",
          "definitionGroups": [
            {
              "group": "To intend.",
              "entries": [
                {
                  "meaning": "(transitive) To intend, to plan (to do); to have as one's intention. [from 8th c.]",
                  "examples": [
                    "I didn't mean to knock your tooth out.",
                    "I mean to go to Baddeck this summer.",
                    "I meant to take the car in for a smog check, but it slipped my mind.",
                    "The authors meant a challenge to the status quo."
                  ]
                },
                {
                  "meaning": "(intransitive) To have as intentions of a given kind. [from 14th c.]",
                  "examples": [
                    "Don't be angry; she meant well."
                  ]
                },
                {
                  "meaning": "(transitive, usually in passive) To intend (something) for a given purpose or fate; to predestine. [from 16th c.]",
                  "examples": [
                    "Actually this desk was meant for the subeditor.",
                    "Man was not meant to question such things."
                  ]
                },
                {
                  "meaning": "(transitive) To intend an ensuing comment or statement as an explanation.[1]",
                  "examples": [
                    "Your reasoning seems needlessly abstruse, complex, and verbose for me. I mean, could you dumb it down for my sake?"
                  ]
                }
              ]
            },
            {
              "group": "To convey (a meaning).",
              "entries": [
                {
                  "meaning": "(transitive) To convey (a given sense); to signify, or indicate (an object or idea). [from 8th c.]",
                  "examples": [
                    "The sky is red this morning—does that mean we're in for a storm?"
                  ]
                },
                {
                  "meaning": "(transitive) Of a word, symbol etc: to have reference to, to signify. [from 8th c.]",
                  "examples": [
                    "What does this hieroglyph mean?"
                  ]
                },
                {
                  "meaning": "(transitive) Of a person (or animal etc): to intend to express, to imply, to hint at, to allude.",
                  "examples": [
                    "I'm afraid I don't understand what you mean.",
                    "He is a little different, if you know what I mean."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To have conviction in (something said or expressed); to be sincere in (what one says). [from 18th c.]",
                  "examples": [
                    "Does she really mean what she said to him last night?",
                    "Say what you mean and mean what you say."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause or produce (a given result); to bring about (a given result). [from 19th c.]",
                  "examples": [
                    "One faltering step means certain death."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually with to) To be of some level of importance.",
                  "examples": [
                    "That little dog meant everything to me.",
                    "Formality and titles mean nothing in their circle."
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "mean (third-person singular simple present means, present participle meaning, simple past and past participle meaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, UK regional) To lament.",
                  "examples": [
                    "Thanne morned Mede · and mened hire to the kynge / To haue space to speke · spede if she myȝte."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mene, imene, from Old English mǣne, ġemǣne (“common, public, general, universal”), from Proto-West Germanic *gamainī, from Proto-Germanic *gamainiz (“common”), from Proto-Indo-European *mey- (“to change, exchange, share”).",
        "Cognate with West Frisian mien (“general, universal”), Dutch gemeen (“common, mean”), German gemein (“common, mean, nasty”), Danish gemen, Gothic 𐌲𐌰𐌼𐌰𐌹𐌽𐍃 (gamains, “common, unclean”), Latin commūnis (“shared, common, general”) (Old Latin comoinem)."
      ],
      "adjectives": [
        {
          "description": "mean (comparative meaner, superlative meanest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Common; general.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a common or low origin, grade, or quality; common; humble.",
                  "examples": [
                    "a man of mean parentage",
                    "a mean abode"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Low in quality or degree; inferior; poor; shabby.",
                  "examples": [
                    "Synonyms: cheap, grotty; see also Thesaurus:low-quality",
                    "a mean appearance",
                    "a mean dress"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Without dignity of mind; destitute of honour; low-minded; spiritless; base.",
                  "examples": [
                    "Synonyms: base, ignoble, selfish, unkind, vile",
                    "Antonyms: lofty, noble, honorable",
                    "a mean motive",
                    "It was mean of you to steal that little girl's piggy bank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of little value or worth; worthy of little or no regard; contemptible; despicable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly UK) Ungenerous; stingy; tight-fisted.",
                  "examples": [
                    "Synonyms: see Thesaurus:stingy",
                    "He's so mean. I've never seen him spend so much as five pounds on presents for his children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Disobliging; pettily offensive or unaccommodating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Intending to cause harm, successfully or otherwise; bearing ill will towards another.",
                  "examples": [
                    "Synonyms: cruel, malicious, nasty",
                    "Watch out for her, she's mean. I said good morning to her, and she punched me in the nose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Powerful; fierce; strong.",
                  "examples": [
                    "Synonyms: harsh, damaging, fierce",
                    "It must have been a mean typhoon that levelled this town."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Accomplished with great skill; deft; hard to compete with.",
                  "examples": [
                    "Synonyms: deft, skillful, top-notch",
                    "Your mother can roll a mean cigarette.",
                    "He hits a mean backhand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, often childish) Difficult, tricky.",
                  "examples": [
                    "This problem is mean!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English meene, borrowed from Old French meien (French moyen), Late Latin mediānus (“that is in the middle, middle”), from Latin medius (“middle”). Cognate with mid. For the musical sense, compare the cognate Italian mezzano. Doublet of median and mizzen."
      ],
      "adjectives": [
        {
          "description": "mean (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the mean (see noun below) as its value; average.",
                  "examples": [
                    "The mean family has 2.4 children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Middling; intermediate; moderately good, tolerable.",
                  "examples": [
                    "I have declared in the causes what harm costiveness hath done in procuring this disease; if it be so noxious, the opposite must needs be good, or mean at least, as indeed it is […]."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mean (plural means)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly in the plural) A method or course of action used to achieve some result. [from 14th c.]",
                  "examples": [
                    "To say truth, it is a meane full of uncertainty and danger."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, in the singular) An intermediate step or intermediate steps.",
                  "examples": [
                    "Verily in this treatise this hath been mine only purpose; and the mean to bring the same to effect hath been such as whereby I studied to profit wholesomely, not to please delicately."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something which is intermediate or in the middle; an intermediate value or range of values; a medium. [from 14th c.]",
                  "examples": [
                    "It presents a sort of mean between speech and song, continually inclining towards the latter, never altogether leaving its hold on the former; it is speech, though always attuned speech, in passages of average interest and importance; it is song, though always distinct and articulate song, in passages demanding more fervid utterance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, now historical) The middle part of three-part polyphonic music; now specifically, the alto part in polyphonic music; an alto instrument. [from 15th c.]",
                  "examples": [
                    "Of these [rattles] they have Base, Tenor, Countertenor, Meane, and Treble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) The average of a set of values, calculated by summing them together and dividing by the number of terms; the arithmetic mean. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Any function of multiple variables that satisfies certain properties and yields a number representative of its arguments; or, the number so yielded; a measure of central tendency.",
                  "examples": [
                    "Note that (1.41) is simply the probability-weighted mean without any explicit allowance for the stratification; each observation is weighted by its inflation factor and the total divided by the total of the inflation factors for the survey."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Either of the two numbers in the middle of a conventionally presented proportion, as 2 and 3 in 1:2=3:6.",
                  "examples": [
                    "...if four numbers be in proportion, the product of the first and last, or of the two extremes, is equal to the product of the second and third, or of the two means."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}