{
  "word": "club",
  "etymologies": [
    {
      "description": [
        "From Middle English clubbe, from Old Norse klubba, klumba (“cudgel”), from Proto-Germanic *klumpô (“clip, clasp; clump, lump; log, block”), from Proto-Indo-European *glemb- (“log, block”), from *gel- (“to ball up, conglomerate, amass”). Cognate with English clump, cloud, Latin globus, glomus; and perhaps related to Middle Low German kolve (“bulb”), German Kolben (“butt, bulb, club”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "club (plural clubs)",
          "definitionGroups": [
            {
              "group": "An association of members joining together for some common purpose, especially sports or recreation.",
              "entries": [
                {
                  "meaning": "(archaic) The fees associated with belonging to such a club.",
                  "examples": [
                    "He can have no right to the benefits of Society, who will not pay his Club towards the Support of it."
                  ]
                }
              ]
            },
            {
              "group": "A heavy object, often a kind of stick, intended for use as a bludgeoning weapon or a plaything.",
              "entries": [
                {
                  "meaning": "An implement to hit the ball in certain ball games, such as golf.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A joint charge of expense, or any person's share of it; a contribution to a common fund.",
                  "examples": [
                    "first we went and dined at a French house , but paid 10s for our part of the club"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An establishment that provides staged entertainment, often with food and drink, such as a nightclub.",
                  "examples": [
                    "She was sitting in a jazz club, sipping wine and listening to a bass player's solo."
                  ]
                }
              ]
            },
            {
              "group": "A black clover shape (♣), one of the four symbols used to mark the suits of playing cards.",
              "entries": [
                {
                  "meaning": "A playing card marked with such a symbol.",
                  "examples": [
                    "I've got only one club in my hand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous) Any set of people with a shared characteristic.",
                  "examples": [
                    "You also hate Night Court?  Join the club.",
                    "Michael stood you up?  Welcome to the club."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A club sandwich.",
                  "examples": [
                    "Crab cake sandwiches, tuna melts, chicken clubs, salmon cakes, and prime-rib sandwiches are usually on the menu."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The slice of bread in the middle of a club sandwich.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "club (third-person singular simple present clubs, present participle clubbing, simple past and past participle clubbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit with a club.",
                  "examples": [
                    "He clubbed the poor dog."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To join together to form a group.",
                  "examples": [
                    "Till grosser atoms, tumbling in the stream / Of fancy, madly met, and clubb'd into a dream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To combine into a club-shaped mass.",
                  "examples": [
                    "a medical condition with clubbing of the fingers and toes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go to nightclubs.",
                  "examples": [
                    "We went clubbing in Ibiza.",
                    "When I was younger, I used to go clubbing almost every night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pay an equal or proportionate share of a common charge or expense.",
                  "examples": [
                    "The owl, the raven, and the bat / Clubb'd for a feather to his hat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To raise, or defray, by a proportional assessment.",
                  "examples": [
                    "to club the expense"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To drift in a current with an anchor out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To throw, or allow to fall, into confusion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To unite, or contribute, for the accomplishment of a common end.",
                  "examples": [
                    "to club exertions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military) To turn the breech of (a musket) uppermost, so as to use it as a club.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}