{
  "word": "sphere",
  "etymologies": [
    {
      "description": [
        "From Middle English spere, from Old French sphere, from Late Latin sphēra, earlier Latin sphaera (“ball, globe, celestial sphere”), from Ancient Greek σφαῖρα (sphaîra, “ball, globe”), of unknown origin. Not related to superficially similar Persian سپهر‎ (sepehr, “sky”) ."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sphere (plural spheres)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A regular three-dimensional object in which every cross-section is a circle; the figure described by the revolution of a circle about its diameter [from 14th c.].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spherical physical object; a globe or ball. [from 14th c.]",
                  "examples": [
                    "So your orientation changes a little bit but it sinks in that the world is a sphere, and you're going around it, sometimes under it, sideways, or over it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, now rare) The apparent outer limit of space; the edge of the heavens, imagined as a hollow globe within which celestial bodies appear to be embedded. [from 14th c.]",
                  "examples": [
                    "Though cold and darkness longer hang somewhere, / Yet Phoebus equally lights all the Sphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, astronomy, mythology) Any of the concentric hollow transparent globes formerly believed to rotate around the Earth, and which carried the heavenly bodies; there were originally believed to be eight, and later nine and ten; friction between them was thought to cause a harmonious sound (the music of the spheres). [from 14th c.]",
                  "examples": [
                    "They understood not the motion of the eighth sphear from West to East, and so conceived the longitude of the Stars invariable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mythology) An area of activity for a planet; or by extension, an area of influence for a god, hero etc. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The region in which something or someone is active; one's province, domain. [from 17th c.]",
                  "examples": [
                    "They thought – originally on grounds derived from religion – that each thing or person had its or his proper sphere, to overstep which is ‘unjust’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The set of all points in three-dimensional Euclidean space (or n-dimensional space, in topology) that are a fixed distance from a fixed point [from 20th c.].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) The extension of a general conception, or the totality of the individuals or species to which it may be applied.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sphere (third-person singular simple present spheres, present participle sphering, simple past and past participle sphered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place in a sphere, or among the spheres; to ensphere.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make round or spherical; to perfect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}