{
  "word": "action",
  "etymologies": [
    {
      "description": [
        "From Middle English accion, from Old French aucion, acciun, from Latin āctiō (“act of doing or making”), from āctus + action suffix -iō, perfect passive participle of agere (“do, act”), ultimately from Proto-Indo-European *h₂éǵeti; see also act, active.",
        "Morphologically act +‎ -ion."
      ],
      "adjectives": [
        {
          "description": "action (comparative more action, superlative most action)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Manglish) arrogant",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "action (countable and uncountable, plural actions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The effort of performing or doing something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something done, often so as to accomplish a purpose.",
                  "examples": [
                    "Coordinate terms: (what verbs can express) occurrence, state of being"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A way of motion or functioning.",
                  "examples": [
                    "Knead bread with a rocking action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fast-paced activity.",
                  "examples": [
                    "a movie full of exciting action"
                  ]
                }
              ]
            },
            {
              "group": "The way in which a mechanical device acts when used; especially a firearm.",
              "entries": [
                {
                  "meaning": "(firearms) The way in which cartridges are loaded, locked, and extracted from the mechanism.",
                  "examples": [
                    "pump action shotgun"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The mechanism, that is the set of moving mechanical parts, of a keyboard instrument, like a piano, which transfers the motion of the key to the sound-making device.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, lutherie) The distance separating the strings and the fretboard on a guitar or other string instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, typically with a quantifier) Sexual intercourse.",
                  "examples": [
                    "She gave him some action.",
                    "I hope to get a bit of action with the hot guy from the club."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Combat.",
                  "examples": [
                    "He saw some action in the Korean War."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A charge or other process in a law court (also called lawsuit and actio).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A mapping from a pairing of mathematical objects to one of them, respecting their individual structures. The pairing is typically a Cartesian product or a tensor product. The object that is not part of the output is said to act on the other object. In any given context, action is used as an abbreviation for a more fully named notion, like group action or left group action.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The product of energy and time, especially the product of the Lagrangian and time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The event or connected series of events, either real or imaginary, forming the subject of a play, poem, or other composition; the unfolding of the drama of events.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, painting and sculpture) The attitude or position of the several parts of the body as expressive of the sentiment or passion depicted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bowling) spin put on the bowling ball.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A share in the capital stock of a joint-stock company, or in the public funds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) A religious performance or solemn function, i.e. action sermon, a sacramental sermon in the Scots Presbyterian Church.",
                  "examples": [
                    "The Action Sermon is quite simply, then, the eucharistic sermon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) a process existing in or produced by nature (rather than by the intent of human beings).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "action (third-person singular simple present actions, present participle actioning, simple past and past participle actioned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, management) To act on a request etc, in order to put it into effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly archaic) To initiate a legal action against someone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}