{
  "word": "soldier",
  "etymologies": [
    {
      "description": [
        "From Middle English soudeour, from Old French soudier or soudeour (“mercenary”), from Medieval Latin soldarius (“soldier (one having pay)”), from Late Latin solidus, a type of coin. Displaced Old English cempa (whence obsolete kemp)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "soldier (plural soldiers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a ground-based army, of any rank, but especially an enlisted member.",
                  "examples": [
                    "I am a soldier and unapt to weep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, nonstandard) Any member of a military, regardless of specialty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enlisted member of a military service, as distinguished from a commissioned officer.",
                  "examples": [
                    "It were meet that any one, before he came to be a captain, should have been a soldier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A guardsman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of the Salvation Army.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low-ranking gangster or member of a gang, especially the mafia, who engages in physical conflict.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Australia, New Zealand) A piece of buttered bread (or toast), cut into a long thin strip for dipping into a soft-boiled egg.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A term of approbation for a young boy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who fights or toils well.",
                  "examples": [
                    "[L]et 'em know how important it is to have Runyon Avenue soldiers up in our corners; their loyalty to us is worth more than any award is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The red or cuckoo gurnard (Chelidonichthys cuculus).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the asexual polymorphic forms of termites, in which the head and jaws are very large and strong. The soldiers serve to defend the nest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A red herring (cured kipper with flesh turned red).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "soldier (third-person singular simple present soldiers, present participle soldiering, simple past and past participle soldiered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To continue steadfast; to keep striving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To serve as a soldier.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To intentionally restrict labor productivity; to work at the slowest rate that goes unpunished.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To take a ride on (another person's horse) without permission.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}