{
  "word": "craze",
  "etymologies": [
    {
      "description": [
        "From Middle English crasen (“to crush, break, break to pieces, shatter, craze”), from Old Norse *krasa (“to shatter”), ultimately imitative.",
        "Cognate with Danish krase (“to crack, crackle”), Swedish krasa (“to crack, crackle”), Norwegian krasa (“to shatter, crush”), Icelandic krasa (“to crackle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "craze (plural crazes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) craziness; insanity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A strong habitual desire or fancy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary passion or infatuation, as for some new amusement, pursuit, or fashion; a fad.",
                  "examples": [
                    "Winemaking was a huge craze in the 1970s, when affordable package holidays to the continent gave people a taste for winedrinking, but the recession made it hard to afford off-license prices back home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ceramics) A crack in the glaze or enamel caused by exposure of the pottery to great or irregular heat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "craze (third-person singular simple present crazes, present participle crazing, simple past and past participle crazed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To weaken; to impair; to render decrepit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To derange the intellect of; to render insane.",
                  "examples": [
                    "any man  […]  that is crazed and out of his wits"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be crazed, or to act or appear as one that is crazed; to rave; to become insane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, archaic) To break into pieces; to crush; to grind to powder. See crase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To crack, as the glazing of porcelain or pottery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}