{
  "word": "purchase",
  "etymologies": [
    {
      "description": [
        "From Middle English purchasen, from Anglo-Norman purchacer (“seek to obtain”) from pur- (from Latin pro-) + chac(i)er (“to chase, pursue”). Compare Old French porchacier (“to follow, to chase”), which has given French pourchasser (“to chase without relent”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purchase (countable and uncountable, plural purchases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The acquisition of title to, or property in, anything for a price; buying for money or its equivalent.",
                  "examples": [
                    "They offer a free hamburger with the purchase of a drink."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is obtained, got or acquired, in any manner, honestly or dishonestly; property; possession; acquisition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is obtained for a price in money or its equivalent.",
                  "examples": [
                    "He was pleased with his latest purchase."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act or process of seeking and obtaining something (e.g. property, etc.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A price paid for a house or estate, etc. equal to the amount of the rent or income during the stated number of years.",
                  "examples": [
                    "Suppose a freehold house to be worth 20 years’ purchase  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, also figuratively) Any mechanical hold or advantage, applied to the raising or removing of heavy bodies, as by a lever, a tackle or capstan.",
                  "examples": [
                    "Synonyms: contact, grip, hold"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The apparatus, tackle or device by which such mechanical advantage is gained and in nautical terminology the ratio of such a device, like a pulley, or block and tackle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rock climbing, uncountable) The amount of hold one has from an individual foothold or ledge.",
                  "examples": [
                    "Synonyms: foothold, support"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, dated) Acquisition of lands or tenements by means other than descent or inheritance, namely, by one's own act or agreement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "purchase (third-person singular simple present purchases, present participle purchasing, simple past and past participle purchased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To buy, obtain by payment of a price in money or its equivalent.",
                  "examples": [
                    "to purchase land, to purchase a house"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pursue and obtain; to acquire by seeking; to gain, obtain, or acquire.",
                  "examples": [
                    "that loves the thing he cannot purchase"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To obtain by any outlay, as of labor, danger, or sacrifice, etc.",
                  "examples": [
                    "to purchase favor with flattery"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To expiate by a fine or forfeit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To apply to (anything) a device for obtaining a mechanical advantage; to get a purchase upon, or apply a purchase to; to raise or move by mechanical means.",
                  "examples": [
                    "to purchase a cannon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put forth effort to obtain anything; to strive; to exert oneself.",
                  "examples": [
                    "Duke John of Brabant purchased greatly that the Earl of Flanders should have his daughter in marriage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To constitute the buying power for a purchase, have a trading value.",
                  "examples": [
                    "Many aristocratic refugees' portable treasures purchased their safe passage and comfortable exile during the revolution."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}