{
  "word": "turnip",
  "etymologies": [
    {
      "description": [
        "From Middle English turnepe, probably from turn + Middle English nepe, from Old English nǣp, from Latin nāpus. The component turn may be due to the round shape of the plant as though turned on a lathe, or because it must be turned and twisted to be harvested. Cognate to neep. See also parsnip."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turnip (plural turnips)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The white root of a yellow-flowered plant, Brassica rapa, grown as a vegetable and as fodder for cattle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Ireland, Northern England, Cornwall, Atlantic Canada) The yellow root of a related plant, the swede or Brassica napus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hong Kong) The white root of Raphanus sativus var. longipinnatus, also known as a daikon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A large, heavy pocket watch, so called because its profile resembled the vegetable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A fool or simpleton.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "turnip (third-person singular simple present turnips, present participle turniping or turnipping, simple past and past participle turniped or turnipped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plant with turnips.",
                  "examples": [
                    "This identical field has been turniped before, and to good account, in a favourable winter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To feed or graze (livestock) on turnips.",
                  "examples": [
                    "The Leicesters and half-breds are purchased by farmers who keep no breeding stock: they are well turniped during the winter, and clipped and fattened in the following season."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}