{
  "word": "chagrin",
  "etymologies": [
    {
      "description": [
        "From French chagrin (“sorrow”), from Middle French chagrin (“pain, affliction”) (compare Middle French chagriner, chagrigner (“to experience sorrow”), Old French chagrin (“painful, afflicted”)), probably derived from Old Northern French chagreiner, chagraigner (“to sadden”), of uncertain origin. Likely an enlargement of Old French greignier, graignier (“to cringe, growl, be sullen, be angry, grieve over”), from Old French graigne (“sadness, resentment, grief”), from graim (“sorrowful”), related to Old High German gram (“furious, gloomy, grieved”). The initial syllable is obscure. It may represent Old French chat (“cat”) to express the idea of \"lamenting or yowling like cats\" (compare German Katzenjammer (“distress, frustration, depression, chagrin”, literally “cat-wailing, cat-misery”), katzbalgen (“to cat-fight”)).",
        "An alternative theory is that it came from a metaphorical use of French chagrin, (peau de) chagrain (“a type of roughened leather”), with the connection of roughness, though some dictionaries consider this to be a separate word derived from Old French peau de sagrin, from Ottoman Turkish sağrı (“the rump of an animal, skin for tawing”). The alteration of initial s to ch is likely due to influence from chagrin meaning \"sorrow\"."
      ],
      "adjectives": [
        {
          "description": "chagrin (comparative more chagrin, superlative most chagrin)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Feeling chagrin; annoyed; vexed, fretful.[17th to 18th centuries.]",
                  "examples": [
                    "Dear, my dear, pity me; I am so chagrin to day, and have had the most signal affront at Court!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "chagrin (countable and uncountable, plural chagrins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Distress of mind caused by a failure of aims or plans, want of appreciation, mistakes etc; vexation or mortification.",
                  "examples": [
                    "Synonyms: disquiet, fretfulness, mortification, peevishness, vexation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of leather or skin with a rough surface.",
                  "examples": [
                    "Synonym: shagreen"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chagrin (third-person singular simple present chagrins, present participle chagrining or chagrinning, simple past and past participle chagrined or chagrinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bother or vex; to mortify.",
                  "examples": [
                    "But since this Infidel Minister knows the folly of these Brags; which he sees destroy’d by the Relations Printed in other Countries: They serve only, for a Subject to augment his Pride; and gives him a Pleasure, the mor to Chagrine and Mortifie the French Ambassador."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, obsolete, rare) To be vexed or annoyed.",
                  "examples": [
                    "Dear Ma’am, why will you chagrine yourself about a vile Man, that is not worth,—no, as I live and breathe,—not worth a single Sigh?—"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}