{
  "word": "delight",
  "etymologies": [
    {
      "description": [
        "Attested from the 13th century, from Middle English delite, from Old French deleiter, deliter, from Latin delectare (“to delight, please”), frequentative of delicere (“to allure, entice”), from de- (“away”) + laciō (“I lure, I deceive”), from Proto-Italic *lakjō (“to draw, pull”), of unknown ultimate origin. Related with delectation, delicate, delicious and dilettante. The modern unetymological spelling (instead of expected delite) is influenced by light and other words in -ight, such as might, bright, etc. The -gh- may also be an attempt to represent the Latin -c-; compare obsolete indight for indict."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "delight (countable and uncountable, plural delights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Joy; pleasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that gives great joy or pleasure.",
                  "examples": [
                    "Greensleeves was all my joy / Greensleeves was my delight,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "delight (third-person singular simple present delights, present participle delighting, simple past and past participle delighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give delight to; to affect with great pleasure; to please highly.",
                  "examples": [
                    "Delight our souls with talk of knightly deeds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have or take great pleasure.",
                  "examples": [
                    "A ſclaunderous tunge, a tunge of a ſkolde,Worketh more miſchiefe than can be tolde;That, if I wiſt not to be controlde,Yet ſomwhat to ſay I dare well be bolde,How ſome delite for to lye, thycke and threfolde."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}