{
  "word": "compass",
  "etymologies": [
    {
      "description": [
        "From Middle English compas (“a circle, circuit, limit, form, a mathematical instrument”), from Old French compas, from Medieval Latin compassus (“a circle, a circuit”), from Latin com- (“together”) + passus (“a pace, step, later a pass, way, route”); see pass, pace."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "compass (plural compasses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A magnetic or electronic device used to determine the cardinal directions (usually magnetic or true north).",
                  "examples": [
                    "He that [...] first discovered the use of the compass [...] did more for the propagation of knowledge [...] than those who built workhouses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pair of compasses (a device used to draw an arc or circle).",
                  "examples": [
                    "to fix one foot of their compass wherever they please"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The range of notes of a musical instrument or voice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A space within limits; an area.",
                  "examples": [
                    "In going up the Missisippi [sic], we meet with nothing remarkable before we come to the Detour aux Anglois, the English Reach: in that part the river takes a large compass."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An enclosing limit; a boundary, a circumference.",
                  "examples": [
                    "within the compass of an encircling wall"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Moderate bounds, limits of truth; moderation; due limits; used with within.",
                  "examples": [
                    "In two hundred years before (I speak within compass), no such commission had been executed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Scope.",
                  "examples": [
                    "There is a truth and falsehood in all propositions on this subject, and a truth and falsehood, which lie not beyond the compass of human understanding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Range, reach.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A passing round; circuit; circuitous course.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English compassen (“to go around, make a circuit, draw a circle, contrive, intend”), from Old French compasser; from the noun; see compass as a noun."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "compass (comparative more compass, superlative most compass)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) In a circuit; round about.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "compass (third-person singular simple present compasses, present participle compassing, simple past and past participle compassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To surround; to encircle; to environ; to stretch round.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To go about or round entirely; to traverse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To accomplish; to reach; to achieve; to obtain.",
                  "examples": [
                    "[...] they never find ways sufficient to compass that end."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To plot; to scheme (against someone).",
                  "examples": [
                    "That he plotted and compassed to raise Sedition and Rebellion [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}