{
  "word": "filibuster",
  "etymologies": [
    {
      "description": [
        "Borrowed from Spanish filibustero (“pirate”), from French flibustier, ultimately from Dutch vrijbuiter (“freebooter”), from vrij (“free”) + buit (“booty”) + -er (“agent”). The alteration in the first syllable in French is due to the word's being somewhat conflated with vlieboot (“light, flat-bottomed cargo vessel with two or three masts”) when it was borrowed into French or another language from Dutch. The word is cognate and analogous to English freebooter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "filibuster (plural filibusters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mercenary soldier; a freebooter; specifically, a mercenary who travelled illegally in an organized group from the United States to a country in Central America or the Spanish West Indies in the mid-19th century seeking economic and political benefits through armed force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US politics) A tactic (such as giving long, often irrelevant speeches) employed to delay the proceedings of, or the making of a decision by, a legislative body, particularly the United States Senate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US politics) A member of a legislative body causing such an obstruction; a filibusterer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "filibuster (third-person singular simple present filibusters, present participle filibustering, simple past and past participle filibustered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take part in a private military action in a foreign country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally and mainly US, politics) To use obstructionist tactics in a legislative body.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}