{
  "word": "interpretation",
  "etymologies": [
    {
      "description": [
        "From Middle English [Term?], from Anglo-Norman [Term?], from Old French [Term?], from Latin interpretātiō, noun of action from interpretor (“to explain, expound, interpret, understand, conclude, infer, comprehend”)\nMorphologically interpret +‎ -ation"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "interpretation (countable and uncountable, plural interpretations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An act of interpreting or explaining something unclear; a translation; a version.",
                  "examples": [
                    "The interpretation of a dream, or of an enigma",
                    "The interpretation of the rules"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A sense given by an interpreter; an exposition or explanation given; meaning.",
                  "examples": [
                    "Commentators give various interpretations of the same passage of Scripture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, linguistics, translation studies) The discipline or study of translating one spoken or signed language into another (as opposed to translation, which concerns itself with written language).",
                  "examples": [
                    "I believe that interpretation, particularly consecutive interpretation, is an art. I also  believe, however, that the skill of consecutive interpretation can be taught, but only up to a point."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The power of explaining.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An artist's way of expressing his thought or embodying his conception of nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An act or process of applying general principles or formulae to the explanation of the results obtained in special cases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, physics) An approximation that allows aspects of a mathematical theory to be discussed in ordinary language.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, logic, model theory) An assignment of a truth value to each propositional symbol of a propositional calculus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "heritage interpretation",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}