{
  "word": "fastness",
  "etymologies": [
    {
      "description": [
        "From Middle English fastnes, fastnesse (“immovableness, stability; firmness, solidness; secure attachment; constancy; obstinacy; something giving firmness or strength; of sleep: soundness; of a wound: healing; assurance, confirmation”) [and other forms], from Old English fæstnes (“fastness, firmness, stability; resolution; tenacity; vigour; firmament; fortification”) [and other forms], from fæst (“firm, stable; constant”) (from Proto-Germanic *fastuz (“firm, fixed; secure”); see further at that entry) + -nes (suffix forming abstract nouns denoting a quality or state). The English word may be analysed as fast +‎ -ness."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fastness (countable and uncountable, plural fastnesses)",
          "definitionGroups": [
            {
              "group": "(uncountable) The quality or state of being fast (in various senses).",
              "entries": [
                {
                  "meaning": "The quality or state of being strongly attached; firmness, secureness, tenacity.",
                  "examples": []
                },
                {
                  "meaning": "(specifically) The ability of a dye to withstand fading.",
                  "examples": []
                },
                {
                  "meaning": "The quality or state of moving quickly; quickness, rapidity, swiftness.",
                  "examples": [
                    "[Frog:] Why are all of us fleein'? What dire peril threatens our sylvan fastness?  [Bug:] Just run! Your fastness shouldn't be too slow."
                  ]
                },
                {
                  "meaning": "The quality or state of having an extravagant lifestyle or immoral habits.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) Of a fortress or other place: the quality or state of being secure from access or attack; safety, security.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The quality or state of being firm, hard, or solid; firmness, hardness, solidity.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) Something that is fast, or that causes someone or something to be fast (in various senses).",
              "entries": [
                {
                  "meaning": "(also figuratively) A fortified or secure place; a fortress, a stronghold.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete except Britain, regional) Something used to fasten or tie; a fastener or fastening.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}