{
  "word": "understand",
  "etymologies": [
    {
      "description": [
        "From Middle English understanden, from Old English understandan (“to understand”), from Proto-West Germanic *understandan (“to stand between, understand”), from Proto-Germanic *understandaną (“to stand between, understand”), equivalent to Old English under- (“between, inter-”) + standan (“to stand”) (Modern English under- +‎ stand). Cognate with Old Frisian understonda (“to understand, experience, learn”), Old High German understantan (“to understand”), Middle Danish understande (“to understand”). Compare also Saterland Frisian understunda, unnerstounde (“to dare, survey, measure”), Dutch onderstaan (“to undertake, presume”), German unterstehen (“to be subordinate”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "understand (third-person singular simple present understands, present participle understanding, simple past and past participle understood)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grasp a concept fully in one's mind, especially (of words, statements, art, etc.) to be aware of the meaning of and (of people) to be aware of the intent of.",
                  "examples": [
                    "I'm sorry. I don't understand.",
                    "Please try to understand. It's not you, it's me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To believe, to think one grasps sufficiently despite potentially incomplete knowledge.",
                  "examples": [
                    "I understand that you have a package for me?",
                    "In the imperative mood, the word “you” is usually understood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(humorous, rare, obsolete outside circus, acrobatics) To stand underneath, to support.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}