{
  "word": "partisan",
  "etymologies": [
    {
      "description": [
        "From French partisan, from Italian partigiano (“defender of a party”), from parte (“part”). Doublet of partigiano. Attested in English from the late 15th century in the noun sense of \"party adherent\", and in related adjective senses from the 16th century. The \"guerilla fighter\" sense influenced by Serbo-Croatian partizan, Russian партиза́н (partizán), from the same source.\nThe sense of \"guerilla fighter\" is from c. 1690.\nThe adjective in the military sense dates from the early 18th century."
      ],
      "adjectives": [
        {
          "description": "partisan (comparative more partisan, superlative most partisan)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Serving as commander or member of a body of detached light troops.",
                  "examples": [
                    "partisan officer, partisan corps"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Adherent to a party or faction; especially, having the character of blind, passionate, or unreasonable adherence to a party.",
                  "examples": [
                    "They were blinded by partisan zeal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Devoted to or biased in support of a party, group, or cause.",
                  "examples": [
                    "partisan politics"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "partisan (plural partisans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An adherent to a party or faction.",
                  "examples": [
                    "\"Strong partisans of neither party, Indiana farmers failed to act as a block  […] \""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fervent, sometimes militant, supporter or proponent of a party, cause, faction, person, or idea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a band of detached light, irregular troops acting behind occupying enemy lines in the ways of harassment or sabotage; a guerrilla fighter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) The commander of a body of detached light troops engaged in making forays and harassing an enemy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From French partizaine, from Middle French partizaine, partisanne etc., from Italian partigiana, related to Etymology 1 above (apparently because it was seen as a typical weapon of such forces)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "partisan (plural partisans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A long-handled spear with a triangular, double-edged blade having lateral projections, in some forms also used in boar hunting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A soldier armed with such a weapon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}