{
  "word": "twang",
  "etymologies": [
    {
      "description": [
        "Onomatopoeic. Compare Middle English twengen (“to pinch, tweak”), from Old English twenġen (“to pinch, twinge”); Middle English twingen (“to afflict, torment, oppress”), from Old Norse þvinga (“to weigh down, oppress”); Old English twingan (“to force, press”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "twang (plural twangs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sharp, quick sound of a vibrating tight string, for example, of a bow or a musical instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A particular sharp vibrating sound characteristic of electric guitars.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trace of a regional or foreign accent in someone's voice.",
                  "examples": [
                    "Despite having lived in Canada for 20 years, he still has that Eastern-European twang in his voice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) The sound quality that appears in the human voice when the epilaryngeal tube is narrowed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp, disagreeable taste or flavor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) An annoying or stupid person, recalcitrant.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "twang (third-person singular simple present twangs, present participle twanging, simple past and past participle twanged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To produce or cause to produce a sharp vibrating sound, like a tense string pulled and suddenly let go.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a nasal sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have a trace of a regional or foreign accent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To play a stringed musical instrument by plucking and snapping.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}