{
  "word": "sprinkle",
  "etymologies": [
    {
      "description": [
        "From Middle English sprenkelen, sprynklen, from Middle Dutch sprenkelen, equivalent to spring +‎ -le (frequentative suffix). Cognate with Dutch sprenkelen (“to sprinkle”), German Low German sprenkeln (“to sprinkle; dapple”), German sprenkeln (“to sprinkle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sprinkle (plural sprinkles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light covering with a sprinkled substance.",
                  "examples": [
                    "He decorated the Christmas card with a sprinkle of glitter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light rain shower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An aspersorium or utensil for sprinkling.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small hard piece of sugar and starch, or chocolate, used to decorate cakes etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sprinkle (third-person singular simple present sprinkles, present participle sprinkling, simple past and past participle sprinkled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (a substance) to fall in fine drops (for a liquid substance) or small pieces (for a solid substance).",
                  "examples": [
                    "The confectioner sprinkled icing sugar over the cakes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover (an object) by sprinkling a substance on to it.",
                  "examples": [
                    "The confectioner sprinkled the cakes with icing sugar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drip in fine drops, sometimes sporadically.",
                  "examples": [
                    "It sprinkled outside all day long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rain very lightly outside.",
                  "examples": [
                    "It sprinkled very early in the morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To baptize by the application of a few drops, or a small quantity, of water; hence, to cleanse; to purify.",
                  "examples": [
                    "having our hearts sprinkled from an evil conscience"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}