{
  "word": "broil",
  "etymologies": [
    {
      "description": [
        "From Middle English broillen, brulen (“to broil, cook”), from Anglo-Norman bruiller, broiller (“to broil, roast”), Old French brusler, bruller (“to broil, roast, char”), a blend of two Old French verbs:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "broil (plural broils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Food prepared by broiling.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "broil (third-person singular simple present broils, present participle broiling, simple past and past participle broiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, US, obsolete in the U.K) To cook by direct, radiant heat.",
                  "examples": [
                    "1788,  Hannah Glasse,  The Art of Cookery, Made Plain and Easy: Which Far Exceeds Any Thing of the Kind Yest Published‎[1], page 6:To broil a pigeon. When you broil them, do them in the same manner, and take care your fire is very clear, and set your gridiron high, that they may not burn, and have a little parsley and butter in a cup. You may split them, and broil them with a little pepper and salt, and you may roast them only with a little parsley and butter in a dish.",
                    "1798,  Richard Briggs,  The English Art of Cookery…With Bills of Fare for Every Month in the Year…A New Edition‎[2], page 70:To broil Red Mullet. Neither seale nor gut your mullet, wipe them very clean in a cloth, butter half a sheet of writing paper for each fish, put them in, and fasten it all round; have a very clear fire, broil them very gently for twenty minutes, hen put them in a dish, with anchovy sauce and plain butter in boats.",
                    "1813,  Bell Plumptre,  Domestic Management; Or, the Healthful Cookery-Book‎[3], page 247:To broil fish. To broil trout in a third way. When they are cleaned and washed, dry them well in a napkin. Then bind them about with packthread, sprinkle them with melted butter and salt, and broil them over a gentle fire, turning them from time to time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Canada, US) To expose to great heat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Canada, US) To be exposed to great heat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Middle English broilen (“to quarrel, present in disorder”), from Anglo-Norman broiller (“to mix up”), from Vulgar Latin *brodiculāre (“to jumble together”) from *brodum (“broth, stew”), from Frankish *broþ (“broth”), from Proto-Germanic *bruþą (“broth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "broil (plural broils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A brawl; a rowdy disturbance.",
                  "examples": [
                    "come to broils"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "broil (third-person singular simple present broils, present participle broiling, simple past and past participle broiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause a rowdy disturbance; embroil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To brawl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}