{
  "word": "lobster",
  "etymologies": [
    {
      "description": [
        "From Middle English loppestere, lopster, from Old English loppestre (“lobster, spider-like creature”), of uncertain origin. Some believe it to be a corruption of Latin lō̆custa (“grasshopper, locust”) + the Old English feminine agent suffix -estre. In Latin, the phrase lō̆custa marīna (literally \"sea-grasshopper\") signified a type of crustacean (shrimp or lobster).",
        "Alternatively, from Old English lobbe, loppe (“spider”) + the Old English feminine agent suffix -estre, equivalent to lop +‎ -ster."
      ],
      "adjectives": [
        {
          "description": "lobster (comparative more lobster, superlative most lobster)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Red-colored, especially from a sunburn.",
                  "examples": [
                    "Synonym: red as a lobster"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "lobster (countable and uncountable, plural lobsters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crustacean of the Nephropidae family, dark green or blue-black in colour turning bright red when cooked, with a hard shell and claws, which is used as a seafood.",
                  "examples": [
                    "Some get shit and some get lobster"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A crustacean of the Palinuridae family, pinkish red in colour, with a hard, spiny shell but no claws, which is used as a seafood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, historical) A soldier or officer of the imperial British Army (due to their red or scarlet uniform).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An Australian twenty dollar note, due to its reddish-orange colour.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lobster (third-person singular simple present lobsters, present participle lobstering, simple past and past participle lobstered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fish for lobsters.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}