{
  "word": "topside",
  "etymologies": [
    {
      "description": [
        "top +‎ side"
      ],
      "adjectives": [
        {
          "description": "topside (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Abovedeck, such as on the weather deck or bridge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "topside (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Abovedeck, such as on the weather deck or bridge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "topside (plural topsides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The side or part of something that is at the top.",
                  "examples": [
                    "Yet the topside exerts significant control over the lower ionosphere and hence also has an indirect effect on long-range radio comunications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The surface of a ship’s hull that is above the water line.",
                  "examples": [
                    "We believe that the failure of Sun Ship to submit a bid for topside work had no effect on the price, quality, quantity or time of performance of any contract to be awarded for the combination of drydock and topside work covered in the firm′s bid for Lot III."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) The structure and assembly of modules above the jacket or gravity base sub structure.",
                  "examples": [
                    "Future plans are for tripod designs in up to 90m of water, supporting lightweight topsides and braced mono towers for marginal field developments."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) The structure and assembly of modules on the deck of any floating installation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand) The outer side of a round of beef.",
                  "examples": [
                    "To detach the round bone, the biggest muscle of the round, the topside, must first be removed. This is done by cutting down to the round bone in a layer of connective tissue which separates the topside from the nuggle."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}