{
  "word": "trundler",
  "etymologies": [
    {
      "description": [
        "trundle +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trundler (plural trundlers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who trundles (something or someone).",
                  "examples": [
                    "I shall begin with the Married Ladies, as this order will be found to be far the most numerous, and includes all the married women in town or country above the degree of a chair-woman or the trundler of a wheel-barrow."
                  ]
                }
              ]
            },
            {
              "group": "(cricket) A bowler (player throwing the ball).",
              "entries": [
                {
                  "meaning": "(cricket) A bowler who bowls slowly; a mediocre bowler.",
                  "examples": [
                    "The next bowler was a trundler, and Luton, evidently inspired by Bognor’s cover drive, hit him to all corners of the ground."
                  ]
                }
              ]
            },
            {
              "group": "A device that is trundled (pushed or pulled on wheels).",
              "entries": [
                {
                  "meaning": "(New Zealand) Shopping cart.",
                  "examples": [
                    "The supermarket, its turnstiles and trundlers, gave substance to hopes as desirable and distant as heaven."
                  ]
                },
                {
                  "meaning": "(New Zealand) A foldable shopping bag with a light frame and wheels.",
                  "examples": [
                    "[…]  I couldn’t see where I was going and banged into a baggy old lady pulling a trundler full of shopping,"
                  ]
                },
                {
                  "meaning": "(Australia, New Zealand) Golf pushcart.",
                  "examples": [
                    "[…]  many golf trolleys, or trundlers as the Australians call them, are equipped with a small seat upon which to rest between shots."
                  ]
                },
                {
                  "meaning": "(obsolete) A device made of a wooden stick with a wheel at the bottom, a crossbar handle at the top, and a hook in the middle, used to move pails and cans while gardening.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) A wooden-wheeled cart used for gardening.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, obsolete) Pea (vegetable).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}