{
  "word": "wager",
  "etymologies": [
    {
      "description": [
        "From Middle English wajour, wageour, wager, from Old Northern French wageure, from wagier (“to pledge”) (compare Old French guagier, whence modern French gager). See also wage."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wager (plural wagers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something deposited, laid, or hazarded on the event of a contest or an unsettled question; a bet; a stake; a pledge.",
                  "examples": [
                    "“This thicket was a singular, an exceedingly singular one. It was unusually dense. Within its naturally walled enclosure were three extraordinary stones, forming a seat with a back and footstool.[...] , whose boys were in the habit of closely examining the shrubberies about them in search of the bark of the sassafras. Would it be a rash wager – a wager of one thousand to one – that a day never passed over the heads of these boys without finding at least one of them ensconced in the umbrageous hall, and enthroned upon its natural throne? Those who would hesitate at such a wager, have either never been boys themselves, or have forgotten the boyish nature.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That on which bets are laid; the subject of a bet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A contract by which two parties or more agree that a certain sum of money, or other thing, shall be paid or delivered to one of them, on the happening or not happening of an uncertain event.",
                  "examples": [
                    "Besides these Plates, the Wagers may be as the Persons please among themselves, but the Horses must be evidenced by good Testimonies to have been bred in Ireland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An offer to make oath.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wager (third-person singular simple present wagers, present participle wagering, simple past and past participle wagered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bet something; to put it up as collateral.",
                  "examples": [
                    "I'd wager my boots on it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To suppose; to dare say.",
                  "examples": [
                    "I'll wager that Johnson knows something about all this."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From the verb, wage +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wager (plural wagers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Agent noun of wage; one who wages.",
                  "examples": [
                    "They were wagers of warfare against the wilderness and the Indians, and founders of families and towns."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}