{
  "word": "sit",
  "etymologies": [
    {
      "description": [
        "From Middle English sitten, from Old English sittan, from Proto-West Germanic *sittjan, from Proto-Germanic *sitjaną, from Proto-Indo-European *sed- (“sit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sit (plural sits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) Subsidence of the roof of a coal mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, Buddhism) An event, usually lasting one full day or more, where the primary goal is to sit in meditation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sit (third-person singular simple present sits, present participle sitting, simple past sat or (dated, poetic) sate, past participle sat or (archaic, dialectal) sitten)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative, of a person) To be in a position in which the upper body is upright and supported by the buttocks.",
                  "examples": [
                    "He is so fair, without lease, he seems full well to sit on this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a person) To move oneself into such a position.",
                  "examples": [
                    "I asked him to sit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an object) To occupy a given position.",
                  "examples": [
                    "The temple has sat atop that hill for centuries.",
                    "Jim's pet parrot sat on his left shoulder."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To remain in a state of repose; to rest; to abide; to rest in any position or condition.",
                  "examples": [
                    "And Moses said to  […]  the children of Reuben, Shall your brothren go to war, and shall ye sit here?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(government) To be a member of a deliberative body.",
                  "examples": [
                    "I currently sit on a standards committee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, government) Of a legislative or, especially, a judicial body such as a court, to be in session.",
                  "examples": [
                    "In what city is the circuit court sitting for this session."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lie, rest, or bear; to press or weigh.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be adjusted; to fit.",
                  "examples": [
                    "Your new coat sits well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of an agreement or arrangement) To be accepted or acceptable; to work.",
                  "examples": [
                    "How will this new contract sit with the workers?",
                    "I don’t think it will sit well.",
                    "The violence in these video games sits awkwardly with their stated aim of educating children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, causative) To cause to be seated or in a sitting posture; to furnish a seat to.",
                  "examples": [
                    "Sit him in front of the TV and he might watch for hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accommodate in seats; to seat.",
                  "examples": [
                    "The dining room table sits eight comfortably."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive, intransitive) To babysit.",
                  "examples": [
                    "I'm going to sit for them on Thursday.",
                    "I need to find someone to sit my kids on Friday evening for four hours."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Australia, New Zealand, UK) To take, to undergo or complete (an examination or test).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cover and warm eggs for hatching, as a fowl; to brood; to incubate.",
                  "examples": [
                    "The partridge sitteth on eggs, and hatcheth them not."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take a position for the purpose of having some artistic representation of oneself made, such as a picture or a bust.",
                  "examples": [
                    "I'm sitting for a painter this evening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To have position, as at the point blown from; to hold a relative position; to have direction.",
                  "examples": [
                    "like a good miller that knows how to grind, which way soever the wind sits"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To keep one's seat when faced with (a blow, attack); to endure, to put up with. [13th–19th c.]",
                  "examples": [
                    "Louisa, who  […]  had but ill born the commencement of this conversation, could sit it no longer, and hastily throwing up the sash, complained of the intense heat of the room."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sit (plural sits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Short for situation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}