{
  "word": "grove",
  "etymologies": [
    {
      "description": [
        "From Middle English grove, grave, from Old English grāf, grāfa (“grove; copse”), from Proto-West Germanic *graib, *graibō (“branch, group of branches, thicket”), from Proto-Germanic *graibaz, *graibô (“branch, fork”).",
        "Related to Old English grǣf, grǣfe (“brushwood; thicket; copse”), Old English grǣfa (“thicket”), dialectal Norwegian greive (“ram with splayed horns”), dialectal Norwegian greivlar (“ramifications of an antler”), dialectal Norwegian grivla (“to branch, branch out”), Old Norse grein (“twig, branch, limb”). More at greave."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grove (plural groves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small forest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An orchard of fruit trees.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Druidism, Wicca) A place of worship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lodge of the Ancient Order of Druids.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "grove (third-person singular simple present groves, present participle groving, simple past and past participle groved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cultivate in groves; to grow naturally so as to form groves.",
                  "examples": [
                    "It is called \"Orchard Lake,\" from the fact, that near the centre is an island embracing an area of about fifty acres of land, well groved with different kinds of shrubbery; and near the centre of this island stand a number of aged apple-trees, planted, perhaps, a century since by the hand of some Indian."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(forestry, of trees) To cultivate with periodic harvesting that also serves to create order (gaps and lines of trees) to facilitate further harvesting.",
                  "examples": [
                    "In Herefordshire, especially on the northern and eastern sides, Oak timber abounds; and in many of the woods it is usual to have felling at periods varying from sixteen to twenty years; the straightest and handsomest are left for timber, or, as it is called, groved; and they are from time to time thinned, and a regular distance kept between them. The effect produced on these groved trees is, that from being exposed to air and sun, the rapidity of their growth is increased in bulk, height, and quality; and in sixty or eighty years they become valuable timber."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To plough or gouge with lines.",
                  "examples": [
                    "Very frequently, however, to shorten the distance to the upper nurseries, where they[the ants] have to take the eggs, they project an arch of about ten inches in length, and half an inch in breadth, groved or worked into steps, on its upper surface, to allow of a more easy passage."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}