{
  "word": "fill",
  "etymologies": [
    {
      "description": [
        "From Middle English fillen, fullen, from Old English fyllan (“to fill, fill up, replenish, satisfy; complete, fulfill”), from Proto-West Germanic *fullijan, from Proto-Germanic *fullijaną (“to make full, fill”), from *fullaz (“full”), from Proto-Indo-European *pl̥h₁nós (“full”).",
        "Cognate with Scots fill (“to fill”), West Frisian folje (“to fill”), Low German füllen (“to fill”), Dutch vullen (“to fill”), German füllen (“to fill”), Danish fylde (“to fill”), Swedish fylla (“to fill”), Norwegian fylle (“to fill”), Icelandic fylla (“to fill”) and Latin plenus (“full”)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fill (third-person singular simple present fills, present participle filling, simple past and past participle filled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To occupy fully, to take up all of.",
                  "examples": [
                    "[…] the drums began to thunder, the sound of trumpets filled the air, the earth trembled beneath their feet, and the hearts of the gazing multitude throbbed with suspense and expectation […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To add contents to (a container, cavity, or the like) so that it is full.",
                  "examples": [
                    "She continued to frown as she filled Bony's cup and added brandy to her own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To enter (something), making it full.",
                  "examples": [
                    "In the evening of the 14th of July, there was a rainfall of 3 or 3½ inches in that locality. The water filled the ditch so full that it overflowed the levees on both sides in many places […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become full.",
                  "examples": [
                    "the bucket filled with rain;  the sails fill with wind"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become pervaded with something.",
                  "examples": [
                    "My heart filled with joy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To satisfy or obey (an order, request, or requirement).",
                  "examples": [
                    "The pharmacist filled my prescription for penicillin.",
                    "We can't let the library close! It fills a great need in the community."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To install someone, or be installed, in (a position or office), eliminating a vacancy.",
                  "examples": [
                    "The board of supervisors called a specal[sic] election to fill the office, and at such special election Henry C. Andrews was elected judge of probate to fill out the said term."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat (a tooth) by adding a dental filling to it.",
                  "examples": [
                    "Be that as it may, had the disturbance continued after our having filled the molar, and presuming that nothing had been done to the bicuspid, we might have been still as far as ever from knowing where the trouble lay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fill or supply fully with food; to feed; to satisfy.",
                  "examples": [
                    "Whence should we have so much bread in the wilderness, as to fill so great a multitude?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To trim (a yard) so that the wind blows on the after side of the sails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang, vulgar, of a male) To have sexual intercourse with (a female).",
                  "examples": [
                    "Did you fill that girl last night?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fille, vülle, fülle, from Old English fyllu, from Proto-West Germanic *fullī, from Proto-Germanic *fullį̄ (“fullness”). Cognate with German Fülle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fill (plural fills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(after a possessive) A sufficient or more than sufficient amount.",
                  "examples": [
                    "Don't feed him any more: he's had his fill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amount that fills a container.",
                  "examples": [
                    "The mixer returned to the plant for another fill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The filling of a container or area.",
                  "examples": [
                    "That machine can do 20 fills a minute.",
                    "This paint program supports lines, circles, and textured fills."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inexpensive material used to occupy empty spaces, especially in construction.",
                  "examples": [
                    "The ruins of earlier buildings were used as fill for more recent construction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) Soil and/or human-created debris discovered within a cavity or cut in the layers and exposed by excavation; fill soil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An embankment, as in railroad construction, to fill a hollow or ravine; also, the place which is to be filled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A short passage, riff, or rhythmic sound that helps to keep the listener's attention during a break between the phrases of a melody.",
                  "examples": [
                    "bass fill"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See thill."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fill (plural fills)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of the thills or shafts of a carriage.",
                  "examples": [
                    "It was a challenge to learn to harness him, guide him slowly back between the fills of the carriage, then to fasten the right buckles and snaps, making the harness and buggy all ready for travel to church or to town."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}