{
  "word": "blackmail",
  "etymologies": [
    {
      "description": [
        "From black + mail (“a piece of money”). Compare Middle English blak rente (“a type of blackmail levied by Irish chieftains”).",
        "The word is variously derived from the tribute paid by English and Scottish border dwellers to Border Reivers in return for immunity from raids and other harassment. This tribute was paid in goods or labour, in Latin reditus nigri \"blackmail\"; the opposite is blanche firmes or reditus albi \"white rent\", denoting payment by silver.",
        "McKay derives it from two Scottish Gaelic words blàthaich, pronounced (the th silent) bl-aich, \"to protect\" and màl (“tribute, payment”). He notes that the practice was common in the Highlands of Scotland as well as the Borders.",
        "More likely, from black + Middle English mal, male, maile (“a payment, rent, tribute”), from Old English māl (“speech, contract, agreement, lawsuit, terms, bargaining”), from Old Norse mál (“agreement, speech, lawsuit”); related to Old English mæðel (“meeting, council”), mæl (“speech”), Gothic 𐌼𐌰𐌸𐌻 (maþl, “meeting place”), from Proto-Germanic *maþlą (“gathering, agreement”), ultimately from Proto-Indo-European *med- (“to give advice, measure”). From the practice of freebooting clan chieftains who ran protection rackets against Scottish farmers. Black from the evil of the practice.",
        "Expanded c.1826 to any type of extortion money. Compare silver mail \"rent paid in money\" (1590s); buttock-mail (Scottish, 1530s) \"fine imposed for fornication.\""
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "blackmail (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The extortion of money or favours by threats of public accusation, exposure, or censure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A form of protection money (or corn, cattle, etc.) anciently paid, in the north of England and south of Scotland, to the allies of robbers in order to be spared from pillage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(England law, historical) Black rent, or rent paid in corn, meat, or the lowest coin, as opposed to white rent, which was paid in silver.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Compromising material that can be used to extort someone, dirt.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blackmail (third-person singular simple present blackmails, present participle blackmailing, simple past and past participle blackmailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extort money or favors from (a person) by exciting fears of injury other than bodily harm, such as injury to reputation, distress of mind, false accusation, etc.",
                  "examples": [
                    "He blackmailed a businesswoman by threatening to expose an alleged fraud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Kenya) To speak ill of someone; to defame someone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}