{
  "word": "second",
  "etymologies": [
    {
      "description": [
        "From Middle English secunde, second, secound, secund, borrowed from Old French second, seond, from Latin secundus (“following, next in order”), from root of sequor (“I follow”), from Proto-Indo-European *sekʷ- (“to follow”). Doublet of secundo. Displaced native twoth and partially displaced native other (from Old English ōþer (“other; next; second”))."
      ],
      "adjectives": [
        {
          "description": "second (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Number-two; following after the first one with nothing between them. The ordinal number corresponding to the cardinal number two.",
                  "examples": [
                    "He lives on Second Street.",
                    "The second volume in \"The Lord of the Rings\" series is called \"The Two Towers\".",
                    "You take the first one, and I'll have the second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Next to the first in value, power, excellence, dignity, or rank; secondary; subordinate; inferior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being of the same kind as one that has preceded; another.",
                  "examples": [
                    "Residents of Texas prepared for Hurricane Harvey, which would in some ways turn out to become the second Hurricane Katrina."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "second (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with superlative) After the first; at the second rank.",
                  "examples": [
                    "Saturn is the second largest planet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "After the first occurrence but before the third.",
                  "examples": [
                    "He is batting second today."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "second (plural seconds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is number two in a series.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that is next in rank, quality, precedence, position, status, or authority.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The place that is next below or after first in a race or contest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) A manufactured item that, though still usable, fails to meet quality control standards.",
                  "examples": [
                    "They were discounted because they contained blemishes, nicks or were otherwise factory seconds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) An additional helping of food.",
                  "examples": [
                    "That was good barbecue. I hope I can get seconds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chance or attempt to achieve what should have been done the first time, usually indicating success this time around. (See second-guess.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The interval between two adjacent notes in a diatonic scale (either or both of them may be raised or lowered from the basic scale via any type of accidental).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The second gear of an engine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) Second base.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The agent of a party to an honour dispute whose role was to try to resolve the dispute or to make the necessary arrangements for a duel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A Cub Scout appointed to assist the sixer.",
                  "examples": [
                    "Many packs have a sixer's council where the sixers, and sometimes the seconds, meet with Akela and some of the other leaders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A second-class honours degree.",
                  "examples": [
                    "[Stephen Hawking]  […]  would go to Cambridge, he said, if they gave him a first, and stay at Oxford if they gave him a second. He got a first."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "second (third-person singular simple present seconds, present participle seconding, simple past and past participle seconded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree as a second person to (a proposal), usually to reach a necessary quorum of two. (See under #Etymology 3 for translations.)",
                  "examples": [
                    "I second the motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To follow in the next place; to succeed.",
                  "examples": [
                    "In the method of nature, a low valley is immediately seconded with an ambitious hill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(climbing) To climb after a lead climber.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English secunde, seconde, borrowed from Old French seconde, from Medieval Latin secunda, short for secunda pars minuta (“second diminished part (of the hour)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "second (plural seconds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One-sixtieth of a minute; the SI unit of time, defined as the duration of 9,192,631,770 periods of radiation corresponding to the transition between two hyperfine levels of caesium-133 in a ground state at a temperature of absolute zero and at rest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of angle equal to one-sixtieth of a minute of arc or one part in 3600 of a degree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A short, indeterminate amount of time.",
                  "examples": [
                    "I'll be there in a second."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French seconder, from Latin secundō (“assist, make favorable”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "second (plural seconds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who supports another in a contest or combat, such as a dueller's assistant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who supports or seconds a motion, or the act itself, as required in certain meetings to pass judgement etc.",
                  "examples": [
                    "If we want the motion to pass, we will need a second."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Aid; assistance; help.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "second (third-person singular simple present seconds, present participle seconding, simple past and past participle seconded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK) To transfer temporarily to alternative employment.",
                  "examples": [
                    "The army officer was seconded while he held civil office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assist or support; to back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agree as a second person to (a proposal), usually to reach a necessary quorum of two. (This may come from the English adjective above.)",
                  "examples": [
                    "I second the motion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To accompany by singing as the second performer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}