{
  "word": "butt",
  "etymologies": [
    {
      "description": [
        "From Middle English but, butte (“goal, mark, butt of land”), from Old English byt, bytt (“small piece of land”) and *butt (attested in diminutive Old English buttuc (“end, small piece of land”) > English buttock), from Proto-Germanic *buttaz (“end, piece”), from Proto-Indo-European *bʰudʰnós (“bottom”), later thematic variant of Proto-Indo-European *bʰudʰmḗn ~ *bʰudʰn-, perhaps from Proto-Indo-European *dʰewbʰ- (“deep”).",
        "Cognate with Norwegian butt (“stump, block”), Icelandic bútur (“piece, fragment”), Low German butt (“blunt, clumsy”). Influenced by Old French but, butte (“but, mark”), ultimately from the same Germanic source. Compare also Albanian bythë (“buttocks”), Ancient Greek πυθμήν (puthmḗn, “bottom of vessel”), Latin fundus (“bottom”) and Sanskrit बुध्न (budhná, “bottom”), from the same Proto-Indo-European root. Related to bottom, boot."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": "(countable) The larger or thicker end of something; the blunt end, in distinction from the sharp or narrow end",
              "entries": [
                {
                  "meaning": "(Canada, US, Philippines, slang) The buttocks (used as a minced oath in idiomatic expressions; less objectionable than arse/ass).",
                  "examples": [
                    "Get up off your butt and get to work."
                  ]
                },
                {
                  "meaning": "(slang) The whole buttocks and pelvic region that includes one's private parts.",
                  "examples": [
                    "I can see your butt."
                  ]
                },
                {
                  "meaning": "(slang, metonymically) Body; self.",
                  "examples": [
                    "Get your butt to the car.",
                    "We can't chat today. I have to get my butt to work before I'm late."
                  ]
                },
                {
                  "meaning": "(leather trades) The thickest and stoutest part of tanned oxhides, used for soles of boots, harness, trunks.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) The waste end of anything.",
              "entries": [
                {
                  "meaning": "(slang) A used cigarette.",
                  "examples": []
                },
                {
                  "meaning": "A piece of land left unplowed at the end of a field.",
                  "examples": [
                    "The hay was growing upon headlands and butts in cornfields."
                  ]
                },
                {
                  "meaning": "(obsolete, West Country) Hassock.",
                  "examples": []
                },
                {
                  "meaning": "(US) A crust end-piece of a loaf of bread.",
                  "examples": [
                    "Synonyms: boot, heel"
                  ]
                }
              ]
            },
            {
              "group": "(countable, generally) An end of something, often distinguished in some way from the other end.",
              "entries": [
                {
                  "meaning": "The end of a firearm opposite to that from which a bullet is fired.",
                  "examples": [
                    "She was hit in the face with the butt of a shotgun."
                  ]
                },
                {
                  "meaning": "(lacrosse) The plastic or rubber cap used to cover the open end of a lacrosse stick's shaft in order to reduce injury.",
                  "examples": []
                },
                {
                  "meaning": "The portion of a half-coupling fastened to the end of a hose.",
                  "examples": []
                },
                {
                  "meaning": "The end of a connecting rod or other like piece, to which the boxing is attached by the strap, cotter, and gib.",
                  "examples": []
                },
                {
                  "meaning": "(mechanical) A joint where the ends of two objects come squarely together without scarfing or chamfering.",
                  "examples": [
                    "Synonym: butt joint"
                  ]
                },
                {
                  "meaning": "(carpentry) A kind of hinge used in hanging doors, etc., so named because it is attached to the inside edge of the door and butts against the casing, instead of on its face, like the strap hinge; also called butt hinge.",
                  "examples": []
                },
                {
                  "meaning": "(shipbuilding) The joint where two planks in a strake meet.",
                  "examples": []
                },
                {
                  "meaning": "The blunt back part of an axehead or large blade. Also called the poll.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable) A limit; a bound; a goal; the extreme bound; the end.",
              "entries": [
                {
                  "meaning": "A mark to be shot at; a target.",
                  "examples": [
                    "The inhabitants of all cities and towns were ordered to make butts, and to keep them in repair, under a penalty of twenty shillings per month, and to exercise themselves in shooting at them on holidays."
                  ]
                },
                {
                  "meaning": "(usually as \"butt of (a) joke\") A person at whom ridicule, jest, or contempt is directed.",
                  "examples": [
                    "Synonym: laughing stock",
                    "He's usually the butt of their jokes."
                  ]
                },
                {
                  "meaning": "The hut or shelter of the person who attends to the targets in rifle practice.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "butt (third-person singular simple present butts, present participle butting, simple past and past participle butted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To join at the butt, end, or outward extremity; to terminate; to be bounded; to abut.",
                  "examples": [
                    "And Barnsdale there doth butt on Don's well-watered ground."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English butten, from Anglo-Norman buter, boter (“to push, butt, strike”), from Frankish *bautan (“to hit, beat”), from Proto-Germanic *bautaną (“to beat, push”), from Proto-Indo-European *bʰewd- (“to beat, push, strike”). Cognate with Old English bēatan (“to beat”). More at beat."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A push, thrust, or sudden blow, given by the head; a head butt.",
                  "examples": [
                    "Be careful in the pen, that ram can knock you down with a butt.",
                    "The handcuffed suspect gave the officer a desperate butt in the chest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thrust in fencing.",
                  "examples": [
                    "To prove who gave the fairer butt, / John shows the chalk on Robert's coat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "butt (third-person singular simple present butts, present participle butting, simple past and past participle butted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strike bluntly, particularly with the head.",
                  "examples": [
                    "Two harmless lambs are butting one the other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To strike bluntly with the head.",
                  "examples": [
                    "Rams butt at other males during mating season."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bit, bitte, bytte, butte (“leather bottle”), from Old English bytt, byt and Old French boute (“cask”) and other etymologies on this page."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(English units) An English measure of capacity for liquids, containing 126 wine gallons which is one-half tun; equivalent to the pipe.",
                  "examples": [
                    "Again, by 28 Hen. VIII, cap. 14, it is re-enacted that the tun of wine should contain 252 gallons, a butt of Malmsey 126 gallons, a pipe 126 gallons, a tercian or puncheon 84 gallons, a hogshead 63 gallons, a tierce 41 gallons, a barrel 31.5 gallons, a rundlet 18.5 gallons. –"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A wooden cask for storing wine, usually containing 126 gallons.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English but, butte, botte (“flounder; plaice; turbot”), possibly derived from sense 1 (“blunt end”), meaning \"blunt-headed fish.\" Compare Dutch bot and the second element of English halibut.",
        "Cognate with West Frisian bot, German Low German Butt, German Butt, Butte, Swedish butta."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England) Any of various flatfish such as sole, plaice or turbot",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, West Country and Ireland) A heavy two-wheeled cart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, West Country and Ireland) A three-wheeled cart resembling a wheelbarrow.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Originally apparently a less-desired cut, named either due to its often being packed in butts (“casks”) for storage and shipping, or from the use of butt to refer to \"the larger or thicker end of something, in distinction from the sharp or narrow end\" or \"the waste end\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "butt (plural butts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The shoulder of an animal, especially the portion above the picnic, as a cut of meat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}