{
  "word": "value",
  "etymologies": [
    {
      "description": [
        "From Middle English valew, value, from Old French value, feminine past participle of valoir, from Latin valēre (“be strong, be worth”), from Proto-Italic *walēō, from Proto-Indo-European *h₂welh₁- (“to be strong”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "value (countable and uncountable, plural values)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality (positive or negative) that renders something desirable or valuable.",
                  "examples": [
                    "The Shakespearean Shylock is of dubious value in the modern world.",
                    "Synonyms: worth; see also Thesaurus:value"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The degree of importance given to something.",
                  "examples": [
                    "The value of my children's happiness is second only to that of my wife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is valued or highly esteemed, such as one's morals, morality, or belief system.",
                  "examples": [
                    "He does not share his parents' values.",
                    "family values"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The amount (of money or goods or services) that is considered to be a fair equivalent for something else.",
                  "examples": [
                    "An article may be possessed of the highest degree of utility, or power to minister to our wants and enjoyments, and may be universally made use of, without possessing exchangeable value."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The relative duration of a musical note.",
                  "examples": [
                    "The value of a crotchet is twice that of a quaver."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) The relative darkness or lightness of a color in (a specific area of) a painting etc.",
                  "examples": [
                    "When pigments of equal value are mixed together, the resulting color will be a darker value. This is the result of subtraction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, physics) Any definite numerical quantity or other mathematical object, determined by being measured, computed, or otherwise defined.",
                  "examples": [
                    "The exact value of pi cannot be represented in decimal notation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Precise meaning; import.",
                  "examples": [
                    "the value of a word; the value of a legal instrument"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The valuable ingredients to be obtained by treating a mass or compound; specifically, the precious metals contained in rock, gravel, etc.",
                  "examples": [
                    "The vein carries good values.",
                    "the values on the hanging walls"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Esteem; regard.",
                  "examples": [
                    "My relation to the person was so near, and my value for him so great."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Valour; also spelled valew.",
                  "examples": [
                    "And him with equall valew countervayld"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "value (third-person singular simple present values, present participle valuing, simple past and past participle valued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To estimate the value of; judge the worth of something.",
                  "examples": [
                    "I will have the family jewels valued by a professional."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To fix or determine the value of; assign a value to, as of jewelry or art work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To regard highly; think much of; place importance upon.",
                  "examples": [
                    "Gold was valued highly among the Romans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold dear.",
                  "examples": [
                    "I value these old photographs."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}