{
  "word": "poise",
  "etymologies": [
    {
      "description": [
        "From Middle English poys, poyse, from Anglo-Norman pois, Middle French pois (“weight”) and Anglo-Norman poise, Middle French poise (“measure of weight”), from Latin pēnsāre (“to ponder, weight, think”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "poise (countable and uncountable, plural poises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state of balance, equilibrium or stability.",
                  "examples": [
                    "plants and animals, which are all made up of and nourished by water, and perhaps never return to water again, do not keep things at a poise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Composure; freedom from embarrassment or affectation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mien; bearing or deportment of the head or body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A condition of hovering, or being suspended.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) A CGS unit of dynamic viscosity equal to one dyne-second per square centimetre.",
                  "examples": [
                    "Letterpress and offset gloss varnishes normally have viscosities varying from 50 to 250 poises; they must stain the paper as little as possible, have insufficient tack to cause plucking,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Weight; an amount of weight, the amount something weighs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The weight, or mass of metal, used in weighing, to balance the substance weighed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which causes a balance; a counterweight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "poise (third-person singular simple present poises, present participle poising, simple past and past participle poised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To hang in equilibrium; to be balanced or suspended; hence, to be in suspense or doubt.",
                  "examples": [
                    "The slender, graceful spars / Poise aloft in the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To counterpoise; to counterbalance.",
                  "examples": [
                    "to poise with solid sense a sprightly wit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be of a given weight; to weigh. [14th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To add weight to, to weigh down. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To hold (something) with or against something else in equilibrium; to balance, counterpose. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To hold (something) in equilibrium, to hold balanced and ready; to carry (something) ready to be used. [from 16th c.]",
                  "examples": [
                    "I poised the crowbar in my hand, and waited.",
                    "to poise the scales of a balance"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To keep (something) in equilibrium; to hold suspended or balanced. [from 17th c.]",
                  "examples": [
                    "The rock was poised precariously on the edge of the cliff."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To ascertain, as if by balancing; to weigh.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}