{
  "word": "cast",
  "etymologies": [
    {
      "description": [
        "From Middle English casten, from Old Norse kasta (“to throw, cast, overturn”), from Proto-Germanic *kastōną (“to throw, cast”), of unknown origin.",
        "Cognate with Scots cast (“to cast, throw”), Danish kaste (“to throw”), Swedish kasta (“to throw, cast, fling, toss, discard”), Icelandic kasta (“to pitch, toss”). In the sense of \"flinging\", displaced native warp.",
        "The senses relating to broadcasting are based on that same term; compare -cast."
      ],
      "adjectives": [
        {
          "description": "cast (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of an animal, such as a horse or sheep: Lying in a position from which it cannot rise on its own.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cast (plural casts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of throwing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) An instance of throwing out a fishing line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something which has been thrown, dispersed etc.",
                  "examples": [
                    "a cast of scatter'd dust"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small mass of earth \"thrown off\" or excreted by a worm.",
                  "examples": [
                    "The area near the stream was covered with little bubbly worm casts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The collective group of actors performing a play or production together. Contrasted with crew.",
                  "examples": [
                    "He’s in the cast of Oliver.",
                    "The cast was praised for a fine performance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The casting procedure.",
                  "examples": [
                    "The men got into position for the cast, two at the ladle, two with long rods, all with heavy clothing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object made in a mould.",
                  "examples": [
                    "The cast would need a great deal of machining to become a recognizable finished part."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supportive and immobilising device used to help mend broken bones.",
                  "examples": [
                    "The doctor put a cast on the boy’s broken arm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mould used to make cast objects.",
                  "examples": [
                    "A plaster cast was made from his face."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hawking) The number of hawks (or occasionally other birds) cast off at one time; a pair.",
                  "examples": [
                    "Louis XIV was keen, employing a total hawking personnel of 175 and adding a fourth cast of gyrfalcons to hunt hares in 1682  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A squint.",
                  "examples": [
                    "The image of the affected eye is clearer and in consequence the diplopy more striking the less the cast of the eye; hence the double vision will be noticed by the patient before the misdirection of the eye attracts the attention of those about him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Visual appearance.",
                  "examples": [
                    "Her features had a delicate cast to them."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The form of one's thoughts, mind etc.",
                  "examples": [
                    "a cast of mind, a mental tendency."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Animal and insect remains which have been regurgitated by a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of crabs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cast (third-person singular simple present casts, present participle casting, simple past and past participle cast or (nonstandard) casted)",
          "definitionGroups": [
            {
              "group": "(physical) To move, or be moved, away.",
              "entries": [
                {
                  "meaning": "(now somewhat literary) To throw. [from 13th c.]",
                  "examples": []
                },
                {
                  "meaning": "To throw forward (a fishing line, net etc.) into the sea. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To throw down or aside. [from 15th c.]",
                  "examples": [
                    "Near Puerto Limon, Costa Rica, Madman, co-pilot and plane were caught in a storm, cast into the Caribbean, drowned."
                  ]
                },
                {
                  "meaning": "(of an animal) To throw off (the skin) as a process of growth; to shed the hair or fur of the coat. [from 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete except in set phrases) To remove, take off (clothes). [from 14th c.]",
                  "examples": [
                    "when the serjeant saw me, he cast his coat and put it on me, and they carried me on their shoulders to a village where the wounded were and our surgeons […]."
                  ]
                },
                {
                  "meaning": "(nautical) To heave the lead and line in order to ascertain the depth of water.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To vomit.",
                  "examples": [
                    "These verses […] make me ready to cast."
                  ]
                },
                {
                  "meaning": "(archaic) To throw up, as a mound, or rampart.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To throw out or emit; to exhale.",
                  "examples": [
                    "This […] casts a sulphurous smell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To direct (one's eyes, gaze etc.). [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To add up (a column of figures, accounts etc.); cross-cast refers to adding up a row of figures. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) To predict, to decide, to plan.",
              "entries": [
                {
                  "meaning": "(astrology) To calculate the astrological value of (a horoscope, birth etc.). [from 14th c.]",
                  "examples": [
                    "he is […] a perfect astrologer, that can cast the rise and fall of others, and mark their errant motions to his own use."
                  ]
                },
                {
                  "meaning": "(obsolete) To plan, intend. [14th–19th c.]",
                  "examples": [
                    "The cloister […] had, I doubt not, been cast for [an orange-house]."
                  ]
                },
                {
                  "meaning": "(transitive) To assign (a role in a play or performance). [from 18th c.]",
                  "examples": [
                    "The director cast the part carefully."
                  ]
                },
                {
                  "meaning": "(transitive) To assign a role in a play or performance to (an actor).",
                  "examples": [
                    "The director cast John Smith as King Lear."
                  ]
                },
                {
                  "meaning": "To consider; to turn or revolve in the mind; to plan.",
                  "examples": [
                    "to cast about for reasons"
                  ]
                },
                {
                  "meaning": "(archaic) To impose; to bestow; to rest.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To defeat in a lawsuit; to decide against; to convict.",
                  "examples": [
                    "to be cast in damages"
                  ]
                },
                {
                  "meaning": "To turn (the balance or scale); to overbalance; hence, to make preponderate; to decide.",
                  "examples": [
                    "a casting voice"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To perform, bring forth (a magical spell or enchantment).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To throw (light etc.) on or upon something, or in a given direction.",
                  "examples": [
                    "The threat of Russian barbarism sweeping over the free world will cast its ominous shadow over us for many, many years."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To give birth to (a child) prematurely; to miscarry. [from 15th c.]",
                  "examples": [
                    "being with childe, they may without feare of accusation, spoyle and cast [translating avorter] their children, with certaine medicaments, which they have only for that purpose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "To shape (molten metal etc.) by pouring into a mould; to make (an object) in such a way. [from 15th c.]",
              "entries": [
                {
                  "meaning": "(printing, dated) To stereotype or electrotype.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To twist or warp (of fabric, timber etc.). [from 16th c.]",
                  "examples": [
                    "Stuff is said to cast or warp when […] it alters its flatness or straightness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To bring the bows of a sailing ship on to the required tack just as the anchor is weighed by use of the headsail; to bring (a ship) round. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deposit (a ballot or voting paper); to formally register (one's vote). [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To change a variable type from, for example, integer to real, or integer to text. [from 20th c.]",
                  "examples": [
                    "Casting is generally an indication of bad design."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(hunting) Of dogs, hunters: to spread out and search for a scent. [from 18th c.]",
                  "examples": [
                    "He clambered on to an apron of rock that held its area out to the sun and began to cast across it. The direction of the wind changed and the scent touched him again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) To set (a bone etc.) in a cast.",
                  "examples": [
                    ""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Wicca) To open a circle in order to begin a spell or meeting of witches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(media) To broadcast (video) over the Internet or a local network, especially to one's television.",
                  "examples": [
                    "The streamer was the first to cast footage of the new game."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}