{
  "word": "kaffir",
  "etymologies": [
    {
      "description": [
        "Ultimately from Arabic كَفَّار‎ (kaffār, “infidel”) or كَافِر‎ (kāfir, “unbeliever”), both from كَفَرَ‎ (kafara, “to cover, to hide”); in some (especially early) uses, via Spanish cafre, Dutch kaffer or other European languages."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "kaffir (countable and uncountable, plural kaffirs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, offensive) In Islamic contexts, a non-Muslim. [from 16th c.]",
                  "examples": [
                    "He  […]  put me in imminent danger of my life, by telling the natives that I was a Caffer, and not a Mussulman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, offensive) A member of the Nguni people of southern Africa, especially a Xhosa. [from 16th c.]",
                  "examples": [
                    "… the Hambonaas, a nation quite different from the Kaffers, having a yellowish complexion […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, South Africa, Rhodesia, ethnic slur, offensive, derogatory) A black person. [from 17th c.]",
                  "examples": [
                    "If you ask a Kaffir why he does so-and-so, he will answer—\"How can I tell? It has always been done by our forefathers.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, now historical, offensive) A language spoken by the Nguni peoples of southern Africa, especially Xhosa. [from 19th c.]",
                  "examples": [
                    "This man, seeing a white person enter, moved aside for her, but she saw Joss's eyes on her, and said in kitchen kaffir, ‘No, when you've finished.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, slang, historical) South African mining shares [from early 20th c.]",
                  "examples": [
                    "Kaffirs bouyant most of last week"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Short for kaffir corn.",
                  "examples": [
                    "This market reports only one or two cars per day, selling by the hundred weight, and at a price a little lower than that of Indian corn. As to the purpose for which the marketed kaffir is used, there is some uncertainty."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}