{
  "word": "clog",
  "etymologies": [
    {
      "description": [
        "Unknown; perhaps from Middle English clog (“weight attached to the leg of an animal to impede movement”). Perhaps of North Germanic origin; compare Old Norse klugu, klogo (“knotty tree log”), Dutch klomp."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "clog (plural clogs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of shoe with an inflexible, often wooden sole sometimes with an open heel.",
                  "examples": [
                    "Dutch people rarely wear clogs these days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blockage.",
                  "examples": [
                    "The plumber cleared the clog from the drain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, colloquial) A shoe of any type.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A weight, such as a log or block of wood, attached to a person or animal to hinder motion.",
                  "examples": [
                    "A clog of lead was round my feet / A band of pain across my brow;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which hinders or impedes motion; an encumbrance, restraint, or impediment of any kind.",
                  "examples": [
                    "All the ancient, honest, juridical principles and institutions of England, are so many clogs to check and retard the headlong course of violence and oppression."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "clog (third-person singular simple present clogs, present participle clogging, simple past and past participle clogged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To block or slow passage through (often with 'up').",
                  "examples": [
                    "Hair is clogging the drainpipe.",
                    "The roads are clogged up with traffic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To encumber or load, especially with something that impedes motion; to hamper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To burden; to trammel; to embarrass; to perplex.",
                  "examples": [
                    "The commodities  […] are clogged with impositions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To enforce a mortgage lender right that prevents a borrower from exercising a right to redeem.",
                  "examples": [
                    "For centuries it has been the rule that a mortgagor’s equity of redemption cannot be clogged and that he cannot, as a part of the original mortgage transaction, cut off or surrender his right to redeem. Any agreement which does so is void and unenforceable [sic] as against public policy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To perform a clog dance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}