{
  "word": "matter",
  "etymologies": [
    {
      "description": [
        "From Middle English matere, mater, from Anglo-Norman matere, materie, from Old French materie, matiere, from Latin materia (“wood”), from mater (“mother”), in which case cognate with Old Armenian մայր (mayr, “cedar”) and մայրի (mayri, “forest”). More recently, referred to Proto-Indo-European *dem-. Doublet of Madeira and mother.",
        "Displaced  Middle English andweorc, andwork (“material, matter”), from Old English andweorc (“matter, substance, material”)), Old English intinga (“matter, affair, business”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "matter (countable and uncountable, plural matters)",
          "definitionGroups": [
            {
              "group": "(uncountable) Material; substance.",
              "entries": [
                {
                  "meaning": "(physics) The basic structural component of the universe, usually having mass and volume.",
                  "examples": []
                },
                {
                  "meaning": "(physics) Matter made up of normal particles, not antiparticles.",
                  "examples": [
                    "Antonym: antimatter"
                  ]
                },
                {
                  "meaning": "A kind of substance.",
                  "examples": [
                    "vegetable matter"
                  ]
                },
                {
                  "meaning": "Printed material, especially in books or magazines.",
                  "examples": [
                    "He always took some reading matter with him on the plane."
                  ]
                },
                {
                  "meaning": "(philosophy) Aristotelian: undeveloped potentiality subject to change and development; formlessness. Matter receives form, and becomes substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An affair, condition, or subject, especially one of concern or (especially when preceded by the) one that is problematic.",
                  "examples": [
                    "Is much the matter with the old plan?",
                    "Something is the matter with him.",
                    "state matters"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An approximate amount or extent.",
                  "examples": [
                    "I stayed for a matter of months."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Essence; pith; embodiment.",
                  "examples": [
                    "He is the matter of virtue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) (The) inducing cause or reason, especially of anything disagreeable or distressing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, medicine) Pus.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "matter (third-person singular simple present matters, present participle mattering, simple past and past participle mattered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative) To be important. [from 16th c.]",
                  "examples": [
                    "The only thing that matters to Jim is being rich.",
                    "Sorry for pouring ketchup on your clean white shirt! - Oh, don't worry, it does not matter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, in negative constructions, now England regional, Caribbean) To care about, to mind; to find important. [from 17th c.]",
                  "examples": [
                    "Besides, if it had been out of doors I had not mattered it so much; but with my own servant, in my own house, under my own roof […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, medicine, archaic) To form pus or matter, as an abscess; to maturate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}