{
  "word": "tertiary",
  "etymologies": [
    {
      "description": [
        "Borrowed from the Latin tertiārius (“of the third part or rank”), from tertius (“third”) + -ārius (whence the English suffix -ary); compare the French tertiaire."
      ],
      "adjectives": [
        {
          "description": "tertiary (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of third rank or order; subsequent.",
                  "examples": [
                    "An untaught peasant beheld the elements around him and was acquainted with their practical uses. The most learned philosopher knew little more. He had partially unveiled the face of Nature, but her immortal lineaments were still a wonder and a mystery. He might dissect, anatomize, and give names; but, not to speak of a final cause, causes in their secondary and tertiary grades were utterly unknown to him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Possessing some quality in the third degree; especially having been subjected to the substitution of three atoms or radicals.",
                  "examples": [
                    "a tertiary alcohol, amine, or salt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) Of quills: growing on the innermost joint of a bird's wing; tertial.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "tertiary (plural tertiaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any item considered to be of third order.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tertiary colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Something from the Tertiary Period (the former term for the geologic period from 65 million to 2.58 million years ago).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A tertiary feather; a tertial.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A large stage in some extremely powerful thermonuclear weapons (resembling a greatly-enlarged secondary) which is compressed by the explosion of the secondary until ignition of nuclear fusion takes place, in much the same manner as the secondary is imploded by the primary, and which can allow for the attainment of yields of many tens or even hundreds of megatons, and likely even greater; not used in modern weapons due to a greater focus on the accurate use of sub-megaton weapons, the tremendous size of weapons incorporating a tertiary, and the lack of targets whose destruction would necessitate the use of a three-stage weapon.",
                  "examples": [
                    "A gigaton-scale weapon would of necessity be a three-stage design (incorporating a fusion tertiary - likely with its own massive fission tamper - in addition to the fission primary and fission-jacketed fusion secondary), as a reasonably-sized primary would likely have difficulty imploding to ignition the enormous secondary that would be required to reach a one-gigaton yield with a two-stage thermonuclear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Roman Catholicism) A member of a Roman Catholic third order; a layperson who participates in activities similar to those engaged in by men and women who take religious vows (respectively the first and second orders), and who may wear some elements of an order's habit such as a scapular.",
                  "examples": [
                    "Immediately after her arrival in Ferrara, while she was still striving to secure the foundation of her exemplary reformed community of Dominican tertiaries, [Lucia] Brocadelli also renewed her attempts to enhance [Girolamo] Savonarola's saintly reputation."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}