{
  "word": "visit",
  "etymologies": [
    {
      "description": [
        "From Middle English visiten, from Old French visiter, from Latin vīsitō, frequentative of vīsō (“behold, survey”), from videō (“see”). Cognate with Old Saxon wīsōn (“to visit, afflict”), archaic German weisen (“to visit, afflict”). Displaced native Old English sēċan (“to visit”) and sōcn (“a visit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "visit (plural visits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single act of visiting.",
                  "examples": [
                    "Next time you're in Manchester, give me a visit.",
                    "We paid a quick visit to James on the way up to Scotland."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, insurance) A meeting with a doctor at their surgery or the doctor's at one's home.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "visit (third-person singular simple present visits, present participle visiting, simple past and past participle visited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To habitually go to (someone in distress, sickness etc.) to comfort them. (Now generally merged into later senses, below.) [from 13th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To go and meet (a person) as an act of friendliness or sociability. [from 14th c.]",
                  "examples": [
                    "She decided to visit her grandparents for Christmas."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of God: to appear to (someone) to comfort, bless, or chastise or punish them. (Now generally merged into later senses, below.) [from 13th c.]",
                  "examples": [
                    "[God] hath visited and redeemed his people."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To punish, to inflict harm upon (someone or something). [from 14th c.]",
                  "examples": [
                    "Her life was spared by the clemency of the emperor, but he visited the pomp and treasures of her palace."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of a sickness, misfortune etc.: to afflict (someone). [from 14th c.]",
                  "examples": [
                    "There used to be a sharp contest as to where the effigy was to be made, for the people thought that the house from which it was carried forth would not be visited with death that year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inflict punishment, vengeance for (an offense) on or upon someone. [from 14th c.]",
                  "examples": [
                    "If this were an Ibsen play, we would be thinking of the sins of one generation being visited upon another, he said."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go to (a shrine, temple etc.) for worship. (Now generally merged into later senses, below.) [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To go to (a place) for pleasure, on an errand, etc. [from 15th c.]",
                  "examples": [
                    "Each year, millions of people visit the 4,570-meter-high Baishui Glacier in southern China."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}