{
  "word": "crumb",
  "etymologies": [
    {
      "description": [
        "From Middle English crome, cromme, crumme, crume, from Old English cruma (“crumb, fragment”), from Proto-Germanic *krumô, *krūmô (“fragment, crumb”), from Proto-Indo-European *grū-mo- (“something scraped together, lumber, junk; to claw, scratch”), from *ger- (“to turn, bend, twist, wind”). The b is excrescent, as in limb and climb, appearing in the mid 15th century to match crumble and words like dumb, numb, thumb. Cognate with Dutch kruim (“crumb”), Low German Krome, Krume (“crumb”), German Krume (“crumb”), Danish krumme (“crumb”), Swedish dialectal krumma (“crumb”), Swedish inkråm (“crumbs, giblets”), Icelandic krumur (“crumb”), Latin grūmus (“a little heap”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "crumb (countable and uncountable, plural crumbs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece which breaks off from baked food (such as cake, biscuit or bread).",
                  "examples": [
                    "The pigeons were happily pecking at crumbs of bread on the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small piece of other material, such as rubber.",
                  "examples": [
                    "Then erase any pencil lines with a good, soft eraser, rubbing gently, in only one direction. A dustbrush can be useful in removing any eraser crumbs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A bit, small amount.",
                  "examples": [
                    "a crumb of comfort"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The soft internal portion of bread, surrounded by crust.",
                  "examples": [
                    "Dust unto dust, what must be, must; / If you can't get crumb, you'd best eat crust."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mixture of sugar, cocoa and milk, used to make industrial chocolate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A nobody; a worthless person.",
                  "examples": [
                    "All Dad can think of is a gift certificate from the Melody Inn? And my crumb of a boyfriend doesn't even show up? This is a birthday?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A body louse (Pediculus humanus).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "crumb (third-person singular simple present crumbs, present participle crumbing, simple past and past participle crumbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with crumbs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To break into crumbs or small pieces with the fingers; to crumble.",
                  "examples": [
                    "to crumb bread"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}