{
  "word": "tucker",
  "etymologies": [
    {
      "description": [
        "tuck +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tucker (countable and uncountable, plural tuckers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One who or that which tucks.",
                  "examples": [
                    "Nature of Grievance:\nDiscrimination. Firm, after having had a long controversy with its tuckers, laid off the whole tucking department for a week. Union maintained it was a clear case cf discrimination against the tuckers on account of the recent controversy.",
                    "Determination:\nComplaint of the union was sustained. Tuckers were paid the amount of money they were deprived of through being discriminated against, $158.90."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colloquial, Australia, New Zealand) Food.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Work that scarcely yields a living wage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tucker (third-person singular simple present tuckers, present participle tuckering, simple past and past participle tuckered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To tire out or exhaust a person or animal.",
                  "examples": [
                    "Man, I’m so tuckered from my run today."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English tokker (“one who dresses or finishes cloth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tucker (plural tuckers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Lace or a piece of cloth in the neckline of a dress.",
                  "examples": [
                    "“And, ma′am,” he continued, “the laundress tells me some of the girls have two clean tuckers in the week: it is too much; the rules limit them to one.”",
                    "“I think I can explain that circumstance, sir. Agnes and Catherine Johnstone were invited to take tea with some friends at Lowton last Thursday, and I gave them leave to put on clean tuckers for the occasion.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A fuller; one who fulls cloth.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}