{
  "word": "fire",
  "etymologies": [
    {
      "description": [
        "From Middle English fyr, from Old English fȳr (“fire”), from Proto-West Germanic *fuir, from *fuïr, a regularised form of Proto-Germanic *fōr (“fire”) (compare Saterland Frisian Fjuur, West Frisian fjoer, Dutch vuur, Low German Füer, German Feuer, Danish fyr), ultimately from Proto-Indo-European *péh₂wr̥.",
        "Compare Hittite 𒉺𒄴𒄯 (paḫḫur), Umbrian pir, Tocharian A/B por/puwar, Czech pýř (“hot ashes”), Ancient Greek πῦρ (pûr, “fire”), and Armenian հուր (hur, “fire”). This was an inanimate noun whose animate counterpart was Proto-Indo-European *h₁n̥gʷnis (see ignite). Cognate to pyre and purge."
      ],
      "adjectives": [
        {
          "description": "fire (not comparable) (predicative only)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Amazing; excellent.",
                  "examples": [
                    "That shit is fire, yo!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "fire (countable and uncountable, plural fires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A (usually self-sustaining) chemical reaction involving the bonding of oxygen with carbon or other fuel, with the production of heat and the presence of flame or smouldering.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of this chemical reaction, especially when intentionally created and maintained in a specific location to a useful end (such as a campfire or a hearth fire).",
                  "examples": [
                    "We sat about the fire singing songs and telling tales."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The occurrence, often accidental, of fire in a certain place, causing damage and danger.",
                  "examples": [
                    "There was a fire at the school last night and the whole place burned down.",
                    "During hot and dry summers many fires in forests are caused by regardlessly discarded cigarette butts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, alchemy, philosophy) The aforementioned chemical reaction of burning, considered one of the Classical elements or basic elements of alchemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain) A heater or stove used in place of a real fire (such as an electric fire).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The elements necessary to start a fire.",
                  "examples": [
                    "The fire was laid and needed to be lit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The bullets or other projectiles fired from a gun or other ranged weapon.",
                  "examples": [
                    "The fire from the enemy guns kept us from attacking."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A planned bombardment by artillery or similar weapons, or the capability to deliver such.",
                  "examples": [
                    "We dominated the battlespace with our fires."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figurative) A barrage, volley",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronautics) An instance of firing one or more rocket engines.",
                  "examples": [
                    "static fire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strength of passion, whether love or hate.",
                  "examples": [
                    "He had fire in his temper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Liveliness of imagination or fancy; intellectual and moral enthusiasm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Splendour; brilliancy; lustre; hence, a star.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A severe trial; anything inflaming or provoking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Red coloration in a piece of opal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English firen, fyren, furen, from Old English fȳrian (“to make a fire”), from the noun (see above). Cognate with Old Frisian fioria (“to light a fire”), Saterland Frisian fjuurje (“to fire”), Middle Dutch vûren, vueren, vieren (“to set fire”), Dutch vuren (“to fire, shoot”), Old High German fiuren (“to ignite, set on fire”), German feuern (“to fire”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fire (third-person singular simple present fires, present participle firing, simple past and past participle fired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set (something, often a building) on fire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To heat as with fire, but without setting on fire, as ceramic, metal objects, etc.",
                  "examples": [
                    "If you fire the pottery at too high a temperature, it may crack.",
                    "They fire the wood to make it easier to put a point on the end."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive away by setting a fire.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To terminate the employment contract of (an employee), especially for cause (such as misconduct or poor performance).",
                  "examples": [
                    "Antonym: hire"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To terminate a contract with a client; to drop a client.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shoot (a gun, rocket/missile, or analogous device).",
                  "examples": [
                    "We will fire our guns at the enemy.",
                    "The jet fired a salvo of rockets at the truck convoy.",
                    "He fired his radar gun at passing cars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To shoot a gun, cannon, or similar weapon.",
                  "examples": [
                    "Synonyms: open fire, shoot",
                    "Don't fire until you see the whites of their eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronautics) To operate a rocket engine to produce thrust.",
                  "examples": [
                    "The RCS thrusters fired several times to stabilize the tumbling spacecraft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mining) To set off an explosive in a mine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports) To shoot; to attempt to score a goal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, physiology) To cause an action potential in a cell.",
                  "examples": [
                    "When a neuron fires, it transmits information."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To forcibly direct (something).",
                  "examples": [
                    "He answered the questions the reporters fired at him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, computer sciences, software engineering) To initiate an event (by means of an event handler).",
                  "examples": [
                    "The event handler should only fire after all web page content has finished loading.",
                    "The queue fires a job whenever the thread pool is ready to handle it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To inflame; to irritate, as the passions.",
                  "examples": [
                    "to fire the soul with anger, pride, or revenge"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To be irritated or inflamed with passion.",
                  "examples": [
                    "Love had fired my mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To animate; to give life or spirit to.",
                  "examples": [
                    "to fire the genius of a young man"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To feed or serve the fire of.",
                  "examples": [
                    "to fire a boiler"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To light up as if by fire; to illuminate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, farriery) To cauterize.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To catch fire; to be kindled.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}