{
  "word": "see",
  "etymologies": [
    {
      "description": [
        "From Middle English seen, from Old English sēon (“to see, look, behold, perceive, observe, discern, understand, know”), from Proto-West Germanic *sehwan, from Proto-Germanic *sehwaną (“to see”), from Proto-Indo-European *sekʷ- (“to see, notice”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "see (third-person singular simple present sees, present participle seeing, simple past saw or (dialectal) seen or (dialectal) seent or (dialectal) seed, past participle seen or (dialectal) seent or (dialectal) seed or (dialectal) saw)",
          "definitionGroups": [
            {
              "group": "(transitive) To perceive or detect someone or something with the eyes, or as if by sight.",
              "entries": [
                {
                  "meaning": "To witness or observe by personal experience.",
                  "examples": [
                    "Hyponyms: experience, suffer",
                    "Now I've seen it all!",
                    "I have been blind since birth and I love to read Braille. When the books arrive in from the library, I can’t wait to see what stories they have sent me."
                  ]
                },
                {
                  "meaning": "To watch (a movie) at a cinema, or a show on television etc.",
                  "examples": [
                    "I saw the latest Tarantino flick last week."
                  ]
                }
              ]
            },
            {
              "group": "To form a mental picture of.",
              "entries": [
                {
                  "meaning": "(figuratively) To understand.",
                  "examples": [
                    "Do you see what I mean?"
                  ]
                },
                {
                  "meaning": "To come to a realization of having been mistaken or misled.",
                  "examples": [
                    "They're blind to the damage they do, but someday they'll see."
                  ]
                },
                {
                  "meaning": "(transitive) To foresee, predict, or prophesy.",
                  "examples": [
                    "The oracle saw the destruction of the city."
                  ]
                },
                {
                  "meaning": "(used in the imperative) Used to emphasise a proposition.",
                  "examples": [
                    "You see, Johnny, your Dad isn't your real father.",
                    "You're not welcome here any more, see?"
                  ]
                }
              ]
            },
            {
              "group": "(social) To meet, to visit.",
              "entries": [
                {
                  "meaning": "To have an interview with; especially, to make a call upon; to visit.",
                  "examples": [
                    "to go to see a friend"
                  ]
                },
                {
                  "meaning": "To date frequently.",
                  "examples": [
                    "I've been seeing her for two months."
                  ]
                },
                {
                  "meaning": "To visit for a medical appointment.",
                  "examples": [
                    "You should see a doctor about that rash on your arm.",
                    "I've been seeing a therapist for three years now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive; ergative) To be the setting or time of.",
                  "examples": [
                    "The 20th century saw humanity's first space exploration.",
                    "1999 saw the release of many great films."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To ensure that something happens, especially while witnessing it.",
                  "examples": [
                    "I'll see you hang for this!  I saw that they didn't make any more trouble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wait upon; attend, escort.",
                  "examples": [
                    "I saw the old lady safely across the road.",
                    "You can see yourself out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling, transitive) To respond to another player's bet with a bet of equal value.",
                  "examples": [
                    "I'll see your twenty dollars and raise you ten."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To determine by trial or experiment; to find out (if or whether).",
                  "examples": [
                    "I'll come over later and see if I can fix your computer.",
                    "You think I can't beat you in a race, eh? We'll see."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used in the imperative) To reference or to study for further details.",
                  "examples": [
                    "Step 4: In the system, check out the laptop to the student (see: \"Logging Resources\" in the Tutor Manual).",
                    "For a complete proof of the Poincaré conjecture, see Appendix C."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To examine something closely, or to utilize something, often as a temporary alternative.",
                  "examples": [
                    "Can I see that lighter for a second? Mine just quit working."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To include as one of something's experiences.",
                  "examples": [
                    "The equipment has not seen usage outside of our projects.",
                    "I saw military service in Vietnam."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English se, see, from Old French sie (“seat, throne; town, capital; episcopal see”), from Latin sedes (“seat”), referring to the bishop's throne or chair (compare seat of power) in the cathedral; related to the Latin verb sedere (“to sit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "see (plural sees)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a diocese, archdiocese; a region of a church, generally headed by a bishop, especially an archbishop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The office of a bishop or archbishop; bishopric or archbishopric",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A seat; a site; a place where sovereign power is exercised.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}