{
  "word": "no",
  "etymologies": [
    {
      "description": [
        "From Middle English no, noo, na, a reduced form of none, noon, nan (“none, not any”) used before consonants (compare a to an), from Old English nān (“none, not any”), from Proto-West Germanic *nain, from Proto-Germanic *nainaz (“not any”, literally “not one”), equivalent to ne (“not”) +‎ a.",
        "Cognate with Scots nae (“no, not any, none”), Old Frisian nān, nēn (\"no, not any, none\"), Saterland Frisian naan, neen (“no, not any, none”), North Frisian nian (“no, not any, none”), Old Dutch nēn (\"no, not any, none\"; > Dutch neen (“no”)), Old Norse neinn (“no, not any, none”). Compare also Old Saxon nigēn (\"not any\"; > Low German nen), Old Dutch nehēn (Middle Dutch negheen/negeen, Dutch geen), West Frisian gjin, Old High German nihein (> German kein). More at no, one."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English no, na, from Old English nā, nō (“no, not, not ever, never”), from Proto-Germanic *nai (“never”), *ne (“not”), from Proto-Indo-European *ne, *nē, *nēy (negative particle), equivalent to Old English ne (“not”) + ā, ō (“ever, always”). Cognate with Scots na (“no”), Saterland Frisian noa (“no”), West Frisian né (“no”), West Frisian nea (“never”), Dutch nee (“no”), Low German nee (“no”), German nie (“never”), dialectal German nö (“no”), Danish nej (“no”), Swedish nej (“no”), Icelandic nei (“no”). More at nay."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "no (not comparable)",
          "definitionGroups": [
            {
              "group": "(with following adjective) not, not at all",
              "entries": [
                {
                  "meaning": "Used before different, before comparatives with more and less, and idiomatically before other comparatives.",
                  "examples": [
                    "It is a less physical kind of torture, but no less gruesome.",
                    "You’re no better than a common thief.",
                    "Look no further than one's nose",
                    "This is no different from what we've been doing all along."
                  ]
                },
                {
                  "meaning": "(informal) Used idiomatically before certain other adjectives.",
                  "examples": [
                    "This thing is no good.",
                    "The teacher’s decision was no fair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(without adjective, now Scotland, informal) not",
                  "examples": [
                    "I just want to find out whether she's coming or no."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "no (plural noes or nos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a negating expression; an answer that shows disagreement, denial, refusal, or disapproval",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a vote not in favor, or opposing a proposition",
                  "examples": [
                    "The workers voted on whether to strike, and there were thirty \"yeses\" and two \"nos\"."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [
        {
          "description": "no",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "without",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "like",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, usually humorous) not, does not, do not, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "verbs": []
    },
    {
      "description": [
        "Variant of No., from the scribal abbreviation for Latin numero (“in number, to the number of”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "no (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Alternative form of No.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "no (plural nos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of No.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}