{
  "word": "accent",
  "etymologies": [
    {
      "description": [
        "From Middle English accent, from Middle French accent, from Old French acent, from Latin accentus, past participle of accinō (“sing to, sing along”). The word accent had been borrowed into Old English already, but was lost and reborrowed in Middle English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "accent (countable and uncountable, plural accents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) A higher-pitched or stronger (louder or longer) articulation of a particular syllable of a word or phrase in order to distinguish it from the others or to emphasize it.",
                  "examples": [
                    "Synonym: stress",
                    "Hyponyms: stress, stress accent, pitch, pitch accent",
                    "In the word \"careful\", the accent is placed on the first syllable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Emphasis or importance in general.",
                  "examples": [
                    "At this hotel, the accent is on luxury."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(orthography) A mark or character used in writing, in order to indicate the place of the spoken accent, or to indicate the nature or quality of the vowel marked.",
                  "examples": [
                    "The name Cézanne is written with an acute accent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Modulation of the voice in speaking; the manner of speaking or pronouncing; a peculiar or characteristic modification of the voice, expressing emotion; tone.",
                  "examples": [
                    "The tender Accent of a Woman's Cry / Will pass unheard, will unregarded die;"
                  ]
                }
              ]
            },
            {
              "group": "(linguistics, sociolinguistics) The distinctive manner of pronouncing a language associated with a particular region, social group, etc., whether of a native speaker or a foreign speaker; the phonetic and phonological aspects of a dialect.",
              "entries": [
                {
                  "meaning": "(informal, sometimes proscribed) A manner of pronunciation suggesting that the speaker is from a different region; a foreign accent.",
                  "examples": [
                    "My professor's accent is so thick that it's difficult to understand her lectures.",
                    "She spoke with a strong accent that betrayed her southern roots.",
                    "I was surprised to learn that he was an immigrant, as he spoke without any accent."
                  ]
                },
                {
                  "meaning": "(sign languages) A distinctive manner of producing a sign language, such as someone who does not normally use a certain sign language might have when using it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A word; a significant tone or sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually plural only) Expressions in general; speech.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prosody, poetry) Stress laid on certain syllables of a verse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A regularly recurring stress upon the tone to mark the beginning, and, more feebly, the third part of the measure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A special emphasis of a tone, even in the weaker part of the measure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A mark used to represent this special emphasis.The third and fourth symbols are accents (marks used to represent special emphasis in music).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The rhythmical accent, which marks phrases and sections of a period.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A prime symbol.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Emphasis laid on a part of an artistic design or composition; an emphasized detail, in particular a detail in sharp contrast to its surroundings.",
                  "examples": [
                    "accent color"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very small gemstone set into a piece of jewellery.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Utterance.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle French accenter, from Old French accenter, from Latin accentō, from accentus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "accent (third-person singular simple present accents, present participle accenting, simple past and past participle accented)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To express the accent of vocally; to utter with accent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark emphatically; to emphasize; to accentuate; to make prominent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mark with written accents.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}