{
  "word": "mignon",
  "etymologies": [
    {
      "description": [
        "From French mignon, from Middle French mignon (“lover, darling, favourite”), from Old French mignon (“dainty, pleasing, gentle, kind”), from Frankish *minnjo (“love, friendship, affection, memory”), from Proto-Germanic *minþijō, *mindijō (“affectionate thought, care”), from Proto-Indo-European *men-, *mnā- (“to think”). Cognate with Old High German minnja (“love, care, affection, desire, memory”), Old Saxon minnea (“love”). More at mind. Compare also minion and Dutch minnen (“to love”)."
      ],
      "adjectives": [
        {
          "description": "mignon (comparative more mignon, superlative most mignon)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Small and cute; pretty in a delicate way; dainty.",
                  "examples": [
                    "Or failing that, it must be sweet to be a famous beauty, a golden-haired divinity, like that fashionable enchantress whom she had seen often on the boulevards and in the Champs-Elysées—a mignon face, a figure delicate to fragility, almost buried amidst the luxury of a matchless set of sables, seated in the lightest and most elegant of victorias, behind a pair of thoroughbred blacks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mignon (plural mignons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, obsolete) A cute or pretty person; a dandy; a pretty child. [18th–19th c.]",
                  "examples": [
                    "“I wish the blow he dealt to that fine essenced mignon had beat his brains out.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) One of the court favourites of Henry III of France. [from 20th c.]",
                  "examples": [
                    "When the mignons, barefoot and clad in sacks with holes for their heads and feet, marched with Henry in a penitential procession, lashing their backs, one wit opined that they should have aimed their blows lower."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}