{
  "word": "philologist",
  "etymologies": [
    {
      "description": [
        "From philology +‎ -ist."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "philologist (plural philologists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who engages in philology (historical linguistics), especially as a profession; a collector of words and their etymologies.",
                  "examples": [
                    "Hyponyms: see Thesaurus:philologist"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person devoted to general learning and literature.",
                  "examples": [
                    "The author of the first text in which the term ‘philosophy of technology’ occurred, Ernst Kapp’s Eine Philosophie der Technik, was a philologist and historian. Most of the authors who wrote critically about technology and its socio-cultural role during the twentieth century were philosophers of a general outlook ... or had a background in one of the other humanities or in social science, like literary criticism and social research..., law..., political science... or literary studies... The form of philosophy of technology constituted by the writings of these and others has been called... ‘humanities philosophy of technology’, because it takes its point of departure in the social sciences and the humanities rather than in the practice of technology."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person devoted to classical scholarship.",
                  "examples": [
                    "For Zhu Xi's explanation of the phrase “ge wu,” see his commentary on Great Learning... For Wang's interpretation, see his “Questions on the Great Learning”... Unfortunately, the key word “ge” is highly ambiguous, so both interpretations ... are completely defensible... Nivison... described the phrase as “a philologist's delight,” because of the endless speculation it could provoke, and argued that “[n]o one will ever know what it really meant in its locus classicus.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}