{
  "word": "youth",
  "etymologies": [
    {
      "description": [
        "From Middle English youthe, youghte, ȝouþe, from Old English ġeoguþ (“the state of being young; youth”), from Proto-West Germanic *juwunþa, from Proto-Germanic *jugunþō, *jugunþiz (“youth”), corresponding to young +‎ -th. Cognate with Saterland Frisian Juugd, West Frisian jeugd, Dutch jeugd, German Low German Jöögd, German Jugend."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "youth (countable and uncountable, plural youths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The quality or state of being young.",
                  "examples": [
                    "Feel awfully about Scott... It was a terrible thing for him to love youth so much that he jumped straight from youth to senility without going through manhood. The minute he felt youth going he was frightened again and thought there was nothing between youth and age."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The part of life following childhood; the period of existence preceding maturity or age; the whole early part of life, from childhood, or, sometimes, from infancy, to adulthood.",
                  "examples": [
                    "Make the most of your youth, it will not last forever.",
                    "I made many mistakes in my youth, but learned from them all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A young person.",
                  "examples": [
                    "Synonyms: adolescent, child, kid, lad, teen, teenager, youngster",
                    "Antonyms: adult, grown-up",
                    "There was a group of youths hanging around the parking lot, reading fashion magazines and listening to music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A young man; a male adolescent or young adult.",
                  "examples": [
                    "Synonyms: boy, young man"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, used with a plural or singular verb) Young persons, collectively.",
                  "examples": [
                    "Synonyms: adolescents, kids, teenagers, teens, young people, youngsters"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}