{
  "word": "carcinoma",
  "etymologies": [
    {
      "description": [
        "Learned borrowing from Latin carcinōma (“tumour; ulcer; carcinoma”), from Ancient Greek κᾰρκῐ́νωμᾰ (karkínōma, “sore, ulcer; cancer”), from καρκινοῦν (karkinoûn, “to make (something) resemble a crab”), καρκινοῦσθαι (karkinoûsthai, “to become cancerous; to suffer from cancer”, passive) + -μᾰ (-ma, suffix attached to verbs to form neuter nouns denoting the effect or result of an action, a particular instance of an action, or the object of an action). Καρκινοῦν (Karkinoûn) is derived from καρκῐ́νος (karkínos, “crab; the zodiac sign Cancer; sore, ulcer; cancer”) (according to Paul of Aegina (c. 625 – c. 690) in his Medical Compendium in Seven Books, because the veins surrounding a cancerous tumour resemble a crab’s legs), ultimately from Proto-Indo-European *(s)ker- (“to bend; to turn”) (as a crab’s pincers form a circle) + *-iHnos (suffix forming adjectives of materials). The English word is a doublet of cancer, and may be analysed as carcino- +‎ -oma.",
        "The plural form carcinomata is a learned borrowing from Latin carcinōmata, from Ancient Greek κᾰρκῐνώμᾰτᾰ (karkinṓmata)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "carcinoma (countable and uncountable, plural carcinomas or carcinomata) (oncology)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An invasive malignant tumour derived from epithelial tissue that tends to metastasize to other areas of the body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) A form of cancer; (uncountable) cancer in general as a disease.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}