{
  "word": "prince",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman, from Old French prince, from Latin prīnceps (“first head”), from prīmus (“first”) + capiō (“seize, take”). Doublet of princeps. Displaced native Old English æþeling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "prince (plural princes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic or historical) A (male) ruler, a sovereign; a king, monarch. [from 13th c.]",
                  "examples": [
                    "By his last years Erasmus realized that princes like Henry VIII and François I had deceived him in their elaborate negotiations for universal peace, but his belief in the potential of princely power for good remained undimmed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A female monarch.",
                  "examples": [
                    "Queen Elizabeth, a prince admirable above her sex."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who is preeminent in their field; a great person. [from 13th c.]",
                  "examples": [
                    "He is a prince among men."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The (male) ruler or head of a principality. [from 14th c.]",
                  "examples": [
                    "He is the prince who never grew up – a one-time playboy and son of the Hollywood star Grace Kelly and Prince Rainier of Monaco."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male member of a royal family other than the ruler; especially (in the United Kingdom) the son or grandson of the monarch. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A non-royal high title of nobility, especially in France and the Holy Roman Empire.",
                  "examples": [
                    "Prince Louis de Broglie won the 1929 Nobel Prize in Physics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mushroom Agaricus augustus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of court card used in tarot cards, the equivalent of the jack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various nymphalid butterflies of the genus Rohana.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}