{
  "word": "cachet",
  "etymologies": [
    {
      "description": [
        "Borrowed from French cachet, first appearing in Scottish English, from 1630."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cachet (countable and uncountable, plural cachets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A seal, as of a letter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A special characteristic or quality; prestige, especially via association.",
                  "examples": [
                    "Synonyms: charm, je ne sais quoi, magic touch, oomph, zing",
                    "I remember when this diner was a quiet hangout, but lately it seems to be losing its cachet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) A commemorative stamped design or inscription on an envelope, other than a cancellation or pre-printed postage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sealed envelope containing an item whose price is being negotiated.",
                  "examples": [
                    "The most romantic rite of bargaining is the cachet; even its name suggests a thrilling secrecy. The cachet is used when a broker negotiates the sale of a diamond."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A capsule containing a pharmaceutical preparation.",
                  "examples": [
                    "In order to facilitate taking by the patient, powders are often ordered to be dispensed in cachets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hidden location from which one can observe birds while remaining unseen.",
                  "examples": [
                    "On my way back to my cachet I met another party of reed-buntings, one of which I bagged; then I sat in my hiding-place for an hour, waiting for geese that never came within range."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cachet (third-person singular simple present cachets, present participle cacheting, simple past and past participle cacheted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, philately) To mark (an envelope) with a commemorative stamped design or inscription.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}