{
  "word": "flourish",
  "etymologies": [
    {
      "description": [
        "From Middle English floryschen, from Old French floriss-, stem of some conjugated forms of florir (compare French fleurir), from Vulgar Latin *florīre, from Latin flōreō (“I bloom”) (and conjugation partly from flōrēscō), from flōs (“flower”). See flower + -ish."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flourish (plural flourishes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dramatic gesture such as the waving of a flag.",
                  "examples": [
                    "With many flourishes of the captured banner, they marched down the avenue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornamentation.",
                  "examples": [
                    "His signature ended with a flourish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A ceremonious passage such as a fanfare.",
                  "examples": [
                    "The trumpets blew a flourish as they entered the church."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) A decorative embellishment on a building.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flourish (third-person singular simple present flourishes, present participle flourishing, simple past and past participle flourished)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To thrive or grow well.",
                  "examples": [
                    "The barley flourished in the warm weather."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To prosper or fare well.",
                  "examples": [
                    "The town flourished with the coming of the railway.",
                    "The cooperation flourished as the customers rushed in the business."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be in a period of greatest influence.",
                  "examples": [
                    "His writing flourished before the war."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To develop; to make thrive; to expand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make bold, sweeping movements with.",
                  "examples": [
                    "They flourished the banner as they stormed the palace.",
                    "The squirrel flourished its fluffy tail about as an alarm signal after its narrow escape from the cat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make bold and sweeping, fanciful, or wanton movements, by way of ornament, parade, bravado, etc.; to play with fantastic and irregular motion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use florid language; to indulge in rhetorical figures and lofty expressions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make ornamental strokes with the pen; to write graceful, decorative figures.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adorn with beautiful figures or rhetoric; to ornament with anything showy; to embellish.",
                  "examples": [
                    "With shadowy verdure flourish'd high,",
                    "A sudden youth the groves enjoy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To execute an irregular or fanciful strain of music, by way of ornament or prelude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To boast; to vaunt; to brag.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}