{
  "word": "presume",
  "etymologies": [
    {
      "description": [
        "From Middle English presumen, from Anglo-Norman presumer and its source, Latin praesūmere (“to take beforehand, anticipate”), from prae- + sūmere (“to take”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "presume (third-person singular simple present presumes, present participle presuming, simple past and past participle presumed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) With infinitive object: to be so presumptuous as (to do something) without proper authority or permission. [from 14th c.]",
                  "examples": [
                    "I wouldn't presume to tell him how to do his job."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To perform, do (something) without authority; to lay claim to without permission. [from 14th c.]",
                  "examples": [
                    "Don't make the decision yourself and presume too much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To assume or suggest to be true (without proof); to take for granted, to suppose. [from 14th c.]",
                  "examples": [
                    "Paw-prints in the snow allow us to presume a visit from next door's cat.",
                    "Dr. Livingstone, I presume?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take as a premise; to assume for the sake of argument.",
                  "examples": [
                    "If we presume that human cloning may one day become a mundane, everyday reality, then maybe it's time to start thinking more positively about our soon-to-arrive genetically engineered pseudo-siblings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be presumptuous; with on, upon, to take advantage (of), to take liberties (with). [from 15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}