{
  "word": "bewray",
  "etymologies": [
    {
      "description": [
        "From Middle English bewraien, bewreyen, biwreyen, from Old English *bewrēġan, from Proto-Germanic *biwrōgijaną (“to speak about; tell on; inform of”), equivalent to be- +‎ wray. Cognate with Old Frisian biwrōgja (“to disclose, reveal”), Dutch bewroegen (“to blame; accuse”), Middle Low German bewrȫgen (“to accuse; complain about; punish”), Old High German biruogen (“to disclose, reveal”), Modern German berügen (“to defraud”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bewray (third-person singular simple present bewrays, present participle bewraying, simple past and past participle bewrayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To accuse; malign; speak evil of.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To reveal, divulge, or make (something) known; disclose.",
              "entries": [
                {
                  "meaning": "(transitive) To reveal or disclose and show the presence or true character of, especially if unintentionally or incidentally, or else if perfidiously, prejudicially, or to one's discredit.",
                  "examples": [
                    "He tooke hir fast betwéene his armes, and not without his shame,",
                    "Bewrayed plainly what he was and wherefore that he came."
                  ]
                },
                {
                  "meaning": "(transitive) To expose or rat out (someone).",
                  "examples": [
                    "While this busy search was diligently applied and put in execution, Humphrey Banaster (were it more for fear of loss of life and goods, or attracted and provoked by the avaricious desire of the thousand pounds) he bewrayed his guest and master to John Mitton, then Sheriff of Shropshire, [...]"
                  ]
                },
                {
                  "meaning": "(transitive, obsolete) To expose to harm.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, obsolete) To expose (a deception).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Variant of beray."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "bewray (third-person singular simple present bewrays, present participle bewraying, simple past and past participle bewrayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To soil or befoul; to beray.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}