{
  "word": "undertone",
  "etymologies": [
    {
      "description": [
        "under- +‎ tone"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "undertone (countable and uncountable, plural undertones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An auditory tone of low pitch or volume.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implicit message perceived subtly alongside, but not detracting noticeably from, the explicit message conveyed in or by a book, film, verbal dialogue or similar (contrast with overtone); an undercurrent.",
                  "examples": [
                    "Antonym: overtone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pale colour, or one seen underneath another colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A low state of the physical faculties.",
                  "examples": [
                    "Sedentary occupations are likely to result in undertone, and this undertone not being relieved by physiological means, constipation is a probable outcome."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "undertone (third-person singular simple present undertones, present participle undertoning, simple past and past participle undertoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To accompany as an undertone.",
                  "examples": [
                    "The Missionary's address rolled on in choppy Chinook, undertoned by a gentle voice from the back of the room which told Tanook in pure Indian words what he was to do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To say or speak in an undertone.",
                  "examples": [
                    "Evan paid no attention to him, and answered none of his hasty undertoned questions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To present as less important, noticeable or prominent.",
                  "examples": [
                    "Men rarely make this mistake, their habitual blunder being to undertone everything, to make too light of Julia's new frock, and Johnnie's symptoms of measles, and the way they waste things down stairs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}