{
  "word": "hobgoblin",
  "etymologies": [
    {
      "description": [
        "From hob (“elf”) (from Hob, a variant of Rob, short for Robin Goodfellow, an elf in German folklore) + goblin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hobgoblin (plural hobgoblins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small, ugly goblin that makes trouble for humans. [from 1520s]",
                  "examples": [
                    "A M. Berbiguier lately published an elaborate work, in three huge volumes, in which he demonstrated the existence of hobgoblins, described the proper manner of capturing and securing them, and took credit to himself for his zeal for the benefit of mankind, in allowing no day to pass without imprisoning, with his own hands, at least thirty hobgoblins. A writer of biographical notices of contemporary authors, who believed neither in M. Berbiguier's manner of catching hobgoblins nor in the existence of hobgoblins did not scruple to say that M. Berbiguier was mad, and upon this M. Berbiguier brought his action for libel; but unluckily, together with his action, he brought himself into Court, and established in a very few words the truth of the libel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A source of dread, fear or apprehension; a bugbear.",
                  "examples": [
                    "Under \"Fallacies of Danger,\" then, is listed the subhead of \"The Hobgoblin Argument, or, No Innovation, in which the hobgoblin in question is anarchy; which tremendous spectre has for its forerunner the monster innovation.\" A hot button like this would presumably elicit a visceral response even from Hamilton whose aversion to the hobgoblin of parliamentary reform was apparently his sole unreasoning reflex."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}