{
  "word": "slim",
  "etymologies": [
    {
      "description": [
        "Borrowing from Low German or Dutch slim (“bad, sly, clever”), from Middle Dutch slim (“bad, crooked”), from Old Dutch *slimb, from Proto-West Germanic *slimb, from Proto-Germanic *slimbaz (“oblique, crooked”).  The sense development would have been \"slanting, cunning\" (Dutch) > \"insignificant, slight\" and then \"thin, graceful\" in English, a shift that Liberman calls an \"incredible amelioration\" of word meaning.",
        "The pejorative sense found in Low German and Dutch is also found preserved in the archaic English noun slim (“worthless or lazy person”), also comparable to the South African use of the adjective as \"crafty, sly.\"",
        "Compare Dutch slim (“smart, clever, crafty”), Middle High German slimp (“slanting, awry”), German schlimm (“bad”), West Frisian slim (“bad, dire”)."
      ],
      "adjectives": [
        {
          "description": "slim (comparative slimmer, superlative slimmest)",
          "definitionGroups": [
            {
              "group": "Slender, thin.",
              "entries": [
                {
                  "meaning": "(of a person or a person's build) Slender in an attractive way.",
                  "examples": [
                    "Movie stars are usually slim, attractive, and young."
                  ]
                },
                {
                  "meaning": "(by extension, of clothing) Designed to make the wearer appear slim.",
                  "examples": []
                },
                {
                  "meaning": "(of an object) Long and narrow.",
                  "examples": []
                },
                {
                  "meaning": "(of a workforce) Of a reduced size, with the intent of being more efficient.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of something abstract like a chance or margin) Very small, tiny.",
                  "examples": [
                    "I'm afraid your chances are quite slim."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rural, Northern England, Scotland) Bad, of questionable quality; not strongly built, flimsy.",
                  "examples": [
                    "A slimly-shod lad; a slimly-made cart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa, obsolete in UK) Sly, crafty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "slim (plural slims)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of cigarette substantially longer and thinner than normal cigarettes.",
                  "examples": [
                    "I only smoke slims."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, regional) A potato farl.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(East Africa, uncountable) AIDS, or the chronic wasting associated with its later stages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, uncountable) Cocaine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "slim (third-person singular simple present slims, present participle slimming, simple past and past participle slimmed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To lose weight in order to achieve slimness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make slimmer; to reduce in size.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}