{
  "word": "hide",
  "etymologies": [
    {
      "description": [
        "From Middle English hiden, huden, from Old English hȳdan (“to hide, conceal, preserve”), from Proto-West Germanic *hūdijan (“to conceal”), from Proto-Germanic *hūdijaną (“to conceal”), from Proto-Indo-European *(s)kewdʰ- (“to cover, wrap, encase”), from Proto-Indo-European *(s)kewH- (“to cover”).",
        "The verb was originally weak. In the King James Version of the Bible (1611) both hid and hidden are used for the past participle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hide (third-person singular simple present hides, present participle hiding, simple past hid, past participle hidden or (archaic) hid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put (something) in a place where it will be harder to discover or out of sight.",
                  "examples": [
                    "Synonyms: conceal, hide away, secrete",
                    "Antonyms: disclose, expose, reveal, show, uncover"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To put oneself in a place where one will be harder to find or out of sight.",
                  "examples": [
                    "Synonyms: go undercover, hide away, hide out, lie low, hole up",
                    "Antonyms: reveal, show"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old English hȳd, of Germanic origin, from Proto-West Germanic *hūdi, from Proto-Germanic *hūdiz, from Proto-Indo-European *kéw(H)tis (“skin, hide”) (compare Latin cutis (“skin, rind, hide”)), from Proto-Indo-European *(s)kew(H)- (“to cover”), ultimately the same root as the above etymology. More at sky."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hide (plural hides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The skin of an animal.",
                  "examples": [
                    "Synonyms: pelt, skin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or derogatory) The human skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metonymically, uncountable, informal, usually US) One's own life or personal safety, especially when in peril.",
                  "examples": [
                    "to save his own hide",
                    "better watch his hide",
                    "Coordinate term: ass (see ass § Usage notes)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) (mainly British) A covered structure from which hunters, birdwatchers, etc can observe animals without scaring them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, architecture) A secret room for hiding oneself or valuables; a hideaway.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A covered structure to which a pet animal can retreat, as is recommended for snakes.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hide (third-person singular simple present hides, present participle hiding, simple past and past participle hided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To beat with a whip made from hide.",
                  "examples": [
                    "He ran last week, and he was hided, and he was out on the day before yesterday, and here he is once more, and he knows he's got to run and to be hided again."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hide, from Old English hīd, hȳd, hīġed, hīġid (“a measure of land”), for earlier *hīwid (“the amount of land needed to support one family”), a derivative of Proto-Germanic *hīwaz, *hīwō (“relative, fellow-lodger, family”), from Proto-Indo-European *ḱey- (“to lie with, store, be familiar”). Related to Old English hīwisc (“hide of land, household”), Old English hīwan (“members of a family, household”). More at hewe, hind."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hide (plural hides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A unit of land and tax assessment of varying size, originally as intended to support one household with dependents. [from 9th c.]",
                  "examples": [
                    "The exact size of hides varied with soil quality, but each one generally encompassed 24 to 26 hectares."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}