{
  "word": "deacon",
  "etymologies": [
    {
      "description": [
        "From Old English diacon, from Ecclesiastical Latin diaconus, from Ancient Greek διᾱ́κονος (diā́konos, “servant, minister”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "deacon (plural deacons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Church history) A designated minister of charity in the early Church (see Acts 6:1-6).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Orthodoxy and Roman Catholicism) A clergyman ranked directly below a priest, with duties of helping the priests and carrying out parish work.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Protestantism) Free Churches: A lay leader of a congregation who assists the pastor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Protestantism) Anglicanism: An ordained clergyman usually serving a year prior to being ordained presbyter, though in some cases they remain a permanent deacon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Protestantism) Methodism: A separate office from that of minister, neither leading to the other; instead there is a permanent deaconate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Freemasonry) A junior lodge officer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Mormonism) The lowest office in the Aaronic priesthood, generally held by 12 or 13 year old boys or recent converts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, animal husbandry) A male calf of a dairy breed, so called because they are usually deaconed (see below).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) The chairman of an incorporated company.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "deacon (third-person singular simple present deacons, present participle deaconing, simple past and past participle deaconed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, music) For a choir leader to lead a hymn by speaking one or two lines at a time, which are then sung by the choir.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, animal husbandry) To kill a calf shortly after birth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To place fresh fruit at the top of a barrel or other container, with spoiled or imperfect fruit hidden beneath.",
                  "examples": [
                    "1868,  Louisa May Alcott,  Little Women:The blanc mange was lumpy, and the strawberries not as ripe as they looked, having been skilfully 'deaconed'.",
                    "1902,  George Horace Lorimer,  Old Gorgon Graham‎[1]:It's like buying a barrel of apples that's been deaconed — after you've found that the deeper you go the meaner and wormier the fruit, you forget all about the layer of big, rosy, wax-finished pippins that was on top."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To make sly alterations to the boundaries of (land); to adulterate or doctor (an article to be sold), etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}