{
  "word": "shotgun",
  "etymologies": [
    {
      "description": [
        "From shot +‎ gun. Front passenger seat sense comes from ride shotgun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shotgun (countable and uncountable, plural shotguns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A gun which fires loads typically consisting of small metal balls, called shot, from a cartridge.",
                  "examples": [
                    "Synonym: scattergun",
                    "Meat was cooked up within hours after the hunter killed the deer with his shotgun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The front passenger seat in a vehicle, next to the driver; so called because the position of the shotgun-armed guard on a horse-drawn stage-coach, wagon train, or gold transport was next to the driver on a forward-mounted bench seat. Can also be used in situations of claiming other resources such as bedrooms.",
                  "examples": [
                    "Synonym: death seat",
                    "I call shotgun! ― I claim the right to sit in the passenger seat.",
                    "I call shotgun! ― I claim the right to this bedroom etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, especially Southern US) A one-story dwelling with no hallways or corridors, with the rooms arranged in a straight line.",
                  "examples": [
                    "Synonyms: shotgun house, shotgun shack",
                    "Elvis Presley was born in a two-bedroom shotgun in Tupelo, Mississippi."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive formation in which the quarterback receives the snap at a distance behind the center, often with a running back set to one or both sides of him.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, as a modifier) Relating to shotguns, either in a present or past sense.",
                  "examples": [
                    "shotgun cartridges",
                    "shotgun seat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, as a modifier) Relating to the threat of force or dubious means.",
                  "examples": [
                    "shotgun wedding",
                    "shotgun diplomacy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(attributive, as a modifier) Relating to the use of numerous, diverse or indiscriminate means to achieve a particular result.",
                  "examples": [
                    "shotgun marketing",
                    "shotgun approach"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shotgun (third-person singular simple present shotguns, present participle shotgunning, simple past and past participle shotgunned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, smoking) To inhale from a pipe or other smoking device, followed shortly by an exhalation into someone else’s mouth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To verbally lay claim to (something)",
                  "examples": [
                    "I got a day off because I shotgunned it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To hit the ball directly back at the pitcher.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To rapidly drink a beverage from a can by making a hole in the bottom of the can, placing the hole above one's mouth, and opening the top.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang) To send out many (requests, answers to a question, etc), especially in the hope that one obtains a positive result (i.e. reveals useful information, is correct, etc), in the manner of a shotgun firing many balls of shot such that one may hit a target.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, slang) To employ the technique of shotgun debugging.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}