{
  "word": "screed",
  "etymologies": [
    {
      "description": [
        "From Middle English screde [and other forms], a variant of shrede (“fragment, scrap; strip of cloth; strip cut off from a larger piece; band or thread woven into fabric; element, streak”) (whence shred (noun)), from Old English sċrēad, sċrēade (“a piece cut off; paring, shred”), from Proto-Germanic *skraudō (“a piece, shred; a cut, crack”), from *skraudaną (“to cut up, shred”), from Proto-Indo-European *(s)ker- (“to cut off”). The English word is cognate with Old Frisian skrēd. Doublet of escrow, scroll, and shred."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "screed (plural screeds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, Newfoundland, Scotland, dated) A piece or narrow strip cut or torn off from a larger whole; a shred. [from mid 14th c.]",
                  "examples": [
                    "Synonym: scrid"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly regional Britain, Scotland, dated) A piece of land, especially one that is narrow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Northern England, Northern Ireland, Scotland, dated) A rent, a tear.",
                  "examples": [
                    "Synonyms: cut, rip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of writing (such as an article, letter, or list) or a speech, especially if long.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A speech or piece of writing which contains angry and extended criticism. [from late 18th c.]",
                  "examples": [
                    "Synonyms: harangue, polemic, rant, tirade, diatribe; see also Thesaurus:diatribe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chiefly in the plural form screeds: a large quantity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": "(construction, masonry) Senses relating to building construction and masonry.",
              "entries": [
                {
                  "meaning": "A tool, usually a long strip of wood or other material, placed on a floor to be covered with concrete, a wall to be plastered, etc., as a guide for producing a smooth, flat surface.",
                  "examples": []
                },
                {
                  "meaning": "A tool such as a long strip of wood or other material which is drawn over a wet layer of concrete, plaster, etc., to make it smooth and flat; also, a machine that achieves this effect; a screeder.",
                  "examples": [
                    "Synonym: strickle"
                  ]
                },
                {
                  "meaning": "A smooth, flat layer of concrete, plaster, or similar material, especially if acting as a base for paving stones, tiles, wooden planks, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English screde, Early Middle English screda, a variant of shreden, shrede (“to chop, cut up, hack; to cut to shape; to maim, wound; to prune, trim”) [and other forms] (whence shred (verb)), from Old English scrēadian (“to cut up, shred; to cut off, prune”), from Proto-Germanic *skraudaną (“to cut up, shred”), see further at etymology 1; later uses are derived from the noun screed."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "screed (third-person singular simple present screeds, present participle screeding, simple past and past participle screeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly Northern England, Northern Ireland, Scotland, dated) To rend, to shred, to tear.",
                  "examples": [
                    "Synonyms: cut, rip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland, also figurative, dated) To read or repeat from memory fluently or glibly; to reel off.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, construction, masonry) To use a screed to produce a smooth, flat surface of concrete, plaster, or similar material; also (generally) to put down a layer of concrete, plaster, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland) To become rent or torn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Probably imitative; compare screech, skreigh."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "screed (plural screeds) (Northern Ireland, Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly humorous) A (discordant) sound or tune played on bagpipes, a fiddle, or a pipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of something scratching or tearing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "screed (third-person singular simple present screeds, present participle screeding, simple past and past participle screeded) (Northern Ireland, Scotland, rare)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly humorous) To play bagpipes, a fiddle, or a pipe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a discordant or harsh scratching or tearing sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chiefly humorous, obsolete) To play (a sound or tune) on bagpipes, a fiddle, or a pipe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From scree (“loose, stony debris”) +‎ -ed."
      ],
      "adjectives": [
        {
          "description": "screed (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Strewn with scree.",
                  "examples": [
                    "We clambered up a screed slope."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}