{
  "word": "sleep",
  "etymologies": [
    {
      "description": [
        "From Middle English slepen, from Anglian Old English slēpan, a variant of slǣpan, from Proto-West Germanic *slāpan, from Proto-Germanic *slēpaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sleep (third-person singular simple present sleeps, present participle sleeping, simple past and past participle slept)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rest in a state of reduced consciousness.",
                  "examples": [
                    "You should sleep eight hours a day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be slumbering in (a state).",
                  "examples": [
                    "to sleep a dreamless sleep"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, reflexive) To achieve or make happen by manner of sleep.",
                  "examples": [
                    "Sleep your way to good health.",
                    "He hoped to sleep his troubles away."
                  ]
                }
              ]
            },
            {
              "group": "(idiomatic, euphemistic) To have sexual intercourse (see sleep with).",
              "entries": [
                {
                  "meaning": "(idiomatic) To earn by sexual favors.",
                  "examples": [
                    "Oh, she didnt earn her promotion, she just slept her way to the top."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accommodate in beds.",
                  "examples": [
                    "This caravan can sleep four people comfortably."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be careless, inattentive, or unconcerned; not to be vigilant; to live thoughtlessly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be dead; to lie in the grave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be, or appear to be, in repose; to be quiet; to be unemployed, unused, or unagitated; to rest; to lie dormant.",
                  "examples": [
                    "a question sleeps for the present; the law sleeps"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, intransitive) To wait for a period of time without performing any action.",
                  "examples": [
                    "After a failed connection attempt, the program sleeps for 5 seconds before trying again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, transitive) To place into a state of hibernation.",
                  "examples": [
                    "Even when you have reasons not to sleep the computer, it's still a good idea to sleep the display after a period of time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, mechanics, dynamics) To spin on its axis with no other perceptible motion.",
                  "examples": [
                    "When a top is sleeping, it is spinning but not precessing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mechanics, dynamics) To cause (a spinning top or yo-yo) to spin on its axis with no other perceptible motion.",
                  "examples": [
                    "Yo-yo tricks involving sleeping the yo-yo (like \"walking the dog\" and \"rocking the baby\") cannot be performed in space."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English slepe, sleep, sleepe, from Old English slǣp (“sleep”), from Proto-West Germanic *slāp, from Proto-Germanic *slēpaz (“sleep”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sleep (countable and uncountable, plural sleeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of reduced consciousness during which a human or animal rests in a daily rhythm.",
                  "examples": [
                    "I really need some sleep.",
                    "We need to conduct an overnight sleep test to diagnose your sleep problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, informal) An act or instance of sleeping.",
                  "examples": [
                    "I’m just going to have a quick sleep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, metonymically) A night.",
                  "examples": [
                    "There are only three sleeps till Christmas!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Rheum, crusty or gummy discharge found in the corner of the eyes after waking, whether real or a figurative objectification of sleep (in the sense of reduced consciousness).",
                  "examples": [
                    "Synonyms: (informal) sleepy, (informal) sleeper, (informal) sleepy dust, (slang) crusty, (UK dialectal) gound",
                    "Wipe the sleep from your eyes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state of plants, usually at night, when their leaflets approach each other and the flowers close and droop, or are covered by the folded leaves.",
                  "examples": [
                    "Synonyms: nyctinasty, nyctitropism"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The hibernation of animals.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}