{
  "word": "engross",
  "etymologies": [
    {
      "description": [
        "From Middle English engrossen, from Anglo-Norman engrosser (“to gather in large quantities, draft something in final form”); partly from the phrase en gros (“in bulk, in quantity, at wholesale”), from en- + gros; and partly from Medieval Latin ingrossō (“thicken, write something large and in bold lettering”, v.), from in- + grossus (“great, big, thick”), from Old High German grōz (“big, thick, coarse”), from Proto-West Germanic *graut, from Proto-Germanic *grautaz (“large, great, thick, coarse grained, unrefined”), from Proto-Indo-European *ghrewə- (“to fell, put down, fall in”). More at in-, gross."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "engross (third-person singular simple present engrosses, present participle engrossing, simple past and past participle engrossed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now law) To write (a document) in large, aesthetic, and legible lettering; to make a finalized copy of.",
                  "examples": [
                    "Coordinate term: longhand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, business, obsolete) To buy up wholesale, especially to buy the whole supply of (a commodity etc.).",
                  "examples": [
                    "Synonym: corner the market"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To monopolize; to concentrate (something) in the single possession of someone, especially unfairly.",
                  "examples": [
                    "The Coral Islands are principally visited by the pearl-shell fishermen, who arrive in small schooners, carrying not more than five or six men. For a long while the business was engrossed by Merenhout, the French Consul at Tahiti, but a Dutchman by birth, who, in one year, is said to have sent to France fifty thousand dollars' worth of shells."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To completely engage the attention of.",
                  "examples": [
                    "She seems to be completely engrossed in that book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To thicken; to condense.",
                  "examples": [
                    "Synonyms: inspissate; see also Thesaurus:thicken"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make gross, thick, or large; to thicken; to increase in bulk or quantity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To amass.",
                  "examples": [
                    "Synonyms: amound, hoard; see also Thesaurus:amass"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}