{
  "word": "phase",
  "etymologies": [
    {
      "description": [
        "From New Latin phasis, from Ancient Greek φάσις (phásis, “an appearance”), from φάω (pháō, “to shine”); compare phantasm and see face."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "phase (plural phases)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distinguishable part of a sequence or cycle occurring over time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is exhibited to the eye; the appearance which anything manifests, especially any one among different and varying appearances of the same object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any appearance or aspect of an object of mental apprehension or view.",
                  "examples": [
                    "The problem has many phases."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A particular appearance or state in a regularly recurring cycle of changes with respect to quantity of illumination or form, or the absence, of its enlightened disk. Illustrated in Wikipedia's article Lunar phase.",
                  "examples": [
                    "the phases of the moon"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Any one point or portion in a recurring series of changes, as in the changes of motion of one of the particles constituting a wave or vibration; one portion of a series of such changes, in distinction from a contrasted portion, as the portion on one side of a position of equilibrium, in contrast with that on the opposite side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A component in a material system that is distinguished by chemical composition and/or physical state (solid, liquid or gas) and/or crystal structure. It is delineated from an adjoining phase by an abrupt change in one or more of those conditions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) In certain organisms, one of two or more colour variations characteristic of the species, but independent of the ordinary seasonal and sexual differences, and often also of age.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby union) The period of play between consecutive breakdowns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A haplotype.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The arctangent of the quotient formed by dividing the imaginary part of a complex number by the real part.",
                  "examples": [
                    "Synonym: argument"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A distortion caused by a difference in the speed of propagation for different frequencies",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electrical engineering) In a polyphase electrical power system, one of the power-carrying conductors, or the alternating current carried by it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "phase (third-person singular simple present phases, present participle phasing, simple past and past participle phased)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with in or out) To begin—if construed with \"in\"—or to discontinue—if construed with out—(doing) something over a period of time (i.e. in phases).",
                  "examples": [
                    "The use of the obsolete machines was gradually phased out as the new models were phased in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Antique form of faze.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics, informal, transitive) To determine haplotypes in (data) when genotypes are known.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pass into or through a solid object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(science fiction) To use a phaser.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Latin phase (“passover”), Phasa, from Hebrew פָּסַח‎ (pésach)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}