{
  "word": "rummage",
  "etymologies": [
    {
      "description": [
        "From Old French arrumage (compare French arrimage), from arrumer (“to arrange the cargo in the hold”) (compare French arrimer and Spanish arrumar)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rummage (countable and uncountable, plural rummages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thorough search, usually resulting in disorder.",
                  "examples": [
                    "Have a rummage through the attic and see if you can find anything worth selling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Commotion; disturbance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disorganized collection of miscellaneous objects; a jumble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A place or room for the stowage of cargo in a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The act of stowing cargo; the pulling and moving about of packages incident to close stowage.",
                  "examples": [
                    "Synonym: (obsolete) romage"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rummage (third-person singular simple present rummages, present participle rummaging, simple past and past participle rummaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To arrange (cargo, goods, etc.) in the hold of a ship; to move or rearrange such goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To search a vessel for smuggled goods.",
                  "examples": [
                    "After the long voyage, the customs officers rummaged the ship."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To search something thoroughly and with disregard for the way in which things were arranged.",
              "entries": [
                {
                  "meaning": "(intransitive) To hastily search for something in a confined space and among many items by carelessly turning things over or pushing things aside.",
                  "examples": [
                    "She rummaged in the drawers trying to find the missing sock."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}