{
  "word": "buckle",
  "etymologies": [
    {
      "description": [
        "From a frequentative form of buck (“to bend, buckle”), of Dutch Low Saxon or German Low German origin, related to Dutch bukken (“to stoop, bend, yield, submit”), German bücken (“to stoop, bend”), Swedish bocka (“to buck, bow”), equivalent to buck +‎ -le. Compare Middle Dutch buchelen (“to strive, tug under a load”), dialectal German aufbückeln (“to raise or arch the back”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "buckle (third-person singular simple present buckles, present participle buckling, simple past and past participle buckled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To distort or collapse under physical pressure; especially, of a slender structure in compression.",
                  "examples": [
                    "Perhaps as startling as the sheer toll was the devastation to some of the state’s well-known locales. Boardwalks along the beach in Seaside Heights, Belmar and other towns on the Jersey Shore were blown away. Amusement parks, arcades and restaurants all but vanished. Bridges to barrier islands buckled, preventing residents from even inspecting the damage to their property."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make bend; to cause to become distorted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To give in; to react suddenly or adversely to stress or pressure (of a person).",
                  "examples": [
                    "It is amazing that he has never buckled after so many years of doing such urgent work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To yield; to give way; to cease opposing.",
                  "examples": [
                    "The Dutch, as high as they seem, do begin to buckle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To enter upon some labour or contest; to join in close fight; to contend.",
                  "examples": [
                    "The bishop was as able and ready to buckle with the Lord Protector as he was with him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To buckle down; to apply oneself.",
                  "examples": [
                    "To make our sturdy humour buckle thereto."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English bokel (“spiked metal ring for holding a belt, etc”), from Old French boucle, bocle (“\"boss (of a shield)\" then \"shield,\" later \"buckle, metal ring”), from Latin buccula (“cheek strap of a helmet”), diminutive of bucca (“cheek”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "buckle (plural buckles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A clasp used for fastening two things together, such as the ends of a belt, or for retaining the end of a strap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, heraldry) The brisure of an eighth daughter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) An upward, elongated displacement of a roof membrane frequently occurring over insulation or deck joints. A buckle may be an indication of movement with the roof assembly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A distortion, bulge, bend, or kink, as in a saw blade or a plate of sheet metal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A curl of hair, especially a kind of crisp curl formerly worn; also, the state of being curled.",
                  "examples": [
                    "lets his wig lie in buckle for a whole half year"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A contorted expression, as of the face.",
                  "examples": [
                    "'Gainst nature arm'd by gravity, / His features too in buckle see."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, baking) A cake baked with fresh fruit and a streusel topping.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "buckle (third-person singular simple present buckles, present participle buckling, simple past and past participle buckled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fasten using a buckle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) To unite in marriage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}