{
  "word": "cradle",
  "etymologies": [
    {
      "description": [
        "From Middle English cradel, credel, from Old English cradol, from Proto-West Germanic *kradul, from Proto-Germanic *kradulaz, from Proto-Germanic *kradô (“(wicker) basket”). Related to cart."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cradle (plural cradles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bed or cot for a baby, oscillating on rockers or swinging on pivots.",
                  "examples": [
                    "the cradle that received thee at thy birth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The place of origin, or in which anything is nurtured or protected in the earlier period of existence.",
                  "examples": [
                    "a cradle of crime",
                    "the cradle of liberty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Infancy, or very early life.",
                  "examples": [
                    "from the cradle to the grave"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An implement consisting of a broad scythe for cutting grain, with a set of long fingers parallel to the scythe, designed to receive the grain, and to lay it evenly in a swath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used in mezzotint engraving, which, by a rocking motion, raises burrs on the surface of the plate, so preparing the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A framework of timbers, or iron bars, moving upon ways or rollers, used to support, lift, or carry ships or other vessels, heavy guns, etc., as up an inclined plane, or across a strip of land, or in launching a ship.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A case for a broken or dislocated limb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A frame to keep the bedclothes from contact with the sensitive parts of an injured person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A machine on rockers, used in washing out auriferous earth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A suspended scaffold used in shafts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(carpentry) A ribbing for vaulted ceilings and arches intended to be covered with plaster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A basket or apparatus in which, when a line has been made fast to a wrecked ship from the shore, the people are brought off from the wreck.",
                  "examples": [
                    "The cradle was ill-made. One victim fell into the sea and was lost and the ensuing delay cost three more lives."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A rest for the receiver of a telephone, or for certain computer hardware.",
                  "examples": [
                    "He slammed the handset into the cradle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(contact juggling) A hand position allowing a contact ball to be held steadily on the back of the hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical device for tilting and decanting a bottle of wine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cradle (third-person singular simple present cradles, present participle cradling, simple past and past participle cradled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contain in or as if in a cradle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rock (a baby to sleep).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wrap protectively, to hold gently and protectively.",
                  "examples": [
                    "cradling the injured man’s head in her arms"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To lull or quieten, as if by rocking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To nurse or train in infancy.",
                  "examples": [
                    "He that hath been cradled in majesty will not leave the throne to play with beggars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lacrosse) To rock the lacrosse stick back and forth in order to keep the ball in the head by means of centrifugal force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cut and lay (grain) with a cradle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To transport a vessel by means of a cradle.",
                  "examples": [
                    "In Lombardy  […]  boats are cradled and transported over the grade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put ribs across the back of (a picture), to prevent the panels from warping.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}