{
  "word": "hypothecate",
  "etymologies": [
    {
      "description": [
        "From Latin hypothecatus, past participle of hypotheco, hypothecare. This was in turn derived from Ancient Greek ὑποθήκη (hupothḗkē, “pledge”), from the verb ὑποτίθημι (hupotíthēmi, “to pledge as surety”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "hypothecate (third-person singular simple present hypothecates, present participle hypothecating, simple past and past participle hypothecated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pledge (something) as surety for a loan; to pawn, mortgage.",
                  "examples": [
                    "‘My husband, Jasper Murdock, provided in his will that no part of his collection might be sold, loaned or hypothecated during my lifetime.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, Britain) To designate a new tax or tax increase for a specific expenditure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) To designate in advance the specific purpose of expenditure for government revenues (especially taxes).",
                  "examples": [
                    "\"Levying customs duties and excises on necessities also ensured a relatively secure source of revenue. Revenues were generally hypothecated in an attempt to draw support from the public, for example funding an orphanage, gaol, hospital equipment and building works around Sydney.\" A brief history of Australia's tax system; Sam Reinhardt and Lee Steel; 04 September 2006"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}