{
  "word": "distribution",
  "etymologies": [
    {
      "description": [
        "From Old French, from Latin distributio, from distribuere 'to distribute', itself from dis- 'apart' + tribuere 'to' (from tribus)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "distribution (countable and uncountable, plural distributions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of distributing or state of being distributed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An apportionment by law (of funds, property).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, marketing) The process by which goods get to final consumers over a geographical market, including storing, selling, shipping and advertising.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything distributed; portion; share.",
                  "examples": [
                    "our charitable distributions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of distributing; arrangement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The total number of something sold or delivered to the clients.",
                  "examples": [
                    "The distribution of my little rock magazine is about 3,000."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The frequency of occurrence or extent of existence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) The apportionment of income or wealth in a population.",
                  "examples": [
                    "The wealth distribution became extremely skewed in the kleptocracy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The way in which a player's hand is divided in suits, or in which a particular suit is divided between the players.",
                  "examples": [
                    "The declarer had 3-6-2-2 distribution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, statistics) A probability distribution; the set of relative likelihoods that a variable will have a value in a given interval.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, differential geometry) A subset of the tangent bundle of a manifold that satisfies certain properties; used to construct the notions of integrability and foliation of a manifold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software) A set of bundled software components",
                  "examples": [
                    "Synonym: distro",
                    "a Linux distribution"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) The process or result of the sale of securities, especially their placement among investors with long-term investment strategies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) The resolution of a whole into its parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) The process of sorting the types and placing them in their proper boxes in the cases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(steam engines) The steps or operations by which steam is supplied to and withdrawn from the cylinder at each stroke of the piston: admission, suppression or cutting off, release or exhaust, and compression of exhaust steam prior to the next admission.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric) A rhetorical technique in which a subject is divided into multiple cases based on some property or properties, and each case is addressed individually.",
                  "examples": [
                    "It is alſo called a diſtribucion, when we diuide the whole, into ſeuerall partes, and ſaie we haue foure poynctes, whereof we purpoſe to ſpeake, compꝛehendyng our whole talke within compaſſe of theſame."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}