{
  "word": "heathendom",
  "etymologies": [
    {
      "description": [
        "From Middle English hæthendom, from Old English hǣþendōm; equivalent to heathen +‎ -dom. OED records a single attestation in the period between 1230 and 1840, a (nonce?) occurrence in J. Law, Proposals and reasons for constituting a council of trade in Scotland (1701, p. 233). Otherwise replaced by Middle English hethenesse in the later Middle English period and heathenism in the 17th and 18th centuries. Cognate with Dutch heidendom, Old High German heidentuom (German Heidentum), Old Norse heiðindómr (Swedish hedendom)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "heathendom (usually uncountable, plural heathendoms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being heathen.",
                  "examples": [
                    "The priest argued to the king that unless clerics accompanied the colony ship, the colony would soon descend into heathendom and barbarity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "From one religion's or creed's perspective, the rest of the world that does not follow that creed or religion.",
                  "examples": [
                    "My aunt considered all of Europe to be heathendom, and refused to visit us in Amsterdam on religious grounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Specifically, the non-Christian world; territories where Christianity is not the dominant religion.",
                  "examples": [
                    "The Crusaders meant to wrest Jerusalem from heathendom, but they managed to pillage a number of lands in Christendom along the way."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Germanic paganism, sometimes capitalized) The collection of people who follow Heathenry, a modern pagan faith inspired by the pre-Abrahamic religions of Germanic tribes, Anglo-Saxons and Norse peoples.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}