{
  "word": "soviet",
  "etymologies": [
    {
      "description": [
        "Borrowed from Russian сове́т (sovét, “council”), from Old Russian borrowed from Old Church Slavonic съвѣтъ (sŭvětŭ, “advice”). Compounded from съ- (sŭ-) + вѣтъ (větŭ, “agreement”), from Proto-Slavic *větъ (“council, talk”). Related words include наве́т (navét), изве́т (izvét), отве́т (otvét), приве́т (privét), обе́т (obét), ве́че (véče), отвеча́ть (otvečátʹ), отве́тить (otvétitʹ), завеща́ть (zaveščátʹ), and совещаться (soveščatʹsja). Probably cognate with Polish witać (“to welcome”)."
      ],
      "adjectives": [
        {
          "description": "soviet (comparative more soviet, superlative most soviet)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to or resembling a soviet (council).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Soviet (pertaining to the Soviet Union)",
                  "examples": [
                    "An engineer who is not very soviet in his convictions is the hero."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "soviet (plural soviets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A workers' council, an institution first formed during the 1905 Russian Revolution and then instituted as the main form of communist government at all levels in the Soviet Union; by extension, a similar organization in early Chinese communism and elsewhere.",
                  "examples": [
                    "Kratochvil, Jedlicka, Safar, Kubes and Vasata, who always took an interest in politics, set up a soviet in the last wagon and uncoupled it from the rest of the train in the night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}