{
  "word": "branch",
  "etymologies": [
    {
      "description": [
        "From Middle English branche, braunche, bronche, from Old French branche, branke, from Late Latin branca (“footprint”, later also “paw, claw”) (whence Middle High German pranke, German Pranke (“paw”)), of unknown origin.",
        "Perhaps of Celtic origin, from a hypothetical Gaulish *vranca, from Proto-Indo-European *wrónk-eh₂. If so, then Indo-European cognates include Old Norse rá, vró (“angle, corner”), and possibly Lithuanian rankà (“hand”), Old Church Slavonic рѫка (rǫka, “hand”), Albanian rangë (“yardwork”).",
        "The verb is from Middle English braunchen, from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "branch (plural branches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The woody part of a tree arising from the trunk and usually dividing.",
                  "examples": [
                    "Synonyms: bough, limb, tiller, tillow, twig; see also Thesaurus:tree"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the parts of something that divides like the branch of a tree.",
                  "examples": [
                    "the branch of an antler, a chandelier, or a railway"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Southern US) A creek or stream which flows into a larger river.",
                  "examples": [
                    "Coordinate terms: (Ohio, Pennsylvania and West Virginia) run, (New York, New England) brook",
                    "branch water"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) One of the portions of a curve that extends outwards to an indefinitely great distance.",
                  "examples": [
                    "the branches of a hyperbola"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A location of an organization with several locations.",
                  "examples": [
                    "Our main branch is downtown, and we have branches in all major suburbs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A line of family descent, in distinction from some other line or lines from the same stock; any descendant in such a line.",
                  "examples": [
                    "the English branch of a family"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Mormonism) A local congregation of the LDS Church that is not large enough to form a ward; see Wikipedia article on ward in LDS church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area in business or of knowledge, research.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A certificate given by Trinity House to a pilot qualified to take navigational control of a ship in British waters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A sequence of code that is conditionally executed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A group of related files in a source control system, including for example source code, build scripts, and media such as images.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A branch line.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "branch (third-person singular simple present branches, present participle branching, simple past and past participle branched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To arise from the trunk or a larger branch of a tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To produce branches.",
                  "examples": [
                    "The tree throve and branched so heavily that the windows of Lower West and the Doll's Flat were darkened."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause to) divide into separate parts or subdivisions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing) To jump to a different location in a program, especially as the result of a conditional statement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strip of branches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To discipline (a union member) at a branch meeting.",
                  "examples": [
                    "His staff were 'not journalists, but Communists', he maintained. Nonetheless, in 1948 his vigorous editorship took the paper's circulation to 120,000 a day. The following year, he was 'branched' by the National Union of Journalists for an intemperate attack on Fleet Street."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}