{
  "word": "sacrifice",
  "etymologies": [
    {
      "description": [
        "From Middle English sacrificen (verb) and sacrifice (noun), from Old French sacrifice, from Latin sacrificium (“sacrifice”), from sacrificō (“make or offer a sacrifice”), from sacer (“sacred, holy”) + faciō (“do, make”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sacrifice (countable and uncountable, plural sacrifices)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The offering of anything to a god; a consecratory rite.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The destruction or surrender of anything for the sake of something else; the devotion of something desirable to something higher, or to a calling deemed more pressing.",
              "entries": [
                {
                  "meaning": "(baseball) A play in which the batter is intentionally out so that one or more runners can advance around the bases.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something sacrificed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loss of profit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A sale at a price less than the cost or the actual value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sacrifice (third-person singular simple present sacrifices, present participle sacrificing, simple past and past participle sacrificed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To offer (something) as a gift to a deity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give away (something valuable) to get at least a possibility of gaining something else of value (such as self-respect, trust, love, freedom, prosperity), or to avoid an even greater loss.",
                  "examples": [
                    "Venison has many advantages over meat from factory farms, although it still requires a hunter to sacrifice the life of a deer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trade (a value of higher worth) for something of lesser worth in order to gain something else valued more, such as an ally or business relationship, or to avoid an even greater loss; to sell without profit to gain something other than money.",
                  "examples": [
                    "If you exchange a penny for a dollar, it is not a sacrifice; if you exchange a dollar for a penny, it is."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chess) To intentionally give up (a piece) in order to improve one’s position on the board.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To advance (a runner on base) by batting the ball so it can be fielded, placing the batter out, but with insufficient time to put the runner out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, tradesmen's slang) To sell at a price less than the cost or actual value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To destroy; to kill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) To kill a test animal for autopsy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}