{
  "word": "belt",
  "etymologies": [
    {
      "description": [
        "From Middle English belt, from Old English belt (“belt, girdle”), from Proto-West Germanic *baltī̆, from Proto-Germanic *baltijaz (“girdle, belt”), from Latin balteus (“belt, sword-belt”), of Etruscan origin. Cognate with Scots belt (“belt”), Dutch belt, German Balz (“belt”), Danish bælte (“belt”), Swedish bälte (“belt, cincture, girdle, zone”) and Icelandic belti (“belt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "belt (plural belts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band worn around the waist to hold clothing to one's body (usually pants), hold weapons (such as a gun or sword), or serve as a decorative piece of clothing.",
                  "examples": [
                    "As part of the act, the fat clown's belt broke, causing his pants to fall down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band used as a restraint for safety purposes, such as a seat belt.",
                  "examples": [
                    "Keep your belt fastened; this is going to be quite a bumpy ride."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A band that is used in a machine to help transfer motion or power.",
                  "examples": [
                    "The motor had a single belt that snaked its way back and forth around a variety of wheels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anything that resembles a belt, or that encircles or crosses like a belt; a strip or stripe.",
                  "examples": [
                    "a belt of trees; a belt of sand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A trophy in the shape of a belt, generally awarded for martial arts.",
                  "examples": [
                    "the heavyweight belt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) A collection of small bodies (such as asteroids) which orbit a star.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) One of certain girdles or zones on the surface of the planets Jupiter and Saturn, supposed to be of the nature of clouds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, nautical) A band of armor along the sides of a warship, protecting the ship's vital spaces.",
                  "examples": [
                    "The battleship was protected by a twelve-inch belt just above the waterline."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A powerful blow, often made with a fist or heavy object.",
                  "examples": [
                    "After the bouncer gave him a solid belt to the gut, Simon had suddenly had enough of bar fights."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quick drink of liquor.",
                  "examples": [
                    "Care to join me in a belt of scotch?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually capitalized) A geographical region known for a particular product, feature or demographic (Corn Belt, Bible Belt, Black Belt, Green Belt).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The part of the strike zone at the height of the batter's waist.",
                  "examples": [
                    "That umpire called that pitch a strike at the belt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaponry) A device that holds and feeds cartridges into a belt-fed weapon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A vocal tone produced by singing with chest voice above the break (or passaggio), in a range typically sung in head voice.",
                  "examples": [
                    "Both auditionees had great ranges but Diamond had the strong belt we really need for the finale."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "belt (third-person singular simple present belts, present participle belting, simple past and past participle belted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To encircle.",
                  "examples": [
                    "The small town was belted by cornfields in all directions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fasten a belt on.",
                  "examples": [
                    "Edgar belted himself in and turned the car's ignition.",
                    "The rotund man had difficulty belting his pants, and generally wore suspenders to avoid the issue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To invest (a person) with a belt as part of a formal ceremony such as knighthood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hit with a belt.",
                  "examples": [
                    "The child was misbehaving so he was belted as punishment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal, normally belt out) To scream or sing in a loud manner.",
                  "examples": [
                    "He belted out the national anthem. (Perhaps a derivative or cognate of English bellow),"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drink quickly, often in gulps.",
                  "examples": [
                    "He belted down a shot of whisky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To hit someone or something.",
                  "examples": [
                    "The angry player belted the official across the face, and as a result was ejected from the game."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball) To hit a pitched ball a long distance, usually for a home run.",
                  "examples": [
                    "He belted that pitch over the grandstand."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move very fast.",
                  "examples": [
                    "He was really belting along."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}