{
  "word": "canopy",
  "etymologies": [
    {
      "description": [
        "From Middle English canapy, canepie, canapee, canape, canope, from Medieval Latin canapeum, canopeum, from Latin cōnōpēum (“mosquito net, canopy”), from Ancient Greek κωνωπεῖον (kōnōpeîon, “mosquito net”), from Ancient Greek κώνωψ (kṓnōps, “mosquito”), of uncertain origin. More at Ancient Greek κώνωψ (kṓnōps). Doublet of canapé and conopeum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "canopy (plural canopies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A high cover providing shelter, such as a cloth supported above an object, particularly over a bed.",
                  "examples": [
                    "golden canopies and beds of state"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any overhanging or projecting roof structure, typically over entrances or doors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The zone of the highest foliage and branches of a forest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In an airplane, the transparent cockpit cover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a parachute, the cloth that fills with air and thus limits the falling speed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The vault of heavens, the firmament in ancient cosmology and in later scientific theory related to the Biblical Book of Genesis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "canopy (third-person singular simple present canopies, present participle canopying, simple past and past participle canopied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with or as if with a canopy.",
                  "examples": [
                    "The walls of the vestibule and passage passing round the sanctuary, are covered with compartments holding high reliefs of Buddha seated on a lotus, the stem of which is grasped by two figures wearing wigs and tiaras, canopied by snakes;  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go through the canopy of a forest on a zipline.",
                  "examples": [
                    "If you’re looking for a little adventure in Colombia, look no further than canopying through Rio Claro’s lush, secluded jungle, located just five hours bus ride from either Medellin or Bogota."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}