{
  "word": "hero",
  "etymologies": [
    {
      "description": [
        "From Middle English heroes, from Old French heroes, from Latin hērōs (“hero”), from Ancient Greek ἥρως (hḗrōs, “demi-god, hero”), from Proto-Indo-European *ser- (“to watch over, protect”). Related to Latin servo (“protect”). Displaced Middle English heleð, haleð, from Old English hæle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hero (plural heroes or (sandwich sense only) heros, feminine heroine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Somebody who possesses great bravery and carries out extraordinary or noble deeds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A role model.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The protagonist in a work of fiction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(poker) The current player, especially an hypothetical player for example and didactic purposes. Compare: villain (“any opponent player”). Not to be confused with hero call (“a weak call against a supposed bluff”).",
                  "examples": [
                    "Let's discuss how to play if the hero has KK, and there's an ace on board."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A large sandwich made from meats and cheeses; a hero sandwich.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, photography, chiefly attributive) The product chosen from several candidates to be photographed, as in food advertising, or with props used in a movie.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(web design) The eye-catching top portion of a web page, sometimes including a hero image; the portion above the fold.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}