{
  "word": "initial",
  "etymologies": [
    {
      "description": [
        "From Middle French initial or directly from its Latin etymon initiālis (“of the beginning, incipient, initial”), from initium (“a going in, entrance, beginning”), from inire (“to go in, enter upon, begin”), from in (“in”) + ire (“to go”)."
      ],
      "adjectives": [
        {
          "description": "initial (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chronologically first, early; of or pertaining to the beginning, cause or origin.",
                  "examples": [
                    "Our initial admiration for their efficiency gave way to disgust about their methods.",
                    "The initial stages of a syndrome may differ vastly from the final symptoms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Spatially first, placed at the beginning, in the first position; especially said of the first letter of a word.",
                  "examples": [
                    "The initial letter of names is usually printed with a capital letter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "initial (plural initials)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first letter of a word or a name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In plural, the first letter of each word of a person's full name considered as a unit.",
                  "examples": [
                    "You can get your initials printed at the top."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, calligraphy) A distinguished initial letter of a chapter or section of a document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) onset, part of a syllable that precedes the syllable nucleus in phonetics and phonology.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "initial (third-person singular simple present initials, present participle initialing or initialling, simple past and past participle initialed or initialled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To sign one's initial(s), as an abbreviated signature.",
                  "examples": [
                    "Please initial each page and sign the contract in full at the bottom."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}