{
  "word": "bogart",
  "etymologies": [
    {
      "description": [
        "From actor Humphrey Bogart, from Dutch surname Bogaard (“keeper of an orchard”), from boomgaard (“treegarden, orchard”), cognate to English boom (“piece of wood”)/beam + garden.",
        "Senses of selfishness and excess evolved from the original 1960s use meaning “keep a joint in the mouth instead of passing it on”, recalling the actor’s signature practice of keeping a cigarette dangling from his mouth even while speaking. Other senses of “bullying” or “tough guy” also originated in the 1960s and recall the actor’s various movie roles.",
        "Another potential origin of the vernacular comes from Humphrey Bogart's role in the film The Treasure of the Sierra Madre (1948) in which his character, Dobbs, becomes increasingly selfish with the gold mine that he shares with his two partners.",
        "Or it could be from The Big Sleep (1946) in which Lauren Bacall lights a cigarette for him while he is tied up, forcing him to dangle the cigarette from his lips for the rest of the scene. According to an interview with \"The Fraternity of Man\" bandmember Lawrence \"Stash\" Wagner, he \"got down on my knees and begged\" the ABC record label to put their song \"Don't Bogart That Joint\" on a single, agreeing to change the title to \"Don't Bogart Me.\" On the origin on the song, he said, \"The band was smoking some pot in our rehearsal house up in Laurel Canyon, when Elliot [Ingber] turned to me and said, 'Hey man, don’t bogart that thing.' I asked him, what does ‘bogart’ mean? He said, “You know, like Humphrey Bogart always had a cigarette in his hand or hanging from his lips when talking. Well, you were hanging onto that joint while your lips were flapping.' I said, 'Cool, we should write a song using Bogart.'\"  Source."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bogart (plural bogarts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An obnoxious, selfish and overbearing person; an attention hog.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bogart (third-person singular simple present bogarts, present participle bogarting, simple past and past participle bogarted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To selfishly take or keep something; to hog; especially to hold a joint (marijuana) dangling between the lips instead of passing it on.",
                  "examples": [
                    "Dude, don’t bogart the chocolate fudge!",
                    "Don’t bogart the can, man."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) To get something by bullying, intimidation; be a tough guy.",
                  "examples": [
                    "He tried to bogart his way in."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}