{
  "word": "disembarrass",
  "etymologies": [
    {
      "description": [
        "From dis- +‎ embarrass."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "disembarrass (third-person singular simple present disembarrasses, present participle disembarrassing, simple past and past participle disembarrassed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get (someone) out of a difficult or embarrassing situation; to free (someone) from the embarrassment (of a situation); to relieve (someone of a burden, item of clothing, etc.) (often used reflexively).",
                  "examples": [
                    "[…]  I hope  […]  that you will have disembarrassed yourself of all sort of business that may detain you here, and so be ready to go with us  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To free (something) from complication.",
                  "examples": [
                    "[…]  that we might disembarrass the Style as much as possible, we have taken the liberty to transpose Parentheses and other perplexed Passages, so as to clear and reduce them to continued Sentences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To disentangle (two things); to distinguish.",
                  "examples": [
                    "[…]  though it be difficult to distinguish genuine Virtue from spurious, they having both the same appearance, and both the same public effects, yet they may be disembarrassed. If it be asked, by what means? He replies  […]  By Conscience  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}