{
  "word": "boil",
  "etymologies": [
    {
      "description": [
        "From Middle English bile, büle (“boil, tumor”), from Old English bȳl, bȳle (“boil, swelling”), from Proto-Germanic *būlijō, *būlō (“boil”). Akin to Dutch buil (“boil, swelling”), German Beule (“boil, hump”), Icelandic beyla (“swelling, hump”). The expected form is bile; the rounding of the diphthong could be caused by the initial b- and/or by association with etymology 2."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boil (plural boils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A localized accumulation of pus in the skin, resulting from infection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English boillen, from Old French boillir (French: bouillir) from Latin bullīre, present active infinitive of bulliō (“I bubble, boil”), from bulla (“bubble”). Displaced native Old English weallan (intransitive) and wiellan (transitive). More at wall, well."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boil (plural boils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point at which fluid begins to change to a vapour; the boiling point.",
                  "examples": [
                    "Add the noodles when the water comes to the boil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dish of boiled food, especially seafood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A social event at which people gather to boil and eat food, especially seafood. (Compare a bake or clambake.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, nonstandard) The collective noun for a group of hawks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, archaic) A bubbling.",
                  "examples": [
                    "He swam to the place where Mary disappeared but there was neither boil nor gurgle on the water, nor even a bell of departing breath, to mark the place where his beloved had sunk."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boil (third-person singular simple present boils, present participle boiling, simple past and past participle boiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of liquids) To heat to the point where it begins to turn into a gas.",
                  "examples": [
                    "Boil some water in a pan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To cook in boiling water.",
                  "examples": [
                    "Boil the eggs for three minutes.",
                    "Is the rice boiling yet?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of liquids) To begin to turn into a gas, seethe.",
                  "examples": [
                    "Pure water boils at 100 degrees Celsius."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK, informal) To bring to a boil, to heat so as to cause the contents to boil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal, used only in progressive tenses, of weather) To be uncomfortably hot.",
                  "examples": [
                    "It’s boiling outside!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal, used only in progressive tenses) To feel uncomfortably hot.",
                  "examples": [
                    "I’m boiling in here – could you open the window?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form, or separate, by boiling or evaporation.",
                  "examples": [
                    "to boil sugar or salt"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To steep or soak in warm water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be agitated like boiling water; to bubble; to effervesce.",
                  "examples": [
                    "the boiling waves of the sea"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be moved or excited with passion; to be hot or fervid.",
                  "examples": [
                    "His blood boils with anger."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}