{
  "word": "philopena",
  "etymologies": [
    {
      "description": [
        "The origin of philopena is unclear. Despite its appearance, it is not formed from classical roots. The traditional game seems to have originated in Germany, and to have included a formulatic greeting, guten Morgen Vielliebchen (“Good morning, sweetheart”), with Vielliebchen being accepted into French as a proper name, and the game's tag becoming Bonjour Philippine.",
        "A different account suggests that the word began as the French Valentin(e), with the nut exchanged considered as a St. Valentine's Day gift; Valentine became Philipine and was accepted in this form into Mosel Franconian dialects of German (Luxemburger Wörterbuch (1950) I.370, Philippchen). However, the OED disputes this, arguing that Valentine in French may mean “sweetheart”, but does not mean “gift” or “lover's gift”, and wondering in addition what pressure would confuse the familiar French given names Valentin(e) and Philip(e)(pine).",
        "The OED also lists forms in Dutch (filippien), Danish (filippine), and Swedish (filipin) denoting either the game or an almond or nut with a double kernel. These citations date from the mid-nineteenth century to the early twentieth century, and the meaning referring to the game is usually attested to earliest."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "philopena (plural philopenas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A game in which a person, on finding a double-kernelled almond or nut, may offer the second kernel to another person and demand a playful forfeit from that person to be paid on their next meeting. The forfeit may simply be to exchange the greeting \"Good-day, Philopena\" or it may be more elaborate. Philopenas were often played as a form of flirtation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The occasion on which a philopena is forfeited; the forfeit paid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A nut or almond with a double kernel, as used to set a philopena.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}