{
  "word": "dirk",
  "etymologies": [
    {
      "description": [
        "Etymology unknown, apparently from Scots drik.\nFirst attested in 1602 as dork, in the later 17th century as durk. The spelling dirk is due to Johnson's Dictionary of 1755.",
        "Early quotations as well as Johnson 1755 suggest that the word is of Scottish Gaelic origin, but no such Gaelic word is known. The Gaelic name for the weapon is biodag. Gaelic duirc is merely an 18th-century adoption of the English word.",
        "A possible derivation is from the Scandinavian personal name Dirk (short for Diederik), which is used of lock-picking tools (but not of knives or daggers)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dirk (plural dirks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long Scottish dagger with a straight blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midwestern US, dated, slang) A penis; dork.",
                  "examples": [
                    "The word dick itself serves as model for two variants which are probably Midwestern, dirk and dork, also meaning \"penis\"..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midwestern US, dated, slang) A socially unacceptable person; an oddball.",
                  "examples": [
                    "...on at least one Midwestern campus a dirk may be an \"oddball\" student, while a prick (more common) is of course an offensive one."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dirk (third-person singular simple present dirks, present participle dirking, simple past and past participle dirked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stab with a dirk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To darken.",
                  "examples": [
                    "The beaute the whiche clothes a derknesse of a forleten and despised elde hadde duskid and dirked, as it is wont to dirken besmokede ymages"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}