{
  "word": "pray",
  "etymologies": [
    {
      "description": [
        "From Middle English preien, from Anglo-Norman preier, from Old French preier, proier, (French prier), from Latin precārī, from prex, precis (“a prayer, a request”), from Proto-Italic *preks, from Proto-Indo-European *preḱ- (“to ask, woo”).",
        "Cognate via Indo-European of Old English frignan, fricgan, German fragen, Dutch vragen. Compare deprecate, imprecate, precarious."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pray (third-person singular simple present prays, present participle praying, simple past and past participle prayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) To direct words, thoughts, or one's attention to God or any higher being, for the sake of adoration, thanks, petition for help, etc.",
                  "examples": [
                    "Muslims pray in the direction of Mecca."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To humbly beg a person for aid or their time.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To ask earnestly for; to seek to obtain by supplication; to entreat for.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To wish or hope strongly for a particular outcome.",
                  "examples": [
                    "She is praying that the Red Sox will win tonight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To implore, to entreat, to request.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Ellipsis of I pray you, I pray thee, whence also prithee."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "pray (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or formal) Please; used to make a polite request",
                  "examples": [
                    "pray silence for…"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of pray tell (“I ask you (insincerely)”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}