{
  "word": "rectify",
  "etymologies": [
    {
      "description": [
        "From Middle English rectifien, from Anglo-Norman rectifiier, rectefier (“to make straight”), from Medieval Latin rēctificō (“to make right”), from Latin rēctus (“straight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rectify (third-person singular simple present rectifies, present participle rectifying, simple past and past participle rectified)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To heal (an organ or part of the body). [14th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restore (someone or something) to its proper condition; to straighten out, to set right. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remedy or fix (an undesirable state of affairs, situation etc.). [from 15th c.]",
                  "examples": [
                    "to rectify the crisis"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, chemistry) To purify or refine (a substance) by distillation. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To correct or amend (a mistake, defect etc.). [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To correct (someone who is mistaken). [from 16th c.]",
                  "examples": [
                    "For thus their Sense informeth them, and herein their Reason cannot Rectifie them; and therefore hopelessly continuing in mistakes, they live and die in their absurdities  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, geodesy, historical) To adjust (a globe or sundial) to prepare for the solution of a proposed problem. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, electronics) To convert (alternating current) into direct current. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mathematics) To determine the length of a curve included between two limits.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To produce (as factitious gin or brandy) by redistilling bad wines or strong spirits (whisky, rum, etc.) with flavourings.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}