{
  "word": "proceed",
  "etymologies": [
    {
      "description": [
        "From Middle English proceden, from Old French proceder, from Latin prōcēdō (“I go forth, go forward, advance”), from prō (“forth”) + cēdō (“I go”); see cede."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "proceed (third-person singular simple present proceeds, present participle proceeding, simple past and past participle proceeded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move, pass, or go forward or onward; to advance; to carry on",
                  "examples": [
                    "to proceed on a journey"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pass from one point, topic, or stage, to another.",
                  "examples": [
                    "to proceed with a story or argument"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come from; to have as its source or origin.",
                  "examples": [
                    "Light proceeds from the sun."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go on in an orderly or regulated manner; to begin and carry on a series of acts or measures; to act methodically",
                  "examples": [
                    "He that proceeds upon others’ principles in his enquiry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be transacted; to take place; to occur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a rule) To be applicable or effective; to be valid.",
                  "examples": [
                    "[This rule] only proceeds and takes place, when a person cannot of common Right condemn or bind another by his Sentence."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, intransitive) To begin and carry on a legal process.",
                  "examples": [
                    "“Gentlemen, shall we proceed?” the judge said. From the beginning, Judge Fong appeared bored at Levine's coaxing remarks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take an academic degree.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}