{
  "word": "quoin",
  "etymologies": [
    {
      "description": [
        "Variant of coin; compare coign."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "quoin (plural quoins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the corner building blocks of a building, usually larger or more ornate than the surrounding blocks.",
                  "examples": [
                    "In Casterbridge there stood a noble pile,  […] But evil days beset that domicile;The stately beauties of its roof and wallPassed into sordid hands. Condemned to fallWere cornice, quoin, and cove,And all that art had wove in antique style."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The keystone of an arch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A metal wedge which fits into the space between the type and the edge of a chase, and is tightened to fix the metal type in place.",
                  "examples": [
                    "Next fit the quoins, using the “persuader” to squeeze in the pages, and tap up all around."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, nautical) A form of wedge used to prevent casks from moving",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(firearms) A wedge of wood or iron put under the breech of heavy guns or the muzzle of siege-mortars to raise them to the proper level.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horticulture) A number of apple varieties with a distinctive ribbed appearance, like corners of a coin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "quoin (third-person singular simple present quoins, present participle quoining, simple past and past participle quoined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wedge or steady with quoins.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}