{
  "word": "lawn",
  "etymologies": [
    {
      "description": [
        "Early Modern English laune (“turf, grassy area”), alteration of laund (“glade”), from Middle English launde, from Old French lande (“heath, moor”), of Germanic or Gaulish origin, from Proto-Germanic *landą (“land”) or Proto-Celtic *landā, both from Proto-Indo-European *lendʰ- (“land, heath”).",
        "Akin to Breton lann (“heath”), Old Norse & Old English land. Doublet of land."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lawn (countable and uncountable, plural lawns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(England, historical or regional) An open space between woods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ground (generally in front of or around a house) covered with grass kept closely mown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) An overgrown agar culture, such that no separation between single colonies exists.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Apparently from Laon, a French town known for its linen manufacturing, from Old French Lan, from Latin Laudunum, a Celtic name cognate with Lugdunum."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lawn (countable and uncountable, plural lawns)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A type of thin linen or cotton.",
                  "examples": [
                    "He looked through the glass at the fire, set it down on the end of the desk and wiped his lips with a sheer lawn handkerchief."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) Pieces of this fabric, especially as used for the sleeves of a bishop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A piece of clothing made from lawn.",
                  "examples": [
                    "[…]  she was as the wild yoncopin to the calla lily. Marjie knew how to dress. To-day, shaded by the buggy-top, in her dainty light blue lawn, with the soft pink of her cheeks and her clear white brow and throat, she was a most delicious thing  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}