{
  "word": "pupil",
  "etymologies": [
    {
      "description": [
        "From Middle English pupille, from Anglo-Norman pupille (“orphan”), from Latin pūpillus (“orphan, minor”), variant of pūpulus (“little boy”), from pūpus (“child, boy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pupil (plural pupils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated outside UK) A learner at a school under the supervision of a teacher.",
                  "examples": [
                    "The Pupil after his Pupillarity, had granted a Diſcharge to one of the Co-tutors, which did extinguiſh the whole Debt of that Co-tutor, and conſequently of all the reſt, they being all correi debendi, lyable by one individual Obligation, which cannot be Diſcharged as to one, and ſtand as to all the reſt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who studies under supervision of a renowned expert in their field.",
                  "examples": [
                    "Plato was Socrates' pupil, and in turn Aristotle was Plato's pupil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, obsolete) An orphan who is a minor and under the protection of the state.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English pupille, from Old French pupille, from Latin pūpilla (“pupil; little girl, doll”), named because of the small reflected image seen when looking into someone's eye."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pupil (plural pupils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) The hole in the middle of the iris of the eye, through which light passes to be focused on the retina.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The central dark part of an ocellated spot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}