{
  "word": "morphology",
  "etymologies": [
    {
      "description": [
        "From morpho- +‎ -logy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "morphology (countable and uncountable, plural morphologies)",
          "definitionGroups": [
            {
              "group": "(uncountable) A scientific study of form and structure, usually without regard to function. Especially:",
              "entries": [
                {
                  "meaning": "(linguistics) The study of the internal structure of morphemes (words and their semantic building blocks).",
                  "examples": [
                    "There are many ways to show that word structure is different from phrase and sentence structure. We will mention two here. First, free constituent order in syntax is common cross-linguistically; many languages lack fixed order of the kind that one finds in English. In morphology, on the other hand, order is always fixed. There is no such thing as free morpheme order. Even languages with wildly free word order, such as the Pama-Nyungan (Australian) language Warlpiri (Simpson 1991), have a fixed order of morphemes within the word. Second, syntactic and morphological patterns can differ within the same language. For example, note the difference in English in the positioning of head and complement between syntax and morphology."
                  ]
                },
                {
                  "meaning": "(biology) The study of the form and structure of animals and plants.",
                  "examples": []
                },
                {
                  "meaning": "(geology) The study of the structure of rocks and landforms.",
                  "examples": []
                },
                {
                  "meaning": "(mathematics) Mathematical morphology.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The form and structure of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A description of the form and structure of something.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}