{
  "word": "aggregate",
  "etymologies": [
    {
      "description": [
        "From Latin aggregātus, perfect passive participle of aggregō (“I flock together”), from ag- (combining form of ad (“to, toward”)) + gregō (“I flock or group”), from grex (“flock”). Compare gregarious."
      ],
      "adjectives": [
        {
          "description": "aggregate (comparative more aggregate, superlative most aggregate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Formed by a collection of particulars into a whole mass or sum; collective; combined; added up.",
                  "examples": [
                    "All over the country small British columns had been operating during these months--operations which were destined to increase in scope and energy as the cold weather drew in. The weekly tale of prisoners and captures, though small for any one column, gave the aggregate result of a considerable victory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consisting or formed of smaller objects or parts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Formed into clusters or groups of lobules.",
                  "examples": [
                    "aggregate glands"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Composed of several florets within a common involucre, as in the daisy; or of several carpels formed from one flower, as in the raspberry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the several component parts adherent to each other only to such a degree as to be separable by mechanical means.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "United into a common organized mass; said of certain compound animals.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "aggregate (countable and uncountable, plural aggregates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mass, assemblage, or sum of particulars; something consisting of elements but considered as a whole.",
                  "examples": [
                    "If the nebulosity were due to an aggregate of stars so far off as to be separately indistinguishable, then the central body would have to be a star of almost incomparably greater dimensions than an ordinary star; if, on the other hand, the central body were of dimensions comparable with those of an ordinary star, the nebulosity must be due to something other than a star cluster."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mass formed by the union of homogeneous particles; – in distinction from a compound, formed by the union of heterogeneous particles.",
                  "examples": [
                    "This in the second boiling will be replaced by nearly an equal quantity of worts, of the same gravity as turned out of the copper, which, in making the calculation, is to be deducted from the aggregate of the second worts, and so on with a third wort if necessary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, obsolete) A set (collection of objects).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) The full chromatic scale of twelve equal tempered pitches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The total score in a set of games between teams or competitors, usually the combination of the home and away scores.",
                  "examples": [
                    "Synonym: agg"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) Crushed stone, crushed slag or water-worn gravel used for surfacing a built-up roof system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Solid particles of low aspect ratio added to a composite material, as distinguished from the matrix and any fibers or reinforcements; especially the gravel and sand added to concrete.",
                  "examples": [
                    "\"Yes sair,\" returned the Frenchman, whose prominent eyes were watching the precarious footsteps of the beast he rode, as it picked its dangerous way among the roots of trees, holes, log bridges, and sloughs that formed the aggregate of the highway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Buddhism) Any of the five attributes that constitute the sentient being.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mechanical mixture of more than one phase.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "aggregate (third-person singular simple present aggregates, present participle aggregating, simple past and past participle aggregated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring together; to collect into a mass or sum.",
                  "examples": [
                    "The aggregated soil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To add or unite (e.g. a person), to an association.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To amount in the aggregate to.",
                  "examples": [
                    "There are ten loads, aggregating five hundred bushels."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}