{
  "word": "meteor",
  "etymologies": [
    {
      "description": [
        "From Middle French météore, from Old French, from Latin meteorum, from Ancient Greek μετέωρον (metéōron), from μετέωρος (metéōros, “raised from the ground, hanging, lofty”), from μετά (metá, “in the midst of, among, between”) (English meta) + ἀείρω (aeírō, “to lift, to heave, to raise up”).",
        "The original sense of “atmospheric phenomenon” gave rise to meteorology, but the meaning of \"meteor\" is now restricted to extraterrestrial objects burning up as they enter the atmosphere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "meteor (plural meteors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now meteorology) An atmospheric or meteorological phenomenon. These were sometimes classified as aerial or airy meteors (winds), aqueous or watery meteors (hydrometeors: clouds, rain, snow, hail, dew, frost), luminous meteors (rainbows and aurora), and igneous or fiery meteors (lightning and shooting stars). [from 16th c.]",
                  "examples": [
                    "The twilight, the meteors call'd fire-balls, or flying dragons, and the northern lights, inhabit the higher regions of the atmosphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fast-moving streak of light in the night sky caused by the entry of extraterrestrial matter into the earth's atmosphere; a shooting star or falling star. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) A prop similar to poi balls, in that it is twirled at the end of a cord or cable.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(martial arts) A striking weapon resembling a track and field hammer consisting of a weight swung at the end of a cable or chain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any short-lived source of wonderment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "meteor (third-person singular simple present meteors, present participle meteoring, simple past and past participle meteored)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move at great speed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}