{
  "word": "abandonment",
  "etymologies": [
    {
      "description": [
        "From French abandonnement, from abandonner (“to abandon, relinquish”). abandonner was originally equivalent to mettre à bandon (“to leave to the jurisdiction, i.e. of another”), bandon being from Medieval Latin bandum, bannum (“order, decree, ban”). Equivalent to abandon +‎ -ment. (See also English banns.)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abandonment (countable and uncountable, plural abandonments)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of abandoning, or the state of being abandoned; total desertion; relinquishment. [Late 16th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The voluntary leaving of a person to whom one is bound by a special relation, as a wife, husband or child; desertion.",
                  "examples": [
                    "Since he left her, she's suing him for divorce on grounds of abandonment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abandoned building or structure.",
                  "examples": [
                    "High-profile abandonments are harder to infiltrate for urban explorers due to their heightened security."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The relinquishment of a right, claim, or privilege; relinquishment of right to secure a patent by an inventor; relinquishment of copyright by an author. [Early 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The relinquishment by the insured to the underwriters of what may remain of the property insured after a loss or damage by a peril insured against. [Early 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cessation of service on a particular segment of the lines of a common carrier, as granted by a government agency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A refusal to receive freight so damaged in transit as to be worthless and render carrier liable for its value.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The self-surrender to an outside influence. [Mid 19th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abandon; careless freedom or ease; surrender to one's emotions. [Mid 19th century.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}