{
  "word": "download",
  "etymologies": [
    {
      "description": [
        "From down +‎ load."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "download (plural downloads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A file transfer to a given computer or device from a remote one through a network connection.",
                  "examples": [
                    "The download took longer than I expected."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A file that has been or is intended to be transferred in this way.",
                  "examples": [
                    "I got the download but it wouldn't work on my computer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "download (third-person singular simple present downloads, present participle downloading, simple past and past participle downloaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To transfer data to a given computer from a remote one via a network.",
                  "examples": [
                    "Voiceover: You wouldn't steal a handbag. You wouldn't steal a car. You wouldn't steal a baby. You wouldn't shoot a policeman and then steal his helmet. You wouldn't go to the toilet in his helmet and then send it to the policeman's grieving widow and then steal it again. Downloading films is stealing. If you do it you WILL face the consequences.Roy: Man, these anti-piracy ads are getting really mean."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nonstandard) Synonym of upload: to send data from a given computer to a remote one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nonstandard) Synonym of copy: to transfer data to or from removable media.",
                  "examples": [
                    "When I was your age, there were no flash drives. I needed to download photos to a CD-ROM."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nonstandard) Synonym of install: to load software forced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, firearms) To load a gun (especially a muzzle-loader) with less propellant than its designed load.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}