{
  "word": "baron",
  "etymologies": [
    {
      "description": [
        "From Middle English baroun, from Old French baron, Medieval Latin barō, from Frankish *barō (“servant, man, warrior”), perhaps from Proto-Germanic *barô (“carrier, bearer”), from Proto-Indo-European *bʰer- (“to bear”). Cognate with Old High German baro (“human being, man, freeman”), and perhaps to Old English beorn (“man, warrior”). Used in early Germanic law in the sense of \"man, human being\".",
        "A Celtic origin has also been suggested, due to the occurrence of a Latin barones (“military official”) as early as the first century (Cornutus, On Persius' Fifth Satire). However, the OED takes this hypothetical Proto-Celtic *bar- (“hero”) to be a figment."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "baron (plural barons, feminine baroness)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male ruler of a barony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male member of the lowest rank of English nobility (the equivalent rank in Scotland is lord).",
                  "examples": [
                    "Coordinate terms: don, duke, earl, lord, prince, baronet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A person of great power in society, especially in business and politics.",
                  "examples": [
                    "Synonyms: magnate, tycoon; see also Thesaurus:important person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, prison slang) A prisoner who gains power and influence by lending or selling goods such as tobacco.",
                  "examples": [
                    "The first thing a baron does is to accumulate a supply of tobacco. He spends every penny he can earn on laying it in  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A baron of beef, a cut made up of a double sirloin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various nymphalid butterflies of the genus Euthalia.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, obsolete) A husband.",
                  "examples": [
                    "Coordinate term: wife",
                    "baron and feme ― husband and wife"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}