{
  "word": "mateship",
  "etymologies": [
    {
      "description": [
        "From mate +‎ -ship. Cognate with Dutch maatschap (“partnership”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mateship (usually uncountable, plural mateships)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable, nautical) The post of mate on a ship; a posting as mate.",
                  "examples": [
                    "Paul Jones profited by his brother′s position and counsel to improve himself in navigation and other professional studies, and was so successful in the endeavour, that he was deemed worthy of being appointed, on his return to Whitehaven, to a third mateship in a vessel in the slave-trade."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, whaling, obsolete) A type of contract between ships to cooperate and share the proceeds of an expedition.",
                  "examples": [
                    "[…] as, for instance, the contract termed mateship, by which one whaling-ship meeting another forms a partnership in the proceeds of the expedition."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Fellowship; companionship.",
                  "examples": [
                    "“Don′t mind if I do,” I answered, and thus begun a mateship that in the course of the next few months was to yield to each of us a fairly big experience of adventure, and, what was more acceptable to me, a good round sum in cash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, Australia, New Zealand) Friendship, particularly between men, such as develops in shared adversity; solidarity.",
                  "examples": [
                    "In traditional Australian culture, “mateship” was expected to bind people not only with their “best mates” or their “great mates” but also with their fellow-miners, fellow-shearers, fellow-“diggers”, fellow-soldiers, or fellow-footballers, and this expectation is one of this culture′s most enduring and characteristic features.19"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, zoology, psychology, anthropology) A relationship based on mating.",
                  "examples": [
                    "The mateships of the three last-named animals are solitary, though in the case of wolves, the separated members of various mateships gather in packs during the winter months."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}