{
  "word": "fishtail",
  "etymologies": [
    {
      "description": [
        "From Middle English fisch tayle, equivalent to fish +‎ tail."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fishtail (plural fishtails)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tail of a fish, or an object resembling this.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The skidding of the back of a vehicle from side to side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of chisel with a flared blade.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for fishtail palm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fishtail (third-person singular simple present fishtails, present participle fishtailing, simple past and past participle fishtailed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To swing the back of a vehicle (originally an aircraft) from side to side.",
                  "examples": [
                    "As we approached the runway, the pilot fishtailed slightly to reduce landing speed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause the back of (a vehicle) to swing from side to side.",
                  "examples": [
                    "But Bruce wasn't done baiting the jocks. He fishtailed the car; it swerved and reversed direction, heading straight for the three jocks who were chasing them on foot. It looked like he was going to run the car over the three men."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move with the tail swinging from side to side in this way.",
                  "examples": [
                    "A large black and gold butterfly fish-tailed in and landed on a hydrangea bush almost at my elbow, moved its wings slowly up and down a few times, then took off heavily  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}