{
  "word": "ensemble",
  "etymologies": [
    {
      "description": [
        "Borrowed from French ensemble."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ensemble (plural ensembles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of separate things that contribute to a coordinated whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fashion) A coordinated costume or outfit; a suit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A group of musicians, dancers, actors, etc who perform together; e.g. the chorus of a ballet company.",
                  "examples": [
                    "On paper, Continental Drift boasts a jaw-dropping voice cast, including but not limited to Jennifer Lopez, Patrick Stewart, Wanda Sykes, Aziz Ansari, Simon Pegg, Nick Frost, Nicki Minaj, Drake, and Alan Tudyk. But in practice, the overstuffed ensemble leaves the cast no room to distinguish themselves, and directors Steve Martino and Michael Thurmeier don’t seem interested in coaxing performances that might render their money stars less identifiable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A piece for several instrumentalists or vocalists.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics, physics) A probability distribution for the state of the system.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(machine learning) A supervised learning algorithm combining multiple hypotheses.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "ensemble (third-person singular simple present ensembles, present participle ensembling, simple past and past participle ensembled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put together in a coordinated whole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To perform in a musical ensemble.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}