{
  "word": "ambient",
  "etymologies": [
    {
      "description": [
        "From Latin ambiēns (“going around”), from ambiō (“go around”)."
      ],
      "adjectives": [
        {
          "description": "ambient (comparative more ambient, superlative most ambient)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Encompassing on all sides; surrounding; encircling; enveloping.",
                  "examples": [
                    "A cup of warm tea eventually cools to the ambient temperature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Evoking or creating an atmosphere: atmospheric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to, or suitable for, storage at room temperature.",
                  "examples": [
                    "ambient food",
                    "ambient warehousing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Containing objects or describing a setting that one is interested in.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "ambient (countable and uncountable, plural ambients)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something that surrounds; encompassing material, substance or shape.",
                  "examples": [
                    "Much after this same manner, when the Air is exceeding cold through which it passes; do we find the drops of Rain, falling from the Clouds, congealed into round Hail-stones by the freezing Ambient."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) The atmosphere; the surrounding air or sky; atmospheric components collectively such as air, clouds, water vapour, hail, etc.",
                  "examples": [
                    "It might be also, that attracted by that great void Vacuum ... all the ambients would be rarified, and particularly, the air."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, music) A type of modern music that creates a relaxing and peaceful atmosphere.",
                  "examples": [
                    "Ambient can be flabby synth mulch that needs to access cyberism and external philosophies to convince you you're not being scammed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}