{
  "word": "greave",
  "etymologies": [
    {
      "description": [
        "From Middle English greve, from Old English grǣfe, grǣfa (“bush, bramble, grove, thicket, copse, brush-wood (for burning), fuel”), probably related to Proto-Germanic *grōbō (“ditch, hole”).",
        "Cognate with Scots greve, greave (“grove”). Compare also Proto-Germanic *grainiz (“twig”), of unknown origin, whence Old Norse grein (“branch, bough”). Closely related to Old English grāf, grāfa (“grove”). See grove."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "greave (plural greaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bush; a tree; a grove.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A bough; a branch.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English greve, greyve, from Old English grǣfa, grēfa (“pit, cave, hole, grave, trench”), from Proto-Germanic *grōbō (“pit, ditch”), from Proto-Indo-European *gʰrebʰ- (“to dig, scratch, scrape”). Cognate with North Frisian groop (“pit, sewer, gutter”), Dutch groef (“pit, hole, gutter”), German Grube (“pit, hole”), Icelandic gröf (“pit, grave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "greave (plural greaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A ditch or trench.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English greve, grayve, from Old French greve (“shin”), of uncertain origin; possibly from Egyptian Arabic جورب‎ (“stocking, leg cover”). Watkins suggests a connection with greve (“part in the hair”), due to the resemblance of the medial ridge to a part in the hair, from graver (“to part (the hair); engrave”), of Germanic origin, from Frankish *graban (“to engrave”); if so, related to Etymology 2 above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "greave (plural greaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of armour that protects the leg, especially the shin, and occasionally the tops of the feet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From greaves (“residue left after animal fat has been rendered”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "greave (third-person singular simple present greaves, present participle greaving, simple past and past participle greaved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To clean (a ship's bottom); to grave.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}