{
  "word": "defile",
  "etymologies": [
    {
      "description": [
        "From Late Middle English defilen (“to make dirty, befoul; to contaminate (the body or an organ) with dirt or disease; to pollute morally or spiritually; to desecrate, profane; to violate (the sanctity of marriage, an agreement or oath, etc.); to rape; to slander; to abuse; to destroy; to injure; to treat unfairly, oppress”) [and other forms], a variant of defoulen (“to make dirty, defile, pollute; to contaminate (the body or an organ) with dirt or disease; to pollute morally or spiritually; to desecrate, profane; to violate (the sanctity of marriage, an agreement or oath, etc.); to have sexual intercourse with; to rape; etc.”) (compare also defoilen). Defoulen is derived from Old French defouler (“to trample; to oppress; to outrage; to pollute; to violate”), from de- (prefix indicating actions are done more strongly or vigorously) + fouler (“to trample, tread on; to mistreat, oppress”), foler (“to destroy; to mistreat”) (from Vulgar Latin fullare (“to full (make cloth denser and firmer by soaking, beating, and pressing)”), from Latin fullō (“person who fulls cloth, fuller”); further etymology uncertain, possibly from Proto-Indo-European *bʰleh₃- (“to blow; to inflate, swell; to bloom, flower”) or Etruscan 𐌖𐌋𐌖𐌘 (fulu)). The English word is analysable as de- (intensifying prefix) +‎ file (“(archaic) to corrupt; to defile”).",
        "The Middle English word defilen was probably formed from defoulen on the analogy of befilen (“to make dirty, befoul; to corrupt; to violate one's chastity; to desecrate; to slander”) and befoulen (“to make dirty, befoul; to violate one's chastity; to vilify”),, respectively from filen (“to make foul, impure, or unclean, pollute; to pollute morally or spiritually; to desecrate, profane; to have sexual intercourse with; to rape; etc.”) and foulen (“to make dirty, pollute; to become dirty; to defecate; to deface or deform; to pollute morally or spiritually; to damage, injure; to destroy; to treat unfairly, oppress; to tread on, trample”). Filen and foulen are respectively from Old English fȳlan (“to befoul, defile, pollute”) and fūlian (“to foul”), both from Proto-West Germanic *fūlijan (“to make dirty, befoul”), from Proto-Germanic *fūlijaną (“to make dirty, befoul”), from *fūlaz (“dirty, foul; rotten”), from Proto-Indo-European *puH- (“foul; rotten”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "defile (third-person singular simple present defiles, present participle defiling, simple past and past participle defiled)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To make (someone or something) physically dirty or unclean; to befoul, to soil.",
                  "examples": [
                    "Synonyms: contaminate, pollute, spoil, sully; see also Thesaurus:dirty",
                    "Antonyms: clean, purify; see also Thesaurus:make clean"
                  ]
                },
                {
                  "meaning": "To make (someone or something) morally impure or unclean; to corrupt, to tarnish.",
                  "examples": []
                },
                {
                  "meaning": "To act inappropriately towards or vandalize (something sacred or special); to desecrate, to profane.",
                  "examples": [
                    "Synonyms: see Thesaurus:desecrate",
                    "Antonyms: hallow, sanctify; see also Thesaurus:consecrate",
                    "To urinate on someone’s grave is an example of a way to defile it."
                  ]
                },
                {
                  "meaning": "(religion) To cause (something or someone) to become ritually unclean.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": [
                    "Synonyms: ravish, violate, (archaic) vitiate",
                    "The serial rapist kidnapped and defiled a six-year-old girl."
                  ]
                },
                {
                  "meaning": "To deprive (someone) of their sexual chastity or purity, often not consensually; to deflower, to rape.",
                  "examples": [
                    "Synonyms: ravish, violate, (archaic) vitiate",
                    "The serial rapist kidnapped and defiled a six-year-old girl."
                  ]
                },
                {
                  "meaning": "To dishonour (someone).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive, obsolete)",
              "entries": [
                {
                  "meaning": "To become dirty or unclean.",
                  "examples": []
                },
                {
                  "meaning": "To cause uncleanliness; specifically, to pass feces; to defecate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is borrowed from French défiler (“to march; to parade”), from dé- (prefix indicating actions are done more strongly or vigorously) + one or both of the following:",
        "The noun is borrowed from French défilé (“parade, procession”), a noun use of the past participle of défiler (verb); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "defile (plural defiles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A narrow passage or way (originally (military), one which soldiers could only march through in a single file or line), especially a narrow gorge or pass between mountains.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(military)",
              "entries": [
                {
                  "meaning": "An act of marching in files or lines.",
                  "examples": []
                },
                {
                  "meaning": "A single file of soldiers; (by extension) any single file.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "defile (third-person singular simple present defiles, present participle defiling, simple past and past participle defiled) (military, also figuratively)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To march in a single file or line; to file.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To march across (a place) in files or lines.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is borrowed from French défiler (“to arrange soldiers or fortify (something) as a protection from enfilading fire; to unthread”) (compare Middle French desfilher (“to unthread”)), from dé- (prefix meaning ‘not’) + enfiler (“to rake with gunfire, enfilade; to string on to a thread; to thread (a needle)”) (from en- (prefix meaning ‘in, into; on, on to’) + filer (verb) or file (noun); see etymology 2).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "defile (plural defiles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, rare) An act of defilading a fortress or other place, or of raising the exterior works in order to protect the interior.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "defile (third-person singular simple present defiles, present participle defiling, simple past and past participle defiled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military, rare) Synonym of defilade (“to fortify (something) as a protection from enfilading fire”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}