{
  "word": "slitch",
  "etymologies": [
    {
      "description": [
        "From Middle English sliche, slicche, slycche, from Old English *slīċ, from Proto-West Germanic *slīk, from Proto-Germanic *slīką, from Proto-Indo-European *sleyg- (“to be slick; slide, slip”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slitch (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal, rare) Fine mud; silt; slake.",
                  "examples": [
                    "This would be the properest Manure for their Sandy Land, if they spread it not too thick, theirs being, as I have said, a shallow sandy Soil, which was the Reason I never advis'd any to use Lime,  […]  But as most Lands have one Swamp or another bordering on them, they may certainly get admirable Slitch, wherewith to manure all their Up-Lands.\nDeBow's Review (James Dunwoody Brownson De Bow, Edwin Bell, 1858), volume 25, page 206, quotes this and glosses slitch as \"marsh-mud\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Blend of slut +‎ bitch; coined by American science fiction author Robert Heinlein in 1982 in the novel Friday."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "slitch",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, nonce word) A slutty bitch.",
                  "examples": [
                    "When she came back, her father inquired who had made the call. The daughter replied that it was that ‘old slitch, Mrs Blank’. I was much puzzled by the word ‘slitch’ and wondered if I had heard correctly. I rather diffidently inquired as to the meaning of the word. The Consul General gave me a piercing look. A ‘slitch,’ he said, ‘is our own little private, personal family word for a cross between a slut and a bitch.’ I do not think I have ever been so surprised in my life."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}