{
  "word": "witness",
  "etymologies": [
    {
      "description": [
        "From Middle English witnesse, from Old English ġewitnes, equivalent to wit +‎ -ness. Cognate with Middle Dutch wetenisse (“witness, testimony”), Old High German gewiznessi (“testimony”), literary German gewissen (“to witness”), Icelandic vitni (“witness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "witness (countable and uncountable, plural witnesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Attestation of a fact or event; testimony.",
                  "examples": [
                    "She can bear witness, since she was there at the time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One who sees or has personal knowledge of something.",
                  "examples": [
                    "As a witness to the event, I can confirm that he really said that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, law) Someone called to give evidence in a court.",
                  "examples": [
                    "The witness for the prosecution did not seem very credible."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) One who is called upon to witness an event or action, such as a wedding or the signing of a document.",
                  "examples": [
                    "The bridesmaid and best man at a wedding typically serve as the witnesses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that serves as evidence; a sign or token.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "witness (third-person singular simple present witnesses, present participle witnessing, simple past and past participle witnessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To furnish proof of, to show.",
                  "examples": [
                    "This certificate witnesses his presence on that day."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take as evidence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To see or gain knowledge of through experience.",
                  "examples": [
                    "He witnessed the accident."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, construed with to or for) To present personal religious testimony; to preach at (someone) or on behalf of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To see the execution of (a legal instrument), and subscribe it for the purpose of establishing its authenticity.",
                  "examples": [
                    "to witness a bond or a deed"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}