{
  "word": "pique",
  "etymologies": [
    {
      "description": [
        "The verb is borrowed from French piquer (“to prick, sting; to anger, annoy; (reflexive) to get angry; to provoke, stimulate; (reflexive) to boast about”), from Middle French piquer, picquer (“to prick, sting; to anger, annoy; (reflexive) to get angry”), from Old French piquer (“to pierce with the tip of a sword”), from proto-Romance or Vulgar Latin *pīccare (“to sting; to strike”) or *pikkāre, and then either:",
        "The noun is borrowed from Middle French pique (“a quarrel; resentment”) (modern French pique), from piquer, picquer (verb); see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pique (countable and uncountable, plural piques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Enmity, ill feeling; (countable) a feeling of animosity or a dispute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Irritation or resentment awakened by a social injury or slight; offence, especially taken in an emotional sense with little consideration or thought; (countable) especially in fit of pique: a transient feeling of wounded pride.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) In pique of honour: a matter, a point.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pique (third-person singular simple present piques, present participle piquing, simple past and past participle piqued)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To wound the pride of (someone); to excite to anger; to irritate, to offend.",
                  "examples": [
                    "Synonyms: fret, nettle, sting; see also Thesaurus:annoy"
                  ]
                },
                {
                  "meaning": "To excite (someone) to action, especially by causing jealousy, resentment, etc.; also, to stimulate (an emotion or feeling, especially curiosity or interest).",
                  "examples": [
                    "Synonyms: excite, stimulate",
                    "I believe this will pique your interest."
                  ]
                },
                {
                  "meaning": "(reflexive) To pride (oneself) on something.",
                  "examples": []
                },
                {
                  "meaning": "(reflexive, obsolete) To excite or stimulate (oneself).",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To take pride in.",
                  "examples": []
                },
                {
                  "meaning": "To excite to action, especially by causing jealousy, resentment, etc.; also, to stimulate an emotion or feeling, especially curiosity or interest.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, rare) To express jealousy, resentment, etc. at someone; to become angry or annoyed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "The noun is borrowed from French pic, Middle French pic (“pique in the game of piquet; pike (tool)”), picq (“game of piquet”), from Vulgar Latin *pīccus (“sharp point, peak; pike, spike”), possibly from Frankish *pikk, *pīk, from Proto-Germanic *pikjaz, *pīkaz (“sharp point, peak; pickaxe; pike”); further etymology unknown. Doublet of pike.",
        "The verb is either derived from the noun (though the latter is attested in print later), or borrowed from French pic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pique (plural piques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In piquet, the right of the elder hand to count thirty in hand, or to play before the adversary counts one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pique (third-person singular simple present piques, present participle piquing, simple past and past participle piqued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, card games, archaic or obsolete) To score a pique against (someone).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Borrowed from Spanish pique, from Central Quechua piki."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pique (plural piques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A chigger, chigoe, or jigger (Tunga penetrans), a species of tropical flea.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "A variant of piqué, borrowed from French piqué (“(noun) ribbed fabric; (ballet) step on to the point of the leading foot without bending the knee; (adjective) backstitched; (cooking) larded”), Middle French piqué (“quilted”), a noun use of the past participle of piquer (“to prick, sting; to decorate with stitches; to quilt; to stitch (fabric) together; to lard (meat)”); see further at etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pique (countable and uncountable, plural piques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) Alternative form of piqué (“a kind of corded or ribbed fabric made from cotton, rayon, or silk”)",
                  "examples": [
                    "Pique and linen also accented several coats and oftentimes were both detachable and formed an overcollar covering a collar made from the coat fabric."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "A variant of pica, or from its etymon Late Latin pica (“disorder characterized by appetite and craving for non-edible substances”), from Latin pīca (“jay; magpie”) (from the idea that magpies will eat almost anything), ultimately from Proto-Indo-European *(s)peyk- (“magpie; woodpecker”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pique (plural piques)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology, obsolete, rare) Synonym of pica (“a disorder characterized by appetite and craving for non-edible substances”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}