{
  "word": "hole",
  "etymologies": [
    {
      "description": [
        "From Middle English hole, hol, from Old English hol (“orifice, hollow place, cavity”), from Proto-West Germanic *hol, from Proto-Germanic *hulą (“hollow space, cavity”), noun derivative of Proto-Germanic *hulaz (“hollow”), which is of uncertain ultimate origin. Related to hollow."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hole (plural holes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hollow place or cavity; an excavation; a pit; a dent; a depression; a fissure.",
                  "examples": [
                    "I made a blind hole in the wall for a peg.  I dug a hole and planted a tree in it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An opening that goes all the way through a solid body, a fabric, etc.; a perforation; a rent.",
                  "examples": [
                    "There’s a hole in my shoe.  Her stocking has a hole in it."
                  ]
                }
              ]
            },
            {
              "group": "(heading) In games.",
              "entries": [
                {
                  "meaning": "(golf) A subsurface standard-size hole, also called cup, hitting the ball into which is the object of play. Each hole, of which there are usually eighteen as the standard on a full course, is located on a prepared surface, called the green, of a particular type grass.",
                  "examples": []
                },
                {
                  "meaning": "(golf) The part of a game in which a player attempts to hit the ball into one of the holes.",
                  "examples": [
                    "I played 18 holes yesterday.  The second hole today cost me three strokes over par."
                  ]
                },
                {
                  "meaning": "(baseball) The rear portion of the defensive team between the shortstop and the third baseman.",
                  "examples": [
                    "The shortstop ranged deep into the hole to make the stop."
                  ]
                },
                {
                  "meaning": "(chess) A square on the board, with some positional significance, that a player does not, and cannot in future, control with a friendly pawn.",
                  "examples": []
                },
                {
                  "meaning": "(stud poker) A card (also called a hole card) dealt face down thus unknown to all but its holder; the status in which such a card is.",
                  "examples": []
                },
                {
                  "meaning": "In the game of fives, part of the floor of the court between the step and the pepperbox.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology, slang) An excavation pit or trench.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A weakness; a flaw or ambiguity.",
                  "examples": [
                    "I have found a hole in your argument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A container or receptacle.",
                  "examples": [
                    "car hole;  brain hole"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) In semiconductors, a lack of an electron in an occupied band behaving like a positively charged particle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A security vulnerability in software which can be taken advantage of by an exploit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, anatomy) An orifice, in particular the anus. When used with shut it always refers to the mouth.",
                  "examples": [
                    "Just shut your hole!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, Scotland, particularly in the phrase \"get one's hole\") Sex, or a sex partner.",
                  "examples": [
                    "Are you going out to get your hole tonight?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, with \"the\") Solitary confinement, a high-security prison cell often used as punishment.",
                  "examples": [
                    "Synonym: box"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An undesirable place to live or visit.",
                  "examples": [
                    "His apartment is a hole!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Difficulty, in particular, debt.",
                  "examples": [
                    "If you find yourself in a hole, stop digging."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(graph theory) A chordless cycle in a graph.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, rail transport) A passing loop; a siding provided for trains traveling in opposite directions on a single-track line to pass each other.",
                  "examples": [
                    "We’re supposed to take the hole at Cronk and wait for the Limited to pass."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hole (third-person singular simple present holes, present participle holing, simple past and past participle holed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make holes in (an object or surface).",
                  "examples": [
                    "Shrapnel holed the ship's hull."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, by extension) To destroy.",
                  "examples": [
                    "She completely holed the argument."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go into a hole.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drive into a hole, as an animal, or a billiard ball or golf ball.",
                  "examples": [
                    "If the player holes the red ball, he scores three, and upon holing his adversary's ball, he gains two; and thus it frequently happens, that seven are got upon a single stroke, by caramboling and holing both balls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut, dig, or bore a hole or holes in.",
                  "examples": [
                    "to hole a post for the insertion of rails or bars"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [
        {
          "description": "hole (comparative holer or more hole, superlative holest or most hole)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete spelling of whole.",
                  "examples": [
                    "Such was the arrangement of the alphabet over the hole North."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}