{
  "word": "actor",
  "etymologies": [
    {
      "description": [
        "Middle English actour, from Anglo-Norman actor, Middle French actor, and their source, Latin āctor (“doer”), from agō (“to do”). Equivalent to act +‎ -or. Cognate with Ancient Greek ἄκτωρ (áktōr, “leader”), from ἄγω (ágō, “lead, carry, convey, bring”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "actor (plural actors, feminine actress, or (nonstandard) actoress)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, law) Someone who institutes a legal suit; a plaintiff or complainant. [13th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Someone acting on behalf of someone else; a guardian. [14th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something that takes part in some action; a doer, an agent. [from 15th c.]",
                  "examples": [
                    "Never, my dear Bethel, did the most feverish dreams of fiction produce scenes more painful, or more terrific, than the real events to which I have been an actor, since the date of my last letter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who acts a part in a theatrical play or (later) in film or television; a dramatic performer. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Ancient Rome) An advocate or proctor in civil courts or causes. [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The subject performing the action of a verb. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering) The entity that performs a role (in use case analysis).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}