{
  "word": "shave",
  "etymologies": [
    {
      "description": [
        "Inherited from Middle English shaven, schaven, from Old English sċafan (“to shave, scrape, shred, polish”), from Proto-West Germanic *skaban, from Proto-Germanic *skabaną (“to scratch”), from Proto-Indo-European *skabʰ- (“to cut, split, form, carve”).",
        "Cognate with West Frisian skave, Dutch schaven (“to shave, plane”), Low German schaven (“to scrape, scratch, shave”), German schaben (“to scrape, shave”), Danish skave, Norwegian Nynorsk skava, Swedish skava (“to scrape, chafe”), Icelandic skafa, Gothic 𐍃𐌺𐌰𐌱𐌰𐌽 (skaban, “to shear, shave”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "shave (third-person singular simple present shaves, present participle shaving, simple past shaved or (obsolete) shove, past participle shaved or shaven)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (the head, skin etc.) bald or (the hair) shorter by using a tool such as a razor or electric clippers to cut the hair close to the skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut anything in this fashion.",
                  "examples": [
                    "The labourer with the bending scythe is seen / Shaving the surface of the waving green."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remove hair from one's face by this means.",
                  "examples": [
                    "I had little time to shave this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cut finely, as with slices of meat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To skim along or near the surface of; to pass close to, or touch lightly, in passing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce in size or weight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To be hard and severe in a bargain with; to practice extortion on; to cheat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated, transitive) To buy (a note) at a discount greater than the legal rate of interest, or to deduct in discounting it more than the legal rate allows.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English shave, from Old English sceafa, from Proto-Germanic *skabô."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shave (plural shaves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of shaving.",
                  "examples": [
                    "I instructed the barber to give me a shave."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin slice; a shaving.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) An exorbitant discount on a note.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) A premium paid for an extension of the time of delivery or payment, or for the right to vary a stock contract in any particular.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hand tool consisting of a sharp blade with a handle at each end; a spokeshave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A narrow miss or escape; a close shave.",
                  "examples": [
                    "\" […]  I had an awful shave getting into the harbour,\" remarked Archie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}