{
  "word": "malkin",
  "etymologies": [
    {
      "description": [
        "From Malde, an early form of Maude or Matilda  +‎ -kin (diminutive ending). Compare grimalkin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "malkin (plural malkins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, regional) A (stereotypical name for a) lower-class or uncultured woman; a kitchenmaid; a slattern. [from 13th c.]",
                  "examples": [
                    "Ȝe ne haue na more meryte · in masse ne in houres / Þan Malkyn of hire maydenhode · þat no man desireth.\nYou gain no more merit from mass or your prayers / Than Malkin from her maidenhood, which no man desires."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now regional) A mop, especially one used to clean a baker's oven. [from 15th c.]",
                  "examples": [
                    "\"She had no sooner said so, but they all vanished saving onely one Peter Grospetter, whom a little after she saw snatch'd up into the aire, and to let fall his Maulkin (a stick that they make clean Ovens withall) and her self was also driven so forcibly with the wind, that it made her almost Lose her breath.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, nautical) A mop or sponge attached to a jointed staff for swabbing out a cannon. [19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, regional) A scarecrow. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A cat. [from 17th c.]",
                  "examples": [
                    "Now she was strong enough to walk and watch them circling in the sky or to sit in the arbour at the end of the long lawn and, with the sunlight smouldering in her dark-red hair and lying wanly over the area of her face and neck, watch the multiform and snow-white convolutions of her malkins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland, Northern England) A hare. [from 18th c.]",
                  "examples": [
                    "There was milk punch and spiced whisky, a smell of goose and maukin roasting on the spit."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}