{
  "word": "superinduce",
  "etymologies": [
    {
      "description": [
        "From late Latin superindūcere."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "superinduce (third-person singular simple present superinduces, present participle superinducing, simple past and past participle superinduced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To replace (someone) with someone else; to bring into another's position; especially, to take (a second wife) quickly after the death of a first, or while she is still alive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bring in or introduce as an addition; to produce, cause, bring on.",
                  "examples": [
                    "For this purpose Nature hath framed in both sexes parts and places fit for generation; beside an instinct of lust or desire, not inordinate such as by sin is superinduced in man, but natural residing in the exquisite sense of the obscene parts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause (especially further disease) in addition (to an existing medical condition).",
                  "examples": [
                    "Among the numerous train of maladies superinduced by that fatal and primary one which effected a revolution of so horrible a kind in the moral and physical being of my cousin, may be mentioned the most distressing and obstinate in its nature, a species of epilepsy not unfrequently terminating in trance itself [...]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place over (something or someone); to cover.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}