{
  "word": "absolute",
  "etymologies": [
    {
      "description": [
        "First attested around 1380. From Middle English absolut, from Middle French absolut, from Latin absolūtus (“unconditional; unfettered; completed”), perfect passive participle of absolvō (“loosen, set free, complete”), from ab (“away”) + solvo (“to loose”). Influenced in part by Old French absolu. Compare absolve."
      ],
      "adjectives": [
        {
          "description": "absolute (comparative more absolute or absoluter, superlative most absolute or absolutest)",
          "definitionGroups": [
            {
              "group": "Free of restrictions, limitations, qualifications or conditions; unconditional. [first attested in the late 1400s]",
              "entries": [
                {
                  "meaning": "Unrestricted by laws, a constitution, or parliamentary or judicial or other checks; (legally) unlimited in power, especially if despotic. [first attested in the late 1400s]",
                  "examples": [
                    "An absolute monarch is free from all forcible restraint, and so far as he is absolute[,] from all legal restraints of positive laws."
                  ]
                },
                {
                  "meaning": "Characteristic of an absolutist ruler: domineering, peremptory. [first attested in the mid 1500s]",
                  "examples": [
                    "The peddler stopped, and tapped her on the head, / With absolute forefinger, brown and ringed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Free from imperfection, perfect, complete; especially, perfectly embodying a quality in its essential characteristics or to its highest degree. [first attested around 1400]",
                  "examples": [
                    "absolute purity, absolute liberty"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pure, free from mixture or adulteration; unmixed. [first attested in the mid 1500s]",
                  "examples": [
                    "absolute alcohol"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Complete, utter, outright; unmitigated, not qualified or diminished in any way. [first attested in the late 1500s]",
                  "examples": [
                    "When caught, he told an absolute lie.",
                    "an absolute denial of all charges",
                    "You're an absolute genius!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(very occasionally postpositive) Positive, certain; unquestionable; not in doubt. [first attested in the early 1600s]",
                  "examples": [
                    "Yet if the register is not to be absolute evidence of proprietorship, it is clear that some investigation of title would still be necessary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Certain; free from doubt or uncertainty (e.g. a person, opinion or prediction). [first attested in the early 1600s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially philosophy) Fundamental, ultimate, intrinsic; not relative; independent of references or relations to other things or standards. [first attested in the late 1700s]",
                  "examples": [
                    "the doctrine that absolute knowledge of things is possible, an absolute principle",
                    "Absolute rights and duties are such as pertain to man in a state of nature as contradistinguished from relative rights and duties, or such as pertain to him in his social relations."
                  ]
                }
              ]
            },
            {
              "group": "(physics) Independent of arbitrary units of measurement, standards, or properties; not comparative or relative.",
              "entries": [
                {
                  "meaning": "Having reference to or derived in the simplest manner from the fundamental units of mass, time, and length.",
                  "examples": []
                },
                {
                  "meaning": "Relating to the absolute temperature scale (based on absolute zero); kelvin.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(grammar) Not immediately dependent on the other parts of the sentence; not in a syntactical relation with other parts of a text, or qualifying the text as a whole rather than any single word in it, like \"it being over\" in \"it being over, she left\". [first attested around 1350 to 1470]",
              "entries": [
                {
                  "meaning": "(of a case form) Syntactically connected to the rest of the sentence in an atypical manner, or not relating to or depending on it, like in the nominative absolute or genitive absolute, accusative absolute or ablative absolute. [first attested around 1350 to 1470]",
                  "examples": []
                },
                {
                  "meaning": "(of an adjective or possessive pronoun) Lacking a modified substantive, like \"hungry\" in \"feed the hungry\". [first attested around 1350 to 1470]",
                  "examples": []
                },
                {
                  "meaning": "(of a comparative or superlative) Expressing a relative term without a definite comparison, like \"older\" in \"an older person should be treated with respect\". [first attested around 1350 to 1470]",
                  "examples": []
                },
                {
                  "meaning": "(of an adjective form) Positive; not graded (not comparative or superlative).",
                  "examples": [
                    "Even when the absolute form of an adverb ends in -ly, the comparative and superlative are identical with the corresponding forms of the adjective: badly, worse, worst."
                  ]
                },
                {
                  "meaning": "(of a usually transitive verb) Having no direct object, like \"kill\" in \"if looks could kill\". [first attested around 1350 to 1470]",
                  "examples": []
                },
                {
                  "meaning": "(of Celtic languages) Being or pertaining to an inflected verb that is not preceded by any number of particles or compounded with a preverb.",
                  "examples": [
                    "Antonym: conjunct"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) As measured using an absolute value.",
                  "examples": [
                    "absolute deviation",
                    "absolute square",
                    "mean absolute difference"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Indicating an expression that is true for all real numbers, or of all values of the variable; unconditional.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(education) Pertaining to a grading system based on the knowledge of the individual and not on the comparative knowledge of the group of students.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, music, dance) Independent of (references to) other arts; expressing things (beauty, ideas, etc) only in one art.",
                  "examples": [
                    "absolute music"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, postpositive, formal) Indicating that a tenure or estate in land is not conditional or liable to terminate on (strictly) any occurrence or (sometimes contextually) certain kinds of occurrence.",
                  "examples": [
                    "A freehold property is an estate in fee simple absolute in possession."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Absolved; free. [attested from the mid 1300s until the mid 1600s]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "absolute (plural absolutes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which exists (or has a certain property, nature, size, etc) independent of references to other standards or external conditions; that which is universally valid; that which is not relative, conditional, qualified or mitigated. [First attested in the mid 19th century.]",
                  "examples": [
                    "moral absolutes"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) In a plane, the two imaginary circular points at infinity; in space of three dimensions, the imaginary circle at infinity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, usually capitalized, usually preceded by \"the\") A realm which exists without reference to anything else; that which can be imagined purely by itself; absolute ego.",
                  "examples": [
                    "Withdrawn as a Buddha he sat, watching the alien world from his perch in the absolute."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, usually capitalized, usually preceded by \"the\") The whole of reality; the totality to which everything is reduced; the unity of spirit and nature; God.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A concentrated natural flower oil, used for perfumes; an alcoholic extract of a concrete.",
                  "examples": [
                    "Complete concentration in a vacuum still at low temperature results in a concentrated flower oil, free from alcohol, the so-called absolute of enfleurage. The crude absolutes of enfleurage are usually of dark color and, because of their fat content,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}