{
  "word": "corruption",
  "etymologies": [
    {
      "description": [
        "Borrowed from French corruption, from Latin corruptiō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "corruption (countable and uncountable, plural corruptions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of corrupting or of impairing integrity, virtue, or moral principle; the state of being corrupted or debased; loss of purity or integrity",
                  "examples": [
                    "They abstained from some of the worst methods of corruption usual to their party in its earlier days."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of corrupting or making putrid, or state of being corrupt or putrid; decomposition or disorganization, in the process of putrefaction; putrefaction; deterioration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The product of corruption; putrid matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The decomposition of biological matter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Unethical administrative or executive practices (in government or business), including bribery (offering or receiving bribes), conflicts of interest, nepotism, and so on.",
                  "examples": [
                    "Synonym: venality"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The destruction of data by manipulation of parts of it, either by deliberate or accidental human action or by imperfections in storage or transmission media.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of changing, or of being changed, for the worse; departure from what is pure, simple, or correct.",
                  "examples": [
                    "a corruption of style",
                    "corruption of innocence"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usage prescription) A nonstandard form of a word, expression, or text, assigned a value judgment as being debased, especially when resulting from misunderstanding, transcription error, or mishearing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something originally good or pure that has turned evil or impure; a perversion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}