{
  "word": "incubation",
  "etymologies": [
    {
      "description": [
        "From Latin incubātiō, from incubō (“to lie on”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "incubation (countable and uncountable, plural incubations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sitting on eggs for the purpose of hatching young; a brooding on, or keeping warm, to develop the life within, by any process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(pathology) The development of a disease from its causes, or the period of such development.",
                  "examples": [
                    "The course of small-pox, whether distinct or confluent, may be divided into five stages, which are known under the names of incubation, invasion, eruption, suppuration, and desiccation. This division, founded on the most prominent symptoms that the disease presents, although it is an arbitrary one, still affords a facility in the study. The period of incubation comprises the interval of time that elapses from the infection to the beginning of the attack; its duration is from six to twenty days. It is not designated by any visible symptom, as the individual apparently continues in good health."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A period of little reaction which is followed by more rapid reaction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology) One of the four proposed stages of creativity (preparation, incubation, illumination, and verification): the unconscious recombination of thought elements that were stimulated through conscious work at one point in time, resulting in novel ideas at a later point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sleeping in a temple or other holy place in order to have oracular dreams or to receive healing.",
                  "examples": [
                    "Incubation in the vicinity of burial places, cremation grounds, holy wells and sacred streams was common. The ancient Hebrews visited vaults or slept among tombs to get meaningful dreams."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}