{
  "word": "length",
  "etymologies": [
    {
      "description": [
        "From Middle English lengthe, from Old English lengþ, lengþu, from Proto-West Germanic *langiþu, from Proto-Germanic *langiþō, equivalent to long +‎ -th. Cognate with Scots lenth, lainth (“length”), Saterland Frisian Loangte (“length”), West Frisian lingte, langte (“length”), Dutch lengte (“length”), German Low German Längde, Längd, Längte, Längt (“length”), Danish længde (“length”), Swedish längd (“length”), Icelandic lengd (“length”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "length (countable and uncountable, plural lengths)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The distance measured along the longest dimension of an object.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "duration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse racing) The length of a horse, used to indicate the distance between horses at the end of a race.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) Distance between the two ends of a line segment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) The distance down the pitch that the ball bounces on its way to the batsman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Total extent.",
                  "examples": [
                    "the length of a book"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Part of something that is long; a physical piece of something.",
                  "examples": [
                    "a length of rope"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(theater) A unit of script length, comprising 42 lines.",
                  "examples": [
                    "[…]  open your book of the play, which you have previously carefully perused, and at the same time marked with the proper calls, as thus: a length (or 42 lines) before an entrance, with a pen make a figure on the margin,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) The number of cards held in a particular suit.",
                  "examples": [
                    "An artificial bid doesn't necessarily show length in the suit being bid, it has an altogether different meaning."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "length (third-person singular simple present lengths, present participle lengthing, simple past and past participle lengthed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To lengthen.",
                  "examples": [
                    "Pack night, peep day; good day, of night now borrow: / Short night, to-night, and length thyself to-morrow."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}