{
  "word": "frieze",
  "etymologies": [
    {
      "description": [
        "Late Middle English, from French and Middle French frise, probably from Medieval Latin Frisia (“Frisian (wool)”) due to import via Northern ships.  Or, from French friser (“to curl”).."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frieze (countable and uncountable, plural friezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of coarse woolen cloth or stuff with a shaggy or tufted (friezed) nap on one side.",
                  "examples": [
                    "This dark, frieze-coated, hoarse, teeth-chattering month  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "frieze (third-person singular simple present friezes, present participle friezing, simple past and past participle friezed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a nap on (cloth); to friz.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From French and Middle French frise f, derived from an Upper Italian fris f, Medieval Latin frisum, frisium, frigium, frixum, frigium, of controversial origin, possibly from multiple sources, Arabic إِفْرِيز‎ (ʔifrīz, “king beam, cornice”) and Latin opus Phrygium (“a kind of embroidery”, literally “work of Phrygia”), the demonym Frisian and terms related to the textile term above in a transferred sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frieze (plural friezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(architecture) That part of the entablature of an order which is between the architrave and cornice. It is a flat member or face, either uniform or broken by triglyphs, and often enriched with figures and other ornaments of sculpture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sculptured or richly ornamented band in a building or, by extension, in rich pieces of furniture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A banner with a series of pictures.",
                  "examples": [
                    "The classroom had an alphabet frieze that showed an animal for each letter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "frieze (third-person singular simple present friezes, present participle friezing, simple past and past participle friezed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, architecture) To put a frieze on.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}