{
  "word": "groundly",
  "etymologies": [
    {
      "description": [
        "From Middle English groundli, growndly, grundlich (“firm, solid; deep, profound; fundamental, radical; of a person: learned, well-grounded”) [and other forms], from ground (“surface of the earth on which one stands; earth, soil; burial site; field of battle, battleground; dry land; flat land; piece of land; region; country; the earth; lowest part, base, bottom; foundation; platform; basis for a doctrine, opinion, etc.; fundamental principle; source; background (of a painting, etc.)”) (from Old English grund (“ground; bottom, foundation; abyss”), from Proto-Germanic *grunduz (“ground; foundation”), from Proto-Indo-European *gʰrem- (“to resound; to grumble, roar, thunder”)) + -li (suffix forming adjectives). The English word is analysable as ground +‎ -ly (suffix forming adjectives), and is cognate with German gründlich (“careful, thorough; deep, profound”), Swedish grundlig (“thorough; in depth; profound; radical”)."
      ],
      "adjectives": [
        {
          "description": "groundly (comparative more groundly, superlative most groundly)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, rare) Firmly grounded; solid; of education: complete, thorough, well-grounded.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English groundli, groundly, grundliche (“strongly, vehemently, violently; completely, fully, thoroughly; basically, fundamentally”) [and other forms], from ground (see etymology 1) + -li (suffix forming adverbs). The English word is analysable as ground +‎ -ly (suffix forming adverbs)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "groundly (comparative more groundly, superlative most groundly) (archaic, rare)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a firmly grounded manner; solidly.",
                  "examples": [
                    "Synonym: groundedly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To the very ground or bottom; deeply, profoundly; completely, thoroughly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}