{
  "word": "station",
  "etymologies": [
    {
      "description": [
        "From Middle English stacioun, borrowed from Anglo-Norman estation, from Latin statiōnem, accusative of statiō (“standing, post, job, position”), whence also Italian stazione. Doublet of stagione. Cognate with Ancient Greek ἵστημι (hístēmi), στάσις (stásis), Old English standan (whence English stand)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "station (plural stations)",
          "definitionGroups": [
            {
              "group": "A stopping place.",
              "entries": [
                {
                  "meaning": "A regular stopping place for ground transportation.",
                  "examples": [
                    "The next station is Esperanza."
                  ]
                },
                {
                  "meaning": "A ground transportation depot.",
                  "examples": [
                    "It's right across from the bus station."
                  ]
                },
                {
                  "meaning": "A place where one stands or stays or is assigned to stand or stay.",
                  "examples": [
                    "From my station at the front door, I greeted every visitor.",
                    "All ships are on station, Admiral."
                  ]
                },
                {
                  "meaning": "A place where some object is provided.",
                  "examples": [
                    "Collect a knife and fork from the cutlery station on the way to your table."
                  ]
                },
                {
                  "meaning": "(US) A gas station, service station.",
                  "examples": [
                    "Localities across New Jersey imposed curfews to prevent looting. In Monmouth, Ocean and other counties, people waited for hours for gasoline at the few stations that had electricity. Supermarket shelves were stripped bare."
                  ]
                }
              ]
            },
            {
              "group": "A place where workers are stationed.",
              "entries": [
                {
                  "meaning": "An official building from which police or firefighters operate.",
                  "examples": [
                    "The police station is opposite the fire station."
                  ]
                },
                {
                  "meaning": "A place where one performs a task or where one is on call to perform a task.",
                  "examples": [
                    "The waitress was at her station preparing three checks.",
                    "The station is part of a group of stations run by the Chinese Academy of Sciences."
                  ]
                },
                {
                  "meaning": "A military base.",
                  "examples": [
                    "She had a boyfriend at the station."
                  ]
                },
                {
                  "meaning": "A place used for broadcasting radio or television.",
                  "examples": [
                    "I used to work at a radio station."
                  ]
                },
                {
                  "meaning": "(Australia, New Zealand) A very large sheep or cattle farm.",
                  "examples": [
                    "There was movement at the station, for the word had passed around, / that the colt from old Regret had got away,"
                  ]
                },
                {
                  "meaning": "(historical) In British India, the place where the English officials of a district, or the officers of a garrison (not in a fortress) reside.",
                  "examples": [
                    "It was my fate to commence my career in the medical service forty years ago in the presanitary days, long before the introduction of modern methods of diagnosis, at two of the most unhealthy stations in the whole of India — Bellary and Secunderabad."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Any of the Stations of the Cross.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The Roman Catholic fast of the fourth and sixth days of the week, Wednesday and Friday, in memory of the council which condemned Christ, and of his passion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) A church in which the procession of the clergy halts on stated days to say stated prayers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Standing; rank; position.",
                  "examples": [
                    "She had ambitions beyond her station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broadcasting entity.",
                  "examples": [
                    "I used to listen to that radio station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Newfoundland) A harbour or cove with a foreshore suitable for a facility to support nearby fishing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) Any of a sequence of equally spaced points along a path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The particular place, or kind of situation, in which a species naturally occurs; a habitat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) An enlargement in a shaft or galley, used as a landing, or passing place, or for the accommodation of a pump, tank, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Post assigned; office; the part or department of public duty which a person is appointed to perform; sphere of duty or occupation; employment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) The position of the foetal head in relation to the distance from the ischial spines, measured in centimetres.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The fact of standing still; motionlessness, stasis.",
                  "examples": [
                    "[…] the cross legs [are] moving or resting together, so that two are always in motion and two in station at the same time […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy) The apparent standing still of a superior planet just before it begins or ends its retrograde motion.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "station (third-person singular simple present stations, present participle stationing, simple past and past participle stationed) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually passive) To put in place to perform a task.",
                  "examples": [
                    "The host stationed me at the front door to greet visitors.",
                    "I was stationed on the pier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put in place to perform military duty.",
                  "examples": [
                    "They stationed me overseas just as fighting broke out.",
                    "I was stationed at Fort Richie."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}