{
  "word": "mischief",
  "etymologies": [
    {
      "description": [
        "From Middle English myschef, meschef, meschief, mischef, from Old French meschief, from meschever (“to bring to grief”), from mes- (“badly”) + chever (“happen; come to a head”), from Vulgar Latin *capare, from Latin caput (“head”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mischief (countable and uncountable, plural mischiefs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Conduct that playfully causes petty annoyance.",
                  "examples": [
                    "Synonyms: delinquency, naughtiness, roguery, scampishness; see also Thesaurus:villainy, Thesaurus:mischief",
                    "Drink led to mischief."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A playfully annoying action.",
                  "examples": [
                    "John's mischief, tying his shoelaces together, irked George at first."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective) A group or a pack of rats.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(archaic) Harm or injury:",
              "entries": [
                {
                  "meaning": "(uncountable) Harm or trouble caused by an agent or brought about by a particular cause.",
                  "examples": [
                    "She had mischief in her heart.",
                    "Sooner or later he'll succeed in doing some serious mischief."
                  ]
                },
                {
                  "meaning": "(countable) An injury or an instance of harm or trouble caused by a person or other agent or cause.",
                  "examples": [
                    "It may end in her doing a great mischief to herself—and perhaps to others too."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A criminal offence defined in various ways in various jurisdictions, sometimes including causing damage to another's property.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, countable) A cause or agent of annoyance, harm or injury, especially a person who causes mischief.",
                  "examples": [
                    "Synonyms: bad boy, knave, rapscallion, rascal, rogue; see also Thesaurus:villain, Thesaurus:troublemaker"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) The Devil; used as an expletive.",
                  "examples": [
                    "What the mischief are you? and how the mischief did you get here, and where in thunder did you come from?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Casual and/or flirtatious sexual acts.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mischief (third-person singular simple present mischiefs, present participle mischiefing, simple past and past participle mischiefed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To do a mischief to; to harm.",
                  "examples": [
                    "[…]  so, when the two ladders were taken down, no man living could come down to me without mischiefing himself,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To slander.",
                  "examples": [
                    "And so it hath been divers times; Men mischiefing the Jews to excuse their own Wickedness: as to instance one Precedent in the time of a certain King of Portugal."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}