{
  "word": "sympathy",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French sympathie, from Late Latin sympathīa (“feeling in common”), from Ancient Greek σῠμπᾰ́θειᾰ (sumpátheia, “fellow feeling”), from σῠμπᾰθής (sumpathḗs, “affected by like feelings; exerting mutual influence, interacting”) +‎ -ῐᾰ (-ia, “-y”, nominal suffix). Equivalent to sym- (“acting or considered together”) +‎ -pathy (“feeling”). Displaced native Old English efnþrōwung (literally “suffering with or together”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sympathy (countable and uncountable, plural sympathies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A feeling of pity or sorrow for the suffering or distress of another.",
              "entries": [
                {
                  "meaning": "(in the plural) The formal expression of pity or sorrow for someone else's misfortune.",
                  "examples": []
                },
                {
                  "meaning": "The ability to share the feelings of another.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Inclination to think or feel alike; emotional or intellectual accord; common feeling.",
              "entries": [
                {
                  "meaning": "(in the plural) Support in the form of shared feelings or opinions.",
                  "examples": []
                },
                {
                  "meaning": "Feeling of loyalty; tendency towards, agreement with or approval of an opinion or aim; a favorable attitude.",
                  "examples": [
                    "Many people in Hollywood were blacklisted merely because they were suspected of Communist sympathies."
                  ]
                }
              ]
            },
            {
              "group": "An affinity, association or mutual relationship between people or things such that they are correspondingly affected by any condition.",
              "entries": [
                {
                  "meaning": "Mutual or parallel susceptibility or a condition brought about by it.",
                  "examples": []
                },
                {
                  "meaning": "(art) Artistic harmony, as of shape or colour in a painting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}