{
  "word": "boogaloo",
  "etymologies": [
    {
      "description": [
        "Attested as a style of dance since at least January 1966 (and found in the titles of many songs around that time), perhaps from boogie (for the ending, compare crackaloo, hullabaloo). (Compare Spanish bugalú, the Spanish name for the style of music and dance.) Kent Harris used the stage name \"Boogaloo\" in the 1950s. The sense \"sequel or repetition\" refers to the title of Breakin' 2: Electric Boogaloo (1984), a sequel which was so bad it became a cult classic. Compare the sense \"black person\" to boogalee, a term for a Cajun, attested since 1960 or earlier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "boogaloo (countable and uncountable, plural boogaloos)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, uncountable) A genre of music that blends rhythm and blues and soul music with Cuban-style rhythms, originating in the United States in the 1960s.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A style of dance to this music, popular in the 1960s.",
                  "examples": [
                    "Most hip Gothamites now trying to get rhythmic understanding between arms, legs and sacroiliac in order to get in on the Boogaloo dance craze."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, countable) A piece of music, or an instance of dancing, in or of this style.",
                  "examples": [
                    "Basie played boogie-woogie, and Ellington boleros and boogaloos. To see the Marsalis faction rap a standard or breakdance before the blues would bring them full-circle, in full embrace,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of freestyle, improvisational street dance incorporating soulful steps and robotic movements, originally danced to funk and disco, but later more commonly to hip-hop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, humorous) A sequel or repetition of events, etc. Often used to mock a lack of creativity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, US politics) A hypothetical second American Civil War, in which far-right or antigovernment activists rise up against the government.",
                  "examples": [
                    "Today, boogaloo has seeped out of the gaming community and found fertile ground in militant fringe movements. That includes anarchists and others on the far left. But it's especially popular among right-wing militias and self-described patriot groups."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, possibly dated) A black person.",
                  "examples": [
                    "A naked savage in one mud village quarrels with another savage, as naked and as black as himself, in the next mud village. They quarrel about Boo-Galoo's chickens scratching up Gaw-Balaw's melon seed, or about Gaw-Balaw's hogs rooting in Boo-Galoo's yam patch (1935)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "boogaloo (third-person singular simple present boogaloos, present participle boogalooing, simple past and past participle boogalooed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To dance in this style.",
                  "examples": [
                    "She would have screamed in the judge's face, getting her man ninety years and a day. \"You two boogaloo like an old married couple,\" I tell them after they've danced stiffly for a few minutes."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}