{
  "word": "tell",
  "etymologies": [
    {
      "description": [
        "From Middle English tellen (“to count, tell”), from Old English tellan (“to count, tell”), from Proto-West Germanic *talljan, from Proto-Germanic *taljaną, *talzijaną (“to count, enumerate”), from Proto-Germanic *talą, *talǭ (“number, counting”), from Proto-Indo-European *dol- (“calculation, fraud”).",
        "Cognate with Saterland Frisian tälle (“to say; tell”), West Frisian telle (“to count”), West Frisian fertelle (“to tell, narrate”), Dutch tellen (“to count”), Low German tellen (“to count”), German zählen, Faroese telja. More at tale."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tell (plural tells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reflexive, often habitual behavior, especially one occurring in a context that often features attempts at deception by persons under psychological stress (such as a poker game or police interrogation), that reveals information that the person exhibiting the behavior is attempting to withhold.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) That which is told; a tale or account.",
                  "examples": [
                    "I am at the end of my tell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A private message to an individual in a chat room; a whisper.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tell (third-person singular simple present tells, present participle telling, simple past and past participle told or (dialectal or nonstandard) telled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic outside of idioms) To count, reckon, or enumerate.",
                  "examples": [
                    "All told, there were over a dozen.  Can you tell time on a clock?  He had untold wealth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ditransitive) To narrate.",
                  "examples": [
                    "I want to tell a story;  I want to tell you a story."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ditransitive) To convey by speech; to say.",
                  "examples": [
                    "Finally, someone told him the truth.  He seems to like to tell lies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To instruct or inform.",
                  "examples": [
                    "Please tell me how to do it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To order; to direct, to say to someone.",
                  "examples": [
                    "Tell him to go away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To discern, notice, identify or distinguish.",
                  "examples": [
                    "Can you tell whether those flowers are real or silk, from this distance?  No, there's no way to tell.",
                    "I can tell you're upset.",
                    "An expert can tell an original from a forgery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reveal.",
                  "examples": [
                    "Time will tell what became of him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be revealed.",
                  "examples": [
                    "Cherry looks old, Mergenthaler told himself. His age is telling. Querulous — that's the word. He's become a whining, querulous old man absorbed with trivialities."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To have an effect, especially a noticeable one; to be apparent, to be demonstrated.",
                  "examples": [
                    "Sir Gerald was moving slower; his wounds were beginning to tell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use (beads or similar objects) as an aid to prayer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, childish) To inform someone in authority about a wrongdoing.",
                  "examples": [
                    "I saw you steal those sweets! I'm telling!",
                    "Synonym: tell on"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(authorship, intransitive) To reveal information in prose through outright expository statement -- contrasted with show",
                  "examples": [
                    "Maria rewrote the section of her novel that talked about Meg and Sage's friendship to have less telling and more showing."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Arabic تَلّ‎ (tall, “hill, elevation”) or Hebrew תֵּל‎ (tél, “hill”), from Proto-Semitic *tall- (“hill”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tell (plural tells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A hill or mound, originally and especially in the Middle East, over or consisting of the ruins of ancient settlements.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}