{
  "word": "callout",
  "etymologies": [
    {
      "description": [
        "call +‎ out"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "callout (plural callouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(communication) An outgoing telephone call.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of being summoned to visit a certain place in order to provide assistance; an instance of summoning someone who is on call.",
                  "examples": [
                    "I had to pay for the callout of the plumber after the pipe burst."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A meeting or rally held in order to find interested participants, e.g. for an activity or sports team.",
                  "examples": [
                    "So many people attended the basketball callout that the coach decided to form two teams."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An invitation to fight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A request for people to join or take part.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography, graphic layout) A pull quote: an excerpt from an article (such as in a news magazine) that is duplicated in a large font alongside the article so as to grab a reader's attention and indicate the article's topic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An annotation that pertains to a specific location in a body of text or a graphic, and that is visually linked to that location by a mark or a matching pair of marks.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of calling out from work, i.e. announcing that one cannot attend; the act of calling in sick.",
                  "examples": [
                    "On this particular day, I felt ill, mostly from exhaustion, and had to call out from work. This callout caused a stir and a display of animosity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(idiomatic) A form of verbal abuse with the intention to make the victim feel guilty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}