{
  "word": "wait",
  "etymologies": [
    {
      "description": [
        "From Middle English waiten, wayten, from Old Northern French waiter, waitier (compare French guetter from Old French gaitier, guaitier), from Frankish *wahtwēn (“to watch, guard”), derivative of Frankish *wahtu (“guard, watch”), from Proto-Germanic *wahtwō (“guard, watch”), from Proto-Indo-European *weǵ- (“to be fresh, cheerful, awake”). Cognate with Old High German wahtēn (“to watch, guard”), German Low German wachten (“to wait”), Dutch wachten (“to wait, expect”), French guetter (“to watch out for”), Saterland Frisian wachtje (“to wait”), West Frisian wachtsje (“to wait”), North Frisian wachtjen (“to stand, stay put”). More at watch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wait (plural waits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A delay.",
                  "examples": [
                    "I had a very long wait at the airport security check."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ambush.",
                  "examples": [
                    "They lay in wait for the patrol."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Short for wait state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who watches; a watchman.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, obsolete, UK) Hautboys, or oboes, played by town musicians.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural, UK) Musicians who sing or play at night or in the early morning, especially at Christmas time; serenaders; musical watchmen. [formerly waites, wayghtes.]",
                  "examples": [
                    "The sound of the waits, rude as may be their minstrelsy, breaks upon the mild watches of a winter night with the effect of perfect harmony."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wait (third-person singular simple present waits, present participle waiting, simple past and past participle waited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To delay movement or action until the arrival or occurrence of; to await. (Now generally superseded by “wait for”.)",
                  "examples": [
                    "Awed with these words, in camps they still abide, / And wait with longing looks their promised guide."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To delay movement or action until some event or time; to remain neglected or in readiness.",
                  "examples": [
                    "Haste, my dear father; 'tis no time to wait."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative, US) To wait tables; to serve customers in a restaurant or other eating establishment.",
                  "examples": [
                    "She used to wait in this joint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To attend on; to accompany; especially, to attend with ceremony or respect.",
                  "examples": [
                    "He chose a thousand horse, the flower of all / His warlike troops, to wait the funeral."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To attend as a consequence; to follow upon; to accompany.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, colloquial) To defer or postpone (especially a meal).",
                  "examples": [
                    "Montague Thorold, who impatiently watched her wherever she went, came to tell her that his mother waited breakfast for her."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remain faithful to one’s partner or betrothed during a prolonged period of absence.",
                  "examples": [
                    "She did not question him. Before leaving, she asked only, \"When will I see you again?\" He answered, \"I don't know. Don't wait for me, Dagny. Next time we meet, you will not want to see me.\""
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}