{
  "word": "forestall",
  "etymologies": [
    {
      "description": [
        "From Middle English forestallen (“to forestall, intercept, ambush, way-lay”), from forestalle (“a forestalling, interception”), from Old English foresteall (“intervention, hindrance of justice, ambush”), from fore- (“ahead of, before”) + steall (“position”), equivalent to fore- +‎ stall."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "forestall (third-person singular simple present forestalls, present participle forestalling, simple past and past participle forestalled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prevent, delay or hinder something by taking precautionary or anticipatory measures; to avert.",
                  "examples": [
                    "Fred forestalled disaster by his prompt action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To preclude or bar from happening, render impossible.",
                  "examples": [
                    "In French, an aspired h forestalls elision."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To purchase the complete supply of a good, particularly foodstuffs, in order to charge a monopoly price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To anticipate, to act foreseeingly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deprive (with of).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law) To obstruct or stop up, as a road; to stop the passage of a highway; to intercept on the road, as goods on the way to market.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English forstal, from Old English foresteall (“an intervention, hindrance (of justice), ambush, assault, offence of waylaying on the highway, fine for such an offence, resistance, opposition”), equivalent to fore- +‎ stall."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "forestall (plural forestalls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete or historical) An ambush; plot; an interception; waylaying; rescue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something situated or placed in front.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}