{
  "word": "squad",
  "etymologies": [
    {
      "description": [
        "From French escouade, from Italian squadra (“square”) (whence also French escadre)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squad (plural squads)",
          "definitionGroups": [
            {
              "group": "A group of people organized for some common purpose, usually of about ten members.",
              "entries": [
                {
                  "meaning": "A unit of tactical military personnel, or of police officers, usually of about ten members.",
                  "examples": [
                    "A squad of soldiers ordered them to disperse but instead of doing so they commenced throwing ice and rocks."
                  ]
                },
                {
                  "meaning": "(cricket, soccer, rugby) A group of potential players from whom a starting team and substitutes are chosen.",
                  "examples": []
                },
                {
                  "meaning": "(informal) A collective noun for a group of squid.",
                  "examples": [
                    "At one point, the 400-ton Calypso was brought to a standstill by a squad of squid which clogged the engines and caused a power failure. Other, highlights included an attack by predatory blue sharks,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) One's friend group, taken collectively; one's peeps.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "squad (third-person singular simple present squads, present participle squadding, simple past and past participle squadded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as part of, or on behalf of, a squad.",
                  "examples": [
                    "We squad on the fifth of the month."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Compare squick (“disgust”), squalid (“dirty”) with similar initial sounds."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "squad",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) Sloppy mud. [from mid-17th c.]",
                  "examples": [
                    "The lass ran all among the muck and squad."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}