{
  "word": "breach",
  "etymologies": [
    {
      "description": [
        "From Middle English breche, from Old English bryċe (“fracture, breach”) and brǣċ (“breach, breaking, destruction”), from Proto-West Germanic *bruki, from Proto-Germanic *brukiz (“breach, fissure”) and *brēkō (“breaking”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "breach (plural breaches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A gap or opening made by breaking or battering, as in a wall, fortification or levee / embankment; the space between the parts of a solid body rent by violence",
                  "examples": [
                    "Synonyms: break, rupture, fissure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breaking up of amicable relations, a falling-out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breaking of waters, as over a vessel or a coastal defence; the waters themselves",
                  "examples": [
                    "A clear breach is when the waves roll over the vessel without breaking. A clean breach is when everything on deck is swept away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breaking out upon; an assault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A bruise; a wound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A hernia; a rupture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A breaking or infraction of a law, or of any obligation or tie; violation; non-fulfillment",
                  "examples": [
                    "breach of promise"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A difference in opinions, social class etc.",
                  "examples": [
                    "For London to have its own exclusive immigration policy would exacerbate the sense that immigration benefits only certain groups and disadvantages the rest. It would entrench the gap between London and the rest of the nation. And it would widen the breach between the public and the elite that has helped fuel anti-immigrant hostility."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of breaking, in a figurative sense.",
                  "examples": [
                    "But were the poet to make a total difression from his subject, and introduce a new actor, nowise connected with the personages, the imagination, feeling a breach in transition, would enter coldly into the new scene;"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "breach (third-person singular simple present breaches, present participle breaching, simple past and past participle breached)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a breach in.",
                  "examples": [
                    "They breached the outer wall, but not the main one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To violate or break.",
                  "examples": [
                    "\"I therefore agree with the Court that the Government did breach its contract with petitioners in failing to approve, within 30 days of its receipt, the plan of exploration petitioners submitted.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical, of the sea) To break into a ship or into a coastal defence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a whale) To leap out of the water.",
                  "examples": [
                    "The fearless whale-fishermen now found themselves in the midst of the monsters; ... some ... came jumping into the light of day, head uppermost, exhibiting their entire bodies in the sun, and falling on their sides into the water with the weight of a hundred tons, and thus \"breaching\" with a crash that the thunder of a park of artillery could scarcely equal."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, informal, transitive, usually passive) To charge or convict (someone) of breaching the terms of a bail, probation, recognizance, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}