{
  "word": "enough",
  "etymologies": [
    {
      "description": [
        "From Middle English ynogh, from Old English ġenōg (“enough”), from Proto-Germanic *ganōgaz (“enough”) (compare Scots eneuch, West Frisian genôch, Dutch genoeg, German genug, Low German noog, Danish nok, Swedish nog, Icelandic nógur), from *ganuganą 'to suffice' (compare Old English ġeneah), or from *ga- + an unattested *nōgaz, probably ultimately from Proto-Indo-European *h₂eh₂nó(n)ḱe (“he has reached, attained”), perfective of *h₂neḱ- (“to reach”) (compare Old Irish tánaic (“he arrived”), Latin nancisci (“to get”), Lithuanian nèšti (“to carry”), Albanian kënaq (“to please, satisfy”), Ancient Greek ἐνεγκεῖν (enenkeîn, “to carry”).)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "enough",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sufficiently.",
                  "examples": [
                    "I cannot run fast enough to catch up to them.",
                    "Are you man enough to fight me?",
                    "You've worked enough; rest for a bit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fully; quite; used after adjectives to express slight augmentation of the positive degree, and sometimes equivalent to very.",
                  "examples": [
                    "He is ready enough to accept the offer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used after certain adverbs to emphasise that a quality is notable, unexpected, etc.",
                  "examples": [
                    "Talking of Mr Smith, funnily enough, I saw him just the other day.",
                    "I left my camera on the train, but luckily enough someone handed it in to lost property."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "enough (plural enoughs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, chiefly in the plural) An instance of being sufficient, or of doing something sufficiently.",
                  "examples": [
                    "And she was neither beautiful nor handsome, but just at the point halfway between which a girl of twenty-three reaches who inherits good features and healthful figure, and who has learned to dance well, ride well, study enough, golf enough, and has attained the thousand other \"well and enoughs\" which include talking well and listening enough, and allow a woman to be liked and loved with so little consciousness that she never suspects she is particularly liked at all."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}