{
  "word": "desk",
  "etymologies": [
    {
      "description": [
        "From Middle English deske, desque, from Medieval Latin desca, modified from Old Italian desco, from Latin discus. Doublet of dais, disc, discus, dish, disk, and diskos."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "desk (plural desks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A table, frame, or case, in past centuries usually with a sloping top but now usually with a flat top, for the use of writers and readers. It often has a drawer or repository underneath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reading table or lectern to support the book from which the liturgical service is read, differing from the pulpit from which the sermon is preached; also (especially in the United States), a pulpit. Hence, used symbolically for the clerical profession.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A department tasked with a particular topic or focus in certain types of businesses, such as newspapers and financial trading firms.",
                  "examples": [
                    "the city desk, the sports desk",
                    "the options desk, the equities desk"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Short for mixing desk.",
                  "examples": [
                    "Each aux out is connected to an effects unit and the signal is then returned into the desk."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "desk (third-person singular simple present desks, present participle desking, simple past and past participle desked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To shut up, as in a desk; to treasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To equip with a desk or desks.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}