{
  "word": "bodacious",
  "etymologies": [
    {
      "description": [
        "Southern American slang, implied by bodaciously, 1837, either from bodyaciously (“bodily, totally, root and branch”)\n(as in “the pigs broke into my fence and destroyed the potato patch bodyaciously”), South Carolina, or a blend of bold and audacious."
      ],
      "adjectives": [
        {
          "description": "bodacious (comparative more bodacious, superlative most bodacious)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Audacious and unrestrained.",
                  "examples": [
                    "If you’re going to lie, you might as well tell a bodacious lie."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Incorrigible and insolent.",
                  "examples": [
                    "You, sir, are a bodacious scoundrel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, US, slang) Impressively great in size, and enormous; extraordinary.",
                  "examples": [
                    "Twenty meters in diameter to match the bore of the huge Japanese ore drilling machines, the floor had been leveled by an equally bodacious milling robot, and the shiny metallic walls seemed to stretch on to infinity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Sexy, attractive.",
                  "examples": [
                    "[Patrick] Stewart has “been named The Most Bodacious Man on TV by the readers of TV Guide (1992), one of the 10 Sexiest Men by Playgirl (1995), and one of the 50 Most Beautiful People by People Magazine (1995)”. Asked how he felt about TV Guide’s readers voting him “The Most Bodacious Man on TV,” Stewart replied, “It still astonishes me. It is truly incomprehensible to this day. But it’s very pleasant.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "bodacious (comparative more bodacious, superlative most bodacious)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, nonstandard) Bodaciously.",
                  "examples": [
                    "Well, he knows by this time, I reckon, that the fastest man afoot can’t noways match speed with a hornet. He taken out through the bresh and thickets, yelpin’ and hollerin’ and hoppin’ most bodacious. He run in a circle, too, for in three minutes he come bellerin’ back, gave one last hop and dove back into the thicket. By this time I figgered he’d wore the hornets out, so I came alive again."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}