{
  "word": "shift",
  "etymologies": [
    {
      "description": [
        "From Middle English schiften, from Old English sċiftan (“to divide, separate into shares; appoint, ordain; arrange, organise”), from Proto-Germanic *skiftijaną, *skiptijaną, from earlier *skipatjaną (“to organise, put in order”), from Proto-Indo-European *skeyb- (“to separate, divide, part”), from Proto-Indo-European *skey- (“to cut, divide, separate, part”). Cognate with Scots schift, skift (“to shift”), West Frisian skifte, skiftsje (“to sort”), Dutch schiften (“to sort, screen, winnow, part”), German schichten (“to stack, layer”), Swedish skifta (“to shift, change, exchange, vary”), Norwegian skifte (“to shift”), Icelandic skipta (“to switch”). See ship."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shift (countable and uncountable, plural shifts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A type of women's undergarment of dress length worn under dresses or skirts, a slip or chemise.",
                  "examples": [
                    "Just last week she bought a new shift at the market."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A simple straight-hanging, loose-fitting dress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A change of workers, now specifically a set group of workers or period of working time.",
                  "examples": [
                    "We'll work three shifts a day till the job's done."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of shifting; a slight movement or change.",
                  "examples": [
                    "There was a shift in the political atmosphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) The gear mechanism in a motor vehicle.",
                  "examples": [
                    "Does it come with a stick-shift?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of Shift (“a modifier button of computer keyboards”).",
                  "examples": [
                    "If you press shift-P, the preview display will change."
                  ]
                }
              ]
            },
            {
              "group": "(computing) A control code or character used to change between different character sets.",
              "entries": [
                {
                  "meaning": "(computing) An instance of the use of such a code or character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A bit shift.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) An infield shift.",
                  "examples": [
                    "Teams often use a shift against this lefty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, crude slang, often with the definite article, usually uncountable) The act of kissing passionately.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A contrivance, a device to try when other methods fail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A trick, an artifice.",
                  "examples": [
                    "Little souls on little shifts rely."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) The extent, or arrangement, of the overlapping of plank, brick, stones, etc., that are placed in courses so as to break joints.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A breaking off and dislocation of a seam; a fault.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) A mutation in which the DNA or RNA from two different sources (such as viruses or bacteria) combine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In violin-playing, any position of the left hand except that nearest the nut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of time in which one's consciousness resides in another reality, usually achieved through meditation or other means.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shift (third-person singular simple present shifts, present participle shifting, simple past and past participle shifted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes figurative) To move from one place to another; to redistribute.",
                  "examples": [
                    "We'll have to shift these boxes to the downtown office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, figurative) To change in form or character; switch.",
                  "examples": [
                    "As a result, I shifted my approach to focus on group-generated activities and broadened the chronological time frame."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change position.",
                  "examples": [
                    "She shifted slightly in her seat.",
                    "His political stance shifted daily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, India) To change residence; to leave and live elsewhere.",
                  "examples": [
                    "We are shifting to America next month.",
                    "Synonym: move"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To change (clothes, especially underwear).",
                  "examples": [
                    "'Tis very good to wash his hands and face often, to shift his clothes, to have fair linen about him, to be decently and comely attired […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, reflexive) To change (someone's) clothes; sometimes specifically, to change underwear.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To change gears (in a car).",
                  "examples": [
                    "I crested the hill and shifted into fifth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typewriters) To move the keys of a typewriter over in order to type capital letters and special characters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computer keyboards) To switch to a character entry mode for capital letters and special characters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To manipulate a binary number by moving all of its digits left or right; compare rotate.",
                  "examples": [
                    "Shifting 1001 to the left yields 10010; shifting it right yields 100."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To remove the first value from an array.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispose of.",
                  "examples": [
                    "How can I shift a grass stain?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hurry; to move quickly.",
                  "examples": [
                    "If you shift, you might make the 2:19."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland, vulgar, slang) To engage in sexual petting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To resort to expedients for accomplishing a purpose; to contrive; to manage.",
                  "examples": [
                    "My Fellow-Slaves were  […]  as courteous to me as I could well-expect; and as they had Plantations of their own, they gave me  […]  such Victuals as they had; especially on dark Nights, and at such Times as I could not shift for myself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To practice indirect or evasive methods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) In violin-playing, to move the left hand from its original position next to the nut.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To change the reality one's consciousness resides in through meditation or other means.",
                  "examples": [
                    "I finally shifted to Hogwarts last night!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}