{
  "word": "spatter",
  "etymologies": [
    {
      "description": [
        "Probably from Middle Low German or Dutch spatten (“to spout, burst”)  +‎ -er (frequentative suffix). Related to spit (“saliva”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spatter (plural spatters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spray or shower of droplets hitting a surface.",
                  "examples": [
                    "As a rough Water-Dog, New-England’s Breed,",
                    "Fresh plaister’d from some Pond with Mud and Weed,",
                    "Round from his Fleece the dirty Puddle shakes",
                    "Rejoicing in the Spatter that he makes:—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spot or spots of a substance spattered on a surface.",
                  "examples": [
                    "There was what looked like a spatter of blood on one wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of droplets hitting a surface.",
                  "examples": [
                    "As Henry lay awake that first night the hiss and spatter of the rain against his window seemed to have a personal grudge against him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A burst or series of sounds resembling the sound of droplets hitting a surface.",
                  "examples": [
                    "[Father Roman] had shriven many simple souls on the battlefields of the Republic, kneeling by the dying on hillsides, in the long grass, in the gloom of the forests, to hear the last confession with the smell of gunpowder smoke in his nostrils, the rattle of muskets, the hum and spatter of bullets in his ears."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A collection of objects scattered like droplets splashed onto a surface.",
                  "examples": [
                    "The attendant had a droopy lower lip, a rust-tone complexion with a spatter of freckles across the cheekbones  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spatter (third-person singular simple present spatters, present participle spattering, simple past and past participle spattered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To splash (someone or something) with small droplets.",
                  "examples": [
                    "When my wet chihuahua shook himself, I was spattered with smelly water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To cover, or lie upon (something) by having been scattered, as if by splashing.",
                  "examples": [
                    "[…]  she seem’d to have woven the Rainbow into a loose Robe, which being so rarified that she might be seen through it, and also spatter’d with radiant Jewells in the forms of Starrs  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To distribute (a liquid) by sprinkling; to sprinkle around.",
                  "examples": [
                    "to spatter blood"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To send out or disperse (something) as if in droplets.",
                  "examples": [
                    "The cabman spattered his few words of English."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To send out small droplets; to splash in small droplets (on or against something).",
                  "examples": [
                    "Make sure the pieces of fish are dry before you put them into the hot oil so that it doesn’t spatter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, figurative) To injure by aspersion; to defame.",
                  "examples": [
                    "Let envy spatter what it can,",
                    "This Embryon will prove a man."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}