{
  "word": "racket",
  "etymologies": [
    {
      "description": [
        "From Middle English raket. Possibly cognate with Middle French rachette, requette (“palm of the hand”). Possibly from Arabic رَاحَةْ اَلْيَد‎ (rāḥat al-yad, “palm of the hand”), although this is doubtful. Instead, the term is more likely to be derived from Dutch raketsen, from Middle French rachasser (“to strike (the ball) back”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "racket (plural rackets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, sports) An implement with a handle connected to a round frame strung with wire, sinew, or plastic cords, and used to hit a ball, such as in tennis or a birdie in badminton.",
                  "examples": [
                    "Synonyms: bat, paddle, racquet"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada) A snowshoe formed of cords stretched across a long and narrow frame of light wood.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad wooden shoe or patten for a man or horse, to allow walking on marshy or soft ground.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "racket (third-person singular simple present rackets, present participle racketing, simple past and past participle racketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike with, or as if with, a racket.",
                  "examples": [
                    "Poor man [is] racketed from one temptation to another."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Attested since the 1500s, of unclear origin; possibly a metathesis of the dialectal term rattick (“rattle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "racket (plural rackets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud noise.",
                  "examples": [
                    "Synonyms: din, noise, ruckus",
                    "Power tools work quickly, but they sure make a racket.",
                    "With all the racket they're making, I can't hear myself think!",
                    "What's all this racket?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An illegal scheme for profit; a fraud or swindle; or both coinstantiated.",
                  "examples": [
                    "War is a racket. It always has been. It is possibly the oldest, easily the most profitable, surely the most vicious. It is the only one international in scope. It is the only one in which the profits are reckoned in dollars and the losses in lives... Of course, it isn't put that crudely in war time. It is dressed into speeches about patriotism, love of country, and \"we must all put our shoulders to the wheel,\" but the profits... skyrocket—and are safely pocketed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) A carouse; any reckless dissipation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, slang) Something taking place considered as exciting, trying, unusual, etc. or as an ordeal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "racket (third-person singular simple present rackets, present participle racketing, simple past and past participle racketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a clattering noise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To be dissipated; to carouse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}