{
  "word": "mystery",
  "etymologies": [
    {
      "description": [
        "From Middle English mysterie, from Anglo-Norman misterie (Old French mistere), from Latin mysterium, from Ancient Greek μυστήριον (mustḗrion, “a mystery, a secret, a secret rite”), from μύστης (mústēs, “initiated one”), from μυέω (muéō, “I initiate”), from μύω (múō, “I shut”). Displaced native Old English ġerȳne."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mystery (countable and uncountable, plural mysteries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something secret or unexplainable; an unknown.",
                  "examples": [
                    "The truth behind the events remains a mystery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone or something with an obscure or puzzling nature.",
                  "examples": [
                    "That man is a mystery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A secret or mystical meaning.",
                  "examples": [
                    "...and, not knowing the meaning or misterie of her pollicie, forgat no termes of reproche or rigorous rebuke against his chast doughter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A religious truth not understandable by the application of human reason alone (without divine aid).",
                  "examples": [
                    "If God should please to reveal unto us this great mystery of the Trinity, or some other mysteries in our holy religion, we should not be able to understand them, unless he would bestow on us some new faculties of the mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic outside Eastern Orthodoxy) A sacrament.",
                  "examples": [
                    "There are seven mysteries, or sacraments, in the Greek church, viz. baptism, the chrism (a rite peculiar to this church), the eucharist, confession, ordination, marriage, and the holy oil."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) A secret religious celebration, admission to which was usually through initiation.",
                  "examples": [
                    "the Eleusinian mysteries",
                    "the Mysteries of Mithras"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism) A particular event or series of events in the life of Christ.",
                  "examples": [
                    "The second decade of the Rosary concerns the Sorrowful mysteries, such as the crucifixion and the crowning with thorns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A craft, art or trade; specifically a guild of craftsmen.",
                  "examples": [
                    "The trades, the crafts, the mysteries, would all be losers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}