{
  "word": "depression",
  "etymologies": [
    {
      "description": [
        "From Middle English depression, depressioun, from Old French depression, from Latin dēpressiō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "depression (countable and uncountable, plural depressions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, usually uncountable) A state of mind producing serious, long-term lowering of enjoyment of life or inability to visualize a happy future.",
                  "examples": [
                    "I used to suffer from depression, but now I'm mostly content with my life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(psychology, countable) A period of low morale or unhappiness (a period of experiencing the above-mentioned state of mind) which lasts longer than several weeks and may include ideation of self-inflicted injury or suicide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) An area that is lower in topography than its surroundings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) An area of lowered air pressure that generally brings moist weather, sometimes promoting hurricanes and tornadoes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) A period of major economic contraction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics, US) Four consecutive quarters of negative, real GDP growth. See NBER.",
                  "examples": [
                    "The Great Depression was the worst financial event in US history."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of lowering or pressing something down.",
                  "examples": [
                    "Depression of the lever starts the machine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, physiology) A lowering, in particular a reduction in a particular biological variable or the function of an organ, in contrast to elevation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}