{
  "word": "trundle",
  "etymologies": [
    {
      "description": [
        "From Middle English trondlin, trondelen, a variation of Middle English trendlen. More at trendle, trindle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trundle (plural trundles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Ellipsis of trundle bed.: A low bed on wheels that can be rolled underneath another bed.",
                  "examples": [
                    "Synonyms: trundle bed, truckle bed, truckle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A low wagon or cart on small wheels, used to transport things.",
                  "examples": [
                    "[…]  you may  […]  place the whole weighty Clod upon a Trundle to be convey’d, and Replanted where you please,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A small wheel or roller.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A motion as of something moving upon little wheels or rollers; a rolling motion.",
                  "examples": [
                    "There was something expert and even vicious in the flick of Paul’s arm and the hard momentary trundle of the [cricket] ball along the curving rails."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound made by an object being moved on wheels.",
                  "examples": [
                    "[…]  an old man who could always be located from far away by the sound of a scythe or the trundle of a wheelbarrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A lantern wheel, or one of its bars.",
                  "examples": [
                    "The Cog-wheels in most Wind-Mills are (in the diameter) 8. foot or under  […]  the trundle is at the least two foot, which is 4. to one."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A spool of golden thread.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trundle (third-person singular simple present trundles, present participle trundling, simple past and past participle trundled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To wheel or roll (an object on wheels), especially by pushing, often slowly or heavily.",
                  "examples": [
                    "Every morning, the vendors trundle their carts out into the market.",
                    "to trundle a bed or a gun carriage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To transport (something or someone) using an object on wheels, especially one that is pushed.",
                  "examples": [
                    "[…]  they are attended like the Lords and Princes of the earth, with mighty retinues, and are carryed in coaches with foure or six horses a peece in them, when a wheele barrow such as they trundle white wine vineger about the towne were a great deale fitter for them  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move heavily (on wheels).",
                  "examples": [
                    "[…]  he can glibly run over Non-sense, as an empty Cart trundles down a Hill."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (something or someone), often heavily or clumsily.",
                  "examples": [
                    "I’ll clap a pair of horses to your chaise that shall trundle you off in a twinkling,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move, often heavily or clumsily.",
                  "examples": [
                    "[…]  we set off again, the dog trundling apathetic at his master’s heels,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (something) to roll or revolve; to roll (something) along.",
                  "examples": [
                    "Synonym: roll",
                    "to trundle a hoop or a ball"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To roll or revolve; to roll along.",
                  "examples": [
                    "Synonym: roll"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}