{
  "word": "coupon",
  "etymologies": [
    {
      "description": [
        "From French coupon, from couper (“to cut”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coupon (plural coupons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A section of a ticket, showing the holder to be entitled to some specified accommodation or service, as to a passage over a designated line of travel, a particular seat in a theater, a discount, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A voucher issued by a manufacturer or retailer which offers a discount on a particular product.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, obsolete) A certificate of interest due, printed at the bottom of transferable bonds (state, railroad, etc.), given for a term of years, designed to be cut off and presented for payment when the interest is due; an interest warrant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Any interest payment made or due on a bond, debenture or similar (no longer by a physical coupon).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK politics, historical) The letter sent to parliamentary candidates at the 1918 general election, endorsing them as official representatives of the coalition government.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A person's face.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(manufacturing) A small sample of a bulk material, prepared so that test failure will be representative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "coupon (third-person singular simple present coupons, present participle couponing or couponning, simple past and past participle couponed or couponned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To use coupons to a such extent that makes the user actively looking for coupons in magazines, online and whatever they can be found.",
                  "examples": [
                    "Jenna coupons and she goes through three magazines a day to find the coupons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}