{
  "word": "what",
  "etymologies": [
    {
      "description": [
        "From Middle English what, from Old English hwæt (“what”), from Proto-Germanic *hwat (“what”), from Proto-Indo-European *kʷód (“what”), neuter form of *kʷós (“who”). Cognate with Scots whit (“what”), North Frisian wat (“what”), Saterland Frisian wat (“what”), West Frisian wat (“what”), Dutch wat (“what”), Low German wat (“what”), German was (“what”), Danish hvad (“what”), Norwegian Bokmål hva (“what”), Swedish vad (“what”), Norwegian Nynorsk kva (“what”), Icelandic hvað (“what”), Latin quod (“what, which”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "what (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(interrogative) In what way; to what extent.",
                  "examples": [
                    "What does it matter?",
                    "What do you care?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used before a prepositional phrase to emphasise that something is taken into consideration as a cause or reason; usually used in combination with 'with' (see what with), and much less commonly with other prepositions.",
                  "examples": [
                    "In short; what by the indiscretion of people here, what by the rebound which came often back from London, what by the private interests and ambitious views of persons in the French court, and what by other causes unnecessary to be examined now, the most private transactions came to light [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "what",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(interrogative) Which, especially which of an open-ended set of possibilities.",
                  "examples": [
                    "What colour are you going to use?",
                    "What time is it?",
                    "What kind of car is that?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(relative) Which; the ... that.",
                  "examples": [
                    "I know what colour I am going to use.",
                    "That depends on what answer is received."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(relative) Any ... that; all ... that; whatever.",
                  "examples": [
                    "He seems to have lost what sense he had.",
                    "What money I earn is soon spent."
                  ]
                }
              ]
            },
            {
              "group": "Emphasises that something is noteworthy or remarkable in quality or degree, in either a good or bad way; may be used in combination with certain other determiners, especially 'a', less often 'some'.",
              "entries": [
                {
                  "meaning": "Used to form exclamations.",
                  "examples": [
                    "Synonym: such",
                    "What nonsense!",
                    "Wow! What a speech.",
                    "What some lovely weather we've been having!",
                    "What beautiful children you have.",
                    "With what passion she sings!"
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "what (countable and uncountable, plural whats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, uncountable) Something; thing; stuff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The identity of a thing, as an answer to a question of what.",
                  "examples": [
                    "The emphasis on the interplay between the hows and whats of interpretive practice is paramount."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that is addressed by what, as opposed to a person, addressed by who.",
                  "examples": [
                    "Regina: What are you?",
                    "Rumplestiltskin: What? What? What? My, my, what a rude question! I am not a what."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}