{
  "word": "excel",
  "etymologies": [
    {
      "description": [
        "From Middle English excellen, from Old French exceller, from Latin excellere, excelsum; ex (“out”) + *cellō, an unattested verb root found in culmen (“height, top”); Compare French exceller. See also culminate, column."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "excel (third-person singular simple present excels, present participle excelling, simple past and past participle excelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surpass someone or something; to be better or do better than someone or something.",
                  "examples": [
                    "La Rochefoucauld, the French philosopher, said: \"If you want enemies, excel your friends; but if you want friends, let your friends excel you.\" Why is that true? Because when our friends excel us, that gives them a feeling of importance; but when we excel them, that gives them a feeling of inferiority and arouses envy and jealousy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be much better than others.",
                  "examples": [
                    "If, then, there is something in what the poets say, and jealousy is natural to the divine power, it would probably occur in this case above all, and all who excelled in this knowledge would be unfortunate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic, rare) To exceed, to go beyond",
                  "examples": [
                    "She opened; but to shut / Excelled her power: the gates wide open stood  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}