{
  "word": "bogie",
  "etymologies": [
    {
      "description": [
        "A dialectal word from Northern England of unknown origin which is unrelated to bogey (“hostile supernatural creature; terrifying thing, bugbear”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bogie (plural bogies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England) A low, hand-operated truck, generally with four wheels, used for transporting objects or for riding on as a toy; a trolley. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Britain, Canada, New Zealand, US, by extension, rail transport, also attributively) One of two sets of wheels under a locomotive or railcar; also, a structure with axles and wheels under a locomotive, railcar, or semi which provides support and reduces vibration for the vehicle.",
                  "examples": [
                    "Synonym: (US) railroad truck"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, by extension) A set of wheels attached to one of an aircraft's landing gear, or the structure connecting the wheels in one such set.",
                  "examples": [
                    "Although most A320s have two wheels on each of their main gear, a few built for the Indian market have four-wheel bogies, halving the amount of weight on each wheel and allowing the aircraft to use runways that couldn't withstand the ground pressure from a standard A320."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dated, India, rail transport) A railway carriage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Possibly from bogart (“to selfishly take or keep something, to hog; especially to hold a joint (marijuana cigarette) dangling between the lips instead of passing it on”) +‎ -ie (suffix forming colloquial nouns). Bogart is derived from the surname of the American actor Humphrey Bogart (1899–1957), who was frequently shown smoking (tobacco) cigarettes in his films. The verb was popularized by its use in the song “Don’t Bogart Me” (1968) by the rock group Fraternity of Man which appeared in the soundtrack of the film Easy Rider (1969); the song has the lines “Don’t bogart that joint my friend. / Pass it over to me.”"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bogie (plural bogies)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, slang) A marijuana cigarette; a joint.",
                  "examples": [
                    "Synonyms: see Thesaurus:marijuana cigarette"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of bogey."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bogie (plural bogies)",
          "definitionGroups": [
            {
              "group": "Alternative spelling of bogey",
              "entries": [
                {
                  "meaning": "A ghost, goblin, or other hostile supernatural creature.",
                  "examples": []
                },
                {
                  "meaning": "A standard of performance set up as a mark to be aimed at in competition.",
                  "examples": []
                },
                {
                  "meaning": "(aviation, military, slang) An unidentified aircraft, especially as observed as a spot on a radar screen and suspected to be hostile.",
                  "examples": []
                },
                {
                  "meaning": "(golf) A score of one over par on a hole.",
                  "examples": []
                },
                {
                  "meaning": "(Britain, colloquial) A piece of dried mucus in or removed from the nostril.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}