{
  "word": "inspiration",
  "etymologies": [
    {
      "description": [
        "From Middle English inspiracioun, from Old French inspiration, from Late Latin īnspīrātiōnem (nominative: īnspīrātiō), from Latin īnspīrātus (past participle of inspīrō).\nMorphologically inspire +‎ -ation. Displaced native Old English onbryrdnes (literally “in-pricked-ness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "inspiration (countable and uncountable, plural inspirations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physiology, uncountable) The drawing of air into the lungs, accomplished in mammals by elevation of the chest walls and flattening of the diaphragm, as part of the act of respiration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A breath, a single inhalation.",
                  "examples": [
                    "Laughing is produced by an inspiration succeeded by a succession of short imperfect expirations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A supernatural divine influence on the prophets, apostles, or sacred writers, by which they were qualified to communicate moral or religious truth with authority; a supernatural influence which qualifies people to receive and communicate divine truth; also, the truth communicated.",
                  "examples": [
                    "The question, therefore, at issue is, not whether those external means be sufficient without grace and divine inspiration, for none pretends that\": but, in order to hinder men from feigning or imagining an inspiration, whether it has not been God's economy, and his usual conduct to make his inspiration walk hand in hand with certain means of fact, which men can neither feign in the air without being convicted of falsehood, nor imagine without illusion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of an elevating or stimulating influence upon the intellect, emotions or creativity.",
                  "examples": [
                    "She was waiting for inspiration to write a book.",
                    "Usage notes: In this sense, it may be followed by the adposition to in relation to the person being influenced, and for or to in relation to the idea or activity:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person, object, or situation which quickens or stimulates an influence upon the intellect, emotions or creativity.",
                  "examples": [
                    "The trip was an inspiration to her for writing a book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A new idea, especially one which arises suddenly and is clever or creative.",
                  "examples": [
                    "Mrs. Balfame had an inspiration. \"My God!\" she exclaimed, springing to her feet, \"the murderer . . . was hidden in the cellar or attic all night, all the next day! He may be here yet!\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}