{
  "word": "idea",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin idea (“a (Platonic) idea; archetype”), from Ancient Greek ἰδέα (idéa, “notion, pattern”), from εἴδω (eídō, “I see”), ultimately from Proto-Indo-European *weyd- (“to know; see”). Cognate with French idée. Doublet of idée. Related to idol, idolum, and eidolon."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "idea (plural ideas or (rare) ideæ)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) An abstract archetype of a given thing, compared to which real-life examples are seen as imperfect approximations; pure essence, as opposed to actual examples. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The conception of someone or something as representing a perfect example; an ideal. [16th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The form or shape of something; a quintessential aspect or characteristic. [16th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An image of an object that is formed in the mind or recalled by the memory. [from 16th c.]",
                  "examples": [
                    "The mere idea of you is enough to excite me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "More generally, any result of mental activity; a thought, a notion; a way of thinking. [from 17th c.]",
                  "examples": [
                    "Ideas won't go to jail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conception in the mind of something to be done; a plan for doing something, an intention. [from 17th c.]",
                  "examples": [
                    "I have an idea of how we might escape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A purposeful aim or goal; intent",
                  "examples": [
                    "Yeah, that's the idea."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vague or fanciful notion; a feeling or hunch; an impression. [from 17th c.]",
                  "examples": [
                    "He had the wild idea that if he leant forward a little, he might be able to touch the mountain-top."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A musical theme or melodic subject. [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}