{
  "word": "telescope",
  "etymologies": [
    {
      "description": [
        "tele- +‎ -scope.\nFrom Latin tēlescopium, from Ancient Greek τηλεσκόπος (tēleskópos, “far-seeing”), from τῆλε (têle, “afar”) + σκοπέω (skopéō, “I look at”).",
        "Coined in 1611 by the Greek mathematician Giovanni Demisiani for one of Galileo Galilei's instruments presented at a banquet at the Accademia dei Lincei. Doublet of Telescopium."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "telescope (plural telescopes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A monocular optical instrument that magnifies distant objects, especially in astronomy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any instrument used in astronomy for observing distant objects (such as a radio telescope).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A retractable tubular support for lights.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "telescope (third-person singular simple present telescopes, present participle telescoping, simple past and past participle telescoped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To extend or contract in the manner of a telescope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To slide or pass one within another, after the manner of the sections of a small telescope or spyglass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come into collision, as railway cars, in such a manner that one runs into another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, mathematics, of a series) To collapse, via cancellation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}