{
  "word": "brazen",
  "etymologies": [
    {
      "description": [
        "From Middle English brasen, from Old English bræsen (“brazen, of brass”); equivalent to brass +‎ -en (compare golden).",
        "The word originally meant “of brass”; the figurative verb sense (as in brazen it out (“face impudently”)) dates from the 1550s (perhaps evoking the sense “face like brass, unmoving and not showing shame”), and the adjective sense “impudent” from the 1570s. Compare bold as brass."
      ],
      "adjectives": [
        {
          "description": "brazen (comparative more brazen, superlative most brazen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Pertaining to, made of, or resembling brass (in color or strength).",
                  "examples": [
                    "Brazen or rather copper swords seem to have been next introduced; these in process of time, workmen learned to harden by the addition of some other metal or mineral, which rendered them almost equal in temper to iron."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sounding harsh and loud, like brass cymbals or brass instruments.",
                  "examples": [
                    "And now the Trumpets terribly from far, / With rattling Clangor, rouze the sleepy War. / The Souldiers Shouts succeed the Brazen Sounds, / And Heav'n, from Pole to Pole, the Noise rebounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Extremely strong; impenetrable; resolute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Shamelessly shocking and offensive; audacious; impudent; barefaced; immodest, unblushing. [from 1570s.]",
                  "examples": [
                    "She was brazen enough to deny stealing the handbag even though she was caught on closed-circuit television doing so."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "brazen (third-person singular simple present brazens, present participle brazening, simple past and past participle brazened)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To turn a brass color.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Generally followed by out or through: to carry through in a brazen manner; to act boldly despite embarrassment, risk, etc. [from 1550s.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}