{
  "word": "culture",
  "etymologies": [
    {
      "description": [
        "From Middle French culture (“cultivation; culture”), from Latin cultūra (“cultivation; culture”), from cultus, perfect passive participle of colō (“till, cultivate, worship”) (related to colōnus and colōnia), from Proto-Indo-European *kʷel- (“to move; to turn (around)”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "culture (countable and uncountable, plural cultures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The arts, customs, lifestyles, background, and habits that characterize humankind, or a particular society or nation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The beliefs, values, behaviour and material objects that constitute a people's way of life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The conventional conducts and ideologies of a community; the system comprising the accepted norms and values of a society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anthropology) Any knowledge passed from one generation to the next, not necessarily with respect to human beings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) Cultivation.",
                  "examples": [
                    "The Culture of Spring-Flowering Bulbs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(microbiology) The process of growing a bacterial or other biological entity in an artificial medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The growth thus produced.",
                  "examples": [
                    "I'm headed to the lab to make sure my cell culture hasn't died."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of bacteria.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cartography) The details on a map that do not represent natural features of the area delineated, such as names and the symbols for towns, roads, meridians, and parallels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaeology) A recurring assemblage of artifacts from a specific time and place that may constitute the material culture remains of a particular past human society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(euphemistic) Ethnicity, race (and its associated arts, customs, etc.)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "culture (third-person singular simple present cultures, present participle culturing, simple past and past participle cultured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to maintain in an environment suitable for growth (especially of bacteria) (compare cultivate)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to increase the artistic or scientific interest (in something) (compare cultivate)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}