{
  "word": "sidetrack",
  "etymologies": [
    {
      "description": [
        "side +‎ track"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sidetrack (plural sidetracks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A second, relatively short length of track just to the side of a railroad track, joined to the main track by switches at one or both ends, used either for unloading freight, or to allow two trains on a same track to meet (opposite directions) or pass (same direction); a railroad siding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sometimes) Any auxiliary railroad track, as differentiated from a siding, that runs adjacent to the main track.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A smaller tunnel or well drilled as an auxiliary off a main tunnel or well.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An alternate train of thought, issue, topic, or activity, that is a deviation or distraction from the topic at hand or central activity, and secondary or subordinate in importance or effectiveness.",
                  "examples": [
                    "Stay focused on the story; you keep getting lost in all of these little sidetracks."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sidetrack (third-person singular simple present sidetracks, present participle sidetracking, simple past and past participle sidetracked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) To divert (a locomotive or train) on to a lesser used track in order to allow other trains to pass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To divert or distract (someone) from a main issue or course of action with an alternate or less relevant topic or activity; or, to use deliberate trickery or sly wordplay when talking to (a person) in order to avoid discussion of a subject.",
                  "examples": [
                    "Sorry I'm late. I got sidetracked helping my friend move some furniture.",
                    "The politician sidetracked the reporter with a story about duck hunting instead of a direct response to the question that was asked.",
                    "I hope you can sidetrack the teacher with questions so we don't have to take the exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sideline; to push aside; to divert or distract from, reducing (something) to a secondary or subordinate position.",
                  "examples": [
                    "The project was sidetracked in favor of a more popular program.",
                    "He has sidetracked this debate for far too long."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To deviate briefly from the topic at hand.",
                  "examples": [
                    "Just to sidetrack a little bit from the subject I will explain my reasoning.",
                    "To sidetrack for a moment, let me commend this team for their outstanding efforts."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}