{
  "word": "fight",
  "etymologies": [
    {
      "description": [
        "From Middle English fighten, from Old English feohtan (“to fight, combat, strive”), from Proto-West Germanic *fehtan, from Proto-Germanic *fehtaną (“to comb, tease, shear, struggle with”), from Proto-Indo-European *peḱ- (“to comb, shear”).",
        "Cognate with Scots fecht (“to fight”), West Frisian fjochtsje, fjuchte (“to fight”), Dutch vechten (“to fight”), Low German fechten (“to fight”), German fechten (“to fight, fence”), Swedish fäkta (“to fence, to fight (using blade weapons), to wave vigorously (and carelessly) with one's arms”), Latin pectō (“comb, thrash”, verb), Albanian pjek (“to hit, strive, fight”), Ancient Greek πέκω (pékō, “comb or card wool”, verb). Related also to Old English feht (“wool, shaggy pelt, fleece”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fight (third-person singular simple present fights, present participle fighting, simple past fought, past participle fought or (archaic) foughten)",
          "definitionGroups": [
            {
              "group": "Senses relating to physical conflict:",
              "entries": [
                {
                  "meaning": "(transitive) To engage in combat with; to oppose physically, to contest with.",
                  "examples": [
                    "My grandfather fought the Nazis in World War II."
                  ]
                },
                {
                  "meaning": "(transitive) To conduct or engage in (battle, warfare etc.).",
                  "examples": [
                    "Our soldiers fought the battle just over that hill."
                  ]
                },
                {
                  "meaning": "(intransitive) To contend in physical conflict, either singly or in war, battle etc.",
                  "examples": [
                    "A wounded animal will fight tooth and nail; relentless, savage and murderous."
                  ]
                },
                {
                  "meaning": "(reciprocal) To contend in physical conflict with each other, either singly or in war, battle etc.",
                  "examples": [
                    "The two boxers have been fighting for more than half an hour."
                  ]
                },
                {
                  "meaning": "(causative, archaic) To cause to fight; to manage or manoeuvre in a fight.",
                  "examples": [
                    "to fight cocks; to fight one's ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To strive for something; to campaign or contend for success.",
                  "examples": [
                    "He fought for the Democrats in the last election."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To try to overpower; to fiercely counteract.",
                  "examples": [
                    "The government pledged to fight corruption."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of colours or other design elements: to clash; to fail to harmonize.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English fight, feyght, fiȝt, fecht, from Old English feoht, ġefeoht, from Proto-West Germanic *fehtan, from Proto-Germanic *fehtą, *gafehtą (“fight, struggle”), from Proto-Germanic *fehtaną (“to struggle with”). Cognate with Dutch gevecht, German Gefecht."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fight (countable and uncountable, plural fights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An occasion of fighting.",
                  "examples": [
                    "One of them got stuck in a chokehold and got stabbed to death during the fight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A battle between opposing armies.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A physical confrontation or combat between two or more people or groups.",
                  "examples": [
                    "Watch your language! Are you looking for a fight?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A boxing or martial arts match.",
                  "examples": [
                    "I'm going to Nick’s to watch the big fight tomorrow night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A conflict, possibly nonphysical, with opposing ideas or forces; strife.",
                  "examples": [
                    "I'll put up a fight to save this company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The will or ability to fight.",
                  "examples": [
                    "That little guy has a bit of fight in him after all.   As soon as he saw the size of his opponent, all the fight went out of him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A screen for the combatants in ships; an arming.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}