{
  "word": "high",
  "etymologies": [
    {
      "description": [
        "From Middle English high, heigh, heih, from Old English hēah (“high, tall, lofty, high-class, exalted, sublime, illustrious, important, proud, haughty, deep, right”), from Proto-West Germanic *hauh (“high”), from Proto-Germanic *hauhaz (“high”), from Proto-Indo-European *kewk- (“to elevate, height”).",
        "Cognate with Scots heich (“high”), Saterland Frisian hooch (“high”), West Frisian heech (“high”), Dutch hoog (“high”), Low German hoog (“high”), German hoch (“high”), Swedish hög (“high”), Norwegian høy (“high”), Icelandic hár (“high”), Lithuanian kaukas (“bump, boil, sore”), Russian ку́ча (kúča, “pile, heap, stack, lump”)."
      ],
      "adjectives": [
        {
          "description": "high (comparative higher, superlative highest)",
          "definitionGroups": [
            {
              "group": "Physically elevated, extending above a base or average level:",
              "entries": [
                {
                  "meaning": "Very elevated; extending or being far above a base; tall; lofty.",
                  "examples": [
                    "The balloon rose high in the sky.   The wall was high.   a high mountain"
                  ]
                },
                {
                  "meaning": "Relatively elevated; rising or raised above the average or normal level from which elevation is measured.",
                  "examples": [
                    "A nightgown with a high neck and long sleeves may have the fullness set into a yoke."
                  ]
                },
                {
                  "meaning": "(baseball, of a ball) Above the batter's shoulders.",
                  "examples": [
                    "the pitch (or: the ball) was high"
                  ]
                },
                {
                  "meaning": "Pertaining to (or, especially of a language: spoken in) in an area which is at a greater elevation, for example more mountainous, than other regions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having a specified elevation or height; tall.",
                  "examples": [
                    "three feet high   three Mount Everests high"
                  ]
                }
              ]
            },
            {
              "group": "Elevated in status, esteem, or prestige, or in importance or development; exalted in rank, station, or character.",
              "entries": [
                {
                  "meaning": "Most exalted; foremost.",
                  "examples": [
                    "the high priest, the high officials of the court, the high altar"
                  ]
                },
                {
                  "meaning": "Of great importance and consequence: grave (if negative) or solemn (if positive).",
                  "examples": [
                    "high crimes, the high festival of the sun"
                  ]
                },
                {
                  "meaning": "Consummate; advanced (e.g. in development) to the utmost extent or culmination, or possessing a quality in its supreme degree, at its zenith.",
                  "examples": [
                    "high (i.e. intense) heat; high (i.e. full or quite) noon; high (i.e. rich or spicy) seasoning; high (i.e. complete) pleasure; high (i.e. deep or vivid) colour; high (i.e. extensive, thorough) scholarship; high tide; high [tourism] season; the High Middle Ages"
                  ]
                },
                {
                  "meaning": "Advanced in complexity (and hence potentially abstract and/or difficult to comprehend).",
                  "examples": [
                    "Plain living and high thinking are no more."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in several set phrases) Very traditionalist and conservative, especially in favoring older ways of doing things; see e.g. high church, High Tory.",
                  "examples": [
                    "The letter of a \"Pioneer\" was sent to the Chronicle office by a very respectable man, of a high conservative family, but whose interests have been injuriously affected by the constant fluctuations in the commercial policy of England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Elevated in mood; marked by great merriment, excitement, etc.",
                  "examples": [
                    "in high spirits"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a lifestyle) Luxurious; rich.",
                  "examples": [
                    "high living, the high life"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lofty, often to the point of arrogant, haughty, boastful, proud.",
                  "examples": [
                    "a high tone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with \"on\" or \"about\") Keen, enthused.",
                  "examples": [
                    "I'm not that high about the relationship."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a body of water) With tall waves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Remote (to the north or south) from the equator; situated at (or constituting) a latitude which is expressed by a large number.",
                  "examples": [
                    "high latitude, fish species in high arctic and antarctic areas"
                  ]
                }
              ]
            },
            {
              "group": "Large, great (in amount or quantity, value, force, energy, etc).",
              "entries": [
                {
                  "meaning": "Having a large or comparatively larger concentration of (a substance, which is often but not always linked by \"in\" when predicative).",
                  "examples": [
                    "Carrots are high in vitamin A.   made from a high-copper alloy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(acoustics) Acute or shrill in pitch, due to being of greater frequency, i.e. produced by more rapid vibrations (wave oscillations).",
                  "examples": [
                    "The note was too high for her to sing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonetics) Made with some part of the tongue positioned high in the mouth, relatively close to the palate.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(card games) Greater in value than other cards, denominations, suits, etc.",
              "entries": [
                {
                  "meaning": "(poker) Having the highest rank in a straight, flush or straight flush.",
                  "examples": [
                    "I have KT742 of the same suit. In other words, a K-high flush.",
                    "9-high straight = 98765 unsuited",
                    "Royal Flush = AKQJT suited = A-high straight flush"
                  ]
                },
                {
                  "meaning": "(of a card or hand) Winning; able to take a trick, win a round, etc.",
                  "examples": [
                    "North's hand was high. East was in trouble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of meat, especially venison) Strong-scented; slightly tainted/spoiled; beginning to decompose.",
                  "examples": [
                    "Epicures do not cook game before it is high.",
                    "The tailor liked his meat high."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Intoxicated; under the influence of a mood-altering drug, formerly usually alcohol, but now (from the mid-20th century) usually not alcohol but rather marijuana, cocaine, heroin, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a sailing ship) Near, in its direction of travel, to the (direction of the) wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports such as soccer) Positioned up the field, towards the opposing team's goal.",
                  "examples": [
                    "Our defensive line is too high."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "high (comparative higher, superlative highest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In or to an elevated position.",
                  "examples": [
                    "How high above land did you fly?",
                    "The desks were piled high with magazines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In or at a great value.",
                  "examples": [
                    "Costs have grown higher this year again."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At a pitch of great frequency.",
                  "examples": [
                    "I certainly can't sing that high."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "high (plural highs)",
          "definitionGroups": [
            {
              "group": "A high point or position, literally (as, an elevated place; a superior region; a height; the sky; heaven).or figuratively (as, a point of success or achievement; a time when things are at their best, greatest, most numerous, maximum, etc).",
              "entries": [
                {
                  "meaning": "The maximum atmospheric temperature recorded at a particular location, especially during one 24-hour period.",
                  "examples": [
                    "Today's high was 32 °C."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of euphoria, from excitement or from an intake of drugs.",
                  "examples": [
                    "They will have to reflect on a seventh successive defeat in a European final while Chelsea try to make sense of an eccentric season rife with controversy and bad feeling but once again one finishing on an exhilarating high."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A drug that gives such a high.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology, informal) A large area of elevated atmospheric pressure; an anticyclone.",
                  "examples": [
                    "A large high is centred on the Azores."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) The highest card dealt or drawn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "high (third-person singular simple present highs, present participle highing, simple past and past participle highed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To rise.",
                  "examples": [
                    "The sun higheth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See hie."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "high (third-person singular simple present highs, present participle highing, simple past and past participle highed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of hie (“to hasten”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}