{
  "word": "stadium",
  "etymologies": [
    {
      "description": [
        "From Latin stadium (“a measure of length, a race course”) (commonly one-eighth of a Roman mile; translated in early English Bibles by furlong), from Ancient Greek στάδιον (stádion, “a measure of length, a running track”), especially the track at Olympia, which was one stadium in length. The Greek word may literally mean \"fixed standard of length\" (from στάδιος (stádios, “firm, fixed”), from Proto-Indo-European *steh₂-, whence also stand and Latin stare). Doublet of stade, stadion, and estadio."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stadium (plural stadiums or stadia)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A venue where sporting events are held.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An Ancient Greek racecourse, especially, the Olympic course for foot races.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) Synonym of stadion, a Greek unit of length equivalent to about 185 m.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of telemeter for measuring the distance of an object of known dimensions, by observing the angle it subtends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surveying) a graduated rod used to measure the distance of the place where it stands from an instrument having a telescope, by observing the number of the graduations of the rod that are seen between certain parallel wires (stadia wires) in the field of view of the telescope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) A life stage of an organism.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}