{
  "word": "cricket",
  "etymologies": [
    {
      "description": [
        "From Middle English creket, crykett, crykette, from Old French criket (with diminutive -et) from criquer (“to make a cracking sound; creak”), from Middle Dutch kricken (“to creak; crack”), from Proto-West Germanic *krakōn, from Proto-Germanic *krakōną, related to Middle English creken, criken (“to creak”), all ultimately of imitative origin.",
        "Compare Dutch kriek (“cricket”), Middle Dutch krikel, criekel, crekel (“cricket”) (with diminituve -el), Middle Low German krikel, krekel (“cricket”), German Kreckel (“cricket”). More at creak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cricket (plural crickets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "An insect in the order Orthoptera, especially family Gryllidae, that makes a chirping sound by rubbing its wing casings against combs on its hind legs.",
              "entries": [
                {
                  "meaning": "(US, slang, humorous, in the plural) In the form crickets: absolute silence; no communication.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A signalling device used by soldiers in hostile territory to identify themselves to a friendly in low visibility conditions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A relatively small area of a roof constructed to divert water from a horizontal intersection of the roof with a chimney, wall, expansion joint, or other projection.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, slang) An aural warning sound consisting of a continuously-repeating chime, designed to be difficult for pilots to ignore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Perhaps from a Flemish dialect of Dutch met de krik ketsen (“to chase a ball with a curved stick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cricket (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A game played outdoors with bats and a ball between two teams of eleven, popular in England and many Commonwealth countries.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain, usually in negative constructions) An act that is fair and sportsmanlike.",
                  "examples": [
                    "Antonym: not cricket"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A variant of the game of darts. See Cricket (darts).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cricket (third-person singular simple present crickets, present participle cricketing, simple past and past participle cricketed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, intransitive) To play the game of cricket.",
                  "examples": [
                    "Judge: Your family is in destitute circumstances. How do you get your living?",
                    "Bannerman: By cricketing, your Worship."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The etymology is unknown. A few similar words exist in Germanic languages, such as Norwegian krakk (“stool”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cricket (plural crickets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A wooden footstool.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}