{
  "word": "retire",
  "etymologies": [
    {
      "description": [
        "From Middle French retirer (“draw back”), from prefix re- (“back”), + verb tirer (“draw, pull”), from Old French tirer, tirier (“to draw out, arrange, adorn”), from tire, tiere (“row, rank, order, dress”) of Germanic origin, akin to Old English and Old Saxon Old Saxon tīr (“fame, glory, ornament”), Old English tīer (“rank, row”), Old High German ziari, zēri (“ornament”), German German Zier (“ornament, adornment”), zieren (“to adorn”). More at tier."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "retire (plural retires)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The act of retiring, or the state of being retired.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place to which one retires.",
                  "examples": [
                    "Synonym: retreat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A call sounded on a bugle, announcing to skirmishers that they are to retire, or fall back.",
                  "examples": [
                    "At the retire, the cavalry fell back."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "retire (third-person singular simple present retires, present participle retiring, simple past and past participle retired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To stop working on a permanent basis, usually because of old age or illness.",
                  "examples": [
                    "Having made a large fortune, he retired.",
                    "He wants to retire at 55.",
                    "She decided to retire from her banking job due to stress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sometimes reflexive) To withdraw; to take away.",
                  "examples": [
                    "As when the sun is present all the year, / And never doth retire his golden ray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cease use or production of something.",
                  "examples": [
                    "The steamship made thousands of trips over several decades before it was retired by the shipping company.",
                    "When a hurricane becomes so deadly or destructive that future use would be insensitive, officials may retire the name of the hurricane."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To withdraw from circulation, or from the market; to take up and pay.",
                  "examples": [
                    "The central bank retired those notes five years ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to retire; specifically, to designate as no longer qualified for active service; to place on the retired list.",
                  "examples": [
                    "The board retired the old major."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, cricket, of a batsman) To voluntarily stop batting before being dismissed so that the next batsman can bat.",
                  "examples": [
                    "Jones retired in favour of Smith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, baseball, of a fielder) To make a play which results in a runner or the batter being out, either by means of a put out, fly out or strikeout.",
                  "examples": [
                    "Jones retired Smith 6-3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go back or return; to withdraw or retreat, especially from public view; to go into privacy.",
                  "examples": [
                    "I will retire to the study.",
                    "to retire from the world",
                    "to retire from the public eye"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To retreat from action or danger; to withdraw for safety or pleasure.",
                  "examples": [
                    "to retire from battle",
                    "The regiment retired from the fray after the Major was killed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To recede; to fall or bend back.",
                  "examples": [
                    "Past the point, the shore retires into a sequence of coves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To go to bed.",
                  "examples": [
                    "I will retire for the night."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From re- +‎ tire."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "retire (third-person singular simple present retires, present participle retiring, simple past and past participle retired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, American spelling) To fit (a vehicle) with new tires.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}