{
  "word": "unloose",
  "etymologies": [
    {
      "description": [
        "From Middle English unlosen (“to loosen, untie; to uncover, unwrap; to extend; to free, liberate, release; to disengage; to detach oneself; to make (someone) weak; to abolish; to destroy”) [and other forms], from un- (intensifying prefix) + losen (“to free, let loose, release; to loosen, untie; to come undone or unfastened; to open; to relax; to remove; to melt; to resolve; to break up, disintegrate; to detach, disengage; to destroy; to say, tell; to absolve of sin”) (from los (“free; loose, untied; exempt; absolved of sin; inattentive, undisciplined; of the tongue: lacking restraint, unbridled; limp, weak; wavering”), from Old Norse lauss (“loose”), ultimately from Proto-Indo-European *lewH- (“to separate; to set free; to untie”)). The English word is analysable as un- (intensifying prefix) +‎ loose."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "unloose (third-person singular simple present unlooses, present participle unloosing, simple past and past participle unloosed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(also figuratively) To loosen or undo (something that entangles, fastens, holds, or interlocks).",
                  "examples": [
                    "Synonyms: disengage, loose, unfasten, untie"
                  ]
                },
                {
                  "meaning": "(also figuratively) To relax or slacken (something that clasps or grips, such as the arms or hands).",
                  "examples": [
                    "Synonyms: let go, unclasp"
                  ]
                },
                {
                  "meaning": "To free (someone or something) from a constraint; (figuratively) to release (something which has been suppressed, such as emotions or objectionable things).",
                  "examples": [
                    "Synonyms: liberate, set free, unleash, vent"
                  ]
                },
                {
                  "meaning": "(archaic) To remove or take off (especially something undesirable).",
                  "examples": [
                    "Synonym: detach"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "To become loose or come off.",
                  "examples": [
                    "Synonym: detach"
                  ]
                },
                {
                  "meaning": "(also figuratively) To free from a constraint.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}