{
  "word": "transfer",
  "etymologies": [
    {
      "description": [
        "From Latin trānsferō (“I bear across”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "transfer (countable and uncountable, plural transfers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of conveying or removing something from one place, person or thing to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An instance of conveying or removing from one place, person or thing to another; a transferal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, transport) An act of exiting one mass transit vehicle and boarding another (typically one belonging to a different line or mode of transportation) to continue a journey.",
                  "examples": [
                    "Free transfers can be made between the Red and Orange Lines by walking from one of the station's platforms to another; in addition, riders using a fare card also get free transfers between bus and subway at the station."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, transport) A paper receipt given to a rider of one bus (and historically also certain elevated or subway lines), allowing free entry onto another bus to continue a journey.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A design conveyed by contact from one surface to another; a heat transfer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soldier removed from one troop, or body of troops, and placed in another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) A pathological process by which a unilateral morbid condition on being abolished on one side of the body makes its appearance in the corresponding region upon the other side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) The conveying of genetic material from one cell to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(bridge) A conventional bid which requests partner to bid the next available suit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A person who transfers or is transferred from one club or team to another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada, varsity sports) Short for transfer student.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "transfer (third-person singular simple present transfers, present participle transferring, simple past and past participle transferred)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move or pass from one place, person or thing to another.",
                  "examples": [
                    "to transfer the laws of one country to another; to transfer suspicion"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey the impression of (something) from one surface to another.",
                  "examples": [
                    "to transfer drawings or engravings to a lithographic stone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transport, of a traveler) To exit one mass transit vehicle and board another (typically one belonging to a different line or mode of transportation) to continue a journey.",
                  "examples": [
                    "transfer to the Blue Line"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be or become transferred.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To arrange for something to belong to or be officially controlled by somebody else.",
                  "examples": [
                    "The title to land is transferred by deed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}