{
  "word": "conversion",
  "etymologies": [
    {
      "description": [
        "From Middle English conversion, conversioun, borrowed from Anglo-Norman conversion, from Latin conversiō, from convertō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "conversion (countable and uncountable, plural conversions)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of converting something or someone.",
                  "examples": [
                    "His conversion to Christianity",
                    "The conversion of the database from ASCII to Unicode"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A software product converted from one platform to another.",
                  "examples": [
                    "Mike Follin  […]  also programmed the Spectrum version of The Sentinel (97%, Issue 40), and the excellent coin-op conversions Bubble Bobble (90%, Issue 45) and Bionic Commando (92%, Issue 53)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A chemical reaction wherein a substrate is transformed into a product.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rugby) A free kick, after scoring a try, worth two points.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An extra point (or two) scored by kicking a field goal or carrying the ball into the end zone after scoring a touchdown.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(marketing) An online advertising performance metric representing a visitor performing whatever the intended result of an ad is defined to be.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Under the common law, the tort of the taking of someone's personal property with intent to permanently deprive them of it, or damaging property to the extent that the owner is deprived of the utility of that property, thus making the tortfeasor liable for the entire value of the property.",
                  "examples": [
                    "the conversion of a horse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) The process whereby a new word is created without changing the form, often by allowing the word to function as a new part of speech.",
                  "examples": [
                    "Hyponyms: anthimeria, shift, shifting"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of turning round; revolution; rotation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) The act of interchanging the terms of a proposition, as by putting the subject in the place of the predicate, or vice versa.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A change or reduction of the form or value of a proposition.",
                  "examples": [
                    "the conversion of equations; the conversion of proportions"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, board games) Changing a miniature figure into another character, usually by mixing different parts, or molding the model's parts, or doing both.",
                  "examples": [
                    "Hyponym: kitbashing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}