{
  "word": "brad",
  "etymologies": [
    {
      "description": [
        "Late Middle English brad, variant of brod(d), from Old Norse broddr (“spike, shaft”), from Proto-Germanic *bruzdaz (compare Old English brord, Old High German brort), from Proto-Indo-European *bʰrusdʰos (compare Welsh brath (“sting, prick”), Albanian bredh (“fir-tree”), Lithuanian bruzdùklis (“bridle”), Czech brzda (“brake”). Doublet of prod."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brad (plural brads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin, small nail, with a slight projection at the top on one side instead of a head, or occasionally with a small domed head, similar to that of an escutcheon pin.",
                  "examples": [
                    "Into the middle arch of each desk silver-headed brads had been hammered to form a lion, a bear, a ram, a dove, and in the midst a flaming torch."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, elementary school usage) A paper fastener, a fastening device formed of thin, soft metal, such as shim brass, with a round head and a flat, split shank, which is spread after insertion in a hole in a stack of pages, in much the same way as a cotter pin or a split rivet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brad (third-person singular simple present brads, present participle bradding, simple past and past participle bradded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attach using a brad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To upset the end of a rod inserted in a hole so as to prevent it from being pulled out, as when riveting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}