{
  "word": "rhythm",
  "etymologies": [
    {
      "description": [
        "First coined in 1557, from Latin rhythmus, from Ancient Greek ῥυθμός (rhuthmós, “any measured flow or movement, symmetry, rhythm”), from ῥέω (rhéō, “I flow, run, stream, gush”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rhythm (countable and uncountable, plural rhythms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The variation of strong and weak elements (such as duration, accent) of sounds, notably in speech or music, over time; a beat or meter.",
                  "examples": [
                    "Dance to the rhythm of the music."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A specifically defined pattern of such variation.",
                  "examples": [
                    "Most dances have a rhythm as distinctive as the Iambic verse in poetry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flow, repetition or regularity.",
                  "examples": [
                    "Once you get the rhythm of it, the job will become easy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The tempo or speed of a beat, song or repetitive event.",
                  "examples": [
                    "We walked with a quick, even rhythm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The musical instruments which provide rhythm (mainly; not or less melody) in a musical ensemble.",
                  "examples": [
                    "The Baroque term basso continuo is virtually equivalent to rhythm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A regular quantitative change in a variable (notably natural) process.",
                  "examples": [
                    "The rhythm of the seasons dominates agriculture as well as wildlife"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Controlled repetition of a phrase, incident or other element as a stylistic figure in literature and other narrative arts; the effect it creates.",
                  "examples": [
                    "The running gag is a popular rhythm in motion pictures and theater comedy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person's natural feeling for rhythm.",
                  "examples": [
                    "That girl's got rhythm, watch her dance!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}