{
  "word": "groom",
  "etymologies": [
    {
      "description": [
        "1604, short for bridegroom (“husband-to-be”), from Middle English brydgrome, alteration (with intrusive r) of earlier bridegome (“bridegroom”), from Old English brȳdguma (“bridegroom”), from brȳd (“bride”) + guma (“man, hero”). In Middle English, the second element was re-analyzed as or influenced by grom, grome (“attendant”). Guma derives from Proto-Germanic *gumô (“man, person”), from Proto-Indo-European *dʰǵʰm̥mō; it is cognate to Icelandic gumi and Norwegian gume and, ultimately, human."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "groom (plural grooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man who is about to marry.",
                  "examples": [
                    "Synonym: bridegroom"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English grom, grome (“man-child, boy, youth”), of uncertain origin. Apparently related to Middle Dutch grom (“boy”), Old Icelandic grómr, gromr (“man, manservant, boy”), Old French gromme (“manservant”), and also to Middle Dutch grom (“fish guts”), Middle Low German grôm (“fish guts”), from the same Proto-Germanic root. Possibly from Old English *grōma, from Proto-West Germanic *grōmō, *grōm (“swollen belly, stomach tumour, womb-child, fish roe, fish guts”), from Proto-Germanic *grōaną (“to grow”).",
        "Alternative etymology describes Middle English grom, grome as an alteration of gome (“man”) with an intrusive r (also found in bridegroom, hoarse, cartridge, etc.), with the Middle Dutch and Old Icelandic cognates following similar variation of their respective forms."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "groom (plural grooms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who looks after horses.",
                  "examples": [
                    "Synonyms: fettler, horsekeeper, ostler, (India) sais"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of several officers of the English royal household, chiefly in the lord chamberlain's department.",
                  "examples": [
                    "the groom of the chamber; the groom of the stole"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A male servant, or more generally, a common man.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brushing or cleaning, as of a dog or horse.",
                  "examples": [
                    "Give the mare a quick groom before you take her out."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "groom (third-person singular simple present grooms, present participle grooming, simple past and past participle groomed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To attend to one's appearance and clothing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To care for (horses or other animals) by brushing and cleaning them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prepare (someone) for an event",
                  "examples": [
                    "It appears that Broderick's seconds, although cool, brave men, were entirely without experience in arranging a duel, and did not know that a man should be groomed for one as carefully as a horse is groomed for a race."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prepare (someone) for election or appointment.",
                  "examples": [
                    "It is of special interest to note the subjects considered as important to those who are being groomed for top administrative posts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prepare (a ski slope) for skiers by packing down the snow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to gain the trust of (somebody, especially a minor) with the intention of subjecting them to abusive or exploitative behaviour such as sexual abuse or human trafficking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, software engineering) In agile software development, to review and prioritize the items in the development backlog.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}