{
  "word": "advantage",
  "etymologies": [
    {
      "description": [
        "From Middle English avantage, avauntage, from Old French avantage, from avant (“before”), from Late Latin ab ante. The spelling with d was a mistake, a- being supposed to be from Latin ad (see advance). For sense development, compare foredeal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "advantage (countable and uncountable, plural advantages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Any condition, circumstance, opportunity or means, particularly favorable or chance to success, or to any desired end.",
                  "examples": [
                    "The enemy had the advantage of a more elevated position."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Superiority; mastery; — used with of to specify its nature or with over to specify the other party.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Superiority of state, or that which gives it; benefit; gain; profit",
                  "examples": [
                    "the advantage of a good constitution",
                    "Having the faster car is of little advantage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) The score where one player wins a point after deuce but needs the next to carry the game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) The continuation of the game after a foul against the attacking team, because the attacking team are in an advantageous position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Interest of money; increase; overplus (as the thirteenth in the baker's dozen).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "advantage (third-person singular simple present advantages, present participle advantaging, simple past and past participle advantaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) to provide (someone) with an advantage, to give an edge to [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) to do something for one's own benefit; to take advantage of [from 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}