{
  "word": "primary",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin prīmārius (“of the first (rank); chief, principal; excellent”), from prīmus (first; whence the English adjective prime) + -ārius (whence the English suffix -ary); compare the French primaire, primer, and premier. Doublet of premier."
      ],
      "adjectives": [
        {
          "description": "primary (comparative more primary, superlative most primary)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "first or earliest in a group or series.",
                  "examples": [
                    "Children attend primary school, and teenagers attend secondary school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "main; principal; chief; placed ahead of others.",
                  "examples": [
                    "Preferred stock has primary claim on dividends, ahead of common stock."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) Earliest formed; fundamental.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) Illustrating, possessing, or characterized by, some quality or property in the first degree; having undergone the first stage of substitution or replacement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Relating to the place where a disorder or disease started to occur.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Relating to day-to-day care provided by health professionals such as nurses, general practitioners, dentists etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "primary (plural primaries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A primary election; a preliminary election to select a political candidate of a political party.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The first year of grade school.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A base or fundamental component; something that is irreducible.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The most massive component of a gravitationally bound system, such as a planet in relation to its satellites.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A primary school.",
                  "examples": [
                    "Excellence in Cities offers a further development of this approach, whereby secondary schools operate with small clusters of primaries as mini-EAZs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) Any flight feather attached to the manus (hand) of a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A primary colour.",
                  "examples": [
                    "By adding and subtracting the three primaries, cyan, yellow, and magenta are produced. These are called subtractive primaries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The first stage of a thermonuclear weapon, which sets off a fission explosion to help trigger a fusion reaction in the weapon's secondary stage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A radar return from an aircraft (or other object) produced solely by the reflection of the radar beam from the aircraft's skin, without additional information from the aircraft's transponder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Primary site of disease; original location or source of the disease.",
                  "examples": [
                    "unknown primary",
                    "most common primaries"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electronics) A directly driven inductive coil, as in a transformer or induction motor that is magnetically coupled to a secondary",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "primary (third-person singular simple present primaries, present participle primarying, simple past and past participle primaried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, politics, transitive, intransitive) To challenge (an incumbent sitting politician) for their political party's nomination to run for re-election, through running a challenger campaign in a primary election, especially one that is more ideologically extreme.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, intransitive, transitive) To take part in a primary election.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}