{
  "word": "draft",
  "etymologies": [
    {
      "description": [
        "A phonetic spelling of draught (compare laughter), from Middle English draught, draght (“that which is pulled; that which is drawn up, a design”), from Old English *dreaht, *dræht, from Proto-West Germanic *drahti, *drahtu, from Proto-Germanic *drahtuz (“a pulling, drawing”), equivalent to draw (“to draw, drag”) +‎ -t. Cognate with Dutch dracht, German Tracht, Icelandic dráttur."
      ],
      "adjectives": [
        {
          "description": "draft (not comparable) (American spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Referring to drinks on tap, in contrast to bottled.",
                  "examples": [
                    "I'd rather have a fresh, cheap draft beer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Referring to animals used for pulling heavy loads.",
                  "examples": [
                    "A Clydesdale is a draft horse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "draft (countable and uncountable, plural drafts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) A current of air, usually coming into a room or vehicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) The draw through a flue of gasses (smoke) resulting from a combustion process.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) An act of drinking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) The quantity of liquid (such as water, alcohol, or medicine) drunk in one swallow.",
                  "examples": [
                    "Synonyms: swig; see also Thesaurus:drink",
                    "to drink at a draft",
                    "She took a deep draft from the bottle of water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) A dose (of medicine, alcohol, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling) Liquid, especially beer or other alcohol, drawn from a cask or keg rather than a bottle or can.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, nautical) The depth of water needed to float a particular ship; the depth from the waterline to the bottom of a vessel's hull; the depth of water drawn by a vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(universal) An early version of a written work (such as a book or e-mail) or drawing.",
                  "examples": [
                    "I have to revise the first draft of my term paper.",
                    "His first drafts were better than most authors' final products."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(universal) A preliminary sketch or outline for a plan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(universal) A cheque, an order for money to be paid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, usually with the) Conscription, the system of forcing people to serve in the military.",
                  "examples": [
                    "He left the country to avoid the draft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics, US) A system of forcing or convincing people to take an elected position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, US) A system of assigning rookie players to professional sports teams.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, rail transport) The pulling force (tension) on couplers and draft gear during a slack stretched condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The bevel given to the pattern for a casting, so that it can be drawn from the sand without damaging the mould.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, possibly archaic) The action or an act (especially of a beast of burden or vehicle) of pulling something along or back.",
                  "examples": [
                    "using oxen for draft",
                    "shot forth an arrow with a mighty draft"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, possibly archaic) The act of drawing in a net for fish.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American spelling, possibly archaic) That which is drawn in; a catch, a haul.",
                  "examples": [
                    "He cast his net, which brought him a very great draft."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British, possibly archaic) A quantity that is requisitioned or drawn out from a larger population.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "draft (third-person singular simple present drafts, present participle drafting, simple past and past participle drafted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To write a first version, make a preliminary sketch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw in outline; to make a draught, sketch, or plan of, as in architectural and mechanical drawing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To write a law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US) To conscript a person, force a person to serve in some capacity, especially in the military.",
                  "examples": [
                    "He was drafted during the Vietnam War."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To select someone (or something) for a particular role or purpose.",
                  "examples": [
                    "There was a campaign to draft Smith to run for President.",
                    "They drafted me to be the chairperson of the new committee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To select and separate an animal or animals from a group.",
                  "examples": [
                    "The calves were drafted from the cows."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, sports, US) To select a rookie player onto a professional sports team.",
                  "examples": [
                    "After his last year of college football, he was drafted by the Miami Dolphins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To follow very closely (behind another vehicle), thereby providing an aerodynamic advantage to both lead and follower and conserving energy or increasing speed.",
                  "examples": [
                    "Synonym: slipstream"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw out; to call forth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw fibers out of a clump, for spinning in the production of yarn.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}