{
  "word": "linchpin",
  "etymologies": [
    {
      "description": [
        "From Middle English lynspin, compound of lins (“axletree”) and pin, from Old English lynis (“lynchpin”), from Proto-Germanic *lunaz – compare German Lünse and Dutch luns – from Proto-Indo-European. Possible further cognates are Welsh olwyn (“wheel”), Old Armenian ողն (ołn, “back; spine, backbone”) and Sanskrit आणि (āṇí, “lynchpin”). Figurative use attested from the mid-20th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "linchpin (plural linchpins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pin inserted through holes at the end of an axle or shaft, so as to secure a wheel or shaft-mounted device.",
                  "examples": [
                    "Synonym: axlepin"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A central cohesive source of stability and security; a person or thing that is critical to a system or organisation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "linchpin (third-person singular simple present linchpins, present participle linchpinning, simple past and past participle linchpinned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To adopt as, or serve as, a central cohesive source of stability and security.",
                  "examples": [
                    "The poems turn fear of individual death into an audit of the costs of an aristocratic status quo which is linchpinned by a monarchy indulging in paradigms of social redress that have become cosmetic, opportunities for self-display rather than genuine justice."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}