{
  "word": "nonpareil",
  "etymologies": [
    {
      "description": [
        "From Late Middle English non-parail (“unparalleled, nonpareil”) [and other forms], from Middle French nonpareille, nonpareil (“unparalleled”) (obsolete), from non- (prefix meaning ‘not’) + pareil (“alike, like, same”). Pareil is derived from Old French pareil, from Late Latin pāriculus (“equal; like; of a number: even”), from Latin pār (“equal; like; of a number: even; suitable”) + -culus (a variant of -ulus (suffix forming diminutives)).",
        "Noun sense 4 (size of type standardized at 6-point) is usually taken to derive from the attractive type cut by the brothers Giovanni and Gregorio De Gregori (fl. 1482–1503 and 1496–1527 respectively) for their 1498 edition of the divine offices in Venice; it was for a long time the smallest-sized type in use."
      ],
      "adjectives": [
        {
          "description": "nonpareil (comparative more nonpareil, superlative most nonpareil)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(frequently postpositive) Unequalled, unrivalled; unique. [from 15th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:unique",
                    "Antonyms: see Thesaurus:common"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "From Late Middle English non-parail (“unparalleled, nonpareil”) [and other forms], from Middle French nonpareille, nonpareil (“unparalleled”) (obsolete), from non- (prefix meaning ‘not’) + pareil (“alike, like, same”). Pareil is derived from Old French pareil, from Late Latin pāriculus (“equal; like; of a number: even”), from Latin pār (“equal; like; of a number: even; suitable”) + -culus (a variant of -ulus (suffix forming diminutives)). Noun sense 4 (size of type standardized at 6-point) is usually taken to derive from the attractive type cut by the brothers Giovanni and Gregorio De Gregori (fl. 1482–1503 and 1496–1527 respectively) for their 1498 edition of the divine offices in Venice; it was for a long time the smallest-sized type in use.",
          "definitionGroups": []
        },
        {
          "description": "nonpareil (countable and uncountable, plural nonpareils)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A person or thing that has no equal; a paragon. [from 16th c.]",
                  "examples": [
                    "(a wren) crept or crawled, just like a true tree-creeper. I was, as I say, quite close, and watched it most attentively. It certainly—as far as good looking can settle it—did not assist itself with the wings. They remained close against the sides, or, if they moved at all, it was imperceptible to my eyes (which, by the way, are non-pareils)."
                  ]
                }
              ]
            },
            {
              "group": "(countable, biology)",
              "entries": [
                {
                  "meaning": "The blue underwing or Clifden nonpareil (Catocala fraxini), a species of moth distributed across the Palearctic; also (obsolete) any of a number of moths of other species.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Australia, archaic) In full nonpareil parrot: the eastern rosella (Platycercus eximius), a species of rosella (parrot) native to southeastern Australia.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly US) The painted bunting (Passerina ciris), a brightly-coloured finch native to North America.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) In full nonpareil apple: a variety of apple tasting both sweet and tart which ripens very late in the season; also, the tree producing this fruit.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(countable, chiefly US, cooking)",
              "entries": [
                {
                  "meaning": "(archaic) Any of various types of small sweets.",
                  "examples": []
                },
                {
                  "meaning": "(by extension, dated) A small pellet of white or coloured sugar used as decoration on baked goods and candy.",
                  "examples": [
                    "Synonyms: (Australia, Britain, plural only) hundreds and thousands, (US) sprinkles"
                  ]
                },
                {
                  "meaning": "(by extension) A small, flat chocolate drop covered with such pellets of sugar, similar to a comfit.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) A caper (“pickled edible flower bud”) of the smallest size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, typography, chiefly historical) The size of type between ruby and emerald (or, in the United States, between agate and minion), standardized as 6-point; (countable) a slug of this size.",
                  "examples": [
                    "Synonym: (in European contexts) nonpareille"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}