{
  "word": "hurt",
  "etymologies": [
    {
      "description": [
        "From Middle English hurten, hirten, hertan (“to injure, scathe, knock together”), from Old Northern French hurter (\"to ram into, strike, collide with\"; > Modern French heurter), perhaps from Frankish *hūrt (“a battering ram”), cognate with Welsh hwrdd (“ram”) and Cornish hordh (“ram”).  Compare Proto-Germanic *hrūtaną, *hreutaną (“to fall, beat”), from Proto-Indo-European *krew- (“to fall, beat, smash, strike, break”); however, the earliest instances of the verb in Middle English are as old as those found in Old French, which leads to the possibility that the Middle English word may instead be a reflex of an unrecorded Old English *hyrtan, which later merged with the Old French verb. Germanic cognates include Dutch horten (“to push against, strike”), Middle Low German hurten (“to run at, collide with”), Middle High German hurten (“to push, bump, attack, storm, invade”), Old Norse hrútr (“battering ram”).",
        "Alternate etymology traces Old Northern French hurter rather to Old Norse hrútr (“ram (male sheep)”), lengthened-grade variant of hjǫrtr (“stag”), from Proto-Germanic *herutuz, *herutaz (“hart, male deer”), which would relate it to English hart (“male deer”). See hart."
      ],
      "adjectives": [
        {
          "description": "hurt (comparative more hurt, superlative most hurt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wounded, physically injured.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pained.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hurt (plural hurts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emotional or psychological humiliation or bad experience.",
                  "examples": [
                    "how to overcome old hurts of the past"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A bodily injury causing pain; a wound or bruise.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Injury; damage; detriment; harm",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A band on a trip hammer's helve, bearing the trunnions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A husk.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hurt (third-person singular simple present hurts, present participle hurting, simple past and past participle hurt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To cause (a person or animal) physical pain and/or injury.",
                  "examples": [
                    "If anybody hurts my little brother, I will get upset.",
                    "This injection might hurt a little."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To cause (somebody) emotional pain.",
                  "examples": [
                    "He was deeply hurt he hadn’t been invited.",
                    "The insult hurt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, stative) To be painful.",
                  "examples": [
                    "Does your leg still hurt? / It is starting to feel better."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To damage, harm, impair, undermine, impede.",
                  "examples": [
                    "This latest gaffe hurts the legislator’s reelection prospects still further.",
                    "Copying and pasting identical portions of source code hurts maintainability, because the programmer has to keep all those copies synchronized.",
                    "Every little hurts."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Unclear. Suggestions include: from its resemblance to a blue hurtleberry, or from French heurt (a blow, leaving a blue bruise: compare the theories about golpe (“purple roundel”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hurt (plural hurts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A roundel azure (blue circular spot).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}