{
  "word": "trance",
  "etymologies": [
    {
      "description": [
        "From Middle English traunce, from Anglo-Norman transe (“fear of coming evil; passage from life to death”), from transir (“to be numb with fear; to die, pass on”), from Latin trānseō (“to cross over”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trance (countable and uncountable, plural trances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A dazed or unconscious condition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A state of awareness, concentration, or focus that filters experience and information (for example, a state of meditation or possession by some being).",
                  "examples": [
                    "And he became very hungry, and would have eaten; but while they made ready, he fell into a trance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, psychology) A state of low response to stimulus and diminished, narrow attention; particularly one induced by hypnosis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, music) Short for trance music (“genre of electronic dance music”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trance (third-person singular simple present trances, present participle trancing, simple past and past participle tranced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause to) be in a trance; to entrance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To create in or via a trance.",
                  "examples": [
                    "The Horned Toad (kɛŋkak) tranced the rivers into being. A bakɔh bird tranced the mountains. The Scrub Bulbul (ˀɛsˀããs) drilled fire into existence with its beak. And, finally, the Bronzed Black Drongo (tɛrhɛɛh) tranced the year  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English traunce, trauncen, trancen (“to move about (?); to prance (?); to trample the ground”) (whence modern English trounce with the same senses, which see for more). The noun is probably derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "trance (plural trances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside Britain, dialectal) A tedious journey.",
                  "examples": [
                    "Synonym: (dialectal) trounce"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "trance (third-person singular simple present trances, present participle trancing, simple past and past participle tranced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside Britain, dialectal, intransitive) To walk heavily or with some difficulty; to tramp, to trudge.",
                  "examples": [
                    "Synonym: (dialectal) trounce"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside Britain, dialectal, intransitive) To pass across or over; to traverse.",
                  "examples": [
                    "Synonym: (dialectal) trounce"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete outside Britain, dialectal, intransitive) To travel quickly over a long distance.",
                  "examples": [
                    "Synonym: (dialectal) trounce"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}