{
  "word": "dinner",
  "etymologies": [
    {
      "description": [
        "From Middle English dyner, from Old French disner (“lunch”, but originally “breakfast”), (modern French dîner), from Vulgar Latin *disiūnō, *disiūnāre from Latin dis- + iēiūnō (“to break the fast”).\nDoublet of diner."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dinner (countable and uncountable, plural dinners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A midday meal (in a context in which the evening meal is called supper or tea).",
                  "examples": [
                    "It was already late for school, so the boy took his time and only arrived in the village when Heidi came home for dinner.  […]  \"Come to the table now and eat with us. Then you can go up with Heidi, and when you bring her back at night, you can get your supper here.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The main meal of the day, often eaten in the evening.",
                  "examples": [
                    "I want to cook dinner.\nAudio (US)(file)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An evening meal.",
                  "examples": [
                    "I had some friends to dinner two nights ago."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A meal given to an animal.",
                  "examples": [
                    "Give the dog its dinner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A formal meal for many people eaten for a special occasion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The food provided or consumed at any such meal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dinner (third-person singular simple present dinners, present participle dinnering, simple past and past participle dinnered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To eat a dinner; to dine.",
                  "examples": [
                    "Once I was geared up, I joined him on the wide, flat seat of the sled which was loaded up with hot food for the jacks who were dinnering out since they worked a forty far from the camp."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide (someone) with a dinner; to dine.",
                  "examples": [
                    "She had taken her about to concerts and exhibitions—she had dinnered her at the Colonies, and suppered her at the New Club."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}