{
  "word": "inspire",
  "etymologies": [
    {
      "description": [
        "From Middle English inspiren, enspiren, from Old French inspirer, variant of espirer, from Latin īnspīrāre, present active infinitive of īnspīrō (“inspire”), itself a loan-translation of Biblical Ancient Greek πνέω (pnéō, “breathe”), from in + spīrō (“breathe”), from Proto-Indo-European *(s)peys- (“to blow, breathe”). Displaced native Old English onbryrdan (literally “to prick in”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "inspire (third-person singular simple present inspires, present participle inspiring, simple past and past participle inspired)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To infuse into the mind; to communicate to the spirit; to convey, as by a divine or supernatural influence; to disclose preternaturally; to produce in, as by inspiration.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To infuse into; to affect, as with a superior or supernatural influence; to fill with what animates, enlivens or exalts; to communicate inspiration to.",
                  "examples": [
                    "Elders should inspire children with sentiments of virtue.",
                    "The captain's speech was aimed to inspire her team to victory in the final."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To draw in by the operation of breathing; to inhale.",
                  "examples": [
                    "By means of those sulfurous coal smokes the lungs are as it were stifled and extremely oppressed, whereby they are forced to inspire and expire the air with difficulty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To infuse by breathing, or as if by breathing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic, transitive) To breathe into; to fill with the breath; to animate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spread rumour indirectly.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}