{
  "word": "drop",
  "etymologies": [
    {
      "description": [
        "From Late Middle English droppe, Middle English drope (“small quantity of liquid; small or least amount of something; pendant jewel; dripping of a liquid; a shower; nasal flow, catarrh; speck, spot; blemish; disease causing spots on the skin”) [and other forms], from Old English dropa (“a drop”), from Proto-West Germanic *dropō (“drop (of liquid)”), from Proto-Germanic *drupô (“drop (of liquid)”), from Proto-Indo-European *dʰrewb- (“to crumble, grind”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "drop (plural drops)",
          "definitionGroups": [
            {
              "group": "(also figuratively) A small quantity of liquid, just large enough to hold its own round shape through surface tension, especially one that falls from a source of liquid.",
              "entries": [
                {
                  "meaning": "(pharmacology) A dose of liquid medicine in the form of a drop (sense 1).",
                  "examples": []
                },
                {
                  "meaning": "(pharmacology, chiefly in the plural) A liquid medicine that is intended to be administered in drops (sense 1).",
                  "examples": [
                    "ear drops    eye drops"
                  ]
                }
              ]
            },
            {
              "group": "(figuratively) A very small quantity of liquid, or (by extension) of anything.",
              "entries": [
                {
                  "meaning": "(chiefly Australia, Britain) A small amount of an alcoholic beverage.",
                  "examples": [
                    "He usually enjoys a drop after dinner.    She won’t touch a drop while she’s on duty."
                  ]
                },
                {
                  "meaning": "(chiefly Britain) Usually preceded by the: alcoholic spirits in general.",
                  "examples": [
                    "It doesn’t matter where you’re from, anyone who enjoys the drop is a friend of mine."
                  ]
                },
                {
                  "meaning": "(Ireland, informal) A single measure of whisky.",
                  "examples": []
                }
              ]
            },
            {
              "group": "That which hangs or resembles a liquid globule, such as a hanging diamond earring or ornament, a glass pendant on a chandelier, etc.",
              "entries": [
                {
                  "meaning": "Often preceded by a defining word: a small, round piece of hard candy, such as a lemon drop; a lozenge.",
                  "examples": []
                },
                {
                  "meaning": "(architecture) An ornament resembling a pendant; a gutta.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A thing which drops or hangs down.",
              "entries": [
                {
                  "meaning": "The cover mounted on a swivel over a keyhole that rests over the keyhole when not in use to keep out debris, but is swiveled out of the way before inserting the key.",
                  "examples": []
                },
                {
                  "meaning": "(agriculture) A fruit which has fallen off a tree, etc., or has been knocked off accidentally, rather than picked.",
                  "examples": []
                },
                {
                  "meaning": "(American football) A dropped pass.",
                  "examples": [
                    "Yet another drop for the Tiger tight end."
                  ]
                },
                {
                  "meaning": "(law enforcement) A trapdoor (“hinged platform”) on a gallows; a gallows itself.",
                  "examples": []
                },
                {
                  "meaning": "(online gaming, video games) An item made available for the player to pick up from the remains of a defeated enemy.",
                  "examples": []
                },
                {
                  "meaning": "(technology)",
                  "examples": []
                },
                {
                  "meaning": "A mechanism for lowering something, such as a machine for lowering heavy weights on to a ship's deck, or a device for temporarily lowering a gas jet, etc.",
                  "examples": []
                },
                {
                  "meaning": "Short for drop hammer and drop press.",
                  "examples": []
                },
                {
                  "meaning": "(theater) A curtain which falls in front of a theatrical stage; also, a section of (cloth) scenery lowered on to the stage like a curtain.",
                  "examples": []
                }
              ]
            },
            {
              "group": "An act or instance of dropping (in all senses).",
              "entries": [
                {
                  "meaning": "An act of moving downwards under the force of gravity; a descent, a fall.",
                  "examples": [
                    "That was a long drop, but fortunately I didn’t break any bones."
                  ]
                },
                {
                  "meaning": "An instance of making a delivery of people, supplies, or things, especially by parachute out of an aircraft (an airdrop), but also by truck, etc.",
                  "examples": [
                    "The delivery driver has to make three more drops before lunch.",
                    "The spy made the drop, leaving the plans under the tree as arranged."
                  ]
                },
                {
                  "meaning": "A release (of music, a video game, etc).",
                  "examples": []
                },
                {
                  "meaning": "(gambling) The amount of money that a gambler exchanges for chips in a casino.",
                  "examples": []
                },
                {
                  "meaning": "(law enforcement, informal) Preceded by the: execution by hanging.",
                  "examples": []
                },
                {
                  "meaning": "(sports)",
                  "examples": [
                    "The Tiger quarterback took a one-step drop, expecting his tight end to be open."
                  ]
                },
                {
                  "meaning": "Usually preceded by the: relegation from one division to a lower one.",
                  "examples": []
                },
                {
                  "meaning": "(American football) Short for drop-back.",
                  "examples": [
                    "The Tiger quarterback took a one-step drop, expecting his tight end to be open."
                  ]
                },
                {
                  "meaning": "(pinball) Short for drop target.",
                  "examples": []
                },
                {
                  "meaning": "(rugby) Short for drop kick.",
                  "examples": []
                },
                {
                  "meaning": "(golf) Short for drop shot.",
                  "examples": []
                },
                {
                  "meaning": "(US, banking, dated) An unsolicited credit card issue.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A decline in degree, quality, quantity, or rate.",
              "entries": [
                {
                  "meaning": "(sewing)",
                  "examples": []
                },
                {
                  "meaning": "Of men's clothes: the difference between the chest circumference and waist circumference.",
                  "examples": []
                },
                {
                  "meaning": "Of women's clothes: the difference between the bust circumference and hip circumference.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The distance through which something drops, or falls below a certain level.",
              "entries": [
                {
                  "meaning": "The distance below a cliff or other high position through which someone or something could fall; hence, a steep slope.",
                  "examples": [
                    "On one side of the road was a 50-foot drop."
                  ]
                },
                {
                  "meaning": "The vertical length of a hanging curtain.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) The distance of the axis of a shaft below the base of a hanger.",
                  "examples": []
                },
                {
                  "meaning": "(law enforcement) The distance that a person drops when being executed by hanging.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) The depth of a (square) sail (generally applied to the courses only); the vertical dimension of a sail.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where items or supplies may be left for others to collect, whether openly (as with a mail drop), or secretly or illegally (as in crime or espionage); a drop-off point.",
                  "examples": [
                    "I left the plans at the drop, like you asked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Only used in get the drop on, have the drop on An advantage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A point in a song, usually electronic music such as dubstep, house, trace, or trap, where there is a very noticeable and pleasing change in bass, tempo, and/or overall tone; a climax, a highlight.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English droppen, dropen (“to fall in drops, drip or trickle down; to scatter, sprinkle; to be covered with a liquid; to give off moisture; of an object: to drop, fall; of a living being: to fall to the ground”) [and other forms], from Old English dropian, droppian (“to drop”), from dropa (“a drop”) (see further at etymology 1) + -ian (suffix forming verbs from adjectives and nouns)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "drop (third-person singular simple present drops, present participle dropping, simple past and past participle dropped or (archaic) dropt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a liquid: to fall in drops or droplets. [from 11th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, also figuratively) To fall (straight down) under the influence of gravity, like a drop of liquid. [from 14th c.]",
                  "examples": [
                    "A single shot was fired and the bird dropped from the sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall or sink quickly or suddenly to the ground. [from 15th c.]",
                  "examples": [
                    "Drop and give me thirty push-ups, private!",
                    "If your clothes are on fire, stop, drop and roll."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To collapse in exhaustion or injury; also, to fall dead, or to fall in death.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall into a particular condition or state.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come to an end (by not being kept up); to lapse, to stop. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive) To decrease, diminish, or lessen in condition, degree, value, etc. [from 18th c.]",
              "entries": [
                {
                  "meaning": "(intransitive) Of a song or sound: to lower in key, pitch, tempo, or other quality.",
                  "examples": [
                    "My synthesizer makes the notes sound funny when they drop below C2.",
                    "The song, 180 beats per minute, drops to 150 BPM near the end."
                  ]
                },
                {
                  "meaning": "(intransitive) Of a voice: to lower in timbre, often due to puberty.",
                  "examples": [
                    "Billy’s voice dropped suddenly when he turned 12."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fall behind or to the rear of a group of people, etc., as a result of not keeping up with those at the front.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Usually followed by by, in, or into: of a person: to visit someone or somewhere informally or without a prior appointment.",
                  "examples": [
                    "Do drop by soon and I’ll lend you that book.",
                    "We’ll drop in on her tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing, music, television, colloquial) Of a programme, software, a music album or song, etc.: to enter public distribution.",
                  "examples": [
                    "The album Hip-Hop Xmas dropped in time for the holidays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, gambling) To drop out of the betting.",
                  "examples": [
                    "But more important, if I dropped, Marty would have won the hand automatically."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, physiology, informal) Of the testicles: to hang further away from the body and begin producing sperm due to puberty.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To let drops fall; to discharge itself in drops.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To drip (a liquid) in drops or small amounts. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative, also figuratively) To let (something) fall; to allow (something) to fall (either by releasing hold of, or losing one's grip on). [from 14th c.]",
                  "examples": [
                    "Don’t drop that plate!    The police ordered the men to drop their weapons."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To move to a lower position; to allow to hang downwards; to lower.",
              "entries": [
                {
                  "meaning": "To quickly lower or take down (one's trousers), especially in public.",
                  "examples": []
                },
                {
                  "meaning": "(cooking) To cook (food, especially fast food), particularly by lowering into hot oil to deep-fry, or by grilling.",
                  "examples": [
                    "Drop a basket of fries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To reduce; to make smaller.",
                  "examples": [
                    "2011, Alexander Mamishev, Sean Williams, Technical Writing for Teams: The STREAM Tools Handbook (page 64)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of an animal (usually a sheep): to give birth to (young); of a bird: to lay (an egg).",
                  "examples": [
                    "to drop a lamb"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mention (something) casually or incidentally, usually in conversation. [from 17th c.]",
                  "examples": [
                    "The lecturer would drop hints whenever the students struggled.",
                    "name drop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To let (a letter, etc.) fall into a postbox; hence, to send (a letter, email, or other message) in an offhand manner. [from 18th c.]",
                  "examples": [
                    "As she had a free moment, she dropped her a text.",
                    "Drop me a note when you get to the city."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make (someone or something) fall to the ground from a blow, gunshot, etc.; to bring down, to shoot down. [from 18th c.]",
                  "examples": [
                    "Make any sudden movements and I will drop you!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set down (someone or something) from a vehicle; to stop and deliver or deposit (someone or something); to drop off.",
                  "examples": [
                    "Could you drop me at the airport on your way to work tomorrow?",
                    "I’ll be dropping the parcel at your place later."
                  ]
                }
              ]
            },
            {
              "group": "(transitive) To lower (a sound, a voice, etc.) in pitch or volume.",
              "entries": [
                {
                  "meaning": "(transitive, music) To tune (a guitar string, etc.) to a lower note.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cease concerning oneself over (someone or something); to have nothing more to do with (a discussion, subject, etc.). [from 17th c.]",
                  "examples": [
                    "I’m tired of this subject. Will you just drop it?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispose or get rid of (something); to lose, to remove.",
                  "examples": [
                    "I dropped ten pounds and an obnoxious fiancée."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cease to include (something), as if on a list; to dismiss, to eject, to expel.",
                  "examples": [
                    "I’ve been dropped from the football team."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cancel or cease to participate in (a scheduled course, event, or project).",
                  "examples": [
                    "I had to drop calculus because it was taking up too much of my time."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, slang)",
              "entries": [
                {
                  "meaning": "To lose, spend, or otherwise part with (money). [from 17th c.]",
                  "examples": [
                    "The question was: Who put the most in the collection box? The wealthy guy, who dropped a “C” note, or the tattered old dame who parted with her last tarnished penny."
                  ]
                },
                {
                  "meaning": "To pass or use (counterfeit cheques, money, etc.).",
                  "examples": []
                },
                {
                  "meaning": "To impart (something).",
                  "examples": [
                    "I drop knowledge wherever I go."
                  ]
                },
                {
                  "meaning": "Especially in drop acid: to swallow (a drug, particularly LSD). [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, music, television, colloquial) To release (a programme, software, a music album or song, etc.) to the public.",
                  "examples": [
                    "They dropped the album Hip-Hop Xmas in time for the holidays.",
                    "That hacker has been threatening to drop my docs [i.e. publish my personal information]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, linguistics) To fail to write, or (especially) to pronounce (a syllable, letter, etc.). [from 19th c.]",
                  "examples": [
                    "Cockneys drop their aitches."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, music)",
              "entries": [
                {
                  "meaning": "To play (a portion of music) in the manner of a disc jockey.",
                  "examples": [
                    "I love it when he drops his funky beats.",
                    "That guy can drop the bass like a monster."
                  ]
                },
                {
                  "meaning": "To perform (rap music).",
                  "examples": [
                    "Yo, I drop rhymes like nobody’s business."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, sports)",
              "entries": [
                {
                  "meaning": "(originally US) To (unexpectedly) lose (a competition, game, etc.).",
                  "examples": []
                },
                {
                  "meaning": "(cricket) Of a fielder: to fail to dismiss (a batsman) by accidentally dropping a batted ball that had initially been caught.",
                  "examples": [
                    "Warne dropped Tendulkar on 99. Tendulkar went on to get a century next ball."
                  ]
                },
                {
                  "meaning": "(rugby) To score (a goal) by means of a drop kick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To cover (something) with or as if with drops, especially of a different colour; to bedrop, to variegate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing) To enter a more basic interface.",
                  "examples": [
                    "drop to a shell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To present the user with a more basic interface.",
                  "examples": [
                    "You are being dropped to a recovery shell."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}