{
  "word": "coaster",
  "etymologies": [
    {
      "description": [
        "From coast (“edge of the land where it meets an ocean, sea, gulf, bay, or large lake”) +‎ -er (suffix forming agent nouns). Coast is derived from Middle English coste (“rib; side of the body, flank; side of a building; face of a solid figure; coast, shore; bay, gulf; sea; concavity, hollow; boundary, limit; land; country; district, province, region; locality, place; division of the heavens; compass direction; direction; location with reference to direction, side”) [and other forms], from Old French coste (“rib; side of an object; coast”) (modern French côte (“rib; coast; hill, slope”)), from Latin costa (“rib; side, wall”), from Proto-Indo-European *kost-."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coaster (plural coasters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who originates from or inhabits a coastal area.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A prostitute, especially one of European descent, plying her trade in Chinese port towns.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(nautical)",
              "entries": [
                {
                  "meaning": "A sailor (especially the master or pilot of a vessel) who travels only in coastal waters.",
                  "examples": []
                },
                {
                  "meaning": "A merchant vessel that stays in coastal waters, especially one that travels between ports of the same country.",
                  "examples": [
                    "Hyponym: hoy"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) Short for coaster trout (“the brook trout (Salvelinus fontinalis) in Lake Superior and Maine”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A cow from the coastal part of Texas.",
                  "examples": [
                    "The ranch's rangy coasters, the only saleable cattle they then held, could not compete with cattle from a growing number of Midwest farmer-feeders or with competitors stocking the northern ranges."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From coast (“to glide along without adding energy; to make a minimal effort; to slide downhill (especially, to slide on a sled upon snow or ice)”) +‎ -er (suffix forming agent nouns). Coast is derived from Middle English costeien (“to travel along a border or coast; to go alongside (something), skirt; to accompany, follow; to travel across, traverse; to be adjacent to, to border;”) [and other forms], from Anglo-Norman [Term?], Old French costoier (“to be at the side of”) [and other forms] (modern French côtoyer (“to pass alongside; (figuratively) to rub shoulders”)), from Latin costicāre, from costa (“rib; side, wall”); see further at etymology 1.",
        "The sense 2.1 (“small stand or tray”) is from the fact that the object and the decanter or wine bottle on it “coast” or travel around a tabletop from person to person. The sense 2.2.2 (“useless compact disc or DVD”) refers to the fact that the object is only useful as a drink coaster."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "coaster (plural coasters)",
          "definitionGroups": [
            {
              "group": "Agent noun of coast: one who coasts.",
              "entries": [
                {
                  "meaning": "(Australia, slang) An itinerant person who shirks work but still seeks food and lodging; a loafer, a sundowner.",
                  "examples": []
                },
                {
                  "meaning": "(US, winter sports) A person who uses a sled or toboggan to slide down a slope covered with ice or snow; a sledder, a tobogganist.",
                  "examples": []
                },
                {
                  "meaning": "One who succeeds while making only a minimal effort.",
                  "examples": [
                    "In Prashar's opinion, there are two types of manager: \"coasters, who coast along in a job, and sprinters, who have a challenge, deal with it and then move on.\""
                  ]
                }
              ]
            },
            {
              "group": "Something that coasts or is used to coast.",
              "entries": [
                {
                  "meaning": "(dated) A small stand or tray, sometimes with wheels, used to pass something such as a decanter or wine bottle around a tabletop.",
                  "examples": []
                },
                {
                  "meaning": "(by extension)",
                  "examples": [
                    "Synonyms: beermat, beer mat",
                    "Coordinate term: saucer"
                  ]
                },
                {
                  "meaning": "A small, flat or tray-like object on which a bottle, cup, glass, mug, etc., is placed to protect a table surface from drink spills, heat, or water condensation.",
                  "examples": [
                    "Synonyms: beermat, beer mat",
                    "Coordinate term: saucer"
                  ]
                },
                {
                  "meaning": "(computing, slang) A useless compact disc or DVD, such as one that was burned incorrectly or has become corrupted.",
                  "examples": []
                },
                {
                  "meaning": "(US, informal) Short for rollercoaster.",
                  "examples": []
                },
                {
                  "meaning": "(US, winter sports) A sled or toboggan.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}