{
  "word": "edgy",
  "etymologies": [
    {
      "description": [
        "From edge +‎ -y. Compare German eckig (“angular, edgy”)."
      ],
      "adjectives": [
        {
          "description": "edgy (comparative edgier, superlative edgiest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Nervous, apprehensive.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entertainment, advertising) Creatively challenging; cutting edge; leading edge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entertainment, advertising) On the edge between acceptable and offensive; pushing the boundaries of good taste; risqué.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Irritable.",
                  "examples": [
                    "an edgy temper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) Having some of the forms, such as drapery or the like, too sharply defined.",
                  "examples": [
                    "A sculptor's ideas must, I should guess, be somewhat rigid and inflexible, like the materials in which he works. Besides, Nollekens's style was comparatively hard and edgy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sharp; having prominent edges.",
                  "examples": [
                    "Shasta tried to get out of the way and to make Bree go back. But  […]  a woman with a very edgy basket in her hands, who was just behind Shasta, pushed the basket hard against his shoulders, and said, \"Now then! Who are you shoving!\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Cool by virtue of being tough, dark, or badass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang) Exhibiting behavior that is disconcerting or alarming, sometimes in an effort to impress or to troll others.",
                  "examples": [
                    "“These trolls think they’re being satirical and brave because they’re putting these dangerous, edgy so-called jokes on there, but in reality it’s cowardly. It’s the antithesis of bravery because they rarely identify themselves or give away personal information. That’s not courage.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}