{
  "word": "embrace",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English embracen (“to clasp in one's arms, embrace; to reach out eagerly for, welcome; to enfold, entwine; to ensnare, entangle; to twist, wrap around; to gird, put on; to lace; to be in or put into bonds; to put a shield on the arm; to grasp (a shield or spear); to acquire, take hold of; to receive; to undertake; to affect, influence; to incite; to unlawfully influence a jury; to surround; to conceal, cover; to shelter; to protect; to comfort; to comprehend, understand”) [and other forms], from Old French embracer, embracier (“to kiss”) (modern French embrasser (“to kiss; (dated) to embrace, hug”)), from Late Latin *imbracchiāre, from in- (prefix meaning ‘in, inside, within’)) + bracchium (“arm”). The English word is analysable as em- +‎ brace.",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "embrace (plural embraces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of putting arms around someone and bringing the person close to the chest; a hug.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An enclosure partially or fully surrounding someone or something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Full acceptance (of something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) An act of enfolding or including.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "embrace (third-person singular simple present embraces, present participle embracing, simple past and past participle embraced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clasp (someone or each other) in the arms with affection; to take in the arms; to hug.",
                  "examples": [
                    "Synonyms: fall on someone's neck; see also Thesaurus:embrace"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To seize (something) eagerly or with alacrity; to accept or take up with cordiality; to welcome.",
                  "examples": [
                    "I wholeheartedly embrace the new legislation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To submit to; to undergo.",
                  "examples": [
                    "Synonym: accept"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, also figuratively) To encircle; to enclose, to encompass.",
                  "examples": [
                    "Synonyms: entwine, surround"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To enfold, to include (ideas, principles, etc.); to encompass.",
                  "examples": [
                    "Natural philosophy embraces many sciences."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To fasten on, as armour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, obsolete) To accept (someone) as a friend; to accept (someone's) help gladly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law, figuratively, obsolete) To attempt to influence (a court, jury, etc.) corruptly; to practise embracery.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}