{
  "word": "and",
  "etymologies": [
    {
      "description": [
        "From Middle English and, an, from Old English and, from Proto-Germanic *andi, *anþi, from Proto-Indo-European *h₂énti (“facing opposite, near, in front of, before”). Cognate with Scots an (“and”), North Frisian en (“and”), West Frisian en, in (“and”), Low German un (“and”), Dutch en (“and”), German und (“and”), Danish end (“but”), Swedish än (“yet, but”), Icelandic enn (“still, yet”), Albanian edhe (“and”) (dialectal ênde, ênne), ende (“still, yet, therefore”), Latin ante (“opposite, in front of”), and Ancient Greek ἀντί (antí, “opposite, facing”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "and (plural ands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, often informal) In rhythm, the second half of a divided beat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English ande, from Old English anda (“grudge, enmity, malice, envy, hatred, anger, zeal, annoyance, vexation; zeal; injury, mischief; fear, horror”) and Old Norse andi (“breath, wind, spirit”); both from Proto-Germanic *anadô (“breath, anger, zeal”), from Proto-Indo-European *h₂enh₁- (“to breathe, blow”). Cognate with German Ahnd, And (“woe, grief”), Danish ånde (“breath”), Swedish anda, ande (“spirit, breath, wind, ingenuity, intellect”), Icelandic andi (“spirit”), Albanian ëndë (“pleasure, delight”), Latin animus (“spirit, soul”). Related to onde."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "and (plural ands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Breath.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Sea smoke; steam fog.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English anden, from Old English andian (“to be envious or jealous, envy”) and Old Norse anda (“to breathe”); both from Proto-Germanic *anadōną (“to breathe, sputter”). Cognate with German ahnden (“to avenge, punish”), Danish ånde (“to breathe”), Swedish andas (“to breathe”), Icelandic anda (“to breathe”). See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "and (third-person singular simple present ands, present participle anding, simple past and past participle anded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, intransitive) To breathe; whisper; devise; imagine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}