{
  "word": "rubicon",
  "etymologies": [
    {
      "description": [
        "The noun is derived from the phrase cross the Rubicon (“to make an irreversible decision or to take an action with consequences”). Julius Caesar’s crossing of the Rubicon, a small river in northeastern Italy, on 10 January 49 B.C.E., indicated his intention to start a civil war with Pompey. Rubicon is derived from Latin Rubicō, Rubicōn (“the Rubicon”), possibly from rubeus (“red, reddish”), from rubeō (“to be red”), ultimately from Proto-Indo-European *h₁rewdʰ- (“red”), an allusion to the colour of the river caused by mud deposits.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rubicon (plural rubicons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A limit that when surpassed cannot be returned from, or an action that when taken cannot be reversed.",
                  "examples": [
                    "Synonym: point of no return"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) Especially in bezique and piquet: a score which, if not achieved by a losing player, increases the player's penalty.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rubicon (third-person singular simple present rubicons, present participle rubiconing, simple past and past participle rubiconed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, card games) Especially in bezique and piquet: to defeat a player who has not achieved the rubicon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}