{
  "word": "waft",
  "etymologies": [
    {
      "description": [
        "From Middle English waften, of uncertain origin. Possibly from unattested Old English *wafettan, from wafian (“to wave”) +‎ -ettan, or perhaps borrowed from Middle Dutch wachten (“to guard, provide for”).\nSee also German wabern (“to waft”), Faroese veiftra (“to wave”) and Icelandic váfa (“to fluctuate, waver, doubt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "waft (plural wafts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light breeze.",
                  "examples": [
                    "It lay before him white and ghaistly, with mist blowing in wafts across it and a slow swaying of the tides."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something (such as an odor or perfume) that is carried through the air.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A flag used to indicate wind direction or, with a knot tied in the center, as a signal; a waif, a wheft.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "waft (third-person singular simple present wafts, present participle wafting, simple past and past participle wafted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To (cause to) float easily or gently through the air.",
                  "examples": [
                    "A breeze came in through the open window and wafted her sensuous perfume into my eager nostrils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be moved, or to pass, on a buoyant medium; to float.",
                  "examples": [
                    "Unhappy Aureng-Zebe is in disgrace; / And your Morat, proclaimed the successor, / Is called, to awe the city with his power. / Those trumpets his triumphant entry tell, / And now the shouts waft near the citadel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give notice to by waving something; to wave the hand to; to beckon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}