{
  "word": "longe",
  "etymologies": [
    {
      "description": [
        "From French allonger (“to lengthen”), or Latin longa (“long”), i.e. the long rope."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "longe (plural longes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long rope or flat web line, more commonly referred to as a longe line, approximately 20-30 feet long, attached to the bridle, longeing cavesson, or halter of a horse and used to control the animal while longeing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A lunge; a thrust.",
                  "examples": [
                    "[…]  he parried my thrusts with great calmness, until I had almost exhausted my spirits; and when he perceived me beginning to flag, attacked me fiercely in his turn.—Finding himself however better opposed than he expected, he resolved to follow his longe, and close with me; accordingly, his sword entered my waistcoat  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) The training ground for a horse.",
                  "examples": [
                    "LONGE.—The training ground for the instruction of a young horse, to render him quiet, tractable, and supple; to give him free and proper use of his limbs, to form his paces, and to prepare him in all respects for the cavalry service."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "longe (third-person singular simple present longes, present participle longeing, simple past and past participle longed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, transitive) To work (a horse) in a circle at the end of a long line or rope.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "longe",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "plural of longa",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}