{
  "word": "cob",
  "etymologies": [
    {
      "description": [
        "Of uncertain origin. The word has many disparate senses, which are likely of diverse origin. The specifics of these origins have long been debated, as has the question of which senses arise from which origins. At least the swan sense originated in Middle English cobbe (“male swan; gang leader; bully”). Some other senses likely originated as a variant of cop (“head, top, peak, summit”). In other senses, the word may be related to cub, itself of obscure origin but possibly from Old Norse kobbi (“seal”). However, many alternative etymologies have been proposed to account for some or all senses of cob; various sources have related it, for example, to English cot (“cottage”), Welsh cob (“top, tuft”), or German Kübel (“large container”). All these etymologies are disputed, and the exact origins of cob cannot be known with any certainty."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cob (countable and uncountable, plural cobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A corncob.",
                  "examples": [
                    "The grains, each of which is about the bulk of the largest marrowfat pea, are placed all round a stalk, which goes up the middle, and this little stalk, to which the seeds adhere, is called the Corn Cob."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The seed-bearing head of a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clipping of cobnut.",
                  "examples": [
                    "This kind of husk also protects the nut from birds, for titmice (Parus) have been observed to pass over filberts, and attack cobs and common nuts growing in the same orchard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A male swan.",
                  "examples": [
                    "In all common streams, and private waters, when cygnets are taken up, the owner of the cob must chuse the first cygnet, and the pen the next, and so in order…."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(East Anglia) A gull, especially the black-backed gull (Larus marinus); also spelled cobb.",
                  "examples": [
                    "Here is also the pica marina or seapye many sorts of Lari, seamewes & cobs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lump or piece of anything, usually of a somewhat large size, as of coal, or stone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midlands) A round, often crusty roll or loaf of bread.",
                  "examples": [
                    "The cob was a cracknel or simnel made of fine flour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A building material consisting of clay, sand, straw, water, and earth, similar to adobe; also called cobb, rammed earth or pisé.",
                  "examples": [
                    "The poore Cotager contenteth himſelfe with Cob for his wals, and Thatch for his couering…."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A horse having a stout body and short legs.",
                  "examples": [
                    "If he comes to you riding a cob…"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the gold and silver coins that were minted in the Spanish Empire and valued in reales or escudos, such as the piece of eight—especially those which were crudely struck and irregularly shaped.",
                  "examples": [
                    "…he put his Hand in his Pocket and pull’d out ſome Gold, ſome Broadpieces and a Gold Cob…."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One who is eminent, great, large, or rich.",
                  "examples": [
                    "I ſaw fleſh bluddie toe ſlauer, / When the cob had maunged the gobets foule garbaged haulfe quick."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spider (cf. cobweb).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small fish, the miller's thumb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large fish, especially the kabeljou (variant spelling of kob).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The head of a herring.",
                  "examples": [
                    "The first red herring that was broil’d in Adam and Eve’s kitchen, do I fetch my pedigree from, by the Harrot’s book. His Cob was my great-great-mighty-great grandfather."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A tower or small castle on top of a hill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A thresher.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, historical) A cylinder with pins in it, encoding music to be played back mechanically by a barrel organ.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated or historical) A person of mixed black and white ancestry, especially a griffe; a mulatto.",
                  "examples": [
                    "[…]  but he does not say whether the nobleman is a mulatto or half-caste, or what advantage is to be derived from purchasing a cob belonging to \"a dark-brown nobleman.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cob (third-person singular simple present cobs, present participle cobbing, simple past and past participle cobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To construct using mud blocks or to seal a wall using mud or an artificial equivalent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of growing corn) To have the heads mature into corncobs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the kernels from a corncob.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To thresh.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To break up ground with a hoe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain. Possibly onomatopoeic, but it has also been suggested that the word could be a continuation of Middle English cobbe (“fight”), a borrowing of Welsh cob (“blow”), or a cognate of Icelandic kubba (“chop”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cob (plural cobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A punishment consisting of blows inflicted on the buttocks with a strap or a flat piece of wood.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cob (third-person singular simple present cobs, present participle cobbing, simple past and past participle cobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To beat with a flat instrument; to paddle.",
                  "examples": [
                    "[…]  he pulled off his hat, and said he was going to cob him for breaking the rules and laws of the ship’s company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern UK, colloquial) To throw, chuck, lob.",
                  "examples": [
                    "Well, sir, I’m sure I’d be rid of it fast enough if I could naut cob it away like a stoan."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To chip off unwanted pieces of stone, so as to form a desired shape or improve the quality of mineral ore.",
                  "examples": [
                    "A ſhade or ſhelter from the weather, under which the Cobbers cob the Ore."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cob",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Abbreviation of cobble.",
                  "examples": [
                    "Habitats were sand, cobble (cob), sand with macrophytes (s\\m) and muck with macrophytes (m\\m)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative form of COB",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}