{
  "word": "home",
  "etymologies": [
    {
      "description": [
        "From Middle English hōm, from Old English hām, from Proto-West Germanic *haim, from Proto-Germanic *haimaz (“home, village”), from Proto-Indo-European *tḱóymos (“village, home”), from the root *tḱey-."
      ],
      "adjectives": [
        {
          "description": "home (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, from, or pertaining to one’s dwelling or country; domestic; not foreign [from 13th c.]",
                  "examples": [
                    "home manufactureshome comforts"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, except in phrases) That strikes home; direct, pointed. [from 17th c.]",
                  "examples": [
                    "a home truth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Personal, intimate. [17th–19th c.]",
                  "examples": [
                    "I hardly knew what I answered him, but, by degrees I tranquillised, as I found he forbore distressing me any further, by such Home strokes […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) Relating to the home team (the team at whose venue a game is played). [from 19th c.]",
                  "examples": [
                    "the home end, home advantage, home supporters",
                    "Antonyms: away, road, visitor"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "home (not comparable)",
          "definitionGroups": [
            {
              "group": "To one's home",
              "entries": [
                {
                  "meaning": "To one's place of residence or one's customary or official location",
                  "examples": [
                    "go home",
                    "come home",
                    "carry someone home"
                  ]
                },
                {
                  "meaning": "To one's place of birth",
                  "examples": []
                },
                {
                  "meaning": "To the place where it belongs; to the end of a course; to the full length",
                  "examples": [
                    "She drove the nail home",
                    "ram a cartridge home"
                  ]
                },
                {
                  "meaning": "(Internet) To the home page",
                  "examples": [
                    "Click here to go home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "At or in one's place of residence or one's customary or official location; at home",
                  "examples": [
                    "Everyone's gone to watch the game; there's nobody home.",
                    "I'm home!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To a full and intimate degree; to the heart of the matter; fully, directly.",
                  "examples": [
                    "I do now publish my Essays; which of all my other works have been most current : for that, as it seems, they come home to men's business and bosoms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, soccer) into the goal",
                  "examples": [
                    "Walker was penalised for a picking up a Gerry Taggart backpass and from the resulting free-kick, Keane fired home after Johnnie Jackson's initial effort was blocked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) into the right, proper or stowed position",
                  "examples": [
                    "sails sheeted home"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "home (plural homes)",
          "definitionGroups": [
            {
              "group": "A dwelling.",
              "entries": [
                {
                  "meaning": "One’s own dwelling place; the house or structure in which one lives; especially the house in which one lives with one's family; the habitual abode of one’s family.",
                  "examples": [
                    "Thither for ease and soft repose we come: / Home is the sacred refuge of our life; / Secured from all approaches, but a wife."
                  ]
                },
                {
                  "meaning": "The place (residence, settlement, country, etc.), where a person was born and/or raised; childhood or parental home; home of one’s parents or guardian.",
                  "examples": [
                    "The rights listed in the UNCRC cover all areas of children's lives such as their right to have a home and their right to be educated."
                  ]
                },
                {
                  "meaning": "The abiding place of the affections, especially of the domestic affections.",
                  "examples": [
                    "He enter’d in the house—his home no more, / For without hearts there is no home; […]"
                  ]
                },
                {
                  "meaning": "A house that has been made home-like, to suit the comfort of those who live there.",
                  "examples": [
                    "It's what you bring into a house that makes it a home"
                  ]
                },
                {
                  "meaning": "A place of refuge, rest or care; an asylum.",
                  "examples": [
                    "a home for outcasts",
                    "a home for the blind",
                    "a veterans' home",
                    "Instead of a pet store, get your new dog from the local dogs’ home."
                  ]
                },
                {
                  "meaning": "(by extension) The grave; the final rest; also, the native and eternal dwelling place of the soul.",
                  "examples": [
                    "[…] because man goeth to his long home, and the mourners go about the streets:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One’s native land; the place or country in which one dwells; the place where one’s ancestors dwell or dwelt.",
                  "examples": [
                    "Visiting these famous localities, and a great many others, I hope that I do not compromise my American patriotism by acknowledging that I was often conscious of a fervent hereditary attachment to the native soil of our forefathers, and felt it to be our own Old Home."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The locality where a thing is usually found, or was first found, or where it is naturally abundant; habitat; seat.",
                  "examples": [
                    "the home of the pine"
                  ]
                }
              ]
            },
            {
              "group": "A focus point.",
              "entries": [
                {
                  "meaning": "(board games) The ultimate point aimed at in a progress; the goal.",
                  "examples": [
                    "The object of Sorry! is to get all four of your pawns to your home."
                  ]
                },
                {
                  "meaning": "(baseball) Home plate.",
                  "examples": []
                },
                {
                  "meaning": "(lacrosse) The place of a player in front of an opponent’s goal; also, the player.",
                  "examples": []
                },
                {
                  "meaning": "(Internet) The landing page of a website; the site's homepage.",
                  "examples": []
                },
                {
                  "meaning": "(music, informal) The chord at which a melody starts and to which it can resolve.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Clipping of home directory.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "home (third-person singular simple present homes, present participle homing, simple past and past participle homed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of animals, transitive) To return to its owner.",
                  "examples": [
                    "The dog homed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(always with \"in on\", transitive) To seek or aim for something.",
                  "examples": [
                    "The missile was able to home in on the target."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}