{
  "word": "pluck",
  "etymologies": [
    {
      "description": [
        "From Middle English plucken, plukken, plockien, from Old English pluccian, ploccian (“to pluck, pull away, tear”), also Old English plyċċan (\"to pluck, pull, snatch; pluck with desire\"; > Modern English plitch), from Proto-Germanic *plukkōną, *plukkijaną (“to pluck”), of uncertain and disputed origin. Perhaps related to Old English pullian (“to pull, draw; pluck off; snatch”). Cognate with Saterland Frisian plukje (“to pluck”), West Frisian plôkje (“to pick, pluck”), Dutch plukken (“to pluck”), Limburgish plógte (“to pluck”), Low German plukken (“to pluck”), German pflücken (“to pluck, pick”), Danish and Norwegian plukke (“to pick”), Swedish plocka (“to pick, pluck, cull”), Icelandic plokka, plukka (“to pluck, pull”). More at pull.",
        "An alternative etymology suggests Proto-Germanic *plukkōną, *plukkijaną may have been borrowed from an assumed Vulgar Latin *pilūc(i)cāre, a derivative of Latin pilāre (“deprive of hair, make bald, depilate”), from pilus (“hair”). The Oxford English Dictionary, however, finds difficulties with this and cites gaps in historical evidence.",
        "The noun sense of \"heart, liver, and lights of an animal\" comes from it being plucked out of the carcass after the animal is killed; the sense of \"fortitude, boldness\" derives from this meaning, originally being a boxing slang denoting a prize-ring, with semantic development from \"heart\", the symbol of courage, to \"fortitude, boldness\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pluck (countable and uncountable, plural plucks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of plucking or pulling sharply.",
                  "examples": [
                    "Those tiny birds are hardly worth the tedious pluck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The lungs, heart with trachea and often oesophagus removed from slaughtered animals.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, figurative, uncountable) Guts, nerve, fortitude or persistence.",
                  "examples": [
                    "Synonyms: see Thesaurus:courage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(African-American Vernacular, slang, uncountable) Cheap wine.",
                  "examples": [
                    "Synonym: plonk"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pluck (third-person singular simple present plucks, present participle plucking, simple past and past participle plucked or (obsolete) pluckt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull something sharply; to pull something out",
                  "examples": [
                    "She plucked the phone from her bag and dialled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take or remove (someone) quickly from a particular place or situation.",
                  "examples": [
                    "First of all, he says a lot of the promotions from the ranks are promotions of the sons of officers who have gone wrong , or got \"plucked,\" or what not, and who are brought up again along another road for commissioned rank."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, music) To gently play a single string, e.g. on a guitar, violin etc.",
                  "examples": [
                    "Whereas a piano strikes the string, a harpsichord plucks it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove feathers from a bird.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To rob, steal from; to cheat or swindle (someone).",
                  "examples": [
                    "Indeed they seem to consider foreigners as strangers whom they should never see again, and might fairly pluck."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To play a string instrument pizzicato.",
                  "examples": [
                    "Plucking a bow instrument may cause a string to break."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To pull or twitch sharply.",
                  "examples": [
                    "to pluck at somebody's sleeve"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, university slang, transitive, obsolete) To reject (a student) after they fail an examination for a degree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a glacier: to transport individual pieces of bedrock by means of gradual erosion through freezing and thawing.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}