{
  "word": "pirate",
  "etymologies": [
    {
      "description": [
        "From Old French pirate, from Latin pīrāta, from Ancient Greek πειρατής (peiratḗs), from πεῖρα (peîra, “trial, attempt, plot”). Displaced native Old English wīċing, which was the word for both \"pirate\" and \"viking\"."
      ],
      "adjectives": [
        {
          "description": "pirate (comparative more pirate, superlative most pirate)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Illegally imitated or reproduced, said of a trademarked product or copyrighted work, or of the counterfeit itself.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "pirate (plural pirates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A criminal who plunders at sea; commonly attacking merchant vessels, though often pillaging port towns.",
                  "examples": [
                    "Synonyms: buccaneer, corsair; see also Thesaurus:pirate",
                    "You should be cautious due to the Somali pirates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An armed ship or vessel that sails for the purpose of plundering other vessels.",
                  "examples": [
                    "The third day out a pirate (Terebinthian by her rig) overhauled us, but when she saw us well armed she stood off after some shooting of arrows on either part—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) One who breaks intellectual property laws by reproducing protected works without permission.",
                  "examples": [
                    "Synonym: bootlegger"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) A bird which practises kleptoparasitism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of marble in children's games.",
                  "examples": [
                    "Most of the time it went fine; some of his classmates had so many marbles they could have opened up their own shop in smurfs, pirates, purple aggies and pink panthers."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pirate (third-person singular simple present pirates, present participle pirating, simple past and past participle pirated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To appropriate by piracy; to plunder at sea.",
                  "examples": [
                    "They pirated the tanker and sailed to a port where they could sell the ship and cargo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intellectual property) To create and/or sell an unauthorized copy of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intellectual property) To knowingly obtain an unauthorized copy of.",
                  "examples": [
                    "Not willing to pay full price for the computer game, Heidi pirated a copy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in piracy.",
                  "examples": [
                    "He pirated in the Atlantic for years before becoming a privateer for the Queen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, Philippines) To entice an employee to switch from a competing company to one's own.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}