{
  "word": "unlight",
  "etymologies": [
    {
      "description": [
        "From un- +‎ light or, in the case of the verb, perhaps from Middle English *unlighten (suggested by past participle unlight, unlyght, unliȝt (“unlit”)), equivalent to un- +‎ light."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "unlight (plural unlights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literary or poetic) The absence of light; darkness.",
                  "examples": [
                    "“They move and shake, from the unlight! The unlight which blackensss and ssscarsss!” “These men, are they a threat to us? To our plans for these lands?” “They are a threat to the way of thingsss! They count among them powerful magii and  […] ”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "unlight (third-person singular simple present unlights, present participle unlighting, simple past and past participle unlighted or unlit)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To extinguish, turn off, or dim the light from",
                  "examples": [
                    "His father, in another room, unlights the lamp and leaves the world alone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English unlighten (“to lighten the burden of; alleviate; dismount from horseback”), equivalent to un- +‎ light (“to alight”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "unlight (third-person singular simple present unlights, present participle unlighting, simple past and past participle unlighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now dialectal) To alight; dismount",
                  "examples": [
                    "I would rather take the water unmixed,\" said I. \"Just as you like,\" said the old soldier; \"but please to unlight, and come into my barracks, at all events.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English unlight, unlyght, unliȝt (“not light (in weight)”), equivalent to un- +‎ light."
      ],
      "adjectives": [
        {
          "description": "unlight",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Not light (“having little weight”).",
                  "examples": [
                    "And thought to bere him doun; With a launce unlight, He smote him in the lyoun; And Tristrem that was wight  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}