{
  "word": "abstraction",
  "etymologies": [
    {
      "description": [
        "From Middle English abstraccyone; either from Middle French abstraction or from Medieval Latin abstrāctiō (“separation”), from Latin abstrahō (“draw away”). Equivalent to abstract +‎ -ion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "abstraction (countable and uncountable, plural abstractions)",
          "definitionGroups": [
            {
              "group": "The act of abstracting, separating, withdrawing, or taking away; withdrawal; the state of being taken away. [First attested around 1350 to 1470.]",
              "entries": [
                {
                  "meaning": "(euphemistic) The taking surreptitiously for one's own use part of the property of another; purloining. [First attested around 1350 to 1470.]",
                  "examples": []
                },
                {
                  "meaning": "(engineering) Removal of water from a river, lake, or aquifer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A separation from worldly objects; a recluse life; the withdrawal from one's senses. [First attested around 1350 to 1470.]",
                  "examples": [
                    "a hermit's abstraction"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of focusing on one characteristic of an object rather than the object as a whole group of characteristics; the act of separating said qualities from the object or ideas. [First attested in the late 16th century.]",
                  "examples": [
                    "Abstraction is no positive act: it is simply the negative of attention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any characteristic of an individual object when that characteristic has been separated from the object and is contemplated alone as a quality having independent existence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of an idealized subgroup when contemplated according to the abstracted quality which defines the subgroup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of comparing commonality between distinct objects and organizing using those similarities; the act of generalizing characteristics; the product of said generalization. [First attested in the late 16th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An idea or notion of an abstract or theoretical nature. [First attested in the late 16th century.]",
                  "examples": [
                    "to fight for mere abstractions."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Absence or absorption of mind; inattention to present objects; preoccupation. [First attested in the late 18th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art) An abstract creation, or piece of art; qualities of artwork that are free from representational aspects. [First attested in the early 20th century.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A separation of volatile parts by the act of distillation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An idea of an idealistic, unrealistic or visionary nature.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The result of mentally abstracting an idea; the product of any mental process involving a synthesis of: separation, despecification, generalization, and ideation in any of a number of combinations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The merging of two river valleys by the larger of the two deepening and widening so much so, as to assimilate the smaller.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Any generalization technique that ignores or hides details to capture some kind of commonality between different instances for the purpose of controlling the intellectual complexity of engineered systems, particularly software systems.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Any intellectual construct produced through the technique of abstraction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}