{
  "word": "railroad",
  "etymologies": [
    {
      "description": [
        "From rail +‎ road."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "railroad (plural railroads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A permanent track consisting of fixed metal rails to drive trains or similar motorized vehicles on.",
                  "examples": [
                    "Many railroads roughly follow the trace of older land - and/or water roads"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) The transportation system comprising such tracks and vehicles fitted to travel on the rails, usually with several vehicles connected together in a train.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US) A single, privately or publicly owned property comprising one or more such tracks and usually associated assets",
                  "examples": [
                    "Railroads can only compete fully if their tracks are technically compatible with and linked to each-other"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) A procedure conducted in haste without due consideration.",
                  "examples": [
                    "The lawyers made the procedure a railroad to get the signatures they needed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "railroad (third-person singular simple present railroads, present participle railroading, simple past and past participle railroaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transport via railroad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To operate a railroad.",
                  "examples": [
                    "The Thatcherite experiment proved the private sector can railroad as inefficiently as a state monopoly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To work for a railroad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To travel by railroad.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in a hobby pertaining to railroads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manipulate and hasten a procedure, as of formal approval of a law or resolution.",
                  "examples": [
                    "The majority railroaded the bill through parliament, without the customary expert studies which would delay it till after the elections."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convict of a crime by circumventing due process.",
                  "examples": [
                    "They could only convict him by railroading him on suspect drug-possession charges."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To procedurally bully someone into an unfair agreement.",
                  "examples": [
                    "He was railroaded into signing a non-disclosure agreement at his exit interview."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(role-playing games) To force characters to complete a task before allowing the plot to continue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(upholstery) To run fabric horizontally instead of the usual vertically.",
                  "examples": [
                    "If you are upholstering a larger item, such as a sofa, it's a good idea to see if the fabric you are buying can be railroaded. Railroading refers to being able to run the fabric from left to right, rather than the conventional top to bottom.  […] [W]hen a pattern is railroaded you can turn it on its side and roll it out to the width of the sofa without join lines."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}