{
  "word": "sweep",
  "etymologies": [
    {
      "description": [
        "From Middle English swepen, from Proto-West Germanic *swaipijan (unattested in Old English), from Proto-Germanic *swaipijaną. Cognate with Early Modern West Frisian swiepe (“whip, cleanse, sweep”), from Old Frisian swēpa, suepa (“sweep”). See also swoop."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sweep (plural sweeps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A single action of sweeping.",
                  "examples": [
                    "Give the front steps a quick sweep to get rid of those fallen leaves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The person who steers a dragon boat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who stands at the stern of a surf boat, steering with a steering oar and commanding the crew.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chimney sweep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A methodical search, typically for bugs (electronic listening devices).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A batsman's shot, played from a kneeling position with a swinging horizontal bat.",
                  "examples": [
                    "Bradman attempted a sweep, but in fact top edged the ball to the wicket keeper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lottery, usually on the results of a sporting event, where players win if their randomly chosen team wins.",
                  "examples": [
                    "Jim will win fifty dollars in the office sweep if Japan wins the World Cup."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flow of water parallel to shore caused by wave action at an ocean beach or at a point or headland.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The degree to which an aircraft's wings are angled backwards (or, occasionally, forwards) from their attachments to the fuselage.",
                  "examples": [
                    "The MiG-17's inner wing has 45 degrees of sweep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(martial arts) A throw or takedown that primarily uses the legs to attack an opponent's legs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Violent and general destruction.",
                  "examples": [
                    "the sweep of an epidemic disease"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(metalworking) A movable template for making moulds, in loam moulding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) In the game casino, the act of capturing all face-up cards from the table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The compass of any turning body or of any motion.",
                  "examples": [
                    "the sweep of a door; the sweep of the eye"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Direction or departure of a curve, a road, an arch, etc. away from a rectilinear line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large oar used in small vessels, partly to propel them and partly to steer them.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) A rowing style in which each rower rows with oar on either the port or starboard side.",
                  "examples": [
                    "I am primarily a sweep rower."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(refining, obsolete) The almond furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long pole, or piece of timber, moved on a horizontal fulcrum fixed to a tall post and used to raise and lower a bucket in a well for drawing water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the blades of a windmill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The sweepings of workshops where precious metals are worked, containing filings, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several sea chubs in the family Kyphosidae (subfamily Scorpidinae).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An expanse or a swath, a strip of land.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sweep (third-person singular simple present sweeps, present participle sweeping, simple past and past participle swept)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To clean (a surface) by means of a stroking motion of a broom or brush.",
                  "examples": [
                    "to sweep a floor, the street, or a chimney"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move through a (horizontal) arc or similar long stroke.",
                  "examples": [
                    "The wind sweeps across the plain.",
                    "The offended countess swept out of the ballroom."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To search (a place) methodically.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To travel quickly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) To play a sweep shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) To brush the ice in front of a moving stone, causing it to travel farther and to curl less.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, ergative) To move something in a long sweeping motion, as a broom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, transitive) To win (a series) without drawing or losing any of the games in that series.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, transitive) To defeat (a team) in a series without drawing or losing any of the games in that series.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) To clear (a body of water or part thereof) of mines.",
                  "examples": [
                    "The channel was swept twice before the battlefleet proceeded through it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove something abruptly and thoroughly.",
                  "examples": [
                    "She swept the peelings off the table onto the floor.",
                    "The wind sweeps the snow from the hills.",
                    "The flooded river swept away the wooden dam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To brush against or over; to rub lightly along.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To carry with a long, swinging, or dragging motion; hence, to carry in a stately or proud fashion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strike with a long stroke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) To row with one oar to either the port or starboard side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To draw or drag something over.",
                  "examples": [
                    "to sweep the bottom of a river with a net"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pass over, or traverse, with the eye or with an instrument of observation.",
                  "examples": [
                    "to sweep the heavens with a telescope"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional, including Ohio and Indiana) To vacuum a carpet or rug.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}