{
  "word": "fountain",
  "etymologies": [
    {
      "description": [
        "From Middle English [Term?]; from Old French fontaine (whence modern fontaine); from Late Latin fontana, from Latin fontanus, fontaneus, adjectives from fons (“source, spring”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fountain (plural fountains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally) A natural source of water; a spring.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artificial, usually ornamental, water feature (usually in a garden or public place) consisting of one or more streams of water originating from a statue or other structure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The structure from which an artificial fountain can issue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reservoir from which liquid can be drawn.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A source or origin of a flow (e.g., of favors or knowledge).",
                  "examples": [
                    "Nothing will pleaſe ſome Men, but Books ſtuff’d with Antiquity, groaning under the weight of Learned Quotations drawn from the Fountains: And what is all this but Pilfering."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A roundel barry wavy argent and azure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(juggling) A juggling pattern typically done with an even number of props where each prop is caught by the same hand that throws it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A soda fountain.",
                  "examples": [
                    "He takes out a soup bowl, fills it with Pepsi from the fountain, and places it carefully on the counter in front of the boy. “That'll be a quarter,” he says professionally."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A drink poured from a soda fountain, or the cup it is poured into.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A ground-based firework that projects sparks similar to a water fountain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Anything that resembles a fountain in operation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fountain (third-person singular simple present fountains, present participle fountaining, simple past and past participle fountained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flow or gush as if from a fountain.",
                  "examples": [
                    "Lava fountained from the volcano."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}