{
  "word": "staccato",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian staccato (“detached, disconnected”), past participle of staccare (“to detach, separate”), aphetic variant of distaccare (“to separate, detach”), from Middle French destacher (“to detach”), from Old French destachier (“to detach”), from des- +‎ atachier (“to attach”), alteration of estachier (“to fasten with or to a stake, lay claim to”), from estache (“a stake”), from Low Frankish *stakka (“stake”), from Proto-Germanic *stakkaz, *stakkēn (“stick, stake”), from Proto-Indo-European *(s)teg- (“stick, stake”). Akin to Old High German stecko (“post”) (German Stecken (“stick”)), Old Saxon stekko (“stake”), Old Norse stakkr (“hay stack, heap”), Old English staca (“stake”). More at stake."
      ],
      "adjectives": [
        {
          "description": "staccato (comparative more staccato, superlative most staccato)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) Describing a passage having this mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Made up of abruptly disconnected parts or sounds.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "staccato (comparative more staccato, superlative most staccato)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) played in this style",
                  "examples": [
                    "Now, play the same passage very staccato."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "staccato (plural staccatos or staccati)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) An articulation marking directing that a note or passage of notes are to be played in an abruptly disconnected manner, with each note sounding for a very short duration, and a short break lasting until the sounding of the next note; as opposed to legato. Staccato is indicated by a dot directly above or below the notehead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A passage having this mark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any sound resembling a musical staccato.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}