{
  "word": "rich",
  "etymologies": [
    {
      "description": [
        "From Middle English riche (“strong, powerful, rich”), from Old English rīċe (“powerful, mighty, great, high-ranking, rich, wealthy, strong, potent”), from Proto-West Germanic *rīkī (“powerful, rich”), from Proto-Germanic *rīkijaz (“kingly, powerful, rich”), from Proto-Germanic *rīks (“king, ruler”), an early borrowing from Proto-Celtic *rīxs, from Proto-Indo-European *h₃rḗǵs. Reinforced by Old French riche, from the same West Germanic source."
      ],
      "adjectives": [
        {
          "description": "rich (comparative richer, superlative richest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Wealthy: having a lot of money and possessions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having an intense fatty or sugary flavour.",
                  "examples": [
                    "a rich dish; rich cream or soup; rich pastry"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Remunerative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Plentiful, abounding, abundant, fulfilling.",
                  "examples": [
                    "a rich treasury; a rich entertainment; a rich crop"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Yielding large returns; productive or fertile; fruitful.",
                  "examples": [
                    "rich soil or land; a rich mine"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Composed of valuable or costly materials or ingredients; procured at great outlay; highly valued; precious; sumptuous; costly.",
                  "examples": [
                    "a rich endowment; a rich dress; rich silk or fur; rich presents"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not faint or delicate; vivid.",
                  "examples": [
                    "a rich red colour"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Very amusing.",
                  "examples": [
                    "The scene was a rich one.",
                    "a rich incident or character"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Ridiculous, absurd, outrageous, preposterous, especially in a galling, hypocritical, or brazen way.",
                  "examples": [
                    "Now, if money be a marketable commodity like flour, as the Witness states, is it not rather a rich idea that of selling the use of a barrel of flour instead of the barrel of flour itself?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) Elaborate, having complex formatting, multimedia, or depth of interaction.",
                  "examples": [
                    "Some rich text email messages contain formatting information that's best viewed with Microsoft Word."
                  ]
                }
              ]
            },
            {
              "group": "Of a solute-solvent solution: not weak (not diluted); of strong concentration.",
              "entries": [
                {
                  "meaning": "Of a fuel-air mixture: having more fuel (thus less air) than is necessary to burn all of the fuel; less air- or oxygen- rich than necessary for a stoichiometric reaction.",
                  "examples": [
                    "Antonym: lean"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance) Trading at a price level which is high relative to historical trends, a similar asset, or (for derivatives) a theoretical value.",
                  "examples": [
                    "The ETF is trading rich to NAV right now; we can arb this by selling the ETF and buying the underlying constituents."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rich pl (plural only)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The rich people of a society or the world collectively, the rich class of a society.",
                  "examples": [
                    "Let me tell you about the very rich. They are different from you and me. They possess and enjoy early, and it does something to them, makes them soft where we are hard, and cynical where we are trustful, in a way that, unless you were born rich, it is very difficult to understand. They think, deep in their hearts, that they are better than we are..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rich (third-person singular simple present riches, present participle riching, simple past and past participle riched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To enrich.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To become rich.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}