{
  "word": "pour",
  "etymologies": [
    {
      "description": [
        "From Middle English pouren (“to pour”), of uncertain origin. Likely to be of Celtic origin, from Celtic base *purr- (“to jerk, throw (water)”), akin to Welsh bwrw (“to cast, strike, rain”), Scottish Gaelic purr (“to push, thrust, urge, drive”), Irish purraim (“I push, I jerk”). Compare also the rare Dutch pouren (“to pour”).",
        "Displaced Middle English schenchen, Middle English schenken (“to pour”) (from Old English sċenċan (“to pour out”), whence dialectal English shink, and Old Norse skenkja, whence dialectal English skink, and akin to Dutch schenken (“to pour; to gift”)), Middle English ȝeoten, Middle English yetten (“to pour”) (from Old English ġēotan (“to pour”) and akin to German gießen (“to pour”)), Middle English birlen (“to pour, serve drink to”) (from Old English byrelian (“to pour, serve drink to”)), Middle English hellen (“to pour, pour out”) (from Old Norse hella (“to pour out, incline”)). Largely displaced English teem, from Middle English temen (“to pour out, empty”) (from Old Norse tœma (“to pour out, empty”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pour (plural pours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of pouring.",
                  "examples": [
                    "The bartender's inexpert pour left me with a pint of beer that was half foam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something, or an amount, poured.",
                  "examples": [
                    "Over this time period, the first concrete pour has not only lost workability but has started to set so that it is no longer affected by the action of a vibrator."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A downpour, or flood of precipitation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pour (third-person singular simple present pours, present participle pouring, simple past and past participle poured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause (liquid, or liquid-like substance) to flow in a stream, either out of a container or into it.",
                  "examples": [
                    "pour water from a jug",
                    "pour wine into a decanter",
                    "to pour oil onto chips",
                    "to pour out sand or dust."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To send out as in a stream or a flood; to cause (an emotion) to come out; to cause to escape.",
                  "examples": [
                    "My teacher poured scorn on my attempts at writing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send forth from, as in a stream; to discharge uninterruptedly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flow, pass or issue in a stream; to fall continuously and abundantly.",
                  "examples": [
                    "the rain poured down."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(impersonal) To rain hard.",
                  "examples": [
                    "It's pouring outside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a beverage, to be on tap or otherwise available for serving to customers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move in a throng, as a crowd.",
                  "examples": [
                    "In the rude throng pour on with furious pace."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pour",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misspelling of pore.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}