{
  "word": "temper",
  "etymologies": [
    {
      "description": [
        "From Middle English temperen, tempren, from Old English ġetemprian, temprian, borrowed from Latin temperō (“I divide or proportion duly, I moderate, I regulate; intransitive senses I am moderate, I am temperate”), from tempus (“time, fit season”). Compare also French tempérer. Doublet of tamper. See temporal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "temper (countable and uncountable, plural tempers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A general tendency or orientation towards a certain type of mood, a volatile state; a habitual way of thinking, behaving or reacting.",
                  "examples": [
                    "to have a good, bad, or calm temper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "State of mind; mood.",
                  "examples": [
                    "She bowed to him, to put him in a good temper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tendency to become angry.",
                  "examples": [
                    "to have a hasty temper",
                    "He has quite a temper when dealing with salespeople."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Anger; a fit of anger.",
                  "examples": [
                    "an outburst of temper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Calmness of mind; moderation; equanimity; composure.",
                  "examples": [
                    "to keep one's temper; to lose one's temper; to recover one's temper"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Constitution of body; the mixture or relative proportion of the four humours: blood, choler, phlegm, and melancholy.",
                  "examples": [
                    "[…]  it is hard to say, whether [Christ’s] pain was more shamefull, or his shame more painfull unto him: the exquisiteness of his bodily temper, increasing the exquisiteness of his torment, and the ingenuity of his Soul, adding to his sensibleness of the indignities and affronts offered until him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Middle state or course; mean; medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of any compound substance which results from the mixture of various ingredients; due mixture of different qualities.",
                  "examples": [
                    "the temper of mortar"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The heat treatment to which a metal or other material has been subjected; a material that has undergone a particular heat treatment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of a metal or other substance, especially as to its hardness, produced by some process of heating or cooling.",
                  "examples": [
                    "the temper of iron or steel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sugar manufacture, historical) Milk of lime, or other substance, employed in the process formerly used to clarify sugar.",
                  "examples": [
                    "All cane juice is liable to rapid fermentation. As soon, therefore, as the clarifier is filled, the fire is lighted, and the temper (white lime of Bristol) is stirred into it. The alkali of the lime having neutralized its superabundant acid, a part of it becomes the basis of the sugar."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "temper (third-person singular simple present tempers, present participle tempering, simple past and past participle tempered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To moderate or control.",
                  "examples": [
                    "Temper your language around children."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To strengthen or toughen a material, especially metal, by heat treatment; anneal.",
                  "examples": [
                    "Tempering is a heat treatment technique applied to metals, alloys, and glass to achieve greater toughness by increasing the strength of materials and/or ductility. Tempering is performed by a controlled reheating of the work piece to a temperature below its lower eutectic critical temperature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) To adjust the temperature of an ingredient (e.g. eggs or chocolate) gradually so that it remains smooth and pleasing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sauté spices in ghee or oil to release essential oils for flavouring a dish in South Asian cuisine.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mix clay, plaster or mortar with water to obtain the proper consistency.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To adjust, as the mathematical scale to the actual scale, or to that in actual use.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, Latinism) To govern; to manage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To combine in due proportions; to constitute; to compose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To mingle in due proportion; to prepare by combining; to modify, as by adding some new element; to qualify, as by an ingredient; hence, to soften; to mollify; to assuage.",
                  "examples": [
                    "Puritan austerity was so tempered by Dutch indifference, that mercy itself could not have dictated a milder system."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To fit together; to adjust; to accommodate.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}