{
  "word": "stay",
  "etymologies": [
    {
      "description": [
        "From Middle English steyen, staien, from Old French estayer, estaier (“to fix, prop up, support, stay”), from estaye, estaie (“a prop, stay”), from Middle Dutch staeye (“a prop, stay”), a contracted form of staede, stade (“a prop, stay, help, aid”) (compare Middle Dutch staeyen, staeden (“to make firm, stay, support, hold still, stabilise”)), from Frankish *stadi (“a site, place, location, standing”), from Proto-Germanic *stadiz (“a standing, place”), from Proto-Indo-European *stéh₂tis (“standing”). Influenced by Old English stæġ (\"a stay, rope\"; see below). Cognate with Old English stede, stæde (“a place, spot, locality, fixed position, station, site, standing, status, position of a moving body, stopping, standing still, stability, fixity, firmness, steadfastness”), Swedish stödja (“to prop, support, brace, hold up, bolster”), Icelandic stöðug (“continuous, stable”). More at stead, steady.",
        "Sense of \"remain, continue\" may be due to later influence from Old French ester, esteir (“to stand, be, continue, remain”), from Latin stāre (“stand”), from the same Proto-Indo-European root above; however, derivation from this root is untenable based on linguistic and historical grounds.",
        "An alternative etymology derives Old French estaye, estaie, from Frankish *stakā, *stakō (“stake, post”), from Proto-Germanic *stakô (“stake, bar, stick, pole”), from Proto-Indo-European *(s)teg- (“rod, pole, stick”), making it cognate with Old English staca (“pin, stake”), Old English stician (“to stick, be placed, lie, remain fixed”). Cognate with Albanian shtagë (“a long stick, a pole”). More at stake, stick."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stay (plural stays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Continuance or a period of time spent in a place; abode for an indefinite time.",
                  "examples": [
                    "Synonym: sojourn",
                    "I hope you enjoyed your stay in Hawaii."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A postponement, especially of an execution or other punishment.",
                  "examples": [
                    "The governor granted a stay of execution."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A stop; a halt; a break or cessation of action, motion, or progress.",
                  "examples": [
                    "stand at a stay"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fixed state; fixedness; stability; permanence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A station or fixed anchorage for vessels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Restraint of passion; prudence; moderation; caution; steadiness; sobriety.",
                  "examples": [
                    "Not grudging that thy lust hath bounds and stays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Hindrance; let; check.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stay (third-person singular simple present stays, present participle staying, simple past and past participle stayed or (obsolete) staid)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prop; support; sustain; hold up; steady.",
                  "examples": [
                    "Draw in your right elbow, turn your hand outward and bear it lightly, gripe not the pen too hard, with your left hand stay the paper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To support from sinking; to sustain with strength; to satisfy in part or for the time.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(transitive) To stop or delay something.",
              "entries": [
                {
                  "meaning": "To stop; detain; keep back; delay; hinder.",
                  "examples": [
                    "This business staid me in London almost a week  […]"
                  ]
                },
                {
                  "meaning": "To restrain; withhold; check; stop.",
                  "examples": [
                    "[…]  all that may but with any the least shew of possibility stay their mindes from thinking that true, which they heartily wish were false, but cannot think it so  […]"
                  ]
                },
                {
                  "meaning": "To cause to cease; to put an end to.",
                  "examples": [
                    "For flattering planets seemed to say",
                    "This child should ills of ages stay,"
                  ]
                },
                {
                  "meaning": "To put off; defer; postpone; delay; keep back.",
                  "examples": [
                    "The governor stayed the execution until the appeal could be heard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold the attention of.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To bear up under; to endure; to hold out against; to resist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To wait for; await.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To remain for the purpose of; to stay to take part in or be present at (a meal, ceremony etc.).",
                  "examples": [
                    "Some of the company staid supper, which prevented the embarrassment that must unavoidably have arisen, had the family been by themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To rest; depend; rely.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To stop; come to a stand or standstill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To come to an end; cease.",
                  "examples": [
                    "That day the storm stayed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To dwell; linger; tarry; wait.",
                  "examples": [
                    "Yet not to be wholly silent of all your Charities I must stay a little on one Action, which preferr’d the Relief of Others, to the Consideration of your Self."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To make a stand; to stand firm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hold out, as in a race or contest; last or persevere to the end; to show staying power.",
                  "examples": [
                    "That horse stays well."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remain in a particular place, especially for a definite or short period of time; sojourn; abide.",
                  "examples": [
                    "We stayed in Hawaii for a week.  I can only stay for an hour."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To wait; rest in patience or expectation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, used with on or upon) To wait as an attendant; give ceremonious or submissive attendance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) To continue to have a particular quality.",
                  "examples": [
                    "Wear gloves so your hands stay warm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Scotland, South Africa, India, Southern US, African-American Vernacular, colloquial) To live; reside",
                  "examples": [
                    "Hey, where do you stay at?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stay, from Old French estaye, estaie (“a prop, a stay”), from Middle Dutch staeye (“a prop, stay”), a contracted form of staede, stade (\"a prop, stay, help, aid\"; compare Middle Dutch staeyen, staeden (“to make firm, stay, support, hold still, stabilise”)), from Old Dutch *stad (“a site, place, location, standing”), from Proto-Germanic *stadiz (“a standing, place”), from Proto-Indo-European *steh₂- (“to stand”). See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stay (plural stays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A prop; a support.",
                  "examples": [
                    "The trees themselves serve, at the same time, as so many stays for their Vines"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of stiff material, such as plastic or whalebone, used to stiffen a piece of clothing.",
                  "examples": [
                    "Where are the stays for my collar?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A corset.",
                  "examples": [
                    "Her figure was tall, yet not too tall; comely and well-developed, yet not fat; her head set on her shoulders with an easy, pliant firmness; her waist, perfection in the eyes of a man, for it occupied its natural place, it filled out its natural circle, it was visibly and delightfully undeformed by stays."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A fastening for a garment; a hook; a clasp; anything to hang another thing on.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English stay, from Old English stæġ (“stay, a rope supporting a mast”), from Proto-Germanic *stagą (“stay, rope”), from Proto-Indo-European *stek-, *stāk- (“stand, pole”), from Proto-Indo-European *steh₂- (“to stand”). Cognate with Dutch stag (“stay”), German Stag (“stay”), Swedish stag (“stay”), Icelandic stag (“stay”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stay (plural stays)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A strong rope or wire supporting a mast, and leading from one masthead down to some other, or other part of the vessel.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A guy, rope, or wire supporting or stabilizing a platform, such as a bridge, a pole, such as a tentpole, the mast of a derrick, or other structural element.",
                  "examples": [
                    "The engineer insisted on using stays for the scaffolding."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The transverse piece in a chain-cable link.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stay (third-person singular simple present stays, present participle staying, simple past and past participle stayed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To brace or support with a stay or stays",
                  "examples": [
                    "stay a mast"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To incline forward, aft, or to one side by means of stays.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, nautical) To tack; put on the other tack.",
                  "examples": [
                    "to stay ship"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, nautical) To change; tack; go about; be in stays, as a ship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *steȝe, from Old English *stǣġe, an apocopated variant of stǣġel (“steep, abrupt”), from Proto-Germanic *staigilaz (“climbing, ascending, sloping, steep”), see sty."
      ],
      "adjectives": [
        {
          "description": "stay (comparative stayer or more stay, superlative stayest or most stay)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Steep; ascending.",
                  "examples": [
                    "The Castle of Edr. is naturally a great strenth situate upon the top of a high Rock perpendicular on all sides, except on the entry from the burgh, which is a stay ascent and is well fortified with strong Walls, three gates each one within another, with Drawbridges, and all necessary fortifications."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) (of a roof) Steeply pitched.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Difficult to negotiate; not easy to access; sheer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Stiff; upright; unbending; reserved; haughty; proud.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "stay (comparative stayer or more stay, superlative stayest or most stay)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Steeply.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}