{
  "word": "pick",
  "etymologies": [
    {
      "description": [
        "From Middle English piken, picken, pikken, from Old English *piccian, *pīcian (attested in pīcung (“a pricking”)), and pīcan, pȳcan (“to pick, prick, pluck”), both from Proto-West Germanic *pikkōn, from Proto-Germanic *pikkōną (“to pick, peck, prick, knock”), from Proto-Indo-European *bew-, *bu- (“to make a dull, hollow sound”). Doublet of pitch and peck.",
        "Cognate with Dutch pikken (“to pick”), German picken (“to pick, peck”), Old Norse pikka, pjakka (whence Icelandic pikka (“to pick, prick”), Swedish picka (“to pick, peck”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pick (plural picks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used for digging; a pickaxe.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool for unlocking a lock without the original key; a lock pick, picklock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A comb with long widely spaced teeth, for use with tightly curled hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A choice; ability to choose.",
                  "examples": [
                    "France and Russia have the pick of our stables."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which would be picked or chosen first; the best.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A tool used for strumming the strings of a guitar; a plectrum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, slang) An anchor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) A screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lacrosse) An offensive tactic in which a player stands so as to block a defender from reaching a teammate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An interception.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A good defensive play by an infielder.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A pickoff.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pointed hammer used for dressing millstones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A pike or spike; the sharp point fixed in the center of a buckler.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) A particle of ink or paper embedded in the hollow of a letter, filling up its face, and causing a spot on a printed sheet.",
                  "examples": [
                    "If it be in the smallest degree gritty, it clogs the form, and consequently produces a thick and imperfect impression; no pains should, therefore, be spared to render it perfectly smooth; it may then be made to work as clear and free from picks"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(art, painting) That which is picked in, as with a pointed pencil, to correct an unevenness in a picture.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(weaving) The blow that drives the shuttle, used in calculating the speed of a loom (in picks per minute); hence, in describing the fineness of a fabric, a weft thread.",
                  "examples": [
                    "so many picks to an inch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) Pasture; feed, for animals. [from 20th c.]",
                  "examples": [
                    "‘She's all African grass and Brahmans. There's not a blade of native pick left, except on the ridges.’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pick (third-person singular simple present picks, present participle picking, simple past and past participle picked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To grasp and pull with the fingers or fingernails.",
                  "examples": [
                    "Don't pick at that scab.",
                    "He picked his nose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To harvest a fruit or vegetable for consumption by removing it from the plant to which it is attached; to harvest an entire plant by removing it from the ground.",
                  "examples": [
                    "It's time to pick the tomatoes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pull apart or away, especially with the fingers; to pluck.",
                  "examples": [
                    "She picked flowers in the meadow.",
                    "to pick feathers from a fowl"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take up; especially, to gather from here and there; to collect; to bring together.",
                  "examples": [
                    "to pick rags"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove something from somewhere with a pointed instrument, with the fingers, or with the teeth.",
                  "examples": [
                    "to pick the teeth; to pick a bone; to pick a goose; to pick a pocket"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To decide upon, from a set of options; to select.",
                  "examples": [
                    "I'll pick the one with the nicest name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seek (a fight or quarrel) where the opportunity arises.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) To recognise the type of ball being bowled by a bowler by studying the position of the hand and arm as the ball is released.",
                  "examples": [
                    "He didn't pick the googly, and was bowled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) To pluck the individual strings of a musical instrument or to play such an instrument.",
                  "examples": [
                    "He picked a tune on his banjo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To open (a lock) with a wire, lock pick, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eat slowly, sparingly, or by morsels; to nibble.",
                  "examples": [
                    "Why stand'st thou picking? Is thy palate sore?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To do anything fastidiously or carefully, or by attending to small things; to select something with care.",
                  "examples": [
                    "I gingerly picked my way between the thorny shrubs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To steal; to pilfer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To throw; to pitch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) To peck at, as a bird with its beak; to strike at with anything pointed; to act upon with a pointed instrument; to pierce; to prick, as with a pin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To separate or open by means of a sharp point or points.",
                  "examples": [
                    "to pick matted wool, cotton, oakum, etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(basketball) To screen.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football, informal) To intercept a pass from the offense as a defensive player.",
                  "examples": [
                    "The pass was almost picked, but the tight end was able to hold on."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}