{
  "word": "warrant",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English warant (“protector; guard, shield, protection”), from Anglo-Norman warrant, Old Northern French warant, warand, a variant of Old French guarant, garant, garand (“assurance, guarantee; authorization, permission; protector; protection, safety”) (modern French garant), from Frankish *warand, present participle of *warjan (“to fend off; to stop, thwart”). The word is cognate with Old High German werento (“guarantor”).",
        "The verb is derived from Middle English warrant, waranten (“to give protection; to protect, shield; to assure, pledge, promise; to guarantee”), from Anglo-Norman warantir, warandir, warentir, and Old Northern French warandir, warantir, variant forms of Old French guarantir (“to protect”) (modern French garantir), a Romance formation from the noun guarant: see above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "warrant (countable and uncountable, plural warrants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Authorization or certification; a sanction, as given by a superior.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something that provides assurance or confirmation; a guarantee or proof.",
                  "examples": [
                    "a warrant of authenticity; a warrant for success"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An order that serves as authorization; especially a voucher authorizing payment or receipt of money.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(finance, countable) An option, usually issued together with another security and with a term at issue greater than a year, to buy other securities of the issuer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, countable) A judicial writ authorizing an officer to make a search, seizure, or arrest, or to execute a judgment.",
                  "examples": [
                    "an arrest warrant issued by the court"
                  ]
                }
              ]
            },
            {
              "group": "(military, countable) Short for warrant officer.",
              "entries": [
                {
                  "meaning": "(countable) A certificate of appointment given to a warrant officer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(New Zealand, road transport, countable) A document certifying that a motor vehicle meets certain standards of mechanical soundness and safety; a warrant of fitness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, countable) A defender, a protector.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, uncountable) Underclay in a coal mine.",
                  "examples": [
                    "Synonym: warren earth"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "warrant (third-person singular simple present warrants, present participle warranting, simple past and past participle warranted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To protect, keep safe (from danger).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To give (someone) an assurance or guarantee (of something); also, with a double object: to guarantee (someone something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To guarantee (something) to be (of a specified quality, value, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To guarantee as being true; (colloquial) to believe strongly.",
                  "examples": [
                    "That tree is going to fall, I’ll warrant."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To authorize; to give (someone) sanction or warrant (to do something).",
                  "examples": [
                    "I am warranted to search these premises fully."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To justify; to give grounds for.",
                  "examples": [
                    "Circumstances arose that warranted the use of lethal force."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}