{
  "word": "citation",
  "etymologies": [
    {
      "description": [
        "From Middle English citacioun, from Old French citation, from Latin citātiō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "citation (countable and uncountable, plural citations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An official summons or notice given to a person to appear.",
                  "examples": [
                    "No citation was issued upon this appeal returnable to the next term of this court, nor was the record filed and the cause docketed during that term. On the 29th of May, 1865, however, a citation was issued, returnable at this term, and service of this citation was acknowledged by the present district attorney; and the writ was returned and the record filed at this term, under an agreement between the district attorney and the attorney for the claimants, to submit the cause upon printed briefs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The paper containing such summons or notice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of citing a passage from a text, or from another person, using the exact words of the original text or speech and giving credit to the original by referencing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An entry in a list of sources from which information was taken, typically following a prescribed bibliographical style; a reference.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The passage or words quoted; a quotation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(lexicography) A quotation with attached bibliographical details demonstrating the use of a particular lexical item in a dictionary, especially a dictionary on historical principles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Enumeration; mention.",
                  "examples": [
                    "It's a simple citation of facts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reference to decided cases, or books of authority, to prove a point in law.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A commendation in recognition of some achievement, or a formal statement of an achievement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}