{
  "word": "triangle",
  "etymologies": [
    {
      "description": [
        "From Middle English triangle, from Old French triangle, from Latin triangulum, noun use of adjective triangulus (“three-cornered, having three angles”), from trēs (“three”) + angulus (“corner, angle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "triangle (plural triangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) A polygon with three sides and three angles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, Canada) A set square.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A percussion instrument made by forming a metal rod into a triangular shape which is open at one angle. It is suspended from a string and hit with a metal bar to make a resonant sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cue sports) A triangular piece of equipment used for gathering the balls into the formation required by the game being played.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A love triangle.",
                  "examples": [
                    "One of the writers' most pleasing inventions was to treat the triangle love story as comedy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(systemics) The structure of systems composed with three interrelated objects.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A draughtsman's square in the form of a right-angled triangle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, usually in the plural) A frame formed of three poles stuck in the ground and united at the top, to which people were bound when undergoing corporal punishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various large papilionid butterflies of the genus Graphium.",
                  "examples": [
                    "Synonym: bluebottle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) A triangular formation of railway tracks, with a curve on at least one side.",
                  "examples": [
                    "Synonym: wye"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}