{
  "word": "surrender",
  "etymologies": [
    {
      "description": [
        "From Old French surrendre, from sur- + rendre (“render”). Noun use is from Anglo-Norman. Displaced native Old English handgang (noun) and on hand gān (verb)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "surrender (countable and uncountable, plural surrenders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of surrendering, submission into the possession of another; abandonment, resignation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The yielding or delivery of a possession in response to a demand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, property law) The yielding of the leasehold estate by the lessee to the landlord, so that the tenancy for years merges in the reversion and no longer exists.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "surrender (third-person singular simple present surrenders, present participle surrendering, simple past and past participle surrendered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give up into the power, control, or possession of another.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, by extension, transitive) To yield (a town, a fortification, etc.) to an enemy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive or reflexive) To give oneself up into the power of another, especially as a prisoner; to submit or give in.",
                  "examples": [
                    "Don't shoot! I surrender!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give up possession of; to yield; to resign.",
                  "examples": [
                    "to surrender a right, privilege, or advantage"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To yield (oneself) to an influence, emotion, passion, etc.",
                  "examples": [
                    "to surrender oneself to grief, to despair, to indolence, or to sleep"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, blackjack) To abandon (one's hand of cards) and recover half of the initial bet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, insurance) For a policyholder, to voluntarily terminate an insurance contract before the end of its term, usually with the expectation of receiving a surrender value.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}