{
  "word": "murmur",
  "etymologies": [
    {
      "description": [
        "From Middle English murmur, murmor, murmour, from Old French murmure (modern French murmure), from Latin murmur (“murmur, humming, muttering, roaring, growling, rushing etc.”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "murmur (countable and uncountable, plural murmurs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Any low, indistinct sound, like that of running water.",
                  "examples": [
                    "The delightful murmur of water running over pebbles is heard a few yards off"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, uncountable) Soft indistinct speech.",
                  "examples": [
                    "A murmur arose from the audience."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cardiology, medicine) The sound made by any condition which produces noisy, or turbulent, flow of blood through the heart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A muttered complaint or protest; the expression of dissatisfaction in a low muttering voice; any expression of complaint or discontent.",
                  "examples": [
                    "In fear of disease and in the interest of his health man will be muzzled and masked like a vicious dog, and that without any murmur of complaint."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "murmur (third-person singular simple present murmurs, present participle murmuring, simple past and past participle murmured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, now rare) To grumble; to complain in a low, muttering voice, or express discontent at or against someone or something. [from 14th c.]",
                  "examples": [
                    "And now, behold thy brothers murmur, saying it is a hard thing which I have required of them; but behold I have not required it of them, but it is a commandment of the Lord."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak or make low, indistinguishable noise; to mumble, mutter. [from 14th c.]",
                  "examples": [
                    "I couldn't hear the words; he just murmured a lot.",
                    "The bees murmured in the forest. The waves murmured on the shore."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say (something) indistinctly, to mutter. [from 15th c.]",
                  "examples": [
                    "With a husky voice she murmured that he was the very dearest grandfather anyone ever had."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}