{
  "word": "common",
  "etymologies": [
    {
      "description": [
        "From Middle English comun, from Anglo-Norman comun, from Old French comun (rare in the Gallo-Romance languages, but reinforced as a Carolingian calque of Proto-West Germanic *gamainī (“common”) in Old French), from Latin commūnis (“common, public, general”), from Proto-Indo-European *ḱom-moy-ni-s (“held in common”), from Proto-Indo-European *mey- (“to exchange, change”). Displaced native Middle English imene, ȝemǣne (“common, general, universal”) (from Old English ġemǣne (“common, universal”)), Middle English mene, mǣne (“mean, common”) (also from Old English ġemǣne (“common, universal”)), Middle English samen, somen (“in common, together”) (from Old English samen (“together”)). Doublet of gmina."
      ],
      "adjectives": [
        {
          "description": "common (comparative commoner or more common, superlative commonest or most common)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mutual; shared by more than one.",
                  "examples": [
                    "The two competitors have the common aim of winning the championship.",
                    "Winning the championship is an aim common to the two competitors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Occurring or happening regularly or frequently; usual.",
                  "examples": [
                    "It is common to find sharks off this coast."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Found in large numbers or in a large quantity; usual.",
                  "examples": [
                    "Audio (US)(file)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Simple, ordinary or vulgar.",
                  "examples": [
                    "If it be asked wherein the utility of some modern extensions of mathematics lies, it must be acknowledged that it is at present difficult to see how they are ever to become applicable to questions of common life or physical science."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of, pertaining or belonging to the common gender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) Of or pertaining to common nouns as opposed to proper nouns.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Vernacular, referring to the name of a kind of plant or animal, i.e., common name vs. scientific name.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Profane; polluted.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Given to lewd habits; prostitute.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "common (plural commons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mutual good, shared by more than one.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tract of land in common ownership; common land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The people; the community.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The right of taking a profit in the land of another, in common either with the owner or with other persons; so called from the community of interest which arises between the claimant of the right and the owner of the soil, or between the claimants and other commoners entitled to the same right.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "common (third-person singular simple present commons, present participle commoning, simple past and past participle commoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To communicate (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To converse, talk.",
                  "examples": [
                    "Capitaine generall of Flaunders, which amiably enterteyned the sayd Duke, and after they had secretly commoned of."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have sex.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To participate.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To have a joint right with others in common ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To board together; to eat at a table in common.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}