{
  "word": "bissextile",
  "etymologies": [
    {
      "description": [
        "From Latin bisextilis annus (“bissextile year”), from bisextus + -ilis, from bis- (“two; twice; doubled”) + sextus (“sixth”) + dies (“day”), from the Julian calendar's original reckoning of its quadrennial intercalary day as a 48-hour February 24, subsequently distinguished as the two separate days of the sixth day before the March calends (sexto Kalendas Martii) and the \"doubled sixth day\". (February 24 is now normally understood as five days before the first of March, but was called the sixth by the Romans owing to their inclusive counting of dates. See Roman calendar on Wikipedia.)"
      ],
      "adjectives": [
        {
          "description": "bissextile (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having an intercalary day, particularly the quadrennial leap day of the Julian and Gregorian calendars traditionally placed as a \"second sixth\" day before March 1st.",
                  "examples": [
                    "The additional day which occurred every fourth year [after the Julian Reform] was given to February, as being the shortest month, and was inserted in the calendar between the 24th and 25th day. February having then twenty-nine days, the 25th was the 6th of the calends of March, sexto calendas; the preceding, which was the additional or intercalary day, was called bis-sexto calendas,—hence the term bissextile, which is still employed to distinguish the year of 366 days. The English denomination of leap-year would have been more appropriate if that year had differed from common years in defect, and contained only 364 days. In the ecclesiastical calendar the intercalary day is still placed between the 24th and 25th of February; in the civil calendar it is the 29th."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "bissextile (plural bissextiles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of leap year: a year with an intercalary day.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}