{
  "word": "scavenger",
  "etymologies": [
    {
      "description": [
        "Originally from Middle English scavager, from Anglo-Norman scawageour (“one who had to do with scavage, inspector, tax collector”), from Old Northern French *scawage, escauwage (“scavage”), Old French *scavage, escavage, alteration of escauvinghe (compare Medieval Latin scewinga, sceawinga), from Old Dutch scauwōn (“to inspect, to examinate, to look at”). Usually reinterpreted/re-analysed today as scavenge (which was originally a backformation from this word) + -er. Compare Old English sċēawung (“a showing, spectacle, examination, inspection, toll on exposure of goods”) and Dutch schouwing (“inspection”). More at show."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scavenger (plural scavengers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who scavenges, especially one who searches through rubbish for food or useful things.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An animal that feeds on decaying matter such as carrion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, obsolete) A street sweeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, historical) A child employed to pick up loose cotton from the floor in a cotton mill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) A substance used to remove impurities from the air or from a solution.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scavenger (third-person singular simple present scavengers, present participle scavengering, simple past and past participle scavengered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To scavenge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To clean the rubbish from a street, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}