{
  "word": "medium",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin medium, neuter of medius (“middle”), from Proto-Italic *meðjos, from Proto-Indo-European *médʰyos (“between”). Compare middle. Doublet of medio, media, and mediate."
      ],
      "adjectives": [
        {
          "description": "medium (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Arithmetically average.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of intermediate size, degree, amount etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of meat, cooked to a point greater than rare but less than well done; typically, so the meat is still red in the centre.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially clothing, food or drink) That is medium (the manufactured size).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "medium (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To a medium extent.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "medium (plural media or mediums)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The material of the surrounding environment, e.g. solid, liquid, gas, vacuum, or a specific substance such as a solvent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The materials or empty space through which signals, waves, or forces pass.",
                  "examples": [
                    "Whether any other Liquours, being made Mediums, cause a Diuersity of Sound from Water, it may be tried:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A format for communicating or presenting information.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(microbiology) A nutrient substance, commonly a solution or solid, for the growth of cells in vitro.",
                  "examples": [
                    "In some instances one can take advantage of differential carbohydrate fermentation capabilities of microorganisms by incorporating one or more carbohydrates in the medium along with a suitable pH indicator. Such media are called differential media (e.g., eosin methylene blue or MacConkey agar) and are commonly used to isolate enteric bacilli."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, horticulture etc.) A substance, structure, or environment in which living organisms subsist, grow or are cultured.",
                  "examples": [
                    "The density of the living medium of fishes exerts upon them a mechanical influence; they are, so to say, balanced in water, free to proceed in all planes of direction..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A means, channel, agency or go-between through which communication, commerce, etc is conveyed or carried on, or by which an aim is achieved.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) The materials used to finish a workpiece using a mass finishing or abrasive blasting process.",
                  "examples": []
                }
              ]
            }
          ]
        },
        {
          "description": "medium (plural mediums or media)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A liquid base which carries pigment in paint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(painting) A means of expression, in the arts, such as a material (oil, pastel, clay, etc) or method or style (expressionism, jazz, etc).",
                  "examples": [
                    "Acrylics, oils, charcoal, and gouache are all mediums I used in my painting."
                  ]
                }
              ]
            }
          ]
        },
        {
          "description": "medium (countable and uncountable, plural mediums)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, spiritualism) Someone who supposedly conveys information from the spirit world.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, especially clothing, food or drink) One of several common sizes to which an item may be manufactured.",
                  "examples": [
                    "Synonym: M"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, especially clothing, food or drink) An item labelled or denoted as being that size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, especially with respect to clothing) One who fits an item of that size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Ireland, dated, informal) A half-pint serving of Guinness (or other stout in some regions).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A middle place or degree.",
                  "examples": [
                    "a happy medium"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, dated) An average; sometimes the mathematical mean.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, logic) The mean or middle term of a syllogism, that by which the extremes are brought into connection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}