{
  "word": "exclusive",
  "etymologies": [
    {
      "description": [
        "From Latin exclūsīvus, from excludere (“to shut out, exclude”), from ex- (“out”) + variant form of verb claudere (“to close, shut”)."
      ],
      "adjectives": [
        {
          "description": "exclusive (comparative more exclusive, superlative most exclusive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(literally) Excluding items or members that do not meet certain conditions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Referring to a membership organisation, service or product: of high quality and/or renown, for superior members only. A snobbish usage, suggesting that members who do not meet requirements, which may be financial, of celebrity, religion, skin colour etc., are excluded.",
                  "examples": [
                    "Exclusive clubs tend to serve exclusive brands of food and drinks, in the same exorbitant price range, such as the 'finest' French châteaux."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exclusionary.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Whole, undivided, entire.",
                  "examples": [
                    "The teacher's pet commands the teacher's exclusive attention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Of or relating to the first-person plural pronoun when excluding the person being addressed.",
                  "examples": [
                    "The pronoun in \"We're going to a party later, but you aren't invited\" is an exclusive \"we\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of two people in a romantic or sexual relationship) Having a romantic or sexual relationship with one another, to the exclusion of others.",
                  "examples": [
                    "They decided to no longer be exclusive."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "exclusive (plural exclusives)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Information (or an artefact) that is granted or obtained exclusively.",
                  "examples": [
                    "The editor agreed to keep a lid on a potentially disastrous political scoop in exchange for an exclusive of a happier nature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A member of a group who exclude others from their society.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A word or phrase that restricts something, such as only, solely, or simply.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}