{
  "word": "amber",
  "etymologies": [
    {
      "description": [
        "From Middle English ambre, aumbre, from Old French aumbre, ambre, from Arabic عَنْبَر‎ (ʕanbar, “ambergris”), from Middle Persian 𐭠𐭭𐭡𐭫‎ (ʾnbl /ambar/, “ambergris”). Compare English lamber, ambergris. Displaced Middle English smulting (from Old English smelting (“amber”)), Old English eolhsand (“amber”), Old English glær (“amber”), and Old English sāp (“amber, resin, pomade”)."
      ],
      "adjectives": [
        {
          "description": "amber (comparative more amber, superlative most amber)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a brownish yellow colour, like that of most amber.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "amber (countable and uncountable, plural ambers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Ambergris, the waxy product of the sperm whale. [14th–18th c.]",
                  "examples": [
                    "Ambre is hote and drye  […]  Some say that it is the sparme of a whale."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hard, generally yellow to brown translucent fossil resin, used for jewellery. One variety, blue amber, appears blue rather than yellow under direct sunlight. [from 15th c.]",
                  "examples": [
                    "To shew this by example, we reade of Sabina Poppcea, to whom nothing was wanting, but shame and honestie, being extremely beloved of Nero, had the colour of her haire yellow, like Amber, which Nero esteemed much of,  […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A yellow-orange colour.",
                  "examples": [
                    "amber:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) The intermediate light in a set of three traffic lights, which when illuminated indicates that drivers should stop short of the intersection when safe to do so.",
                  "examples": [
                    "While earlier controllers provided concurrent ambers, present practice is to indicate a minimum intergreen period of 4 s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology, genetics, biochemistry) The stop codon (nucleotide triplet) \"UAG\", or a mutant which has this stop codon at a premature place in its DNA sequence.",
                  "examples": [
                    "an amber codon, an amber mutation, an amber suppressor"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Hesitance to proceed, or limited approval to proceed; an amber light.",
                  "examples": [
                    "[…]  in response to the actions I just described, business was given the green light, and now we seem to be on amber."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "amber (third-person singular simple present ambers, present participle ambering, simple past and past participle ambered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To perfume or flavour with ambergris.",
                  "examples": [
                    "ambered wine, an ambered room"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To preserve in amber.",
                  "examples": [
                    "an ambered fly"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare, chiefly poetic or literary) To cause to take on the yellow colour of amber.",
                  "examples": [
                    "For purple mountains majesty; for amber waves of grain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, rare, chiefly poetic or literary) To take on the yellow colour of amber.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}