{
  "word": "admit",
  "etymologies": [
    {
      "description": [
        "From Middle English admitten, amitten, borrowed from Old French admettre, amettre (“to admit”), from Latin admittō (“to allow entrance, inlet”, literally “to send to”), from ad- + mittere (“to send”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "admit (third-person singular simple present admits, present participle admitting, simple past and past participle admitted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to enter; to grant entrance (to), whether into a place, into the mind, or into consideration",
                  "examples": [
                    "A ticket admits one into a playhouse.",
                    "They were admitted into his house.",
                    "to admit a serious thought into the mind",
                    "to admit evidence in the trial of a cause"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow (someone) to enter a profession or to enjoy a privilege; to recognize as qualified for a franchise.",
                  "examples": [
                    "to admit an attorney to practice law",
                    "the prisoner was admitted to bail"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive or intransitive) To concede as true; to acknowledge or assent to, as an allegation which it is impossible to deny (+ to).",
                  "examples": [
                    "the argument or fact is admitted",
                    "he admitted his guilt",
                    "she admitted taking drugs / she admitted to taking drugs"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be capable of; to permit. In this sense, \"of\" may be used after the verb, or may be omitted.",
                  "examples": [
                    "the words do not admit such a construction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give warrant or allowance, to grant opportunity or permission (+ of).",
                  "examples": [
                    "circumstances do not admit of this",
                    "the text does not admit of this interpretation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow to enter a hospital or similar facility for treatment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}