{
  "word": "scarlet",
  "etymologies": [
    {
      "description": [
        "From Middle English scarlet, scarlat, borrowed from Old French escarlate (“a type of cloth”), from Medieval Latin scarlatum (“scarlet cloth”), of uncertain origin. This was long thought to derive from Persian سقرلات‎ (saqerlât, “a warm woollen cloth”), but the Persian word (first attested in the 1290s) is now thought to be from Arabic سِقِلَّات‎ (siqillāt), denoting very expensive, luxury silks dyed scarlet-red using the exceptionally expensive dye, first attested around the ninth century. The most obvious route for the Arabic word siqillāt to have entered the Romance languages would be via the Arabic-speaking Iberian region of al-Andalus, particularly Almería, where kermes was produced extensively; compare especially the dialectal form سِقِرْلَاط‎ (siqirlāṭ). The word then came to be used of woollen cloth dyed with the same dye. The Arabic word may itself be derived from Byzantine Greek σιγιλλᾶτον (sigillâton), from Latin sigillātum (“a type of fabric”, literally “sealed; sealing”) ."
      ],
      "adjectives": [
        {
          "description": "scarlet (comparative more scarlet, superlative most scarlet)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a bright red colour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sinful or whorish.",
                  "examples": [
                    "a scarlet woman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Ireland) Blushing; embarrassed or mortified.",
                  "examples": [
                    "He signed off our correspondence, “Well thank God for facemasks, cos I’m scarlet”."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "scarlet (countable and uncountable, plural scarlets)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brilliant red colour tinged with orange.",
                  "examples": [
                    "scarlet:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Cloth of a scarlet color.",
                  "examples": [
                    "All her household are clothed with scarlet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scarlet (third-person singular simple present scarlets, present participle scarleting, simple past and past participle scarleted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dye or tinge (something) with scarlet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}