{
  "word": "tobacco",
  "etymologies": [
    {
      "description": [
        "Attested since 1588, borrowed from Spanish tabaco. The Spanish word could be from Arabic طُبَّاق‎ (ṭubbāq, “Dittrichia viscosa”) or from a Caribbean language such as Galibi Carib or Taíno or multiple of them, from a word meaning \"roll of tobacco leaves\" or \"a pipe for smoking tobacco,\" such as tabago (“tube for inhaling smoke or powdered intoxicating plants”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tobacco (countable and uncountable, plural tobaccos or tobaccoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Any plant of the genus Nicotiana.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Leaves of Nicotiana tabacum and some other species cultivated and harvested to make cigarettes, cigars, snuff, for smoking in pipes or for chewing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A variety of tobacco.",
                  "examples": [
                    "Tobaccos from the Connecticut Valley were used for wrapping cigars."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tobacco (third-person singular simple present tobaccos, present participle tobaccoing, simple past and past participle tobaccoed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To indulge in tobacco; to smoke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat with tobacco.",
                  "examples": [
                    "The most satisfactory method of tobaccoing houses is that of stitching the leaves on to a piece of cloth like a strip of matting, which is then laid on the floor. Powdered tobacco should be introduced into rat holes, which can then be firmly closed up with bricks and mortar. Experiments carried out in the City of Hyderabad seem to have been very satisfactory."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}