{
  "word": "fizzle",
  "etymologies": [
    {
      "description": [
        "Attested in English since 1525-35. From earlier fysel (“to fart”). Related to fīsa (“to fart”). Compare with Swedish fisa (“to fart (silently)”). See also feist.",
        "It could also come from old Norse: \"fise\" simply means \"blow,\" like in \"blow in the wind.\"  A weather-exposed community in Rogaland, Norway, is called Fister. (In modern language, the verb \"fisle\" has the same 3 meanings as in English, see below.)"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fizzle (plural fizzles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A spluttering or hissing sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Failure of an exploding nuclear bomb to meet its expected yield during testing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abortive effort; a flop or dud.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state of agitation or worry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fizzle (third-person singular simple present fizzles, present participle fizzling, simple past and past participle fizzled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sputter or hiss.",
                  "examples": [
                    "The soda fizzled for several minutes after it was poured."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively, informal) To decay or die off to nothing; to burn out; to end less successfully than previously hoped.",
                  "examples": [
                    "The entire project fizzled after the founder quit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, of a nuclear weapon) To fail to generate the expected yield when exploded during testing.",
                  "examples": [
                    "The shot fizzled, generating only 200 tons rather than the 30 kilotons they were aiming for."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}