{
  "word": "service",
  "etymologies": [
    {
      "description": [
        "From Middle English servise, from Old French servise (French service), from the verb servir, from Latin servitium (compare Portuguese serviço, Italian servizio, Norman sèrvice, Spanish servicio), from servus (“servant; serf; slave”), ultimately from Proto-Indo-European *ser-wo-s (“guardian”), possibly from *ser- (“watch over, protect”). Displaced native Old English þeġnung."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "service (countable and uncountable, plural services)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of being of assistance to someone.",
                  "examples": [
                    "I say I did him a service by ending our relationship – now he can freely pursue his career."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(economics) The practice of providing such a service as economic activity.",
                  "examples": [
                    "Hair care is a service industry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A department in a company, an organization, a government department, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A function that is provided by one program or machine for another.",
                  "examples": [
                    "This machine provides the name service for the LAN."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being subordinate to or employed by an individual or group",
                  "examples": [
                    "Lancelot was at the service of King Arthur."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The military.",
                  "examples": [
                    "I did three years in the service before coming here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of dishes or utensils.",
                  "examples": [
                    "She brought out the silver tea service."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The act of initially starting, or serving, the ball in play in tennis, volleyball, and other games.",
                  "examples": [
                    "The player had four service faults in the set."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A religious rite or ritual.",
                  "examples": [
                    "The funeral service was touching."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The serving, or delivery, of a summons or writ.",
                  "examples": [
                    "He Suſpends on theſe Reaſons, that Thomas Rue had granted a general Diſcharge to Adam Muſhet, who was his Conjunct, and correus debendi, after the alleadged Service, which Diſcharged Muſhet, and conſequently Houstoun his Partner."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Israel, West Bank, also in Jordan, Lebanon and Syria) A taxi shared among unrelated passengers, each of whom pays part of the fare; often, it has a fixed route between cities.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical composition for use in churches.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Profession of respect; acknowledgment of duty owed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The materials used for serving a rope, etc., such as spun yarn and small lines.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Access to resources such as hotel rooms and web-based videos without transfer of the resources' ownership.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "service (third-person singular simple present services, present participle servicing, simple past and past participle serviced)",
          "definitionGroups": [
            {
              "group": "(transitive) To serve.",
              "entries": [
                {
                  "meaning": "(transitive) To perform maintenance.",
                  "examples": [
                    "He is going to service the car."
                  ]
                },
                {
                  "meaning": "(public relations, transitive) To supply (media outlets) with press releases etc.",
                  "examples": [
                    "One obvious way is press releases, which should be sent to your region's reporters, editors and columnists, the wire services, professional publications.  […]  Servicing the media should be an everyday thing."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, agriculture, euphemistic) To inseminate through sexual intercourse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, vulgar) To perform a sexual act upon.",
                  "examples": [
                    "He serviced her several times a week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, military, euphemistic) To attack.",
                  "examples": [
                    "to service a target; target servicing"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Properly, the tree that bears sorb fruit, from Middle English serves, plural of serve (“sorb apple, serviceberry”), from Old English syrfe, from Vulgar Latin *sorbea, from Latin sorbus (“service tree”). See sorb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "service (plural services)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Service tree.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sorb; the fruit of this tree.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}