{
  "word": "fellow",
  "etymologies": [
    {
      "description": [
        "From Middle English felowe, Early Middle English felage (“companion, good friend”) from Old English fēolaga, from Old Norse félagi, derived from félag (“joint venture; partnership”, literally “a laying together of property”), from fé (“livestock, property; money”) (ultimately from Proto-Indo-European *peḱ- (“livestock; wealth”)) + lag (“something laid down; right position; arrangement; companionship, fellowship; partnership”) (ultimately from Proto-Indo-European *legʰ- (“to lie down”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fellow (plural fellows)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural, also figuratively) A companion; a comrade.",
                  "examples": [
                    "Synonyms: see Thesaurus:associate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) An animal which is a member of a breed or species, or a flock, herd, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly in the plural) An object which is associated with another object; especially, as part of a set.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(also attributively) A person or thing comparable in characteristics with another person or thing; especially, as belonging to the same class or group.",
              "entries": [
                {
                  "meaning": "(chiefly in the negative) A person with abilities, achievements, skills, etc., equal to those of another person; a thing with characteristics, worth, etc., equal to those of another thing.",
                  "examples": [
                    "to be without fellow    to have no fellows"
                  ]
                },
                {
                  "meaning": "(chiefly in the plural) One in the same condition, or situation of need, as another.",
                  "examples": []
                },
                {
                  "meaning": "(archaic, chiefly in the plural)",
                  "examples": []
                },
                {
                  "meaning": "An equal in character, power, rank, etc.; a peer.",
                  "examples": []
                },
                {
                  "meaning": "A person living at the same time, or about the same age as another, especially when in the same field of study or work.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Often in the form Fellow: academic senses.",
              "entries": [
                {
                  "meaning": "Originally, one of a group of academics who make up a college or similar educational institution; now, a senior member of a college or similar educational institution involved in teaching, research, and management of the institution.",
                  "examples": []
                },
                {
                  "meaning": "An honorary title bestowed by a college or university upon a distinguished person (often an alumna or alumnus).",
                  "examples": []
                },
                {
                  "meaning": "A (senior) member of a learned or professional society.",
                  "examples": [
                    "a Fellow of the Royal Society"
                  ]
                },
                {
                  "meaning": "(specifically, Britain, historical) A senior member of an Inn of Court.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Britain) A scholar appointed to a fellowship, that is, a paid academic position held for a certain period which usually requires the scholar to conduct research.",
                  "examples": []
                },
                {
                  "meaning": "(Canada, US) A physician undergoing a fellowship (supervised subspecialty medical training) after having completed a residency (specialty training program).",
                  "examples": []
                },
                {
                  "meaning": "(US) A member of a college or university who manages its business interests.",
                  "examples": []
                },
                {
                  "meaning": "(US) A senior researcher or technician in a corporation, especially one engaged in research and development.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A male person; a bloke, a chap, a guy, a man; also, preceded by a modifying word, sometimes with a sense of mild reproach: used as a familiar term of address to a man.",
                  "examples": [
                    "Synonyms: see Thesaurus:man",
                    "my dear fellow    old fellow"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) Usually qualified by an adjective or used in the plural: an individual or person regardless of gender.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, often humorous or ironic) An animal or object.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(archaic)",
              "entries": [
                {
                  "meaning": "One of a pair of things suited to each other or used together; a counterpart, a mate.",
                  "examples": []
                },
                {
                  "meaning": "Originally (obsolete), a person's partner (of either sex) in life or marriage; a spouse; also, the mate of an animal; now (dated), a person's male lover or partner; a boyfriend; a husband.",
                  "examples": []
                },
                {
                  "meaning": "(Australian Aboriginal) Alternative form of fella (“used as a general intensifier”)",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "A colleague or partner.",
                  "examples": []
                },
                {
                  "meaning": "(specifically, also figuratively) An associate in the commission of a crime or other wrongful act; an accomplice.",
                  "examples": []
                },
                {
                  "meaning": "A close companion or friend; also, a companion or friend whom one eats or drinks with.",
                  "examples": []
                },
                {
                  "meaning": "Followed by of: one who participates in an activity; a participant.",
                  "examples": []
                },
                {
                  "meaning": "A man without good breeding or of lower social status; a common or ignoble man; also, used as a polite term of address to such a person.",
                  "examples": []
                },
                {
                  "meaning": "A person's servant or slave.",
                  "examples": []
                },
                {
                  "meaning": "(derogatory) A worthless person; a churl, a knave; also, used as a term of address to a person regarded as such.",
                  "examples": []
                },
                {
                  "meaning": "(UK, slang) Synonym of schoolmate (“a student at the same school”)",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Southern US, derogatory) A black man.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English felauen, felow (“to join (someone) in companionship, friendship, partnership, etc.”) [and other forms], from felowe, felau, felawe (noun): see etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "fellow (third-person singular simple present fellows, present participle fellowing, simple past and past participle fellowed)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(archaic) To address (someone) as \"fellow\", especially in an insulting manner (see noun sense 10.6).",
                  "examples": []
                },
                {
                  "meaning": "(chiefly passive, poetic, archaic) To equal (someone or something); also, to cause or find someone or something to be equal to (some other person or thing).",
                  "examples": []
                },
                {
                  "meaning": "(obsolete)",
                  "examples": []
                },
                {
                  "meaning": "To pair or suit (someone or something) with some other person or thing; also, to pair or suit someone or something with (some other person or thing); to arrange (things) in pairs.",
                  "examples": []
                },
                {
                  "meaning": "(also reflexive) Followed by to or with: to associate or join (oneself, someone, or something) with some other person or thing in companionship or a partnership.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly passive, sometimes reflexive) Followed by to or with: to cause or portray (someone or something) to be equal to some other person or thing.",
                  "examples": []
                },
                {
                  "meaning": "(poetic) To associate or go together with (someone or something); to become a partner of (someone or something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, poetic, obsolete) Followed by with: to associate or join with a person or thing in companionship or a partnership.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}