{
  "word": "income",
  "etymologies": [
    {
      "description": [
        "From Middle English income, perhaps continuing (in altered form) Old English incyme (“an in-coming, entrance”), equivalent to in- +‎ come. Cognate with Dutch inkomen (“income, earnings, gainings”), German Einkommen (“income, earnings, competence”), Icelandic innkváma (“income”), Danish indkomst (“income”), Swedish inkomst (“income”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "income (countable and uncountable, plural incomes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Money one earns by working or by capitalising on the work of others.",
                  "examples": [
                    "In 1970 the richest 1 percent made 9 percent of the nation’s income; now that top slice makes closer to 25 percent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, commerce) Money coming in to a fund, account, or policy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A coming in; arrival; entrance; introduction.",
                  "examples": [
                    "more abundant incomes of light and strength from God"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic or dialectal, Scotland) A newcomer or arrival; an incomer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An entrance-fee.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A coming in as by influx or inspiration, hence, an inspired quality or characteristic, as courage or zeal; an inflowing principle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Scotland) A disease or ailment without known or apparent cause, as distinguished from one induced by accident or contagion; an oncome.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is taken into the body as food; the ingesta; sometimes restricted to the nutritive, or digestible, portion of the food.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}