{
  "word": "idiom",
  "etymologies": [
    {
      "description": [
        "From Middle French idiome, and its source, Late Latin idioma, from Ancient Greek ἰδίωμα (idíōma, “a peculiarity, property, a peculiar phraseology, idiom”), from ἰδιοῦσθαι (idioûsthai, “to make one's own, appropriate to oneself”), from ἴδιος (ídios, “one's own, pertaining to oneself, private, personal, peculiar, separate”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "idiom (plural idioms or idiomata) (sometimes used uncountably)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": "A manner of speaking, a mode of expression peculiar to a language, language family, or group of people.",
              "entries": [
                {
                  "meaning": "(programming) A programming construct or phraseology that is characteristic of the language.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A language or language variety; specifically, a restricted dialect used in a given historical period, context etc.",
                  "examples": [
                    "In the idiom of the day, they were sutlers, although today they'd probably be called vendors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An established phrasal expression whose meaning may not be deducible from the literal meanings of its component words.",
                  "examples": [
                    "She often spoke in idioms, pining for salad days and complaining about pots calling the kettle black."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An artistic style (for example, in art, architecture, or music); an instance of such a style.",
                  "examples": [
                    "the idiom of the expressionists"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}