{
  "word": "receiver",
  "etymologies": [
    {
      "description": [
        "From Anglo-Norman receverre, receivour et al., later also reformed as receive +‎ -er. Compare recevor, rescaivour."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "receiver (plural receivers)",
          "definitionGroups": [
            {
              "group": "A person.",
              "entries": [
                {
                  "meaning": "(now historical) An official whose job is to receive taxes or other monies; a tax collector, a treasurer. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "A person who receives something in a general sense; a recipient. [from 14th c.]",
                  "examples": [
                    "I, the writer of this paper, have been, for some time, a chosen receiver of Begging Letters."
                  ]
                },
                {
                  "meaning": "A person who accepts stolen goods. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "A person or company appointed to settle the affairs of an insolvent entity. [from 18th c.]",
                  "examples": [
                    "Synonyms: insolvency administrator, insolvency practitioner, liquidator, administrator, court administrator, trustee in bankruptcy"
                  ]
                },
                {
                  "meaning": "(American football) An offensive player who catches the ball after it has been passed. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(racquet sports) A person who attempts to return the serve. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "An item or apparatus.",
              "entries": [
                {
                  "meaning": "Something which receives some substance or object, in a general sense; a receptacle. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "(chemistry) A vessel for receiving and holding the products of distillation, or for containing gases. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now chiefly historical) An airtight vessel from which air is pumped in order to form a vacuum. [from 17th c.]",
                  "examples": [
                    "A man can live in thick air, but perishes in an exhausted receiver."
                  ]
                },
                {
                  "meaning": "(firearms) The part of a firearm containing the action. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(now historical) A vessel for receiving the exhaust steam from the high-pressure cylinder before it enters the low-pressure cylinder, in a compound steam engine. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "Any of several electronic devices that receive electromagnetic waves, or signals transmitted as such. [from 19th c.]",
                  "examples": [
                    "Antonym: transmitter"
                  ]
                },
                {
                  "meaning": "The part of a telephone handset contained in the earpiece; (hence) the handset itself; an earpiece. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(finance) A swaption which gives its holder the option to enter into a swap in which they pay the floating leg and receive the fixed leg.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}