{
  "word": "whitewash",
  "etymologies": [
    {
      "description": [
        "white +‎ wash"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "whitewash (countable and uncountable, plural whitewashes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lime and water mixture for painting walls and fences bright white.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) A complete victory or series of victories without suffering any losses; a clean sweep.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) A campaign to paper over unfavorable elements.",
                  "examples": [
                    "Antonym: blackwash"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cooking) The most basic type of thickening agent, flour blended with water to make a paste.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Any liquid composition for whitening something, such as a wash for making the skin fair.",
                  "examples": [
                    "I have heard a whole Sermon against a White-wash."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A glass of sherry as a finale, after drinking port and claret.",
                  "examples": [
                    "The bottles, however, were port bottles, but contained mushroom ketchup; and we can only say with regard to the 15s. sherry, that it would have made an admirable \"whitewash,\" as Sheridan's glass is still sometimes called,  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "whitewash (third-person singular simple present whitewashes, present participle whitewashing, simple past and past participle whitewashed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To paint over with a lime and water mixture so as to brighten up a wall or fence.",
                  "examples": [
                    "The houses looked very bright when they whitewashed the whole neighborhood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) To cover over errors or bad actions.",
                  "examples": [
                    "Antonym: blackwash",
                    "In his sermon, the minister didn't try to whitewash over the sins of his church."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, transitive) To repay the financial debts of (another person).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball, slang, dated, late, 19th century, archaic) To prevent a team from scoring any runs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, UK, slang) In various games, to defeat (an opponent) so that they fail to score, or to reach a certain point in the game; to skunk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) To make over (a person or character, a group, an event, etc) so that it is or seems more white, for example by applying makeup to a person, or by discounting the participation of people of color in an event and focusing on only white participation.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}