{
  "word": "mameluke",
  "etymologies": [
    {
      "description": [
        "From French mamelouk, ultimately from Arabic مَمْلُوك‎ (mamlūk, “slave”) (literally \"possessed\"), passive participle of مَلَكَ‎ (malaka, “to possess, to acquire”). Doublet of mameluco."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mameluke (plural mamelukes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A member of various military regimes in the Middle East created and run by freed slave soldiers, mainly from the Eurasian steppe or the Caucasus; in particular, those who formed a ruling caste in Egypt from 1250 until 1812 and in Syria until 1516.",
                  "examples": [
                    "Conceivably both fort and causeway had been built by an Egyptian Mameluke for the passage of his pilgrim-caravan from Yenbo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A slave (especially European and white) in a Middle Eastern Muslim country.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, Italian-American) A fool.",
                  "examples": [
                    "2010 June 3,  James Ellroy,  American Tabloid‎[1]:Kabikov: “Hey, I’m setting a mood.” Mad Sal: “I’ll mood you, you mameluke.",
                    "2014 January 28,  Anthony Bruno,  Bad Guys‎[2]:My goddamn son-in-law, my right-hand man, acting like a fucking mameluke in front of all those people.” “Maybe he acted that way on purpose,” Tozzi said, “To make you think he was a mameluke.” “He was a mameluke!”",
                    "2021 January 14,  Harry Brooks,  Nothing Beats Luck‎[3]:“I’m saying there are some asshole cops who take their ‘collar’ out to the desert and bury him. […] There is nothing I would enjoy more than to put that mameluke Mikey Esposito in the ground . . . but that’s not going to happen.”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}