{
  "word": "spud",
  "etymologies": [
    {
      "description": [
        "From Middle English spudde (“small knife”). Origin unknown; probably related to Danish spyd, Old Norse spjót (“spear”), German Spieß (“spear; spike; skewer”). Compare English spit (“sharp, pointed rod”). The use of the term for a potato was originally in New Zealand and Australian dialect and slang usage."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spud (plural spuds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A potato. [from 1845]",
                  "examples": [
                    "We were peeling spuds on afternoon detail back of the lodge at summer camp — Billy Dean and I, and two or three more — and as usual arguing about whether the camp work ought to be done that way or not […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A hole in a sock.",
                  "examples": [
                    "He leans over to one side to get the light, as he darns a hole in the heel of a sock. He is getting pretty smart at it now, and no longer makes spuds in the sock to chafe his heels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plumbing) A type of short nut (fastener) threaded on both ends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Anything short and thick.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, US, dialect) A piece of dough boiled in fat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, usually in the plural) A testicle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dagger. [from mid-15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A digging fork with three broad prongs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool, similar to a spade, used for digging out weeds etc. [from 1660s]",
                  "examples": [
                    "My love to Sheelah is more firmly fixt, / Than strongest weeds that grow these stones betwixt: / My spud these nettles from the stone can part; / No knife so keen to weed thee from my heart."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A barking spud; a long-handled tool for removing bark from logs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(film, television) A short central rod in a lighting fixture, for attachment to the light.",
                  "examples": [
                    "This spigot (spud) is used to support the lamp, and allows it to be turned from side to side. The spud fits into a socket in a bracket (receptable[sic]) or a C-clamp. This fixture enables you to suspend the lighting fixture from an overhead bar  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spud (third-person singular simple present spuds, present participle spudding, simple past and past participle spudded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To dig up weeds with a spud.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(drilling) To begin drilling an oil well; to drill by moving the drill bit and shaft up and down, or by raising and dropping a bit.",
                  "examples": [
                    "A rope called the jerk line is attached to the wrist pin of the band-wheel crank, brought inside the derrick, and attached to the part of the drilling cable which extends from the crown pulley to the bull-wheel shaft by a curved metal slide called a spudding shoe. (See fig. 8.)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) To remove the roofing aggregate and most of the bituminous top coating by scraping and chipping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(camping) To set up a recreational vehicle (RV) at a campsite, typically by leveling the RV and connecting it to electric, water, and/or sewer hookups.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}