{
  "word": "offer",
  "etymologies": [
    {
      "description": [
        "From Middle English offer, from Old English offrian (“offer or make a sacrifice”) rather than from Old French offre (“offer”), from offrir (“to offer”), from Latin offerō (“to present, bring before”). Compare North Frisian offer (“sacrifice, donation, fee”), Dutch offer (“offering, sacrifice”), German Opfer (“victim, sacrifice”), Danish offer (“victim, sacrifice”), Icelandic offr (“offering”). See verb below."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "offer (plural offers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A proposal that has been made.",
                  "examples": [
                    "What's in his offer?",
                    "I decline your offer to contract."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something put forth, bid, proffered or tendered.",
                  "examples": [
                    "His offer was $3.50 per share."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) An invitation to enter into a binding contract communicated to another party which contains terms sufficiently definite to create an enforceable contract if the other party accepts the invitation.",
                  "examples": [
                    "His first letter was not a real offer, but an attempt to determine interest."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English offren, offrien. In the religious senses inherited from Old English offrian (“to offer, sacrifice, bring an oblation”); otherwise from Old French ofrir. Both ultimately from Latin offerō (“to present, bestow, bring before”, literally “to bring to”), from Latin ob + ferō (“bring, carry”), from Proto-Indo-European *bʰer- (“to carry, bear”), later reinforced by Old French offrir (“to offer”). Cognate with Old Frisian offria (“to offer”), Old Dutch offrōn (“to offer”), German opfern (“to offer”), Old Norse offra (“to offer”). More at ob-, bear."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "offer (third-person singular simple present offers, present participle offering, simple past and past participle offered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To propose or express one's willingness (to do something).",
                  "examples": [
                    "She offered to help with her homework."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To present in words; to proffer; to make a proposal of; to suggest.",
                  "examples": [
                    "Everybody offered an opinion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place at someone’s disposal; to present (something) to be either accepted or turned down.",
                  "examples": [
                    "He offered use of his car for the week.  He offered his good will for the Councilman's vote."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To present (something) to God or gods as a gesture of worship, or for a sacrifice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, engineering) To place (something) in a position where it can be added to an existing mechanical assembly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bid, as a price, reward, or wages.",
                  "examples": [
                    "I offered twenty dollars for it. The company is offering a salary of £30,000 a year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To happen, to present itself.",
                  "examples": [
                    "The occasion offers, and the youth complies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To make an attempt; typically used with at.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To put in opposition to; to manifest in an offensive or defensive way; to threaten.",
                  "examples": [
                    "to offer violence to somebody",
                    "The peasants offered no resistance as they were rounded up."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "off +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "offer (plural offers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used in combinations from phrasal verbs) agent noun of off",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}