{
  "word": "sycophant",
  "etymologies": [
    {
      "description": [
        "First attested in 1537. From Latin sȳcophanta (“informer, trickster”), from Ancient Greek συκοφάντης (sukophántēs), itself from σῦκον (sûkon, “fig”) + φαίνω (phaínō, “I show, demonstrate”). The gesture of \"showing the fig\" was a vulgar one, which was made by sticking the thumb between two fingers, a display which vaguely resembles a fig, which is itself symbolic of a σῦκον (sûkon), which also meant vulva. The story behind this etymology is that politicians in ancient Greece steered clear of displaying that vulgar gesture, but secretly urged their followers to taunt their opponents by using it."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sycophant (plural sycophants)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who uses obsequious compliments to gain self-serving favour or advantage from another; a servile flatterer.",
                  "examples": [
                    "Synonyms: ass-kisser, brown noser, suck up, yes man; see also Thesaurus:sycophant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who seeks to gain through the powerful and influential.",
                  "examples": [
                    "Synonyms: parasite, flunky, lackey; see also Thesaurus:sycophant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) An informer; a talebearer.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sycophant (third-person singular simple present sycophants, present participle sycophanting, simple past and past participle sycophanted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To inform against; hence, to calumniate.",
                  "examples": [
                    "As therefore he began in the title, so in the next leaf he makes it his first business to tamper with his reader by sycophanting and misnaming the work of his adversary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To play the sycophant toward; to flatter obsequiously.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}