{
  "word": "reconciliation",
  "etymologies": [
    {
      "description": [
        "From Middle English reconciliacioun (“act of reconciling; state of accord or harmony;”) [and other forms], from Anglo-Norman reconciliaciun, reconsiliacion, reconsiliaciun, and Middle French reconciliation, reconsiliacion, reconsiliation (“act of reconciling; result of this act; act of bringing about agreement or harmony; reconsecration of a desecrated place”) (modern French réconciliation), and from their etymon Latin reconciliātiō (“reinstatement, renewal, restoration; reconciliation”) (compare Late Latin reconciliātiō (“reconciliation; reconsecration of a desecrated place”), from reconciliāre + -iō (suffix forming abstract nouns from verbs). Reconciliāre is the present active infinitive of reconciliō (“to bring together again, conciliate, reconcile, reunite; to bring back; to recover, re-establish, regain, restore, win back”), from re- (prefix meaning ‘again’) + conciliō (“bring together, unite; to gain; to win over; to recommend; to procure, purchase”) (ultimately from Proto-Indo-European *kelh₁- (“to call, cry, summon”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "reconciliation (countable and uncountable, plural reconciliations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The re-establishment of friendly relations; conciliation, rapprochement.",
                  "examples": [
                    "Synonyms: reconcilement, (noun) reconciling, (Britain, dialectal) saught",
                    "Antonyms: irreconciliation, unreconciliation",
                    "He longed for reconciliation with his estranged father, but painful memories made him feel unready to do so."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) The process of comparing and resolving apparent differences between sets of accounting records, or between accounting records and bank statements, receipts, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Religious senses.",
              "entries": [
                {
                  "meaning": "(Christianity) The end of estrangement between a human and God as a result of atonement.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity) The reconsecration of a desecrated church or other holy site.",
                  "examples": []
                },
                {
                  "meaning": "(Christianity, chiefly Roman Catholicism) Admission of a person to membership of the church, or readmission after the person has previously left the church.",
                  "examples": []
                },
                {
                  "meaning": "(Roman Catholicism) Short for sacrament of reconciliation (“a sacrament (sacred ritual) also called confession, involving contrition by a person, confessing sins to a priest, penance performed by the person, and absolution granted by the priest”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, Canada) The process of systemically atoning for the crimes and broken promises that a nation has historically committed against indigenous people.",
                  "examples": [
                    "In order to redress the legacy of residential schools and advance the process of Canadian reconciliation, the Truth and Reconciliation Commission makes the following calls to action."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}