{
  "word": "infidel",
  "etymologies": [
    {
      "description": [
        "First attested 1460, from Middle French infidèle, from Latin īnfidēlis (“unfaithful”), from in- (“not”) + fidēlis (“faithful”). See fidelity."
      ],
      "adjectives": [
        {
          "description": "infidel (comparative more infidel, superlative most infidel)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rejecting a specific religion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of, characteristic of, or relating to unbelievers or unbelief.",
                  "examples": [
                    "But not only have the priests tried to make the very term Atheism odious, as if it would destroy all of good and beautiful in nature, but some of the reformers, not having the moral courage to avow their own sentiments, wishing to be popular, fearing lest their reforms would be considered Infidel, (as all reforms assuredly are), shield themselves from the stigma, by joining in the tirade against Atheism, and associate it with everything that is vile, with the crime of slavery, the corrup­tions of the Church, and all the vices imaginable."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "infidel (plural infidels)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now usually derogatory) One who does not believe in a certain religion.",
                  "examples": [
                    "The infidel writer is a greater enemy to society."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now usually derogatory) One who does not believe in a certain principle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now usually derogatory) One with no religious beliefs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}