{
  "word": "frist",
  "etymologies": [
    {
      "description": [
        "From Middle English *frist, frest, first, furst, from Old English fierst (“period, space of time, time, respite, truce”), from Proto-Germanic *fristiz, *frestą (“date, appointed time”), from Proto-Indo-European *pres-, *per- (“forward, forth, over, beyond”). Cognate with North Frisian ferst, frest (“period, time”), German Frist (“period, deadline, term”), Swedish frist (“deadline, respite, reprieve, time-limit”), Icelandic frestur (“period”). See also first."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "frist (countable and uncountable, plural frists)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A certain space or period of time; respite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Time allotted for repayment; a term (in which a debt is to be repaid); a delay; respite; suspension.",
                  "examples": [
                    "His was a short frist (He had a short life)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) Credit; trust.",
                  "examples": [
                    "I sald tham to fryst to a man of the Hag.\nI sold them to frist to a man of the Hague."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English *fristen, frysten, fresten, firsten, from Old English *fyrstan (“to defer, delay, put off”), from fyrst, fierst, first (“period, space of time, time, respite, truce”). See Etymology 1. Cognate with Low German versten, German fristen (“to eke out”), Danish friste (“to sustain, support, experience, tempt”), Icelandic fresta (“to delay”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "frist (third-person singular simple present frists, present participle fristing, simple past and past participle fristed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal) To grant respite; especially, to give a debtor credit or time for payment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, UK dialectal) To defer; postpone.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}