{
  "word": "luff",
  "etymologies": [
    {
      "description": [
        "From Old French lof. Collins English Dictionary states that this word is ultimately derived from Middle Dutch loef. Ellert Ekwall's Shakspere's Vocabulary: its etymological elements (1903) related this verb and loof instead to the East Frisian verb lofen, lufen, which would make it cognate to the French term lover."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "luff (plural luffs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The vertical edge of a sail that is closest to the direction of the wind.",
                  "examples": [
                    "By easing the halyard, the luff of the sail was made to sag to leeward."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The act of sailing a ship close to the wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The roundest part of a ship's bow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The forward or weather leech of a sail, especially of the jib, spanker, and other fore-and-aft sails.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "luff (third-person singular simple present luffs, present participle luffing, simple past and past participle luffed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a sail, intransitive) To shake due to being trimmed improperly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a boat, intransitive) To alter course to windward so that the sails luff. (Alternatively luff up)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) to let out (a sail) so that it luffs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mechanical) To alter the vertical angle of the jib of a crane so as to bring it level with the load.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}