{
  "word": "adaptation",
  "etymologies": [
    {
      "description": [
        "From French adaptation, from Medieval Latin adaptātiō, from Latin adaptō (“I fit, adjust, modify; I adapt, fit or adjust to”); see adapt. Equivalent to adapt +‎ -ation."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "adaptation (countable and uncountable, plural adaptations)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The process of adapting something or becoming adapted to a situation; adjustment, modification.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A change that is made or undergone to suit a condition or environment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, evolutionary theory) The process of change that an organism undergoes to be better suited to its environment.",
                  "examples": [
                    "Antonym: maladaptation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, evolutionary theory) An instance of an organism undergoing change, or the structure or behavior that is changed.",
                  "examples": [
                    "This is the very method adopted, in the structure of the eye, to produce a perfect picture on the retina; it is an adaptation to the laws of light, and the property of  color, in natural objects."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The process of adapting an artistic work from a different medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, authorship) An artistic work that has been adapted from a different medium.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sociology) The means by which social groups adapt to different social and physical environments.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}