{
  "word": "dispatch",
  "etymologies": [
    {
      "description": [
        "From Spanish despachar or Italian dispacciare, replacing alternate reflex depeach, which is from French dépêcher. The first known use in writing (in the past tense, spelled as dispached) is by Bishop Cuthbert Tunstall in 1517. This would be unusually early for a borrowing from a Romance language other than French, but Tunstall had studied in Italy and was Commissioner to Spain, so this word may have been borrowed through diplomatic circles. The alternative spelling despatch was introduced in Samuel Johnson's dictionary, probably by accident."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dispatch (countable and uncountable, plural dispatches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A message sent quickly, as a shipment, a prompt settlement of a business, or an important official message sent by a diplomat, government official, military officer, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of doing something quickly.",
                  "examples": [
                    "Synonyms: haste, hurry, rapidity",
                    "We must act with dispatch in this matter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A mission by an emergency response service, typically involving attending to an emergency in the field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The passing on of a message for further processing, especially through a dispatch table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A dismissal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dispatch (third-person singular simple present dispatches, present participle dispatching, simple past and past participle dispatched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (a shipment) with promptness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (a person) away hastily.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (an important official message) promptly, by means of a diplomat or military officer.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To send (a journalist) to a place in order to report.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To dispose of speedily, as business; to execute quickly; to make a speedy end of; to finish; to perform.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rid; to free.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To destroy (someone or something) quickly and efficiently.",
                  "examples": [
                    "Synonyms: destroy, kill"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing) To pass on for further processing, especially via a dispatch table (often with to).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To hurry.",
                  "examples": [
                    "“Proceed, friend Nicolas, and let us dispatch; for, it grows late.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To deprive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}