{
  "word": "receptacle",
  "etymologies": [
    {
      "description": [
        "From Middle English receptacle, from Anglo-Norman receptacle and Middle French receptacle (“organ containing a fluid; gathering place; water basin”) (modern French réceptacle), from Latin receptāculum (“animal enclosure, container, place of refuge, receptacle, repository, reservoir, shelter”), from receptāre (“to harbour, to receive, to shelter”) or receptō (“I receive back or again, I recover”), frequentative of recipiō (“I receive; I hold back, I reserve”) (from re- (“back, again”) + capiō (“I hold”)) + -culum (suffix forming nouns from verbs, particularly nouns representing tools and instruments); cognate with Italian recettaculo, ricettaculo, Portuguese receptáculo, Spanish receptáculo."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "receptacle (plural receptacles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A container.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(botany) The part of the flower stalk (peduncle or pedicel) to which the floral parts are attached; a thalamus, a torus.",
              "entries": [
                {
                  "meaning": "In the Asteraceae (aster or sunflower family), the end of the peduncle to which all of the florets of the flower head are attached.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phycology) A structure at the end of a branch of an alga containing conceptacles (reproductive organs).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) An organ that receives and holds a secretion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(electricity, US) A contact device installed at an outlet for the connection of an attachment plug (typically by receiving the plug's prongs) to supply portable appliances or equipment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}