{
  "word": "aspect",
  "etymologies": [
    {
      "description": [
        "From Middle English aspect, from Latin aspectus (“look, sight; appearance”), from aspiciō (“see; catch sight of; inspect”), from ad- (“to, towards, at”) + speciō (“look, look at, behold; observe”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "aspect (plural aspects)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any specific feature, part, or element of something.",
                  "examples": [
                    "Synonym: facet",
                    "Japan's aging population is an important aspect of its economy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The way something appears when viewed from a certain direction or perspective.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The way something appears when considered from a certain point of view.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A phase or a partial, but significant view or description of something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's appearance or expression. [from 16th c.]",
                  "examples": [
                    "Synonyms: appearance, look, blee"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Position or situation with regard to seeing; that position which enables one to look in a particular direction; position in relation to the points of the compass.",
                  "examples": [
                    "The house has a southern aspect, i.e. a position which faces the south."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Prospect; outlook.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) A grammatical quality of a verb which determines the relationship of the speaker to the internal temporal flow of the event which the verb describes, or whether the speaker views the event from outside as a whole, or from within as it is unfolding. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) The relative position of heavenly bodies as they appear to an observer on earth; the angular relationship between points in a horoscope. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion, mythology) The personified manifestation of a deity that represents one or more of its characteristics or functions.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The act of looking at something; gaze. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Appearance to the eye or the mind; look; view.",
                  "examples": [
                    "They are both in my judgment the image or picture of a great Ruine, and have the true aspect of a World lying in its rubbish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(programming) In aspect-oriented programming, a feature or component that can be applied to parts of a program independent of any inheritance hierarchy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport) The visual indication of a colour light (or mechanical) signal as displayed to the driver. With colour light signals this would be red, yellow or green.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "aspect (third-person singular simple present aspects, present participle aspecting, simple past and past participle aspected)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology, of a planet) To have a particular aspect or type of aspect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Wicca) To channel a divine being.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To look at.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}