{
  "word": "measles",
  "etymologies": [
    {
      "description": [
        "Either from Middle Dutch masels (“blood blisters, measels”) or Middle Low German maselen (“red blemishes, measels”), both from Old High German masala (“blood blister, phlegmon”). Doublet of measlings. Cognate with mazer & mase and Middle Low German masele & māsel. Influenced in pronunciation and some senses by mesel (“leprous, leper”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "measles pl (normally plural, singular measle)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) An acute and highly contagious disease which often afflicts children caused by the virus Measles morbillivirus and causing red rashes, fever, runny nose, coughing, and red eyes.",
                  "examples": [
                    "Les rugeroles: maseles."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, obsolete) Any disease causing red rashes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Used as an intensifier.",
                  "examples": [
                    "Why the meazills, should you stand heere, with your traine..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(veterinary medicine) Synonym of cysticercosis: A disease of livestock or meat caused by the presence of tapeworm larvae.",
                  "examples": [
                    "The Swyne dyed of the Measils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, obsolete) Any disease causing a tree's bark to become rough and irregular.",
                  "examples": [
                    "Their fruit-trees are subject to two diseases, the Meazels... and lowsiness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) plural of measle: a red spot forming part of a rash, (now) particularly those caused by M. morbillivirus.",
                  "examples": [
                    "Others take a fether, and dippe it in the saide water, and therwith they annoynte all the Measells of the Face when they are come forth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) plural of measle: any similar-looking red spot, particularly (printing) foxing.",
                  "examples": [
                    "Measles. When prints are imperfectly fixed, the appearance presented is very similar to that of the same disease in the human subject. Hence the name."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(veterinary medicine) plural of measle: the individual cysts of cysticercosis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, obsolete) plural of measle: the individual blisters in the surface of a diseased tree's bark.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, espionage jargon) A discreet assassination made to look like death from any natural cause.",
                  "examples": [
                    "[…]  they would prefer having him \"die of the measles,\" as wags at the CIA put it, than be punished by legal means. If there is no convenient way of administering the \"measles,\" they may even favor simply letting him go."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "measles",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "third-person singular simple present indicative form of measle",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English mesel (“leprous, leper”), from Norman mesel (“leprous, leper”), from Old French mesel (“leprous, leper”), from Late Latin misellus (“leper”), from miser (“wretched, wretch”) + -ellus (“-elle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "measles",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) plural of measle",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Alternative form of mesels: Leprosy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}