{
  "word": "brace",
  "etymologies": [
    {
      "description": [
        "From Middle English brace, from Old French brace (“arm”), from Latin bracchia, the nominative and accusative plural of bracchium (“arm”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "brace (plural braces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Armor for the arm; vambrace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A measurement of length, originally representing a person's outstretched arms.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A curved instrument or handle of iron or wood, for holding and turning bits, etc.; a bitstock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which holds anything tightly or supports it firmly; a bandage or a prop.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cord, ligament, or rod, for producing or maintaining tension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thong used to regulate the tension of a drum.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being braced or tight; tension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Harness; warlike preparation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(typography) A curved, pointed line, also known as \"curly bracket\": { or } connecting two or more words or lines, which are to be considered together, such as in {role, roll}; in music, used to connect staves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pair, a couple; originally used of dogs, and later of animals generally (e.g., a brace of conies) and then other things, but rarely human persons. (The plural in this sense is unchanged.) In British use (as plural), this is a particularly common reference to game birds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of material used to transmit, or change the direction of, weight or pressure; any one of the pieces, in a frame or truss, which divide the structure into triangular parts. It may act as a tie, or as a strut, and serves to prevent distortion of the structure, and transverse strains in its members. A boiler brace is a diagonal stay, connecting the head with the shell.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A rope reeved through a block at the end of a yard, by which the yard is moved horizontally; also, a rudder gudgeon.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, Cornwall, mining) The mouth of a shaft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, chiefly in the plural) Straps or bands to sustain trousers; suspenders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(plural in North America, singular or plural in the UK) A system of wires, brackets, and elastic bands used to correct crooked teeth or to reduce overbite.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer) Two goals scored by one player in a game.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "brace (third-person singular simple present braces, present participle bracing, simple past and past participle braced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To prepare for something bad, such as an impact or blow.",
                  "examples": [
                    "All hands, brace for impact!",
                    "Brace yourself!",
                    "The boy has no idea about everything that's been going on. You need to brace him for what's about to happen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place in a position for resisting pressure; to hold firmly.",
                  "examples": [
                    "He braced himself against the crowd."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To swing round the yards of a square rigged ship, using braces, to present a more efficient sail surface to the direction of the wind.",
                  "examples": [
                    "to brace the yards"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To stop someone for questioning, usually said of police.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To confront with questions, demands or requests.",
                  "examples": [
                    "Just about then the young kid who had braced us when we came in uttered a curse and made for the door."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To furnish with braces; to support; to prop.",
                  "examples": [
                    "to brace a beam in a building"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw tight; to tighten; to put in a state of tension; to strain; to strengthen.",
                  "examples": [
                    "to brace the nerves"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To bind or tie closely; to fasten tightly.",
                  "examples": [
                    "The women of China […] , by bracing and binding them [their feet] from their infancy, have very little feet."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}