{
  "word": "foot",
  "etymologies": [
    {
      "description": [
        "From Middle English fot, fote, foot, from Old English fōt, from Proto-West Germanic *fōt, from Proto-Germanic *fōts, from Proto-Indo-European *pṓds. Doublet of pes and pous."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "foot (plural feet or (UK colloquial, unit of measure) foot)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A biological structure found in many animals that is used for locomotion and that is frequently a separate organ at the terminal part of the leg.",
                  "examples": [
                    "A spider has eight feet."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) Specifically, a human foot, which is found below the ankle and is used for standing and walking.",
                  "examples": [
                    "Southern Italy is shaped like a foot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often used attributively) Travel by walking.",
                  "examples": [
                    "We went there by foot because we could not afford a taxi.",
                    "There is a lot of foot traffic on this street."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The base or bottom of anything.",
                  "examples": [
                    "I'll meet you at the foot of the stairs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of a flat surface on which the feet customarily rest.",
                  "examples": [
                    "We came and stood at the foot of the bed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The end of a rectangular table opposite the head.",
                  "examples": [
                    "The host should sit at the foot of the table."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A short foot-like projection on the bottom of an object to support it.",
                  "examples": [
                    "The feet of the stove hold it a safe distance above the floor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A unit of measure equal to twelve inches or one third of a yard, equal to exactly 30.48 centimetres.",
                  "examples": [
                    "The flag pole at the local high school is about 20 feet high."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A unit of measure for organ pipes equal to the wavelength of two octaves above middle C, approximately 328 mm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(collective, military) Foot soldiers; infantry.",
                  "examples": [
                    "King John went to battle with ten thousand foot and one thousand horse."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cigars) The end of a cigar which is lit, and usually cut before lighting.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sewing) The part of a sewing machine which presses downward on the fabric, and may also serve to move it forward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) The bottommost part of a typed or printed page.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) The base of a piece of type, forming the sides of the groove.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(prosody) The basic measure of rhythm in a poem.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(phonology) The parsing of syllables into prosodic constituents, which are used to determine the placement of stress in languages along with the notions of constituent heads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The bottom edge of a sail.",
                  "examples": [
                    "To make the mainsail fuller in shape, the outhaul is eased to reduce the tension on the foot of the sail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) The end of a billiard or pool table behind the foot point where the balls are racked.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) In a bryophyte, that portion of a sporophyte which remains embedded within and attached to the parent gametophyte plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(malacology) The muscular part of a bivalve mollusc or a gastropod by which it moves or holds its position on a surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(molecular biology) The globular lower domain of a protein.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) The point of intersection of one line with another that is perpendicular to it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Fundamental principle; basis; plan.",
                  "examples": [
                    "Answer directly upon the foot of dry reason."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Recognized condition; rank; footing.",
                  "examples": [
                    "As to his being on the foot of a servant."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "foot (third-person singular simple present foots, present participle footing, simple past and past participle footed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To use the foot to kick (usually a ball).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pay (a bill).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To tread to measure of music; to dance; to trip; to skip.",
                  "examples": [
                    "There's time enough, I hope, To foot a measure with the bonnie bride,"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To walk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To set foot on; to walk on.",
                  "examples": [
                    "People who would not have dared to foot the place before crept in and did not come to the house."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To set on foot; to establish; to land.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To renew the foot of (a stocking, etc.).",
                  "examples": [
                    "I'll sew nether stocks and mend them and foot them too"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To sum up, as the numbers in a column; sometimes with up.",
                  "examples": [
                    "to foot (or foot up) an account"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}