{
  "word": "sophisticate",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English sophisticaten (“to mix (something) with a foreign or inferior substance, adulterate”), from Medieval Latin sophisticātus, the past participle of sophisticāre (“to disguise; to tamper with; to trick using words”) + -ātus (suffix denoting the possession of features or things). Sophisticāre is derived from Latin sophisticus (“pertaining to the ancient Sophists, sophistic; pertaining to sophistry, sophistic, sophistical”) (from Ancient Greek σοϕιστικός (sophistikós), from σοϕιστής (sophistḗs, “master of a craft; prudent or wise person; philosopher; teacher, tutor; (derogatory) one who profits from false wisdom, cheat, swindler”), from σοφός (sophós, “able, skilful; clever, intelligent, prudent, wise; cunning”), further etymology unknown) + -āre (suffix forming present active infinitives of verbs).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "sophisticate (plural sophisticates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is sophisticated (“experienced in the ways of the world, that is, cosmopolitan or worldly-wise”), or who has sophisticated tastes. [from early 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "sophisticate (third-person singular simple present sophisticates, present participle sophisticating, simple past and past participle sophisticated)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To make (something) less innocent or natural; to artificialize.",
                  "examples": []
                },
                {
                  "meaning": "To make (something) more sophisticated (“complex, developed, or refined”); to develop, to refine. [from late 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "(also reflexive) To make (oneself or someone) more sophisticated (“experienced in the ways of the world, that is, cosmopolitan or worldly-wise”); to cosmopolitanize.",
                  "examples": []
                },
                {
                  "meaning": "(also figuratively) To alter and make impure (something) by mixing it with some foreign or inferior substance, especially with an intention to deceive; to adulterate; (generally) to corrupt or deceive (someone, their thinking, etc.). [from early 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "To change the meaning of (something) in a deceptive or misleading way.",
                  "examples": []
                },
                {
                  "meaning": "(archaic) To apply an artificial technique to (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To practise sophistry (“the (deliberate) making of arguments that seem plausible but are fallacious or misleading”). [from early 17th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English sophisticat, sophisticate (“adulterated; not genuine, counterfeit”), an adjective use of the past participle of sophisticaten (verb): see etymology 1."
      ],
      "adjectives": [
        {
          "description": "sophisticate (comparative more sophisticate, superlative most sophisticate)",
          "definitionGroups": [
            {
              "group": "Synonym of sophisticated (adjective)",
              "entries": [
                {
                  "meaning": "Of a person: experienced in the ways of the world; cosmopolitan, worldly-wise.",
                  "examples": []
                },
                {
                  "meaning": "Of art or other things: appealing to the tastes of an intellectual or sophisticated (sense 1.1) person; cerebral; also, cultured, elegant, refined.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Mixed with a foreign or inferior substance; not genuine or pure; adulterated, impure.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Of a thing: having its meaning changed in a deceptive or misleading way.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}