{
  "word": "virgin",
  "etymologies": [
    {
      "description": [
        "From Middle English virgine, from Old French virgine, from Latin virginem, accusative of virgō. Doublet of Virgo. Displaced native Old English fǣmne."
      ],
      "adjectives": [
        {
          "description": "virgin (comparative more virgin, superlative most virgin)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually not comparable) In a state of virginity; chaste, not having had sexual intercourse.",
                  "examples": [
                    "From their embraces was born the handsome Actaeon, a naive boy, who had  less excuse than other men, given that he was her son, for believing her to be a virgin. It's true that he was even more virgin than his mother."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a physical object, untouched.",
                  "examples": [
                    "Synonyms: brand new, pristine, unspoilt, untouched"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Not yet cultivated, explored, or exploited by humans or humans of certain civilizations.",
                  "examples": [
                    "virgin prairie",
                    "virgin ecosystem",
                    "virgin forest",
                    "virgin clay ― clay that has never been fired",
                    "The virgin lands of the Americas were awaiting the Europeans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inexperienced.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of olive oil, obtained by mechanical means, so that the oil is not altered.",
                  "examples": [
                    "Wondering how some oil is somehow more virgin than regular virgin olive oil can be a real head-scratcher."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually not comparable) Of mixed drinks, not containing alcohol.",
                  "examples": [
                    "a virgin daiquiri"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "virgin (plural virgins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who has never had sexual intercourse (but may have engaged in other sexual acts, such as masturbation).",
                  "examples": [
                    "Synonyms: (dated; used of a woman only) maiden, (slang, jocular) unicorn bait, (medical term; used of a woman only) virgo intacta, vestal"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who has never engaged in any sexual activity at all. [from mid-14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Catholicism, Orthodoxy or historical) Someone vowed to virginity (usually a woman and often a consecrated virgin), or someone who died in defense of their virginity; (especially) one venerated as a saint. [from early 13th c.]",
                  "examples": [
                    "In its list of saints, the Catholic Church classifies St. Agnes, St. Maria Goretti, and St. Thérèse of Lisieux as virgins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) One who has never used or experienced a specified thing.",
                  "examples": [
                    "I've never eaten tofu before—you could say I'm a tofu virgin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several species of gossamer-winged butterflies of the family Lycaenidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) A female insect producing eggs from which young are hatched, though there has been no fecundation by a male; a parthenogenetic insect.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}