{
  "word": "jounce",
  "etymologies": [
    {
      "description": [
        "Unknown, possibly a Portmanteau / Blend of jolt +‎ bounce."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "jounce (plural jounces)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A movement, such as a jolt or a shake.",
                  "examples": [
                    "Well, I remember we were bouncing around, the car was tilting back and forth, and it seems like it was bouncing after we made this big jounce and went up over the driveway, it was bouncing and tilting back and forth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) The fourth derivative of the position vector with respect to time; the time derivative of jerk.",
                  "examples": [
                    "Synonym: snap"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "jounce (third-person singular simple present jounces, present participle jouncing, simple past and past participle jounced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To jolt; to shake, especially by rough riding or by driving over obstructions.",
                  "examples": [
                    "Send these nice, white, clean shipping cases of honey to a commission man, without any instruction whatever, and he will have the genius and liberality to slap them upon a dray, jounce them to his store, rub them around and over an old, dirty floor, sell a part of it for less than you expected, fail to pay for it until he sells the other part, which he will do after six months or a year, then he will remit, provided the debt has not yet got so old that it is outlawed or he does not \"bust up\" in business in the mean time."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}