{
  "word": "battery",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French batterie, from Old French baterie (“action of beating”), from batre (“battre”), from Latin battuō (“beat”), from Gaulish. Doublet of batterie."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "battery (countable and uncountable, plural batteries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, electronics) A device used to power electric devices, consisting of a set of electrically connected electrochemical or, archaically, electrostatic cells. A single such cell when used by itself.",
                  "examples": [
                    "Upon this We made what we call’d an Electrical Battery, consisting of eleven Panes of large Sash Glass, arm’d with thin leaden Plates, pasted on each Side...",
                    "A Turky is to be killed for our Dinners by the Electrical Shock; and roasted by the electrical Jack, before a Fire kindled by the Electrified Bottle; when the Healths of all the Famous Electricians in England, France and Germany, are to be drank in Electrified Bumpers, under the Discharge of Guns from the Electrical Battery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) The infliction of unlawful physical violence on a person, legally distinguished from assault, which includes the threat of impending violence.",
                  "examples": [
                    "A battery is the actual infliction of unlawful personal violence. [...] [The defendant] fell to the ground and lashed out with his feet and in doing so kicked the hand of one of the police officers, fracturing a bone. He was charged with assault [...] although this was a battery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A coordinated group of artillery weapons.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, archaic) An elevated platform on which cannon could be placed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An array of similar things.",
                  "examples": [
                    "Schoolchildren take a battery of standard tests to measure their progress."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of small cages where hens are kept for the purpose of farming their eggs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The catcher and the pitcher together",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chess) Two or more major pieces on the same rank, file, or diagonal",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A marching percussion ensemble; a drumline.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of a firearm when it is possible to be fired.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Apparatus for preparing or serving meals.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}