{
  "word": "shanghai",
  "etymologies": [
    {
      "description": [
        "1871, from the important Chinese port Shanghai, as a verb with reference to the former practice by some shippers on the West Coast of the United States of press-ganging crews for fishing or shipping in the Pacific Ocean."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shanghai (plural shanghais)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often capitalized, dated) A breed of chicken with large bodies, long legs, and feathered shanks.",
                  "examples": [
                    "Cochins or Shanghaes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, obsolete) A kind of daub.",
                  "examples": [
                    "The ‘shanghai’ is the glaring daub required by some frame-makers for cheap auctions. They are turned out at so much by the day's labor, or at from $12 to $24 a dozen, by the piece."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, obsolete) A tall dandy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(darts, often capitalized) A kind of dart game in which players are gradually eliminated (\"shanghaied\"), usually either by failing to reach a certain score in 3 quick throws or during a competition to hit a certain prechosen number and then be the first to hit the prechosen numbers of the other players.",
                  "examples": [
                    "‘Shanghai’ may be played by teams of 8, in pairs, individually, or, in fact, any number."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shanghai (third-person singular simple present shanghais, present participle shanghaiing, simple past and past participle shanghaied)",
          "definitionGroups": [
            {
              "group": "(transitive) To force or trick someone to go somewhere or do something against their will or interest, particularly",
              "entries": [
                {
                  "meaning": "To press-gang sailors, especially (historical) for shipping or fishing work.",
                  "examples": []
                },
                {
                  "meaning": "(US law enforcement slang) To trick a suspect into entering a jurisdiction in which they can be lawfully arrested.",
                  "examples": []
                },
                {
                  "meaning": "(US military slang) To transfer a serviceman against their will.",
                  "examples": [
                    "“Why, if you so loved and cherished the armed guard,” Captain Banning continued, “did you arrange for transfer?”“I never, sir! ... But he shanghaied me out of the armed guard pronto.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To commandeer, hijack, or otherwise (usually wrongfully) appropriate a place or thing.",
                  "examples": [
                    "Let's see if we can shanghai a room for a couple of hours."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Scottish shangan, from Scottish Gaelic seangan, influenced by the Chinese city."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shanghai (plural shanghais)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) Synonym of slingshot.",
                  "examples": [
                    "Turn, turn thy shang~hay dread aside,Nor touch that little bird"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shanghai (third-person singular simple present shanghais, present participle shanghaiing, simple past and past participle shanghaied)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand) To hit with a slingshot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}