{
  "word": "locust",
  "etymologies": [
    {
      "description": [
        "From Middle English locuste, locust, from Anglo-Norman locuste, Middle French locuste, and their source, Latin locusta (“locust, crustacean, lobster”). Doublet of langouste. The sense in \"Mainlander\" is a calque of Cantonese 蝗蟲／蝗虫 (wong4 cung4), also meaning \"locust\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "locust (plural locusts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of the grasshoppers, often polyphenic and usually swarming, in the family Acrididae that are very destructive to crops and other vegetation, (especially) the migratory locust (Locusta migratoria). [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A fruit or pod of the carob tree. [from 16th c.]",
                  "examples": [
                    "Among other articles, they brought with them a great quantity of locusts, which are a kind of pulse, sweet and pleasant to the palate, and in shape resembling French beans, but longer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of various often leguminous trees and shrubs, especially of the genera Robinia and Gleditsia; the locust tree. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cicada. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hong Kong, derogatory, offensive) A Mainlander.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "locust (third-person singular simple present locusts, present participle locusting, simple past and past participle locusted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To come in a swarm.",
                  "examples": [
                    "This Philip and the black-faced swarms of Spain,The hardest, cruellest people in the world,Come locusting upon us, eat us up,Confiscate lands, goods, money  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}