{
  "word": "style",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English stile, stel, stele, stiel, stiele, stil, still, stille, styele, style, styill, styll, styyl (“writing tool, stylus; piece of written work; characteristic mode of expression, particularly one regarded as high quality; demeanour, manner, way of life; person's designation or title; stem of a plant; period of time”), from Old French style, estile, stil, stile (modern French style), or from Medieval Latin stylus, both from Latin stilus (“pointed instrument, pale, spike, stake; writing tool, stylus; act of setting down in writing, composition; characteristic mode of expression, style; stem of a plant”), from Proto-Indo-European *(s)teyg- (“to be sharp; to pierce, prick, puncture, stab; to goad”). Doublet of stylus.",
        "The English word is cognate with Catalan estil (“engraving tool, stylus; gnomon; manner of doing something, style; fashionable skill, grace”), German Stiel (“handle; stalk”), Italian stilo (“needle, stylus; fountain pen; beam; gnomon; part of pistil, style”), Occitan estil, Portuguese estilo (“writing tool, stylus; manner of doing something, style”), Spanish estilo (“writing tool, stylus; manner of doing something, style; fashionable skill, grace; part of pistil, style”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "style (countable and uncountable, plural styles)",
          "definitionGroups": [
            {
              "group": "Senses relating to a thin, pointed object.",
              "entries": [
                {
                  "meaning": "(historical) A sharp stick used for writing on clay tablets or other surfaces; a stylus; (by extension, obsolete) an instrument used to write with ink; a pen.",
                  "examples": []
                },
                {
                  "meaning": "A tool with a sharp point used in engraving; a burin, a graver, a stylet, a stylus.",
                  "examples": []
                },
                {
                  "meaning": "The gnomon or pin of a sundial, the shadow of which indicates the hour.",
                  "examples": []
                },
                {
                  "meaning": "(botany) The stalk that connects the stigma(s) to the ovary in a pistil of a flower.",
                  "examples": [
                    "Synonym: stylet"
                  ]
                },
                {
                  "meaning": "(surgery) A kind of surgical instrument with a blunt point, used for exploration.",
                  "examples": [
                    "Synonym: stylet"
                  ]
                },
                {
                  "meaning": "(zoology) A small, thin, pointed body part.",
                  "examples": [
                    "Synonym: stylet"
                  ]
                },
                {
                  "meaning": "(entomology) A long, slender, bristle-like process near the anal region.",
                  "examples": [
                    "the anal styles of insects"
                  ]
                }
              ]
            },
            {
              "group": "(by extension from sense 1.1) A particular manner of expression in writing or speech, especially one regarded as good.",
              "entries": [
                {
                  "meaning": "A legal or traditional term or formula of words used to address or refer to a person, especially a monarch or a person holding a post or having a title.",
                  "examples": [
                    "Monarchs are often addressed with the style of Majesty."
                  ]
                }
              ]
            },
            {
              "group": "A particular manner of creating, doing, or presenting something, especially a work of architecture or art.",
              "entries": [
                {
                  "meaning": "A particular manner of acting or behaving; (specifically) one regarded as fashionable or skilful; flair, grace.",
                  "examples": [
                    "As a dancer, he has a lot of style.",
                    "Backstabbing people is not my style."
                  ]
                },
                {
                  "meaning": "A particular way in which one grooms, adorns, dresses, or carries oneself; (specifically) a way thought to be attractive or fashionable.",
                  "examples": []
                },
                {
                  "meaning": "(computing) A visual or other modification to text or other elements of a document, such as boldface or italics.",
                  "examples": [
                    "applying styles to text in a wordprocessor  Cascading Style Sheets"
                  ]
                },
                {
                  "meaning": "(printing, publishing) A set of rules regarding the presentation of text (spelling, typography, the citation of references, etc.) and illustrations that is applied by a publisher to the works it produces.",
                  "examples": [
                    "the house style of the journal"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "style (third-person singular simple present styles, present participle styling, simple past and past participle styled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To design, fashion, make, or arrange in a certain way or form (style)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, formal) To call or give a name or title to.",
                  "examples": [
                    "Synonyms: designate, dub, name; see also Thesaurus:denominate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To create for, or give to, someone a style, fashion, or image, particularly one which is regarded as attractive, tasteful, or trendy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, informal) To act in a way which seeks to show that one possesses style.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}