{
  "word": "potlatch",
  "etymologies": [
    {
      "description": [
        "The noun is borrowed from Chinook Jargon potlatch, pátlač (“to give; gift; gift-giving ceremony, potlatch”), from Nootka Jargon pa'chatle, pa'chēētle, pah-chilt (“to give, give me”), from Nootka p̕ačiƛ (“to give a gift during a potlatch ceremony”).",
        "Sense 1 of the verb (“to give; especially, to give a a gift during a potlatch ceremony”) is borrowed from Chinook Jargon potlatch, pátlač (see above); sense 2 (“to carry out or take part in a potlatch ceremony”) is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "potlatch (usually uncountable, plural potlatches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, also figuratively) A ceremony amongst certain indigenous peoples of the Pacific Northwest in which gifts are bestowed upon guests and personal property is destroyed in a show of generosity and wealth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, chiefly Alaska) A communal meal to which guests bring dishes to share; a potluck.",
                  "examples": [
                    "Synonym: (Britain, dialectal) fuddle"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "potlatch (third-person singular simple present potlatches, present participle potlatching, simple past and past participle potlatched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give; especially, to give as a gift during a potlatch ceremony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To carry out or take part in a potlatch ceremony.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}