{
  "word": "gob",
  "etymologies": [
    {
      "description": [
        "From Middle English gobben, gabben (“to drink greedily”), of uncertain origin. Perhaps a variant of Middle English globben (“to gulp down”), related to Middle English gulpen (“to gulp”); or alternatively related to French gober (“swallow, gulp”), from Irish and/or Scottish Gaelic gob (“beak, bill”), from Proto-Celtic *gobbos. See also gobbet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "gob (countable and uncountable, plural gobs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A lump of soft or sticky material.",
                  "examples": [
                    "These inventors have discovered that gobs may be fed at widely spaced times without allowing the glass to flow during the interval but instead flushes[sic] out the chilled glass which accumulates during the dwell."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, UK, Australia, New Zealand, Ireland, slang) The mouth.",
                  "examples": [
                    "Synonyms: cakehole, face, mush, trap",
                    "He′s always stuffing his gob with fast food.",
                    "Oi, you, shut your gob!",
                    "She's got such a gob on her – she's always gossiping about someone or other."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Saliva or phlegm.",
                  "examples": [
                    "Synonyms: saliva, spit, sputum",
                    "He spat a big ball of gob on to the pavement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, slang) A sailor.",
                  "examples": [
                    "Well I have taken the oath of allegiance for 4 years service anywhere in the world and am now a real 'gob' in the U. S. Navy. Believe me I am certainly one hot looking little 'Jack' and you will just about split when you see me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, mining) Waste material in old mine workings, goaf.",
                  "examples": [
                    "This consisted in wheeling gob back to the most distant part of the stope and filling up the sets right up to the roof."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, regional) A whoopee pie.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "gob (third-person singular simple present gobs, present participle gobbing, simple past and past participle gobbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gather into a lump.",
                  "examples": [
                    "I liked to gob up two or three worms on a snelled hook, pinch three or four split shot onto the leader, and plunk it into the dark water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To spit, especially to spit phlegm.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining, intransitive) To pack away waste material in order to support the walls of the mine.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}