{
  "word": "personality",
  "etymologies": [
    {
      "description": [
        "Coined between 1350 and 1400 as Middle English personalite, from Middle French [Term?], from Latin persōnālitās.",
        "Morphologically personal +‎ -ity"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "personality (countable and uncountable, plural personalities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of people) A set of non-physical psychological and social qualities that make one person distinct from another.",
                  "examples": [
                    "Personality is individuality existing in itself, but with a nature as a ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of inanimate or abstract things) A set of qualities that make something distinctive or interesting.",
                  "examples": [
                    "His writing has a lot of personality.",
                    "This functional concrete building lacks personality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An assumed role or manner of behavior.",
                  "examples": [
                    "In his final act, the comedian takes on a child's personality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A celebrity, especially one with a strong media presence.",
                  "examples": [
                    "Johnny Carson was a respected television personality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Charisma, or qualities that make a person stand out from the crowd.",
                  "examples": [
                    "But over and over / I´ll be a fool for you / 'cause you got personality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something said or written which refers to the person, conduct, etc., of some individual, especially something of a disparaging or offensive nature; personal remarks.",
                  "examples": [
                    "Perceiving that personalities were not out of order, I asked him what species of beast had long ago twisted and mutilated his left ear."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) That quality of a law which concerns the condition, state, and capacity of persons",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}