{
  "word": "wanton",
  "etymologies": [
    {
      "description": [
        "From Middle English wantoun, wantowen, wantoȝen, wantowe (“uneducated; unrestrained; licentious; sportive; playful”), from wan- (“not, un-, mis-”) + towen, i-towen (“educated”, literally “towed; led; drawn”), from Old English togen, ġetogen, past participle of tēon (“to train, discipline”), equivalent to wan- +‎ towed."
      ],
      "adjectives": [
        {
          "description": "wanton (comparative wantoner, superlative wantonest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Undisciplined, unruly; not able to be controlled.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Playful, sportive; merry or carefree.",
                  "examples": [
                    "The grave simplicity of the philosopher was ill calculated to engage her wanton levity, or to fix that unbounded passion for variety, which often discovered personal merit in the meanest of mankind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lewd, immoral; sexually open, unchaste.",
                  "examples": [
                    "People should not marry too young, because, if they do, the children will be weak and female, the wives will become wanton, and the husbands stunted in their growth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capricious, reckless of morality, justice etc.; acting without regard for the law or the well-being of others; gratuitous.",
                  "examples": [
                    "these developments in Gaza are a consequence of the state of siege that the tiny territory has been under – a society that has been fenced-in, starved, and seen its very fabric torn apart by unemployment and wanton military destruction."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Extravagant, unrestrained, excessive.",
                  "examples": [
                    "the market price will rise more or less above the natural price, according as either the greatness of the deficiency, or the wealth and wanton luxury of the competitors, happen to animate more or less the eagerness of the competition."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wanton (plural wantons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A pampered or coddled person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An overly playful person; a trifler.",
                  "examples": [
                    "Peace, my wantons; he will do / More than you can aim unto."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A self-indulgent person, fond of excess.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A lewd or immoral person, especially a prostitute.",
                  "examples": [
                    "...paints with tremendous force the adulteries of the two wantons Aholah and Aholibah, Israel and Judah, and their love of strangers..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wanton (third-person singular simple present wantons, present participle wantoning, simple past and past participle wantoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To rove and ramble without restraint, rule, or limit; to revel; to play loosely; to frolic.",
                  "examples": [
                    "How merrily we would sally into the fields; and strip under the first warmth of the sun; and wanton like young dace in the streams  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To waste or squander, especially in pleasure (most often with away).",
                  "examples": [
                    "The young man wantoned away his inheritance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act wantonly; to be lewd or lascivious.",
                  "examples": [
                    "Be loving and courteous to your fellow Servants, not gigling or idling out your time, or wantoning in the society of men  […]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}