{
  "word": "fender",
  "etymologies": [
    {
      "description": [
        "fend +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fender (plural fenders)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) panel of a car which encloses the wheel area, especially the front wheels",
                  "examples": [
                    "Synonyms: (Australian) guard, (British) wheel arch, (British) wing"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) a shield, usually of plastic or metal, on a bicycle that protects the rider from mud or water",
                  "examples": [
                    "Synonym: (British) mudguard"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) any shaped cushion-like object normally made from polymers, rubber or wood that is placed along the sides of a boat to prevent damage when moored alongside another vessel or jetty, or when using a lock, etc. Modern variations are cylindrical although older wooden version and rubbing strips can still be found; old tyres are used as a cheap substitute",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "a low metal framework in front of a fireplace, intended to catch hot coals, soot, and ash",
                  "examples": [
                    "Now and then he would make a motion with his feet as if he were running quickly backward upstairs, and would tread on the edge of the fender, so that the fire-irons went flying and the buttered-bun dishes crashed against each other in the hearth."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fender (third-person singular simple present fenders, present participle fendering, simple past and past participle fendered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To use fenders to protect the side of a boat",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}