{
  "word": "baba",
  "etymologies": [
    {
      "description": [
        "As one of the first utterances many babies are able to say, baba (like mama, papa, and dada) has come to be used in many languages as a term for various family members:",
        "These terms often continue to be used by English speakers whose families came from one of these cultures. In some cases, they may become more widely used in localities that have been heavily influenced by an immigrant community. Some senses were extensions of one of these family terms in the original languages (\"old woman\" from \"grandmother\", \"holy man\" from \"father\"). The \"cake\" sense comes through French, from Polish baba (“old woman”). The Middle Eastern word baba (as in Ali Baba) is rather a term of endearment, and is ultimately derived from Persian بابا (bābā, “father”) (from Old Persian pāpa; as opposed to the Arabic words أَبُو (ʾabū) and أَب (ʾab); see also Papak), and is linguistically related to the common European word papa and the word pope, having the same Indo-European origin. The Chinese word \"baba\", meaning father comes from 爸爸."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "baba (plural babas)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of sponge cake soaked in rum-flavoured syrup.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially among people of East European ancestry) A grandmother.",
                  "examples": [
                    "My baba, Ksenia Dubinsky, tells me that my education makes her proud."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An old woman, especially a traditional old woman from an eastern European culture.",
                  "examples": [
                    "According to some, new volunteers are becoming more difficult to recruit and there are dark suggestions that 'money is being made on the backs of the babas', the dedicated, but ageing ladies who still spend countless hours of their time preparing foodstuffs for the occasion."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially among people of Indian or Chinese ancestry) A father.",
                  "examples": [
                    "\"The greatest gift and honor is having you for a daughter. I've missed you so.\" \"I've missed you too, baba.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Hinduism, Islam, Sikhism) A holy man, a spiritual leader.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(British India) A baby, child.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In baby talk, often used for a variety of words beginning with b, such as bottle or blanket.",
                  "examples": [
                    "Oh, it's storytime! Let me get my baba."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}