{
  "word": "scrape",
  "etymologies": [
    {
      "description": [
        "From Middle English scrapen, from Old Norse skrapa (“to scrape, scratch”) and Old English scrapian (“to scrape, scratch”), both from Proto-Germanic *skrapōną, *skrepaną (“to scrape, scratch”), from Proto-Indo-European *skrebʰ- (“to engrave”). Cognate with Dutch schrapen (“to scrape”), schrappen (“to strike through; to cancel; to scrap”), schrabben (“to scratch”), German schrappen (“to scrape”), Danish skrabe (“to scrape”), Icelandic skrapa (“to scrape”), Walloon screper (“to scrape”), Latin scribō (“dig with a pen, draw, write”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scrape (countable and uncountable, plural scrapes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A broad, shallow injury left by scraping (rather than a cut or a scratch).",
                  "examples": [
                    "He fell on the sidewalk and got a scrape on his knee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A fight, especially a fistfight without weapons.",
                  "examples": [
                    "He got in a scrape with the school bully."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An awkward set of circumstances.",
                  "examples": [
                    "I'm in a bit of a scrape — I've no money to buy my wife a birthday present."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) A D and C or abortion; or, a miscarriage.",
                  "examples": [
                    "It’s quite possible, in view of the diagnosis ‘danger of miscarriage’, that they might drag me off, give me a scrape and then say that the miscarriage began itself."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shallow depression used by ground birds as a nest; a nest scrape.",
                  "examples": [
                    "We knew from U. Weidmann’s work (1956) that Black-headed Gulls could be prevented from laying by offering them eggs on the empty scrape veil before […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) A shallow pit dug as a hideout.",
                  "examples": [
                    "In between rounds, he dug a scrape for himself with his entrenching tool."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang) A shave.",
                  "examples": [
                    "A'm goin to the barber's for a scrape."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, UK, slang, obsolete) Cheap butter.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, UK, slang, obsolete) Butter laid on bread in the thinnest possible manner, as though laid on and scraped off again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A diminutive of the bend (especially of the bend sinister) which is half its width.",
                  "examples": [
                    "Alternative form: scarpe",
                    "Coordinate term: baton"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scrape (third-person singular simple present scrapes, present participle scraping, simple past and past participle scraped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To draw (an object, especially a sharp or angular one), along (something) while exerting pressure.",
                  "examples": [
                    "She scraped the wooden plate with her fingernails.",
                    "That car often scrapes the shallowest of humps because of its low ground clearance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove (something) by drawing an object along in this manner.",
                  "examples": [
                    "Scrape the chewing gum off with a knife."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To injure or damage by rubbing across a surface.",
                  "examples": [
                    "She tripped on a rock and scraped her knee."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To barely manage to achieve.",
                  "examples": [
                    "I scraped a pass in the exam."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To collect or gather, especially without regard to the quality of what is chosen.",
                  "examples": [
                    "Just use whatever you can scrape together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) To extract data by automated means from a format not intended to be machine-readable, such as a screenshot or a formatted web page.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To occupy oneself with getting laboriously.",
                  "examples": [
                    "He scraped and saved until he became rich."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To play awkwardly and inharmoniously on a violin or similar instrument.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To draw back the right foot along the ground or floor when making a bow].",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To express disapprobation of (a play, etc.) or to silence (a speaker) by drawing the feet back and forth upon the floor; usually with down.",
                  "examples": [
                    "All the various kinds of interest which 80 strongly against the accused , that his friends belong to the near and to the distant , to the were coughed and scraped down."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}