{
  "word": "parallelism",
  "etymologies": [
    {
      "description": [
        "From parallel +‎ -ism and from Late Latin parallelismus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parallelism (countable and uncountable, plural parallelisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state or condition of being parallel; agreement in direction, tendency, or character.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being in agreement or similarity; resemblance, correspondence, analogy.",
                  "examples": [
                    "Plutarch (c. AD 46-120), in his Lives of the Noble Grecians and Romans, traced a parallelism between the most eminent men of the two countries."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A parallel position; the relation of parallels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric, grammar) The juxtaposition of two or more identical or equivalent syntactic constructions, especially those expressing the same sentiment with slight modifications, introduced for rhetorical effect.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy) The doctrine that matter and mind do not causally interact but that physiological events in the brain or body nonetheless occur simultaneously with matching events in the mind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) In antitrust law, the practice of competitors of raising prices by roughly the same amount at roughly the same time, without engaging in a formal agreement to do so.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(biology) Similarity of features between two species resulting from their having taken similar evolutionary paths following their initial divergence from a common ancestor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The use of parallel methods in hardware or software, so that several tasks can be performed at the same time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}