{
  "word": "screw",
  "etymologies": [
    {
      "description": [
        "From Middle English screw, scrue (“screw”); apparently, despite the difference in meaning, from Old French escroue (“nut, cylindrical socket, screwhole”), from Latin scrōfa (“female pig”) through comparison with the corkscrew shape of a pig's penis. There is also the Old French escruve (“screw”), from Old Dutch *scrūva (\"screw\"; whence Middle Dutch schruyve (“screw”)), which probably influenced or conflated with the aforementioned, resulting in the Middle English word."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "screw (plural screws)",
          "definitionGroups": [
            {
              "group": "A device that has a helical function.",
              "entries": [
                {
                  "meaning": "A simple machine, a helical inclined plane.",
                  "examples": []
                },
                {
                  "meaning": "A (usually) metal fastener consisting of a partially or completely threaded shank, sometimes with a threaded point, and a head used to both hold the top material and to drive the screw either directly into a soft material or into a prepared hole.",
                  "examples": []
                },
                {
                  "meaning": "(nautical) A ship's propeller.",
                  "examples": [
                    "It is never possible to settle down to the ordinary routine of life at sea until the screw begins to revolve. There is an hour or two, after the passengers have embarked, which is disquieting and fussy."
                  ]
                },
                {
                  "meaning": "An Archimedes screw.",
                  "examples": []
                },
                {
                  "meaning": "A steam vessel propelled by a screw instead of wheels.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The motion of screwing something; a turn or twist to one side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) A prison guard.",
                  "examples": [
                    "And that's how it came to pass that on the second-to-last day of the job, the convict crew that tarred the plate factory roof in the spring of forty-nine wound up sitting in a row at ten o'clock in the morning drinking icy cold, Bohemia-style beer, courtesy of the hardest screw that ever walked a turn at Shawshank State Prison."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, derogatory) An extortioner; a sharp bargainer; a skinflint.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) An instructor who examines with great or unnecessary severity; also, a searching or strict examination of a student by an instructor.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) Sexual intercourse; the act of screwing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(vulgar, slang) A casual sexual partner.",
                  "examples": [
                    "Synonyms: see Thesaurus:casual sexual partner"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Salary, wages.",
                  "examples": [
                    "“I’ll speak to Mrs. Dorman when she comes back, and see if I can’t come to terms with her,” I said. “Perhaps she wants a rise in her screw. It will be all right. Let’s walk up to the church.”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards) Backspin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A small packet of tobacco.",
                  "examples": [
                    "3 Screws and a Pipe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) An old, worn-out, unsound and worthless horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A straight line in space with which a definite linear magnitude termed the pitch is associated. It is used to express the displacement of a rigid body, which may always be made to consist of a rotation about an axis combined with a translation parallel to that axis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amphipod crustacean.",
                  "examples": [
                    "the skeleton screw (Caprella)",
                    "the sand screw"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, in the plural, with \"the\") Rheumatism.",
                  "examples": [
                    "She didn't like my mother, so she made a wax doll and stuck thorns into its legs, and my mother had the screws (rheumatism) in her legs ever since."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "screw (third-person singular simple present screws, present participle screwing, simple past and past participle screwed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To connect or assemble pieces using a screw.",
                  "examples": [
                    "Synonyms: screw up; see also Thesaurus:join"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, vulgar, slang) To have sexual intercourse with.",
                  "examples": [
                    "Synonyms: (vulgar, slang) fuck, (Australia) root, (British) shag; see also Thesaurus:copulate with"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To cheat someone or ruin their chances in a game or other situation.",
                  "examples": [
                    "Synonyms: (vulgar, slang) fuck, screw over"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To extort or practice extortion upon; to oppress by unreasonable or extortionate exactions; to put the screws on.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contort.",
                  "examples": [
                    "Synonyms: twist, writhe"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(soccer, transitive) To miskick (a ball) by hitting it with the wrong part of the foot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(billiards, snooker, pool) To screw back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, dated) To examine (a student) rigidly; to subject to a severe examination.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, slang, often imperative, dated) To leave; to go away; to scram. [from early to mid 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}