{
  "word": "chancery",
  "etymologies": [
    {
      "description": [
        "From French chancellerie, from Late Latin cancellaria, from Latin cancellarius, from Latin cancellus (“lattice”) (English chancel), from Latin cancelli (“grating, bars”), from the lattice-work that separated a section of a church or court.",
        "See related chancellor and chancellery, and the more distantly related incarcerate (“put behind bars”), from carcer (“prison”).",
        "The adverbial form is an allusion to the condition of a person involved in the chancery court."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "chancery (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing) With the head of an antagonist under one's arm, so that one can pommel it with the other fist at will.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) In an awkward situation; wholly under the power of someone else.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [
        {
          "description": "chancery (countable and uncountable, plural chanceries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In England, formerly, the highest court of judicature next to the Parliament, exercising jurisdiction at law, but chiefly in equity; but under the jurisdiction act of 1873 it became the chancery division of the High Court of Justice, and now exercises jurisdiction only in equity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In the United States, a court of equity; equity; proceeding in equity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The type of building that houses a diplomatic mission or embassy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The type of building that houses the offices and administration of a diocese; the offices of a diocese.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) In the Middle Ages, a government office that produced and notarized official documents.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(boxing, slang) The position of a boxer's head when under his adversary's arm.",
                  "examples": [
                    "The Chicken himself attributed this punishment to his having had the misfortune to get into Chancery early in the proceedings, when he was severely fibbed by the Larkey one, and heavily grassed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) Any awkward predicament.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(writing)  Short for chancery hand.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}