{
  "word": "knot",
  "etymologies": [
    {
      "description": [
        "From Middle English knotte, from Old English cnotta, from Proto-West Germanic *knottō, from Proto-Germanic *knuttô, *knudô (“knot”); (cognate with Old High German knoto (German Knoten, Dutch knot, Low German Knütte); compare also Old Norse knútr > Danish knude, Swedish knut, Norwegian knute, Faroese knútur, Icelandic hnútur). Probably ultimately from Proto-Indo-European *gnod- (“to bind”), compare Latin nōdus and its Romance descendants. Doublet of knout, node, and nodus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knot (plural knots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A looping of a piece of string or of any other long, flexible material that cannot be untangled without passing one or both ends of the material through its loops.",
                  "examples": [
                    "Climbers must make sure that all knots are both secure and of types that will not weaken the rope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of hair, etc) A tangled clump.",
                  "examples": [
                    "The nurse was brushing knots from the protesting child's hair."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A maze-like pattern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A non-self-intersecting closed curve in (e.g., three-dimensional) space that is an abstraction of a knot (in sense 1 above).",
                  "examples": [
                    "A knot can be defined as a non-self-intersecting broken line whose endpoints coincide: when such a knot is constrained to lie in a plane, then it is simply a polygon.",
                    "A knot in its original sense can be modeled as a mathematical knot (or link) as follows: if the knot is made with a single piece of rope, then abstract the shape of that rope and then extend the working end to merge it with the standing end, yielding a mathematical knot. If the knot is attached to a metal ring, then that metal ring can be modeled as a trivial knot and the pair of knots become a link. If more than one mathematical knot (or link) can be thus obtained, then the simplest one (avoiding detours) is probably the one which one would want."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A difficult situation.",
                  "examples": [
                    "I got into a knot when I inadvertently insulted a policeman."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The whorl left in lumber by the base of a branch growing out of the tree's trunk.",
                  "examples": [
                    "When preparing to tell stories at a campfire, I like to set aside a pile of pine logs with lots of knots, since they burn brighter and make dramatic pops and cracks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Local swelling in a tissue area, especially skin, often due to injury.",
                  "examples": [
                    "Jeremy had a knot on his head where he had bumped it on the bedframe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tightened and contracted part of a muscle that feels like a hard lump under the skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protuberant joint in a plant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any knob, lump, swelling, or protuberance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The swelling of the bulbus glandis in members of the dog family, Canidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The point on which the action of a story depends; the gist of a matter.",
                  "examples": [
                    "the knot of the tale"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A node.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A kind of epaulet; a shoulder knot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people or things.",
                  "examples": [
                    "When, for instance, he saw a knot of the ruffians on the prairie, discussing, of course, the single topic which then occupied their minds, he would, perhaps, take his compass and one of his sons, and proceed to run an imaginary line right through the very spot on which that conclave had assembled, and when he came up to them, he would naturally pause and have some talk with them, learning their news, and, at last, all their plans perfectly; and having thus completed his real survey he would resume his imaginary one, and run on his line till he was out of sight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bond of union; a connection; a tie.",
                  "examples": [
                    "ere we knit the knot that can never be loosed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation, nautical) A unit of speed, equal to one nautical mile per hour. (From the practice of counting the number of knots in the log-line (as it is paid out) in a standard time. Traditionally spaced at one every 1⁄120 of a mile.)",
                  "examples": [
                    "Synonyms: kn, kt",
                    "Cedric claimed his old yacht could make 12 knots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A unit of indicated airspeed, calibrated airspeed, or equivalent airspeed, which varies in its relation to the unit of speed so as to compensate for the effects of different ambient atmospheric conditions on aircraft performance.",
                  "examples": [
                    "In the early stages of reentry, due to the extremely-rarefied air at these altitudes, the space shuttle flew at only one to a few knots equivalent airspeed, even when its actual speed was many thousands of knots."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A nautical mile.",
                  "examples": [
                    "Synonym: nm"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The bulbus glandis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fandom slang) In omegaverse fiction, a bulbus glandis-like structure on the penis of a male alpha, which ties him to an omega during intercourse.",
                  "examples": [
                    "Since the knot won't release until the alpha has finished and can't be controlled by either party, the sex has to go on until it's done."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "knot (third-person singular simple present knots, present participle knotting, simple past and past participle knotted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into a knot; to tie with a knot or knots.",
                  "examples": [
                    "We knotted the ends of the rope to keep it from unravelling."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form wrinkles in the forehead, as a sign of concentration, concern, surprise, etc.",
                  "examples": [
                    "She knotted her brow in concentration while attempting to unravel the tangled strands."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unite closely; to knit together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete, rare) To entangle or perplex; to puzzle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form knots.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To knit knots for a fringe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Supposed to be derived from the name of King Canute, with whom the bird was a favourite article of food. See the specific epithet canutus."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "knot (plural knots or knot)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One of a variety of shore birds; red-breasted sandpiper (variously Calidris canutus or Tringa canutus).",
                  "examples": [
                    "My foot-boy shall eat pheasants, calvered salmons, / Knots, godwits, lampreys: I myself will have / The beards of barbels, served instead of salads  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}