{
  "word": "ether",
  "etymologies": [
    {
      "description": [
        "From Middle English ēther (“the caelum aetherum of ancient cosmology in which the planets orbit; a shining, fluid substance described as a form of air or fire; air”), borrowed from Anglo-Norman ether and Middle French ether, ethere, aether, from Old French aether (“highest and purest part of the atmosphere; medium supposedly filling the upper regions of space”) (modern French éther), or directly from its etymon Latin aethēr (“highest and purest part of the atmosphere; air; heavens, sky; light of day; ethereal matter surrounding a deity”) (note also New Latin aethēr (“chemical compound analogous to diethyl ether”)), from Ancient Greek αἰθήρ (aithḗr, “purer upper air of the atmosphere; heaven, sky; theoretical medium supposed to fill unoccupied space and transmit heat and light”), from αἴθω (aíthō, “to burn, ignite; to blaze, shine”), from Proto-Indo-European *h₂eydʰ- (“to burn; fire”).",
        "The English word is cognate with Italian ether, ethera (both obsolete), etere, Middle Dutch ether (modern Dutch aether (obsolete), ether), German Äther, Ether, Portuguese éter, Spanish éter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ether (countable and uncountable, plural ethers)",
          "definitionGroups": [
            {
              "group": "(uncountable, literary or poetic) The substance formerly supposed to fill the upper regions of the atmosphere above the clouds, in particular as a medium breathed by deities.",
              "entries": [
                {
                  "meaning": "(by extension) The medium breathed by human beings; the air.",
                  "examples": []
                },
                {
                  "meaning": "(by extension) The sky, the heavens; the void, nothingness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, physics, historical) Often as aether and more fully as luminiferous aether: a substance once thought to fill all unoccupied space that allowed electromagnetic waves to pass through it and interact with matter, without exerting any resistance to matter or energy; its existence was disproved by the 1887 Michelson–Morley experiment and the theory of relativity propounded by Albert Einstein (1879–1955).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colloquial) The atmosphere or space as a medium for broadcasting radio and television signals; also, a notional space through which Internet and other digital communications take place; cyberspace.",
                  "examples": [
                    "He held some friendly chat with Pabodie over the ether, and repeated his praise of the really marvelous drills that had helped him make his discovery."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, colloquial) A particular quality created by or surrounding an object, person, or place; an atmosphere, an aura.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, organic chemistry) Diethyl ether (C4H10O), an organic compound with a sweet odour used in the past as an anaesthetic.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, organic chemistry) Any of a class of organic compounds containing an oxygen atom bonded to two hydrocarbon groups.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Starting fluid.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From “Ether” (2001), a song by the American hip hop recording artist Nas (born 1973). According to Nas, the song, a diss track aimed at fellow artist Jay-Z (born 1969), was thus named because he was once told that ghosts and spirits do not like the fumes from ether (noun, sense 5), and he viewed the song as affecting Jay-Z in a similar way. The song contains the lines “I fuck with your soul like ether” and “That ether, that shit that make your soul burn slow”."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "ether (third-person singular simple present ethers, present participle ethering, simple past and past participle ethered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, slang) To viciously humiliate or insult.",
                  "examples": [
                    "Synonyms: see Thesaurus:abash",
                    "The battle rapper ethered his opponent and caused him to slink away in shame."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "ether (plural ether)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptocurrencies) Alternative letter-case form of Ether",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}