{
  "word": "replace",
  "etymologies": [
    {
      "description": [
        "re- +‎ place"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "replace (third-person singular simple present replaces, present participle replacing, simple past and past participle replaced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restore to a former place, position, condition, etc.; to put back",
                  "examples": [
                    "When you've finished using the telephone, please replace the handset."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To refund; to repay; to pay back",
                  "examples": [
                    "You can take what you need from the petty cash, but you must replace it tomorrow morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To supply or substitute an equivalent for",
                  "examples": [
                    "I replaced my car with a newer model.",
                    "The batteries were dead so I replaced them"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take over the position or role from.",
                  "examples": [
                    "Next Wednesday, four women and 15 men on the Crown Nominations Commission will gather for two days of prayer and horsetrading to replace Rowan Williams as archbishop of Canterbury."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take the place of; to be used instead of",
                  "examples": [
                    "This security pass replaces the one you were given earlier."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To demolish (a building) and build an updated form of that building in its place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To place again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rare) To put in a new or different place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}