{
  "word": "dude",
  "etymologies": [
    {
      "description": [
        "Uncertain, though likely derived from doodle (“fool, simpleton, mindless person”), perhaps with reference to the fashionable “Yankee Doodle dandy” in the 18th-century lyrics of the song “Yankee Doodle”; the word is first attested in 1883 as a New York City slang term of contempt for a “fastidious man, fop”.",
        "It has also been suggested that the word is derived from dudes (“old rags”; compare duds) and dudesman (“scarecrow”), or possibly related to dawdle; to German Low German Dudeldop, Dudendop (“fool, dunce”), from Middle Low German dudendop (“cuckold; simpleton”); or to Saterland Frisian Duddigegen (“idiot”). It has also been suggested the word derives from the Irish dúid.",
        "The common claim that the term derives from (or is) a word for a camel's foreskin (or some other vulgar thing, like a hair on a cow, horse, donkey, or elephant's bottom) is false."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dude (plural dudes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly US, Canada, colloquial) A man, generally a younger man.",
                  "examples": [
                    "So we were at the mall and these two dudes just walk up to us and say \"hi\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, used in the vocative) A term of address for someone, typically a man, particularly when cautioning them or offering advice.",
                  "examples": [
                    "Dude, I'd be careful around the principal; he's having a bad day.",
                    "Watch it, dude; you almost knocked me over."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An inexperienced cowboy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A tourist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A man who is very concerned about his dress and appearance; a dandy, a fop.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dude (third-person singular simple present dudes, present participle dudeing or duding, simple past and past participle duded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To address someone as dude.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take a vacation in a dude ranch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) Usually followed by up: to dress up, to wear smart or special clothes.",
                  "examples": [
                    "\"Speaking of being duded out …\" He shrugged, then handed her the bag. \"Here. This is for you.\" / She reached inside and gasped as she pulled out a white suede western style hat. A glittering gold braid encircled the brim. / \"Oh, Zack! It's beautiful. Thank you.\""
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}