{
  "word": "rust",
  "etymologies": [
    {
      "description": [
        "From Middle English rust, rost, roust, from Old English rust, rūst (“rust”), from Proto-West Germanic *rust, from Proto-Germanic *rustaz (“rust”), from Proto-Indo-European *rudʰso- (“red”), from Proto-Indo-European *h₁rewdʰ- (“red”).",
        "Cognate with Scots roust (“rust”), Saterland Frisian rust (“rust”), West Frisian roast (“rust”), Dutch roest (“rust”), German Rost (“rust”), Danish rust (“rust”), Swedish rost (“rust”), Norwegian rust, ryst (“rust”). Related to red."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rust (countable and uncountable, plural rusts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The deteriorated state of iron or steel as a result of moisture and oxidation.",
                  "examples": [
                    "The rust on my bicycle chain made cycling to work very dangerous."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A similar substance based on another metal (usually with qualification, such as \"copper rust\").",
                  "examples": [
                    "aerugo. Green or blue-green copper rust; verdigris. (American Heritage Dictionary, 1973)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A reddish-brown color.",
                  "examples": [
                    "rust:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A disease of plants caused by a reddish-brown fungus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philately) Damage caused to stamps and album pages by a fungal infection.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rusten, from the noun (see above)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "rust (third-person singular simple present rusts, present participle rusting, simple past and past participle rusted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To oxidize, especially of iron or steel.",
                  "examples": [
                    "The patio furniture had rusted in the wind-driven spray."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to oxidize.",
                  "examples": [
                    "The wind-driven spray had thoroughly rusted the patio furniture."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be affected with the parasitic fungus called rust.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, figuratively) To (cause to) degenerate in idleness; to make or become dull or impaired by inaction.",
                  "examples": [
                    "Must I rust in Egypt? never more / Appear in arms, and be the chief of Greece?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) Of a black cat or its fur, to turn rust-coloured following long periods of exposure to sunlight.",
                  "examples": [
                    "It's very common for black cats to rust during the summer."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}