{
  "word": "thickness",
  "etymologies": [
    {
      "description": [
        "From Middle English thikkenesse, thiknesse, from Old English þicnes (“thickness, viscosity, density, hardness; obscurity, cloud, darkness; thicket; depth, a thick body, anything thick or heavy”), equivalent to thick +‎ -ness. Eclipsed non-native Middle English crassitude (“thickness”)  from Latin crassitūdō (“thickness”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "thickness (countable and uncountable, plural thicknesses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The property of being thick (in dimension).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, countable) A measure of how thick (in dimension) something is.",
                  "examples": [
                    "The thickness of the Earth's crust varies from two to 70 kilometres.",
                    "Guitar picks come in different thicknesses."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A layer.",
                  "examples": [
                    "We upholstered the seat with three thicknesses of cloth to make it more comfortable to sit on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The quality of being thick (in consistency).",
                  "examples": [
                    "Whip the cream until it reaches a good thickness."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) The property of being thick (slow to understand).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "thickness (third-person singular simple present thicknesses, present participle thicknessing, simple past and past participle thicknessed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To trim (wood) to a consistent thickness using a thickness planer.",
                  "examples": [
                    "Even if the parts are thicknessed by machine, check for and plane out any cup with a bench plane."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}