{
  "word": "berserker",
  "etymologies": [
    {
      "description": [
        "Borrowed from Old Norse berserkr (“Norse warrior who fights with frenzy”), probably from bjǫrn (“bear”) + serkr (“coat; shirt”), referring to the bearskins which the warriors wore. Bjǫrn is possibly ultimately derived from Proto-Indo-European *bʰerH- (“brown”); and serkr from Proto-Indo-European *ser- (“to bind, tie together; thread”). Alternatively, it has been suggested that the first element of the word is from berr (“bare, naked”), suggesting warriors who went into battle without armour, but this is now thought unlikely. Doublet of berserk.",
        "The word was introduced in English by the Scottish author and historian Walter Scott (1771–1832) in Illustrations of Northern Antiquities (1814) (spelled berserkir), and in his novel The Pirate (1822) (spelled berserkar). Sense 3 (“type of von Neumann probe whose mission is to exterminate alien lifeforms”) was coined by the American author Fred Saberhagen (1930–2007) in 1963 in his Berserker series of novels and short stories."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "berserker (plural berserkers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) A Norse warrior who purportedly fought in a trance-like frenzy; a berserk.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "One who fights as if frenzied, like a berserker.",
                  "examples": []
                },
                {
                  "meaning": "(science fiction) A type of von Neumann probe whose mission is to exterminate alien lifeforms.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}