{
  "word": "plead",
  "etymologies": [
    {
      "description": [
        "From Middle English pleden, plaiden, from Old French plaider (“to plead, offer a plea”), from plait, from Medieval Latin placitum (“a decree, sentence, suit, plea, etc.\", in Classical Latin, \"an opinion, determination, prescription, order; literally, that which is pleasing, pleasure”), neuter of placitus, past participle of placeō (“to please”). Cognate with Spanish pleitear (“to litigate, take to court”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "plead (third-person singular simple present pleads, present participle pleading, simple past and past participle (North America, England, legal) pleaded or (North America, Scotland) pled or (North America) plead)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, copulative) To present (an argument or a plea), especially in a legal case.",
                  "examples": [
                    "The defendant has decided to plead not guilty."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To beg, beseech, or implore, especially emotionally.",
                  "examples": [
                    "Synonyms: appeal, ask, beg, request",
                    "He pleaded with me not to leave the house.",
                    "He was pleading for mercy."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To offer by way of excuse.",
                  "examples": [
                    "Synonyms: allege, claim, maintain",
                    "Not wishing to attend the banquet, I pleaded illness.",
                    "It is no defence to plead that you were only obeying orders."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To discuss by arguments.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}