{
  "word": "stance",
  "etymologies": [
    {
      "description": [
        "From Middle English staunce (“place to stand; battle station; position; standing in society; circumstance, situation; stanchion”), from Old French estance (“predicament; situation; sojourn, stay”) (compare modern French stance (“stanza; position one stands in when golfing”)), from Italian stanza (“room, standing place; stanza”), from Latin stāns (“standing; remaining, staying”), from Latin stō (“to stand; to remain, stay”), ultimately from Proto-Indo-European *steh₂- (“to stand (up)”). The word is cognate with Spanish estante (“shelf”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "stance (plural stances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The manner, pose, or posture in which one stands.",
                  "examples": [
                    "The fencer’s stance showed he was ready to begin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One's opinion or point of view.",
                  "examples": [
                    "Synonyms: position, posture, stand",
                    "I don’t agree with your stance on gun control."
                  ]
                }
              ]
            },
            {
              "group": "A place to stand; a position, a site, a station.",
              "entries": [
                {
                  "meaning": "(specifically, climbing) A foothold or ledge on which to set up a belay.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A place for buses or taxis to await passengers; a bus stop, a taxi rank.",
                  "examples": [
                    "Synonym: stand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) A place where a fair or market is held; a location where a street trader can carry on business.",
                  "examples": [
                    "Synonym: stand"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) A stanza.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "stance (third-person singular simple present stances, present participle stancing, simple past and past participle stanced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, Scotland) To place, to position, to station; (specifically) to put (cattle) into an enclosure or pen in preparation for sale.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}