{
  "word": "telephone",
  "etymologies": [
    {
      "description": [
        "First used by Alexander Graham Bell in 1876 to refer to the modern instrument, but previous devices had been given this name, which was borrowed from French téléphone. Ultimately from Ancient Greek τῆλε (têle, “afar”) + φωνή (phōnḗ, “voice, sound”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "telephone (countable and uncountable, plural telephones)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A telecommunication device (originally mechanical, and now electronic) used for two-way talking with another person (now often shortened to phone).",
                  "examples": [
                    "Synonyms: (slang) blower, phone, (slang) Ameche, (slang) dog and bone, (informal) horn, (slang) pipe; see also Thesaurus:phone",
                    "Hyponym: cellphone"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, uncountable) The game of Chinese whispers.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US, uncountable, figuratively) Chinese whispers; a situation in which an initial message has been distorted and misunderstood by being passed from person to person.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "telephone (third-person singular simple present telephones, present participle telephoning, simple past and past participle telephoned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (attempt to) contact someone using a telephone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey (a message) via telephone.",
                  "examples": [
                    "David telephoned his apologies to his mother."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}