{
  "word": "pull",
  "etymologies": [
    {
      "description": [
        "Verb from Middle English pullen, from Old English pullian (“to pull, draw, tug, pluck off”), of uncertain ultimate origin. Related to West Frisian pûlje (“to shell, husk”), Middle Dutch pullen (“to drink”), Middle Dutch polen (“to peel, strip”), Low German pulen (“to pick, pluck, pull, tear, strip off husks”), Icelandic púla (“to work hard, beat”).",
        "Noun from Middle English pul, pull, pulle, from the verb pullen (“to pull”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "Verb from Middle English pullen, from Old English pullian (“to pull, draw, tug, pluck off”), of uncertain ultimate origin. Related to West Frisian pûlje (“to shell, husk”), Middle Dutch pullen (“to drink”), Middle Dutch polen (“to peel, strip”), Low German pulen (“to pick, pluck, pull, tear, strip off husks”), Icelandic púla (“to work hard, beat”). Noun from Middle English pul, pull, pulle, from the verb pullen (“to pull”).",
          "definitionGroups": []
        },
        {
          "description": "pull (countable and uncountable, plural pulls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act of pulling (applying force toward oneself).",
                  "examples": [
                    "He gave the hair a sharp pull and it came out."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attractive force which causes motion towards the source.",
                  "examples": [
                    "The spaceship came under the pull of the gas giant.",
                    "iron fillings drawn by the pull of a magnet",
                    "She took a pull on her cigarette."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, by extension) An advantage over somebody; a means of influencing.",
                  "examples": [
                    "The hypnotist exerted a pull over his patients."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, informal) The power to influence someone or something; sway, clout.",
                  "examples": [
                    "I don't have a lot of pull within the company."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any device meant to be pulled, as a lever, knob, handle, or rope.",
                  "examples": [
                    "a zipper pull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) Something in one's favour in a comparison or a contest.",
                  "examples": [
                    "In weights the favourite had the pull."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Appeal or attraction (e.g. of a movie star).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, uncountable) The situation where a client sends out a request for data from a server, as in server pull, pull technology",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A journey made by rowing.",
                  "examples": [
                    "As Blunt had said, the burning ship lay a good twelve miles from the Malabar, and the pull was a long and a weary one. Once fairly away from the protecting sides of the vessel that had borne them thus far on their dismal journey, the adventurers seemed to have come into a new atmosphere."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A contest; a struggle.",
                  "examples": [
                    "a wrestling pull"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An injury resulting from a forceful pull on a limb, etc.; a strain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, poetic) Loss or violence suffered.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) The act of drinking; a mouthful or swig of a drink.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) A type of stroke by which a leg ball is sent to the off side, or an off ball to the on side; a pull shot.",
                  "examples": [
                    "The pull is not a legitimate stroke, but bad cricket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(golf) A mishit shot which travels in a straight line and (for a right-handed player) left of the intended path.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) A single impression from a handpress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A proof sheet.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "Verb from Middle English pullen, from Old English pullian (“to pull, draw, tug, pluck off”), of uncertain ultimate origin. Related to West Frisian pûlje (“to shell, husk”), Middle Dutch pullen (“to drink”), Middle Dutch polen (“to peel, strip”), Low German pulen (“to pick, pluck, pull, tear, strip off husks”), Icelandic púla (“to work hard, beat”). Noun from Middle English pul, pull, pulle, from the verb pullen (“to pull”).",
          "definitionGroups": []
        },
        {
          "description": "pull (third-person singular simple present pulls, present participle pulling, simple past and past participle pulled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To apply a force to (an object) so that it comes toward the person or thing applying the force.",
                  "examples": [
                    "When I give the signal, pull the rope.",
                    "You're going to have to pull harder to get that cork out of the bottle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To gather with the hand, or by drawing toward oneself; to pluck.",
                  "examples": [
                    "to pull fruit from a tree",
                    "pull flax",
                    "pull a finch"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attract or net; to pull in.",
                  "examples": [
                    "Television, a favored source of news and information, pulls the largest share of advertising monies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, UK, Ireland, slang) To persuade (someone) to have sex with one: to be 'on the pull' - looking for a sexual partner.",
                  "examples": [
                    "I pulled at the club last night.",
                    "He's pulled that bird over there."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To  remove (something), especially from public circulation or availability.",
                  "examples": [
                    "Each day, they pulled the old bread and set out fresh loaves.",
                    "The book was due to be released today, but it was pulled at the last minute over legal concerns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To retrieve or generate for use.",
                  "examples": [
                    "I'll have to pull a part number for that.",
                    "This computer file is incorrect. Can we pull the old version from your backups?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(construction) To obtain (a permit) from a regulatory authority.",
                  "examples": [
                    "It's the contractor's responsibility to pull the necessary permits before starting work."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To do or perform.",
                  "examples": [
                    "He regularly pulls 12-hour days, sometimes 14.",
                    "You'll be sent home if you pull another stunt like that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with 'a' and the name of a person, place, event, etc.) To copy or emulate the actions or behaviour that is associated with the person or thing mentioned.",
                  "examples": [
                    "He pulled an Elvis and got really fat.",
                    "They're trying to pull a Watergate on us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To toss a frisbee with the intention of launching the disc across the length of a field.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To row.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, rowing) To achieve by rowing on a rowing machine.",
                  "examples": [
                    "I pulled a personal best on the erg yesterday.",
                    "It had been a sort of race hitherto, and the rowers, with set teeth and compressed lips, had pulled stroke for stroke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To draw apart; to tear; to rend.",
                  "examples": [
                    "He hath turned aside my ways, and pulled me in pieces; he hath made me desolate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To strain (a muscle, tendon, ligament, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, transitive, intransitive) To draw (a hostile non-player character) into combat, or toward or away from some location or target.",
                  "examples": [
                    "…we had to clear a long hallway, run up half way, pull the boss mob to us, and engage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) To score a certain number of points in a sport.",
                  "examples": [
                    "How many points did you pull today, Albert?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(horse-racing) To hold back, and so prevent from winning.",
                  "examples": [
                    "The favourite was pulled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) To take or make (a proof or impression); so called because hand presses were worked by pulling a lever.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, golf) To strike the ball in a particular manner. (See noun sense.)",
                  "examples": [
                    "Never pull a straight fast ball to leg."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK) To draw beer from a pump, keg, or other source.",
                  "examples": [
                    "Let's stop at Finnigan's. The barman pulls a good pint."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To take a swig or mouthful of drink.",
                  "examples": [
                    "Danny pulled at his beer and thought for a moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transportation, US, of a railroad car) To pull out from a yard or station; to leave.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly Scotland, England and US regional) To pluck or pick (flowers, fruit etc.).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}