{
  "word": "nativity",
  "etymologies": [
    {
      "description": [
        "From Middle English nativite, from Anglo-Norman nativite, Middle French nativite, and their source, Latin nātīvitās (“birth”). See also naïveté."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nativity (countable and uncountable, plural nativities)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dated) Someone's birth; the place, time and circumstances of a birth. [from 14th c.]",
                  "examples": [
                    "[…]  me semeth to be a souerayn wele to Incyte & exhorte men & wymmen to kepe them from slouthe & ydlenesse & to lete to be vnderstonden to suche peple as been not lettered the natyuytees, lyues, the passyons, the myracles and the dethe of the holy saynts  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) Someone's birth considered as a means of astrology; a horoscope associated with a person's birth. [from 14th c.]",
                  "examples": [
                    "Accordingly  […]  he was careful, as befitted a Fellow of the Royal Society, to note the exact nativity of his subjects whenever it could be discovered; in this way he hoped to make possible a scientific comparison of the course of human life with the astrological circumstances of its inception, and thus to arrive at a more exact astrology."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also with capital initial) The birth of Jesus. [from 14th c.]",
                  "examples": [
                    "Now we nowhere find warrant in Scripture for setting apart the day of Christ’s Nativity from common use to religious holy use."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, also with capital initial) The festival celebrating the birth of Jesus, Christmas Day; the festival celebrating the birth of the Virgin Mary or the birth of Saint John the Baptist. [from 12th c.]",
                  "examples": [
                    "Be it therefore enacted by the authority of this present parliament, that the said statute of repeal, and every thing therein contained  […]  shall be void and of none effect, from, and after the feast of the Nativity of S. John Baptist, next coming."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also with capital initial) A set of figurines used to create a nativity scene.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Origin; founding.",
                  "examples": [
                    "[…]  ’tis justly to be apprehended, that persecutions will put a speedy period to the Protestant religion in the place of its nativity."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Place of origin; place to which a species is native.",
                  "examples": [
                    "For a long time I believed the common yarrow to be introduced, as the country had been settled at least ten years before I saw it, but my belief in that is shaken, as I never sent for flowers by friends, when they went to an unknown region, but they inevitably brought yarrow. I have had it sent from Texas, Utah, Pike’s Peak and Long’s Peak, Colorado, and at last from the Alps and Germany; so its nativity is very uncertain."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality of being native or innate.",
                  "examples": [
                    "Much difference of opinion has prevailed with reference to the genuine nativity of this species [Vinca minor] in Britain."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}