{
  "word": "have",
  "etymologies": [
    {
      "description": [
        "From Middle English haven, from Old English hafian, habban (“to have”), from Proto-West Germanic *habbjan, from Proto-Germanic *habjaną (“to have”), durative of *habjaną (“to lift, take up”), from Proto-Indo-European *kh₂pyéti, present tense of *keh₂p- (“to take, seize, catch”). Related to heave.",
        "Since there is no common Indo-European root for a transitive possessive verb have (notice that Latin habeō is not etymologically related to English have), Proto-Indo-European probably lacked the have structure. Instead, the third person forms of be were used, with the possessor in dative case, compare Latin mihi est / sunt, literally to me is / are."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "have (plural haves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually contrastive) A wealthy or privileged person.",
                  "examples": [
                    "A good credit rating can mean the difference between being a have or a have not."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncommon) One who has some (contextually specified) thing.",
                  "examples": [
                    "Generally, I can assure you that a woman's posterior causes a stir, whether she's considered a have or a have not. But in most cases, men gravitate toward a pair of prominent gluteus muscles because they find this display appealing. This prominent protrusion can make a pair of jeans look like it was painted on, above just being good to look at. And by the way, it also incites some backshot (a Caribbean term for a well-known sex position) and spanking tendencies during sexual activity ..."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "have (third-person singular simple present has, present participle having, simple past and past participle had)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To possess, own.",
                  "examples": [
                    "I have a house and a car."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hold, as something at someone's disposal.",
                  "examples": [
                    "Look what I have here—a frog I found on the street!",
                    "Do you have the key? (not necessarily one's own key)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To include as a part, ingredient, or feature.",
                  "examples": [
                    "The stove has a handle. The shirt has sleeves.",
                    "The words cow and dog have three letters.",
                    "A government has three branches: the executive, legislative, and judicial.",
                    "The movie has lots of action."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Used to state the existence or presence of someone in a specified relationship with the subject.",
                  "examples": [
                    "I have two sisters.",
                    "She doesn’t have any friends.",
                    "I have a really mean boss."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To consume or use up (a particular substance or resource, especially food or drink).",
                  "examples": [
                    "I have breakfast at six o'clock.",
                    "You've already had five drinks!",
                    "She's had more than enough time already."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To undertake or perform (an action or activity).",
                  "examples": [
                    "Can I have a look at that?",
                    "He's having a tantrum about it.",
                    "I’m going to have a bath now.",
                    "Let’s have a game of tiddlywinks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be scheduled to attend, undertake or participate in.",
                  "examples": [
                    "What class do you have right now? I have English.",
                    "Fred won’t be able to come to the party; he has a meeting that day.",
                    "I have a lot of work to do."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To experience, go through, undergo.",
                  "examples": [
                    "We had a hard year last year, with the locust swarms and all that.",
                    "He had surgery on his hip yesterday.",
                    "I’m having the time of my life!",
                    "I hope you have a wonderful birthday.",
                    "This year we're having Christmas with my wife's family in Thunder Bay."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be afflicted with, suffer from.",
                  "examples": [
                    "He had a cold last week."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary verb, taking a past participle) Used in forming the perfect aspect.",
                  "examples": [
                    "I have already eaten today.",
                    "I had already eaten.",
                    "I will have left by the time you get here."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used as an interrogative verb before a pronoun to form a tag question, echoing a previous use of 'have' as an auxiliary verb or, in certain cases, main verb. (For further discussion, see the appendix English tag questions.)",
                  "examples": [
                    "They haven’t eaten dinner yet, have they?",
                    "Your wife hasn’t been reading that nonsense, has she?",
                    "He has some money, hasn’t he?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(auxiliary verb, taking a to-infinitive) See have to.",
                  "examples": [
                    "I have to go."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To give birth to.",
                  "examples": [
                    "The couple always wanted to have children.",
                    "My wife is having the baby right now!",
                    "My mother had me when she was 25."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually passive) To obtain.",
                  "examples": [
                    "The substance you describe can't be had at any price."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To engage in sexual intercourse with.",
                  "examples": [
                    "He’s always bragging about how many women he’s had."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To accept as a romantic partner.",
                  "examples": [
                    "Despite my protestations of love, she would not have me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive with bare infinitive) To cause to, by a command, request or invitation.",
                  "examples": [
                    "They had me feed their dog while they were out of town.",
                    "Her very boyfriend is the person the criminal has do most of her dirty deeds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive with adjective or adjective-phrase complement) To cause to be.",
                  "examples": [
                    "He had him arrested for trespassing.",
                    "The lecture’s ending had the entire audience in tears.",
                    "Jim has his eyes closed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive with bare infinitive) To be affected by an occurrence. (Used in supplying a topic that is not a verb argument.)",
                  "examples": [
                    "The hospital had several patients contract pneumonia last week.",
                    "I’ve had three people today tell me my hair looks nice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive with adjective or adjective-phrase complement) To depict as being.",
                  "examples": [
                    "Their stories differed; he said he’d been at work when the incident occurred, but her statement had him at home that entire evening."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) To defeat in a fight; take.",
                  "examples": [
                    "I could have him!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang) To inflict punishment or retribution on.",
                  "examples": [
                    "You broke the window! Teacher’ll have you for that!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated outside Ireland) To be able to speak (a language).",
                  "examples": [
                    "I have no German."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To feel or be (especially painfully) aware of.",
                  "examples": [
                    "Dan certainly has arms today, probably from scraping paint off four columns the day before."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, often passive) To trick, to deceive.",
                  "examples": [
                    "I bought a laptop online but it never arrived. I think I've been had!",
                    "You had me alright! I never would have thought that was just a joke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, in the negative, often in continuous tenses) To allow; to tolerate.",
                  "examples": [
                    "The child screamed incessantly for his mother to buy him a toy, but she wasn't having any of it.",
                    "I asked my dad if I could go to the concert this Thursday, but he wouldn't have it since it's a school night."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, often used in the negative) To believe, buy, be taken in by.",
                  "examples": [
                    "I made up an excuse as to why I was out so late, but my wife wasn't having any of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To host someone; to take in as a guest.",
                  "examples": [
                    "Thank you for having me!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To get a reading, measurement, or result from an instrument or calculation.",
                  "examples": [
                    "What do you have for problem two?",
                    "I have two contacts on my scope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, of a jury) To consider a court proceeding that has been completed; to begin deliberations on a case.",
                  "examples": [
                    "We’ll schedule closing arguments for Thursday, and the jury will have the case by that afternoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, birdwatching) To make an observation of (a bird species).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From have on (“to deceive”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "have (plural haves)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, informal) A fraud or deception; something misleading.",
                  "examples": [
                    "They advertise it as a great deal, but I think it's a bit of a have."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}