{
  "word": "remembrance",
  "etymologies": [
    {
      "description": [
        "From Middle English remembraunce, from Old French remembrance, from remembrer (“to remember”), from Late Latin rememorārī (“to call to mind, to remember”). Equivalent to remember +‎ -ance."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "remembrance (countable and uncountable, plural remembrances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of remembering; a holding in mind, or bringing to mind; recollection.",
                  "examples": [
                    "For Titan, by the mightly Loſs [of Phaëthon] diſmay'd, / Among the Heav'ns th'Immortal Fact diſplay'd, / Leſt the remembrance of his Grief ſhould fail, / And in Conſtellations wrote his Tale. [Translation of a work by Claudian.]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of being remembered, or held in mind; memory, recollection.",
                  "examples": [
                    "Yes, and did ſee ſuch things there, the remembrance of which will ſtick by me as long as I live; ſpecially three things, to wit, How Chriſt, in deſpite of Satan, maintains his work of Grace in the heart; how the Man had ſinned himſelf quite out of hopes of Gods mercy; and alſo the Dream of him that thought in his ſleep the day of Judgement was come."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something remembered; a person or thing kept in memory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which serves to keep in or bring to mind; a memento, a memorial, a souvenir, a token; a memorandum or note of something to be remembered.",
                  "examples": [
                    "[stanza I] A Gentle Knight was pricking on the Plain, / Yclad in mightie Arms and ſilver Shield,  […]  / [stanza II] And on his Breaſt a bloody Croſs he bore, / The dear remembrance of his dying Lord, / For whoſe ſweet ſake that glorious Badge he wore, / And dead (as living) ever him ador'd:  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The power of remembering; the reach of personal knowledge; the period over which one's memory extends.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Something to be remembered; an admonition, counsel, instruction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "remembrance (third-person singular simple present remembrances, present participle remembrancing, simple past and past participle remembranced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remember; to recall to mind.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}