{
  "word": "grow",
  "etymologies": [
    {
      "description": [
        "From Middle English growen, from Old English grōwan (“to grow, increase, flourish, germinate”), from Proto-West Germanic *grōan, from Proto-Germanic *grōaną (“to grow, grow green”), from Proto-Indo-European *gʰreh₁- (“to grow, become green”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "grow (third-person singular simple present grows, present participle growing, simple past grew or (dialectal) growed, past participle grown or (dialectal) growed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative) To become larger, to increase in magnitude.",
                  "examples": [
                    "Children grow quickly."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ergative, of plants) To undergo growth; to be present (somewhere)",
                  "examples": [
                    "Apples now grow all over the world."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To appear or sprout.",
                  "examples": [
                    "Leaf buds grew on the trees with the advance of spring.",
                    "A long tail began to grow from his backside."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To develop, to mature.",
                  "examples": [
                    "As I grew throughout adolescence, I came to appreciate many things about human nature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause or allow something to become bigger, especially to cultivate plants.",
                  "examples": [
                    "He grows peppers and squash each summer in his garden.",
                    "Have you ever grown your hair before?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(copulative) To assume a condition or quality over time.",
                  "examples": [
                    "The boy grew wise as he matured.",
                    "The town grew smaller and smaller in the distance as we travelled.",
                    "You have grown strong."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To become attached or fixed; to adhere.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}