{
  "word": "freeze",
  "etymologies": [
    {
      "description": [
        "From Middle English fresen, from Old English frēosan (“to freeze”), from Proto-West Germanic *freusan, from Proto-Germanic *freusaną (“to frost, freeze”), from Proto-Indo-European *prews- (“to frost, freeze”).",
        "Cognate with Scots frese (“to freeze”), Saterland Frisian frjoze (“to freeze”), West Frisian frieze (“to freeze”), Dutch vriezen (“to freeze”), Low German freren, freern, fresen (“to freeze”), German frieren (“to freeze”), Norwegian fryse, Swedish frysa (“to freeze”), Latin pruīna (“hoarfrost”), Welsh (Northern) rhew (“frost, ice”), and Sanskrit प्रुष्व (pruṣvá, “water drop, frost”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "freeze (third-person singular simple present freezes, present participle freezing, simple past froze, past participle frozen or (now colloquial) froze)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, copulative) Especially of a liquid, to become solid due to low temperature.",
                  "examples": [
                    "The lake froze solid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To lower something's temperature to the point that it freezes or becomes hard.",
                  "examples": [
                    "Don't freeze meat twice."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To drop to a temperature below zero degrees celsius, where water turns to ice.",
                  "examples": [
                    "It didn't freeze this winter, but last winter was very harsh."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, informal) To be affected by extreme cold.",
                  "examples": [
                    "It's freezing in here!",
                    "Don't go outside wearing just a t-shirt; you'll freeze!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (of machines and software) To come to a sudden halt, stop working (functioning).",
                  "examples": [
                    "Since the last update, the program freezes after a few minutes of use.",
                    "Synonym: freeze up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (of people and other animals) To stop (become motionless) or be stopped due to attentiveness, fear, surprise, etc.",
                  "examples": [
                    "Despite all of the rehearsals, I froze as soon as I got on stage.",
                    "Synonym: freeze up"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause someone to become motionless.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To lose or cause to lose warmth of feeling; to shut out; to ostracize.",
                  "examples": [
                    "Over time, he froze towards her, and ceased to react to her friendly advances."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause loss of animation or life in, from lack of heat; to give the sensation of cold to; to chill.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To prevent the movement or liquidation of a person's financial assets",
                  "examples": [
                    "The court froze the criminal's bank account."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of prices, spending etc., to keep at the same level, without any increase.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To prevent from showing any visible change.",
                  "examples": [
                    "Some websites, such as YouTube, deliberately freeze the view count, intended to deter attempts to game the system."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "See the above verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "freeze (plural freezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of intensely cold weather.",
                  "examples": [
                    "In order to work properly, the cotton stripper required that the plant be brown and brittle, as happened after a freeze, so that the cotton bolls could snap off easily."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A halt of a regular operation.",
                  "examples": [
                    "Without a freeze it might be possible to proceed with the production and deployment of such destabilizing systems as the MX, Trident II, cruise missiles and SS-18s, -19s and -20s."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) The state when either a single computer program, or the whole system ceases to respond to inputs.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A precise draw weight shot where a delivered stone comes to a stand-still against a stationary stone, making it nearly impossible to knock out.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, finance) A block on pay rises or on the hiring of new employees etc.",
                  "examples": [
                    "a hiring freeze;  a pay freeze"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "freeze (plural freezes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Obsolete form of frieze.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}