{
  "word": "shout",
  "etymologies": [
    {
      "description": [
        "From Middle English shouten. Further origin uncertain. Possibly related to Middle English shooten (“to shoot (out)”) or from or akin to Old Norse skúta (“to chide, scold”), Old Norse skúti, skúta (“a taunt”). See also the second, rare sense of the verb scout (“to reject with contempt”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shout (plural shouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A loud burst of voice or voices; a violent and sudden outcry, especially that of a multitude expressing joy, triumph, exultation, anger, or great effort.",
                  "examples": [
                    "give out a shout",
                    "hear a desperate shout",
                    "an ear-piercing shout"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, New Zealand, slang) A round of drinks in a pub; the turn to pay the shot or scot; an act of paying for a round of drinks.",
                  "examples": [
                    "“I′ll get my wine though,” taking out her wallet.",
                    "“No. This is my shout,” holding up his hand as though to ward her money off."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, Australia, slang) A call-out for an emergency services team.",
                  "examples": [
                    "Yet another ambulance on a shout enters Parliament Square."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A greeting, name-check or other mention, for example on a radio or TV programme.",
                  "examples": [
                    "Synonym: shout out",
                    "Next up the new single from Beyoncé, but first a shout to Barry Bloggins and his wife Belinda..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A suggestion; an idea.",
                  "examples": [
                    "Yeah, good shout. We might get an idea of what we're up against before we park up and do business."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shout (third-person singular simple present shouts, present participle shouting, simple past and past participle shouted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To utter a sudden and loud cry, as in joy, triumph, exultation or anger, or to attract attention, to animate others, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To utter with a shout; to cry; to shout out",
                  "examples": [
                    "They shouted his name to get his attention."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia, New Zealand, slang) To pay for food, drink or entertainment for others.",
                  "examples": [
                    "Synonym: treat"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To post a text message (for example, email) in upper case, regarded as the electronic messaging equivalent of oral shouting.",
                  "examples": [
                    "Please don't shout in the chat room."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To treat with shouts or clamor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shout (plural shouts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, dialect) A light flat-bottomed boat used in duck-shooting.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}