{
  "word": "court",
  "etymologies": [
    {
      "description": [
        "From Middle English court, from Old French cort, curt, from Latin cōrtem (accusative of cōrs), ultimately from cohors. Doublet of cohort."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "court (plural courts)",
          "definitionGroups": [
            {
              "group": "An enclosed space; a courtyard; an uncovered area shut in by the walls of a building, or by different buildings; also, a space opening from a street and nearly surrounded by houses; a blind alley.",
              "entries": [
                {
                  "meaning": "(Australia, US) A street with no outlet, a cul-de-sac.",
                  "examples": []
                },
                {
                  "meaning": "(Hong Kong, only used in names) A housing estate under the House Ownership Scheme.",
                  "examples": []
                },
                {
                  "meaning": "(Hong Kong, only used in names) An apartment building, or a small development of several apartment buildings.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(social) Royal society.",
              "entries": [
                {
                  "meaning": "The residence of a sovereign, prince, nobleman, or other dignitary; a palace.",
                  "examples": [
                    "The noblemen visited the queen in her court."
                  ]
                },
                {
                  "meaning": "The collective body of persons composing the retinue of a sovereign or person high in authority; all the surroundings of a sovereign in his regal state.",
                  "examples": [
                    "The queen and her court traveled to the city to welcome back the soldiers."
                  ]
                },
                {
                  "meaning": "Any formal assembling of the retinue of a sovereign.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Attention directed to a person in power; behaviour designed to gain favor; politeness of manner; civility towards someone",
                  "examples": []
                }
              ]
            },
            {
              "group": "(law) The administration of law.",
              "entries": [
                {
                  "meaning": "The hall, chamber, or place, where justice is administered.",
                  "examples": [
                    "Many famous criminals have been put on trial in this court."
                  ]
                },
                {
                  "meaning": "The persons officially assembled under authority of law, at the appropriate time and place, for the administration of justice; an official assembly, legally met together for the transaction of judicial business; a judge or judges sitting for the hearing or trial of cases.",
                  "examples": [
                    "The court started proceedings at 11 o'clock."
                  ]
                },
                {
                  "meaning": "(often capitalized) The judge or judges or other judicial officer presiding in a particular matter, particularly as distinguished from the counsel or jury, or both.",
                  "examples": []
                },
                {
                  "meaning": "The session of a judicial assembly.",
                  "examples": [
                    "The court is now in session."
                  ]
                },
                {
                  "meaning": "Any jurisdiction, civil, military, or ecclesiastical.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(sports) A place arranged for playing the games of tennis, basketball, handball, badminton, volleyball, squash and some other games",
              "entries": [
                {
                  "meaning": "one of the two divisions of a tennis, badminton or volleyball court, in which the player or players of each team play",
                  "examples": [
                    "The photograph at left captures a great serve by Dr. Sadowsky, who will never forget one of Bobby Riggs's serves, which had such a great spin that it landed in his court and bounced back to the other side of the net before he had a chance to return it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "court (third-person singular simple present courts, present participle courting, simple past and past participle courted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To seek to achieve or win.",
                  "examples": [
                    "He was courting big new accounts that previous salesman had not attempted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To risk (a consequence, usually negative).",
                  "examples": [
                    "He courted controversy with his frank speeches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To try to win a commitment to marry from.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To engage in behavior leading to mating.",
                  "examples": [
                    "The bird was courting by making an elaborate dance."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to attract.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To invite by attractions; to allure; to attract.",
                  "examples": [
                    "Synonyms: charm, entrance; see also Thesaurus:allure"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attempt to gain alliance with.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in activities intended to win someone's affections.",
                  "examples": [
                    "Synonyms: romance, solicit; see also Thesaurus:woo",
                    "She's had a few beaus come courting."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To engage in courtship behavior.",
                  "examples": [
                    "In this season, you can see many animals courting."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}