{
  "word": "geyser",
  "etymologies": [
    {
      "description": [
        "From the name of a particular Icelandic geyser which is mentioned as early as the 1760s in The Annual Register, as “Geyser, a wonderful spring in the valley of Haukadal”. From Geysir (“Gusher”), the Icelandic name of the hot spring in Iceland (see Wikipedia), from the verb geysa (“to gush”), from Old Norse geysa (“to gush”).  Doublet of gusher."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "geyser (plural geysers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(planetology, geology, volcanology) A boiling natural spring which throws forth jets of water, mud, etc., at frequent intervals, driven upwards by the expansive power of steam.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A momentary vertical jet or fountain of fluid driven upwards by a violent force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, archaic) An instantaneous, and often dangerous, hot water heater.",
                  "examples": [
                    "Where a Geyser or hot-water heater is used it is a good and wise precaution to see that the bath-room, &c., when it is used is well ventilated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(South Africa, India) A domestic water boiler.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "geyser (third-person singular simple present geysers, present participle geysering, simple past and past participle geysered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To (cause to) rush or burst upward like water from a geyser.",
                  "examples": [
                    "Four jets of water geysered upward from the sea. Short and wide. He noted it. Ranging salvo. His division was discovered."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}