{
  "word": "troll",
  "etymologies": [
    {
      "description": [
        "From Norwegian or Swedish troll or Danish trold, from Old Norse trǫll (“witch, mage, conjurer”) (compare Icelandic tröll), related to Middle High German trolle (“spook, wraith, monster, ogre”). From Proto-Germanic *truzlą (“a supernatural being; demon; fiend; giant; monster”). Norwegian fortrylle (“to bewitch”), Norwegian and Danish trylle (“to conjure”) and Swedish trolla (“to conjure”). Doublet of droll."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "troll (plural trolls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fantasy) A supernatural being of varying size, now especially a grotesque humanoid creature living in caves or hills or under bridges. [from early 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) An ugly person of either sex, especially one seeking sexual experiences.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astronomy, meteorology) Optical ejections from the top of the electrically active core regions of thunderstorms that are red in color that seem to occur after tendrils of vigorous sprites extend downward toward the cloud tops.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trollen (“to go about, stroll, roll from side to side”), from Old French troller (“to quest, to wander”) (French trôler), of Germanic origin, ultimately from Proto-Germanic *truzlōną (“to lumber”), which is probably related to *trudaną (“to tread, step on”). Related to Middle High German trollen (“to stroll”), Middle Low German drullen (“to stroll”).",
        "Fishing sense possibly influenced by trawl and/or trail; internet sense influenced by Etymology 1."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "troll (plural trolls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An instance of trolling, especially, in fishing, the trailing of a baited line. [from circa 1600]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, now also used outside of internet) A person who posts or says inflammatory, insincere, digressive, extraneous, or off-topic messages to provoke others on the Internet for their own personal amusement or to manipulate others' perception. [from late 20th c.]",
                  "examples": [
                    "Coordinate term: griefer",
                    "Hyponym: keyboard warrior"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "troll (third-person singular simple present trolls, present participle trolling, simple past and past participle trolled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To saunter. [from late 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To trundle, to roll from side to side. [from early 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively) To draw someone or something out, to entice, to lure as if with trailing bait. [from the 1500s]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, fishing, by extension) To fish using a line and bait or lures trailed behind a boat similarly to trawling; to lure fish with bait. [from circa 1600]",
                  "examples": [
                    "Their young men  […]  trolled along the brooks that abounded in fish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To angle for with a trolling line, or with a hook drawn along the surface of the water; hence, to allure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To fish in; to try to catch fish from.",
                  "examples": [
                    "With patient angle trolls the finny deep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To stroll about in order to find a sexual partner. [from 20th c.]",
                  "examples": [
                    "Synonym: cruise",
                    "He spends most of his waking hours trolling on WIRE."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, Internet slang, now also used outside of internet) To post or make inflammatory or insincere statements so as to attempt to lure others into combative argument for purposes of personal entertainment or to manipulate others' perception, especially in an online community or discussion. [from late 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trollen, trollin (“to walk, wander”). Cognate with Low German trullen (“to troll”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "troll (plural trolls)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of moving round; routine; repetition.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A song whose parts are sung in succession; a catch; a round.",
                  "examples": [
                    "Thence the catch and troll, while \"Laughter, holding both his sides,\" sheds tears to song and ballad pathetic on the woes of married life."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A trolley.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "troll (third-person singular simple present trolls, present participle trolling, simple past and past participle trolled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, obsolete) To move circularly; to roll; to turn. [from the 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To send about; to circulate, as a vessel in drinking.",
                  "examples": [
                    "Then doth she troll to the bowl."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive, archaic) To sing the parts of in succession, as of a round, a catch, and the like; also, to sing loudly, freely or in a carefree way. [from the 16th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}