{
  "word": "impregnable",
  "etymologies": [
    {
      "description": [
        "From Late Middle English imprenable, impregnable (“impossible to capture, impregnable”), from Old French imprenable (modern French imprenable (“impregnable”)), from im- (a variant of in- (prefix meaning ‘not’) + prenable (“(military) of a building, position, etc.: takable”) (from prendre (“to take”) + -able (suffix meaning ‘creating an effect or influence’)). Prendre is derived from Latin prēndere, present active infinitive of prēndō, a variant of prehendō (“to catch, lay hold of; to grasp; to grab, snatch; to seize, take”), ultimately from Proto-Indo-European *gʰed- (“to find; to hold; to seize, take”). The intrusive g in the English word was modelled after words like deign and reign."
      ],
      "adjectives": [
        {
          "description": "impregnable (comparative more impregnable, superlative most impregnable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military) Of a fortress or other fortified place: able to withstand all attacks; impenetrable, inconquerable, unvanquishable.",
                  "examples": [
                    "Synonyms: breachless, inexpugnable, unassailable",
                    "Antonyms: pregnable, unimpregnable"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Too strong to be defeated or overcome; invincible.",
                  "examples": [
                    "Synonyms: inconquerable, unconquerable, undefeatable",
                    "Antonyms: conquerable, defeatable, pregnable, vincible"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From impregnate (verb) +‎ -able (suffix meaning ‘able or fit to be done’ forming adjectives). Impregnate is either derived from impregnate (“pregnant”, adjective), or from its etymon Medieval Latin or Late Latin impraegnātus (“made pregnant”), past participle of impraegnō (“to make pregnant”), from Latin im- (a variant of in- (prefix meaning ‘in, inside, within’) + praegnāre (“pregnant”) (from praegnāns, a variant of praegnās (“pregnant”), from prae- (prefix meaning ‘before; in front’) + gnāscor (archaic), nāscor (“to be born; to grow, spring forth; to arise, proceed”) (ultimately from Proto-Indo-European *ǵenh₁- (“to beget; to give birth; to produce”)))."
      ],
      "adjectives": [
        {
          "description": "impregnable (comparative more impregnable, superlative most impregnable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Capable of being impregnated; impregnatable.",
                  "examples": [
                    "Antonym: unimpregnable"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}