{
  "word": "pope",
  "etymologies": [
    {
      "description": [
        "From Middle English pope, popa, from Old English pāpa, from Vulgar Latin papa (title for priests and bishops, esp. and by 8th c. only the bishop of Rome), from early Byzantine Greek παπᾶς (papâs, title for priests and bishops, especially by 3rd c. the bishop of Alexandria), from late Ancient Greek πάπας (pápas, title for priests and bishops, in the sense of spiritual father), from πάππας (páppas, “papa, daddy”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pope (plural popes)",
          "definitionGroups": [
            {
              "group": "(Roman Catholicism and generally) An honorary title of the Roman Catholic bishop of Rome as father and head of his church, a sovereign of the Vatican city state.",
              "entries": [
                {
                  "meaning": "(by extension, now often ironic) Any similarly absolute and 'infallible' authority.",
                  "examples": [
                    "We often say, that every man has a pope in his belly."
                  ]
                },
                {
                  "meaning": "(by extension) Any similar head of a religion.",
                  "examples": [
                    "In þat yle dwelleth the Pope of hire lawe, þat þei clepen lobassy."
                  ]
                },
                {
                  "meaning": "(uncommon) A theocrat, a priest-king, including (at first especially) over the imaginary land of Prester John or (now) in figurative and alliterative uses.",
                  "examples": [
                    "Eche day there etyn in his court xii erchebeshopis and xx bishopis, and the patriak of Seynt Thomays is as here pope."
                  ]
                },
                {
                  "meaning": "(UK) An effigy of the pope traditionally burnt in Britain on Guy Fawkes' Day and (occasionally) at other times.",
                  "examples": [
                    "This is the only piece in which the author has given a hint of his religion, by ridiculing the ceremony of burning the pope, and by mentioning with some indignation the inscription  […]"
                  ]
                },
                {
                  "meaning": "(US, obsolete) Pope Day, the present Guy Fawkes Day.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Coptic Church) An honorary title of the Coptic bishop of Alexandria as father and head of his church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Eastern Orthodoxy) An honorary title of the Orthodox bishop of Alexandria as father and head of his autocephalous church.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, historical, obsolete) Any bishop of the early Christian church.",
                  "examples": [
                    "All notable Bishops were then called popes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) The ruffe, a small Eurasian freshwater fish (Gymnocephalus cernua); others of its genus.",
                  "examples": [
                    "Byfleet-river, wherein are very large pikes, jack, and tench ; perch, of eighteen inches long ; good carp, large flounders, bream, roach, dace, gudgeons, popes, large chub, and eels."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK regional, Cumberland, Cornwall, Devon, Scotland) The Atlantic puffin (Fratercula arctica).",
                  "examples": [
                    "Alca genus; 6 species, including the razorbill, the penguin, the pope, and others."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US regional) The painted bunting (Passerina ciris).",
                  "examples": [
                    "The Pope is of a bright blue round the head; on the throat it is of a fine red, and on the back of a gold green colour, it sings very finely and is the size of a canary bird."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare) The red-cowled cardinal (Paroaria dominicana).",
                  "examples": [
                    "From the sketch of the bird which you have sent us, there is no doubt about its being the Pope Grosbeak, which is a species of the Cardinal, but not the crested one."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pope (third-person singular simple present popes, present participle poping, simple past and past participle poped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive or with 'it') To act as or like a pope.",
                  "examples": [
                    "Paul popith Jolyly, that woll desire the worlde to pray for the kinges apeyrement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To convert to Roman Catholicism.",
                  "examples": [
                    "I'm not going to ‘Pope’ until after the war (if I'm alive)."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "By analogy with bishop (“mulled and spiced wine”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pope (plural popes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(alcoholic beverages) Any mulled wine (traditionally including tokay) considered similar and superior to bishop.",
                  "examples": [
                    "When made with Burgundy or Bordeaux, the mixture was called Bishop; when with old Rhenish, its name was Cardinal; and when with Tokay, it was dignified with the title of Pope."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Russian поп (pop), from Old Church Slavonic попъ (popŭ), from Byzantine Greek παπᾶς (papâs) as above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pope (plural popes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Russian Orthodoxy) Alternative form of pop, a Russian Orthodox priest.",
                  "examples": [
                    "The other Ecclesiastical Orders are distinguish'd into Proto-popes, Popes, (or Priests) and Deacons."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Of Onomatopoeic origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pope (plural popes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialectal, obsolete) whippoorwill (Antrostomus vociferus, syn. Caprimulgus vociferus).",
                  "examples": [
                    "The Whipperwill has so named itself by its nocturnal songs. It is also called the pope, by reason of its darting with great swiftness, from the clouds almost to the ground, and bawling out Pope!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, dialectal, rare) nighthawk (Chordeiles minor).",
                  "examples": [
                    "Common Nighthawk... Pope (Conn[ecticut]. From the sound made by its wings while dropping through the air)."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}