{
  "word": "critical",
  "etymologies": [
    {
      "description": [
        "From Latin criticus +‎ -al, from Ancient Greek κριτικός (kritikós, “of or for judging, able to discern”), from\nκρίνω (krínō, “I separate, judge”); also the root of crisis."
      ],
      "adjectives": [
        {
          "description": "critical (comparative more critical, superlative most critical)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Inclined to find fault or criticize.",
                  "examples": [
                    "Synonyms: fastidious, captious, censorious, exacting",
                    "A good teacher is fair but critical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to, or indicating, a crisis or turning point.",
                  "examples": [
                    "This is a critical moment."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Extremely important.",
                  "examples": [
                    "Synonyms: crucial, imperative",
                    "It's critical that you deliver this on time."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to criticism or careful analysis, such as literary or film criticism.",
                  "examples": [
                    "The movie was a critical success, but bombed at the box-office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine) Of a patient condition involving unstable vital signs and a prognosis that predicts the condition could worsen; or, a patient condition that requires urgent treatment in an intensive care or critical care medical facility.",
                  "examples": [
                    "Coordinate terms: fair, serious, stable",
                    "The patient's condition is critical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Likely to go out of control if disturbed, that is, opposite of stable.",
                  "examples": [
                    "The political situation was so critical that the government declared the state of siege."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Of the point (in temperature, reagent concentration etc.) where a nuclear or chemical reaction becomes self-sustaining.",
                  "examples": [
                    "The reaction was about to become critical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics) Of a temperature that is equal to the temperature of the critical point of a substance, i.e. the temperature above which the substance cannot be liquefied.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "critical (plural criticals)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A critical value, factor, etc.",
                  "examples": [
                    "Finally, criticals are high-risk, high-value items that give the final product a competitive advantage in the marketplace  […]  Criticals, in part, determine the customer's ultimate cost of using the finished product — in our example, the computer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In breakdancing, a kind of airflare move in which the dancer hops from one hand to the other.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}