{
  "word": "hike",
  "etymologies": [
    {
      "description": [
        "From English dialectal hyke (“to walk vigorously”), probably a Northern form of hitch, from Middle English hytchen, hichen, icchen (“to move, jerk, stir”). Cognate with Scots hyke (“to move with a jerk”), dialectal German hicken (“to hobble, walk with a limp”), Danish hinke (“to hop”). More at hick."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hike (plural hikes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A long walk, usually for pleasure or exercise. [from c. 1900]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An abrupt increase.",
                  "examples": [
                    "Antonym: cut (used in same context); decrease",
                    "The tenants were not happy with the rent hike."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) The snap of the ball to start a play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp upward tug to raise something.",
                  "examples": [
                    "She gave a cute hike of her skirt as she spun and almost sauntered down the stairs."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hike (third-person singular simple present hikes, present participle hiking, simple past and past participle hiked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take a long walk for pleasure or exercise.",
                  "examples": [
                    "Don't forget to bring the map when we go hiking tomorrow."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To unfairly or suddenly raise a price.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) To snap the ball to start a play.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To lean out to the windward side of a sailboat in order to counterbalance the effects of the wind on the sails.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pull up or tug upwards sharply.",
                  "examples": [
                    "She hiked her skirt up."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}