{
  "word": "pig",
  "etymologies": [
    {
      "description": [
        "From Middle English pigge (“pig, pigling”) (originally a term for a young pig, with adult pigs being swyn), apparently from Old English *picga (attested only in compounds, such as picgbrēad (“mast, pig-fodder”)), from Proto-West Germanic *piggō, *puggō (“piglet”). Compare Middle Dutch pogge, puggen, pigge, pegsken (“pigling”), Middle Low German pugge, pûke (“piglet”). The word applied to an immature animal rapidly gaining weight, so it probably derives from the verb \"to big\" (build, increase), from Middle English biggen, byggen, from Old Norse byggja, byggva (“to build”), from Proto-Germanic *būwijaną (“to build”),  from PIE *bʰuH- (“to become, to grow”). Pokorny suggests this root might be somehow related to *bū-, *bew- (“to blow; swell”), which could account for the alternation between \"pig\" and \"big\".",
        "A connection to early modern Dutch bigge (contemporary big (“piglet”)), West Frisian bigge (“pigling”), and similar terms in Middle Low German is sometimes proposed, \"but the phonology is difficult\". Some sources say the words are \"almost certainly not\" related, others consider a relation \"probable, but not certain\".",
        "The slang sense of \"police officer\" is attested since at least 1785."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pig (countable and uncountable, plural pigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any of several mammalian species of the genus Sus, having cloven hooves, bristles and a nose adapted for digging; especially the domesticated animal Sus domesticus.",
                  "examples": [
                    "Synonyms: see Thesaurus:pig",
                    "The man kept a pen with two pigs that he fed everything from carrots to cabbage."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) A young swine, a piglet (contrasted with a hog, an adult swine).",
                  "examples": [
                    "Weanlings grow into feeder pigs, and feeder pigs grow into slaughter hogs.  […]  Ultimately the end use for virtually all pigs and hogs is to be slaughtered for the production of pork and other products."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The edible meat of such an animal; pork.",
                  "examples": [
                    "Some religions prohibit their adherents from eating pig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A light pinkish-red colour, like that of a pig (also called pig pink).",
                  "examples": [
                    "pig:"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) Someone who overeats or eats rapidly and noisily.",
                  "examples": [
                    "Synonyms: see Thesaurus:glutton",
                    "You gluttonous pig! Now that you've eaten all the cupcakes, there will be none for the party!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A lecherous or sexist man.",
                  "examples": [
                    "She considered him a pig as he invariably stared at her bosom when they talked."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory, slang) A dirty or slovenly person.",
                  "examples": [
                    "He was a pig and his apartment a pigpen; take-away containers and pizza boxes in a long, moldy stream lined his counter tops."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A very obese person.",
                  "examples": [
                    "Synonyms: see Thesaurus:fat person"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly US, UK, Australia, derogatory, slang) A police officer. [From ante 1785.]",
                  "examples": [
                    "Synonyms: see Thesaurus:police officer",
                    "The protester shouted, “Don't give in to the pigs!” as he was arrested."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A difficult problem.",
                  "examples": [
                    "Hrm... this one's a real pig: I've been banging my head against the wall over it for hours!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable and uncountable) A block of cast metal.",
                  "examples": [
                    "The conveyor carried the pigs from the smelter to the freight cars.",
                    "After the ill-advised trade, the investor was stuck with worthless options for 10,000 tons of iron pig."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The mold in which a block of metal is cast.",
                  "examples": [
                    "The pig was cracked, and molten metal was oozing from the side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lead container used for radioactive waste.",
                  "examples": [
                    "Taylor also bought a pig—a radiation-shielding container made of thick lead—to stash the most radioactive materials in."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A device for cleaning or inspecting the inside of an oil or gas pipeline, or for separating different substances within the pipeline. Named for the pig-like squealing noise made by their progress.",
                  "examples": [
                    "Unfortunately, the pig sent to clear the obstruction got lodged in a tight bend, adding to the problem."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, military, slang) The general-purpose M60 machine gun, considered to be heavy and bulky.",
                  "examples": [
                    "Unfortunately, the M60 is about twenty-four pounds and is very unbalanced. You try carrying the pig around the jungle and see how you feel."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A simple dice game in which players roll the dice as many times as they like, either accumulating a greater score or losing previous points gained.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, obsolete) A sixpence.",
                  "examples": [
                    "Synonym: sow's baby"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pig (third-person singular simple present pigs, present participle pigging, simple past and past participle pigged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of swine) to give birth.",
                  "examples": [
                    "The black sow pigged at seven this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To greedily consume (especially food).",
                  "examples": [
                    "They were pigging on the free food at the bar."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To huddle or lie together like pigs, in one bed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To live together in a crowded filthy manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, engineering) To clean (a pipeline) using a pig (the device).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Unknown. See piggin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pig (plural pigs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) earthenware, or an earthenware shard",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An earthenware hot-water jar to warm a bed; a stone bed warmer",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}