{
  "word": "pelt",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English pelt (“skin of a sheep, especially without the wool”); further etymology uncertain, possibly:",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pelt (plural pelts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The skin of an animal with the hair or wool on; either a raw or undressed hide, or a skin preserved with the hair or wool on it (sometimes worn as a garment with minimal modification).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(also figuratively) The skin of an animal (especially a goat or sheep) with the hair or wool removed, often in preparation for tanning.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The fur or hair of a living animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Ireland, humorous, informal) Human skin, especially when bare; also, a person's hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(obsolete)",
              "entries": [
                {
                  "meaning": "A garment made from animal skins.",
                  "examples": []
                },
                {
                  "meaning": "(falconry) The body of any quarry killed by a hawk; also, a dead bird given to a hawk for food.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pelt (third-person singular simple present pelts, present participle pelting, simple past and past participle pelted) (transitive)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To remove the skin from (an animal); to skin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Chiefly followed by from: to remove (the skin) from an animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, rare) To remove feathers from (a bird).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "The verb is derived from Late Middle English pelt, pelte; further origin uncertain, probably a variant of Late Middle English pilten (“to push, thrust; to strike; to cast down, humble; to incite, induce; to place, put; to extend, reach forward with”) [and other forms], possibly from Old English *pyltan, from Late Latin *pultiare, from Latin pultare (“to beat, knock, strike”), the frequentative of pellere, the present active infinitive of pellō (“to drive, impel, propel, push; to hurl; to banish, eject, expel, thrust out; to beat, strike; to set in motion”), ultimately from Proto-Indo-European *pel- (“to beat; to drive, push”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pelt (plural pelts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A beating or falling down of hailstones, rain, or snow in a shower.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic except Ireland) A blow or stroke from something thrown.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(figuratively, archaic)",
              "entries": [
                {
                  "meaning": "(except Ireland) A verbal insult; a jeer, a jibe, a taunt.",
                  "examples": []
                },
                {
                  "meaning": "(except Midlands, Southern England (South West)) A fit of anger; an outburst, a rage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Northern England except in at (full) pelt) An act of moving quickly; a rush.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pelt (third-person singular simple present pelts, present participle pelting, simple past and past participle pelted)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "To bombard (someone or something) with missiles.",
                  "examples": [
                    "Synonyms: bethwack; see also Thesaurus:hit",
                    "The children are pelting each other with snowballs.",
                    "They pelted the attacking army with bullets."
                  ]
                },
                {
                  "meaning": "To force (someone or something) to move using blows or the throwing of missiles.",
                  "examples": []
                },
                {
                  "meaning": "Of a number of small objects (such as raindrops), or the sun's rays: to beat down or fall on (someone or something) in a shower.",
                  "examples": []
                },
                {
                  "meaning": "Chiefly followed by at: to (continuously) throw (missiles) at.",
                  "examples": [
                    "Synonym: cockshy",
                    "The children pelted apples at us."
                  ]
                },
                {
                  "meaning": "(archaic except Britain, dialectal) To repeatedly beat or hit (someone or something).",
                  "examples": []
                },
                {
                  "meaning": "(figuratively) To assail (someone) with harsh words in speech or writing; to abuse, to insult.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "Especially of hailstones, rain, or snow: to beat down or fall forcefully or heavily; to rain down.",
                  "examples": [
                    "It’s pelting down out there!"
                  ]
                },
                {
                  "meaning": "(figuratively) To move rapidly, especially in or on a conveyance.",
                  "examples": [
                    "The boy pelted down the hill on his toboggan."
                  ]
                },
                {
                  "meaning": "(archaic, also figuratively) Chiefly followed by at: to bombard someone or something with missiles continuously.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To throw out harsh words; to show anger.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "Uncertain; possibly related to pelting (“mean, paltry”) (obsolete), peltry (“rubbish, trash; an unpleasant thing”) (chiefly Scotland, obsolete), and paltry (“of little value, trashy, trivial; contemptibly unimportant, despicable”), possibly from a Germanic language such as Middle Low German palte, palter (“cloth; rag, shred”), from Old Saxon *paltro, *palto (“cloth; rag”), from Proto-Germanic *paltrô, *paltô (“patch; rag, scrap”). The ultimate origin is uncertain, but the word is possibly derived from Proto-Indo-European *polto- (“cloth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pelt (plural pelts) (archaic except Kent, Scotland)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tattered or worthless piece of clothing; a rag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) Anything in a ragged and worthless state; rubbish, trash.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Uncertain; possibly related to palter (“to talk insincerely; to prevaricate or equivocate in speech or actions; to haggle; to babble, chatter; (rare) to trifle”), further etymology unknown. The Oxford English Dictionary takes the view that any relation to pelting (“mean, paltry”) (obsolete) and paltry (“of little value, trashy, trivial; contemptibly unimportant, despicable”) is unlikely."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pelt (third-person singular simple present pelts, present participle pelting, simple past and past participle pelted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To bargain for a better deal; to haggle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "A variant of pelta, borrowed from Latin pelta, from Ancient Greek πέλτη (péltē, “small crescent-shaped leather shield of Thracian design”); further etymology uncertain, perhaps either from Thracian, or ultimately from Proto-Indo-European *pel- (“to cover; to wrap; hide; skin; cloth”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pelt (plural pelts)",
          "definitionGroups": [
            {
              "group": "(obsolete, rare) Alternative form of pelta",
              "entries": [
                {
                  "meaning": "(historical) A small shield, especially one of an approximately elliptical form, or crescent-shaped.",
                  "examples": []
                },
                {
                  "meaning": "(botany) A flat apothecium with no rim.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}