{
  "word": "demiurge",
  "etymologies": [
    {
      "description": [
        "From Ancient Greek δημιουργός (dēmiourgós, “one who works for the people; a skilled workman, a handicraftsman”) (whence Latin dēmiūrgus, French démiurge), from δήμιος (dḗmios, “belonging to the people, public”) (from δῆμος (dêmos, “the people”), from Proto-Indo-European *deh₂mos (“people”), from *deh₂- (“to divide”) + Ancient Greek -ιος (-ios), from Proto-Indo-European *-yós (“suffix creating an adjective from a noun”)) + Ancient Greek -ουργός (-ourgós, “worker”) (from ἔργον (érgon, “labour; task; work”), from Proto-Indo-European *wérǵom (“work”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "demiurge (plural demiurges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Platonic philosophy) The (usually benevolent) being that created the universe out of primal matter.",
                  "examples": [
                    "A demiurge or craftsman god takes pre-existing matter and fashions it in light of the eternal Forms."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Gnosticism) A (usually jealous or outright malevolent) being who is inferior to the supreme being, and sometimes seen as the creator of evil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) Something (such as an idea, individual or institution) conceived as an autonomous creative force or decisive power.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Ancient Greece) The title of a magistrate in a number of states of Ancient Greece, and in the city states (poleis) of the Achaean League.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}