{
  "word": "outgo",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English outgon (“to go out, depart, leave; to come out, emerge; to escape; to protrude; of a sword: to be drawn; to emanate from (a place); to accompany”), from Old English ūtgān (“to go out”), from ūt- (prefix meaning ‘out’) (ultimately from Proto-Indo-European *úd (“away; out; outwards; upwards”)) + gān (“to go; to walk”) (ultimately from Proto-Indo-European *ǵʰeh₁- (“to go; to walk”)).",
        "Compare Middle English outwenden (“to go out, depart, leave; to escape; to be emitted, fly out from; of a weapon: to be drawn”), which, like modern outgo, had the past tense and past participle form outwent.",
        "The noun is derived from modern English out- (prefix meaning ‘away from; toward the outside of’) +‎ go. Sense 1 (“cost, expenditure, or outlay”) was probably modelled on income."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "outgo (countable and uncountable, plural outgos or outgoes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, business, archaic except India) A cost, expenditure, or outlay.",
                  "examples": [
                    "Synonym: outgoing",
                    "Antonyms: income, receipts, takings"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act or process of going out; (countable) an instance of this; an outgoing.",
                  "examples": [
                    "Synonyms: departure, efflux, exit, outflow",
                    "Antonyms: arrival, entrance, incoming, inflow, ingoing, influx"
                  ]
                }
              ]
            },
            {
              "group": "(archaic or obsolete)",
              "entries": [
                {
                  "meaning": "(countable) The means by which something flows or goes out; an outlet.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, rare) A (quantity of a) substance or thing that has flowed out; an outflow.",
                  "examples": [
                    "Synonyms: effluxion, issue, outcome"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": []
        },
        {
          "description": "outgo (third-person singular simple present outgoes, present participle outgoing, simple past outwent, past participle outgone)",
          "definitionGroups": [
            {
              "group": "(transitive)",
              "entries": [
                {
                  "meaning": "(archaic) To go further than (someone or something); to exceed, to go beyond, to surpass.",
                  "examples": [
                    "Synonym: outdo"
                  ]
                },
                {
                  "meaning": "(obsolete)",
                  "examples": [
                    "Synonyms: outdistance, outrun, pass"
                  ]
                },
                {
                  "meaning": "To experience, go through, or undergo (something).",
                  "examples": []
                },
                {
                  "meaning": "To travel faster than (someone or something); to outstrip, to overtake.",
                  "examples": [
                    "Synonyms: outdistance, outrun, pass"
                  ]
                }
              ]
            },
            {
              "group": "(intransitive)",
              "entries": [
                {
                  "meaning": "(archaic except poetic and Britain, regional) To go out, to set forth, to set out.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) To go too far; to overextend or overreach.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}