{
  "word": "vest",
  "etymologies": [
    {
      "description": [
        "From French veste (“a vest, jacket”), from Latin vestis (“a garment, gown, robe, vestment, clothing, vesture”), from Proto-Indo-European *wéstis, from *wes- (“to be dressed”) (English wear). Cognate with Sanskrit वस्त्र (vastra) and  Spanish vestir."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vest (plural vests)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Canada, US) A sleeveless garment that buttons down the front, worn over a shirt, and often as part of a suit; a waistcoat.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A sleeveless garment, often with a low-cut neck, usually worn under a shirt or blouse.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sleeveless top, typically with identifying colours or logos, worn by an athlete or member of a sports team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sleeveless outer garment, often for a purpose such as identification, safety, or storage.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A vestment.",
                  "examples": [
                    "In state attended by her maiden train, / Who bore the vests that holy rites require."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Clothing generally; array; garb.",
                  "examples": [
                    "Not seldom, clad in radiant vest / Deceitfully goes forth the morn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A loose robe or outer garment worn historically by men in Arab or Middle Eastern countries.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vest (third-person singular simple present vests, present participle vesting, simple past and past participle vested)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly passive) To clothe with, or as with, a vestment, or garment; to dress; to robe; to cover, surround, or encompass closely.",
                  "examples": [
                    "With ether vested, and a purple sky."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To clothe with authority, power, etc.; to put in possession; to invest; to furnish; to endow; followed by with and the thing conferred.",
                  "examples": [
                    "to vest a court with power to try cases of life and death"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To place or give into the possession or discretion of some person or authority; to commit to another; with in before the possessor.",
                  "examples": [
                    "The power of life and death is vested in the king, or in the courts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To clothe with possession; also, to give a person an immediate fixed right of present or future enjoyment of.",
                  "examples": [
                    "to vest a person with an estate",
                    "an estate is vested in possession"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, intransitive) (of an inheritance or a trust fund) To devolve upon the person currently entitled when a prior interest has ended.",
                  "examples": [
                    "Upon the death of the Sovereign the Crown automatically vests in the next heir without the need of coronation or other formality."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(financial, intransitive) To become vested, to become permanent.",
                  "examples": [
                    "My pension vests at the end of the month and then I can take it with me when I quit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To invest; to put.",
                  "examples": [
                    "to vest money in goods, land, or houses"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}