{
  "word": "marine",
  "etymologies": [
    {
      "description": [
        "Recorded since c.1420 as Middle English marin, borrowed from Middle French marin, from Old French, from Latin marinus (“of the sea”), itself from mare (“sea”), from Proto-Indo-European *móri (“body of water, lake”) (cognate with Old English mere (“sea, lake, pool, pond”), Dutch meer, German Meer, all from Proto-Germanic *mari).",
        "The modern pronunciation is presumably due to the influence of modern French marine, feminine singular of marin."
      ],
      "adjectives": [
        {
          "description": "marine (comparative more marine, superlative most marine)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Belonging to or characteristic of the sea; existing or found in the sea; formed or produced by the sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Relating to or connected with the sea (in operation, scope, etc.), especially as pertains to shipping, a navy, or naval forces.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Used or adapted for use at sea.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Inhabiting the high seas; oceanic; pelagic. (distinguished from maritime or littoral)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Belonging to or situated at the seaside; maritime.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "marine (plural marines)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, nautical) A soldier, normally a member of a marine corps, trained to serve on board or from a ship",
                  "examples": [
                    "He was a marine in World War II."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(capitalised in the plural): A marine corps.",
                  "examples": [
                    "He fought with the Marines in World War II."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A painting representing some marine subject.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "marine (third-person singular simple present marines, present participle marining, simple past and past participle marined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To adapt for use in a marine environment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To temporarily inundate with water and/or other marine substances.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To equip (a boat) with sailors and other personnel required for an ocean voyage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}