{
  "word": "scold",
  "etymologies": [
    {
      "description": [
        "The noun is from Middle English scold(e), skald(e), first attested in the 12th or 13th century (as scold, scolde, skolde, skald). The verb is from Middle English scolden, first attested in the late 1300s. Most dictionaries derive the verb from the noun and say the noun is probably from Old Norse skald (“poet”) (cognate with Icelandic skáld (“poet, scop”)), as skalds sometimes wrote insulting poems, though another view is that the Norse and English words are cognate to each other and to Old High German skeltan, Old Dutch skeldan, all inherited from Proto-Germanic *skeldaną (“scold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scold (plural scolds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who habitually scolds, in particular a troublesome and angry woman.",
                  "examples": [
                    "A ſclaunderous tunge, a tunge of a ſkolde,Worketh more miſchiefe than can be tolde;That, if I wiſt not to be controlde,Yet ſomwhat to ſay I dare well be bolde,How ſome delite for to lye, thycke and threfolde."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scold (third-person singular simple present scolds, present participle scolding, simple past and past participle scolded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To rebuke angrily.",
                  "examples": [
                    "I advise that you refrain from using that kind of language at home, lest your mother scold you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ornithology) Of birds, to make harsh vocalisations in aggression.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of birds, to make vocalisations that resemble human scolding.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Misconstruction of scald",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}