{
  "word": "relieve",
  "etymologies": [
    {
      "description": [
        "From Old French relever, specifically from the conjugated forms such as (jeo) relieve (“I lift up”), and its source, Latin relevo (“to lift up, lighten, relieve, alleviate”), combined form of re- (“back”) + levo (“to lift”). Doublet of relevate. Compare levant, levity, etc."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "relieve (third-person singular simple present relieves, present participle relieving, simple past and past participle relieved)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ease (a person, person's thoughts etc.) from mental distress; to stop (someone) feeling anxious or worried, to alleviate the distress of. [from 14th c.]",
                  "examples": [
                    "I was greatly relieved by the jury's verdict."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To ease (someone, a part of the body etc.) or give relief from physical pain or discomfort. [from 14th c.]",
                  "examples": [
                    "Synonym: liss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To alleviate (pain, distress, mental discomfort etc.). [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To provide comfort or assistance to (someone in need, especially in poverty). [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To lift up; to raise again. [15th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To raise (someone) out of danger or from (a specified difficulty etc.). [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To free (someone) from debt or legal obligations; to give legal relief to. [from 15th c.]",
                  "examples": [
                    "This shall not relieve either Party of any obligations."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To bring military help to (a besieged town); to lift the siege on. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To release (someone) from or of a difficulty, unwanted task, responsibility etc. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally military) To free (someone) from their post, task etc. by taking their place. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) To make (something) stand out; to make prominent, bring into relief. [from 18th c.]",
                  "examples": [
                    "The henna should be deeply dyed to make / The skin relieved appear more fairly fair  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, euphemistic) To urinate or defecate. [from 20th c.]",
                  "examples": [
                    "Synonyms: see Thesaurus:defecate, Thesaurus:urinate"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive, euphemistic) To ease one's own desire to orgasm, often through masturbation to orgasm.",
                  "examples": [
                    "Synonyms: see Thesaurus:masturbate"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}