{
  "word": "mass",
  "etymologies": [
    {
      "description": [
        "In late Middle English (circa 1400) as masse in the sense of \"lump, quantity of matter\", from Anglo-Norman masse, in Old French attested from the 11th century, via late Latin massa (“lump, dough”), from Ancient Greek μᾶζα (mâza, “barley-cake, lump (of dough)”). The Greek noun is derived from the verb μάσσω (mássō, “to knead”), ultimately from a Proto-Indo-European *maǵ- (“to oil, knead”). Doublet of masa.\nThe sense of \"a large number or quantity\" arises circa 1580. The scientific sense is from 1687 (as Latin massa) in the works of Isaac Newton, with the first English use (as mass) occurring in 1704."
      ],
      "adjectives": [
        {
          "description": "mass (not generally comparable, comparative masser, superlative massest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Involving a mass of things; concerning a large quantity or number.",
                  "examples": [
                    "There is evidence of mass extinctions in the distant past."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Involving a mass of people; of, for, or by the masses.",
                  "examples": [
                    "Mass unemployment resulted from the financial collapse."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "mass (countable and uncountable, plural masses)",
          "definitionGroups": [
            {
              "group": "(physical) Matter, material.",
              "entries": [
                {
                  "meaning": "A quantity of matter cohering together so as to make one body, or an aggregation of particles or things which collectively make one body or quantity, usually of considerable size.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Precious metal, especially gold or silver.",
                  "examples": []
                },
                {
                  "meaning": "(physics) The quantity of matter which a body contains, irrespective of its bulk or volume. It is one of four fundamental properties of matter. SI unit of mass: kilogram.",
                  "examples": []
                },
                {
                  "meaning": "(pharmacology) A medicinal substance made into a cohesive, homogeneous lump, of consistency suitable for making pills; as, blue mass.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) A palpable or visible abnormal globular structure; a tumor.",
                  "examples": []
                },
                {
                  "meaning": "(bodybuilding) Excess body weight, especially in the form of muscle hypertrophy.",
                  "examples": []
                },
                {
                  "meaning": "(proscribed) Synonym of weight",
                  "examples": []
                }
              ]
            },
            {
              "group": "A large quantity; a sum.",
              "entries": [
                {
                  "meaning": "Bulk; magnitude; body; size.",
                  "examples": []
                },
                {
                  "meaning": "The principal part; the main body.",
                  "examples": []
                },
                {
                  "meaning": "A large body of individuals, especially persons.",
                  "examples": [
                    "The mass of spectators didn't see the infraction on the field.",
                    "A mass of ships converged on the beaches of Dunkirk."
                  ]
                },
                {
                  "meaning": "(in the plural) The lower classes of persons.",
                  "examples": [
                    "The masses are revolting."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mass (third-person singular simple present masses, present participle massing, simple past and past participle massed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form or collect into a mass; to form into a collective body; to bring together into masses; to assemble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To assemble in a mass",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English messe, masse, from Old English mæsse (“the mass, church festival”) and Old French messe, from Vulgar Latin *messa (“Eucharist, dismissal”), from Late Latin missa, noun use of feminine past participle of classical Latin mittere (“to send”), from ite, missa est (“go, (the assembly) is dismissed”), reanalyzed as \"go, [that] is the missa\", last words of the Roman Rite of the Catholic Church. Compare Dutch mis (“mass”), German Messe (“mass”), Danish messe (“mass”), Swedish mässa (“mass; expo”), Icelandic messa (“mass”). More at mission."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mass (plural masses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) The Eucharist, now especially in Roman Catholicism.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity) Celebration of the Eucharist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Christianity, usually as the Mass) The sacrament of the Eucharist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A musical setting of parts of the mass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "mass (third-person singular simple present masses, present participle massing, simple past and past participle massed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To celebrate mass.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}