{
  "word": "watch",
  "etymologies": [
    {
      "description": [
        "As a noun, from Middle English wacche, from Old English wæċċe. See below for verb form."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "watch (plural watches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A portable or wearable timepiece.",
                  "examples": [
                    "More people today carry a watch on their wrists than in their pockets."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of guarding and observing someone or something.",
                  "examples": [
                    "All the long night their mournful watch they keep."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A particular time period when guarding is kept.",
                  "examples": [
                    "The second watch of the night began at midnight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of wakefulness between the two sleeps of a biphasic sleep pattern (the dead sleep or first sleep and morning sleep or second sleep): the first waking.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person or group of people who guard.",
                  "examples": [
                    "The watch stopped the travelers at the city gates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The post or office of a watchman; also, the place where a watchman is posted, or where a guard is kept.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A group of sailors and officers aboard a ship or shore station with a common period of duty: starboard watch, port watch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) A period of time on duty, usually four hours in length; the officers and crew who tend the working of a vessel during the same watch. (FM 55–501).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of seeing, or viewing, for a period of time.",
                  "examples": [
                    "The first third of the film is laugh after laugh;  […]  But half an hour in and this movie gets unnervingly dark and is an uncomfortable watch at times."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English wacchen, from Old English wæċċan, from Proto-West Germanic *wakkjan, from Proto-Germanic *wakjaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "watch (third-person singular simple present watches, present participle watching, simple past and past participle watched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To look at, see, or view for a period of time.",
                  "examples": [
                    "Watching the clock will not make time go faster.",
                    "I'm tired of watching TV."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To observe over a period of time; to notice or pay attention.",
                  "examples": [
                    "Watch this!",
                    "Put a little baking soda in some vinegar and watch what happens."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To mind, attend, or guard.",
                  "examples": [
                    "Please watch my suitcase for a minute.",
                    "He has to watch the kids that afternoon."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To be wary or cautious of.",
                  "examples": [
                    "You should watch that guy. He has a reputation for lying."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attend to dangers to or regarding.",
                  "examples": [
                    "watch your head; watch your step",
                    "Watch yourself when you talk to him.",
                    "Watch what you say."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To remain awake with a sick or dying person; to maintain a vigil.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be vigilant or on one's guard.",
                  "examples": [
                    "For some must watch, while some must sleep: So runs the world away."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To act as a lookout.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, of a buoy) To serve the purpose of a watchman by floating properly in its place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To be awake.",
                  "examples": [
                    "So on the morne Sir Trystram, Sir Gareth and Sir Dynadan arose early and went unto Sir Palomydes chambir, and there they founde hym faste aslepe, for he had all nyght wacched  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To be on the lookout for; to wait for expectantly.",
                  "examples": [
                    "[S]he had reason to dread that her husband had formed a very criminal project of being revenged on Zeluco, and watched an opportunity of putting it in execution."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}