{
  "word": "nauseate",
  "etymologies": [
    {
      "description": [
        "From Latin nauseātus, from nauseō, from nausea, from Ancient Greek ναυσία (nausía), from ναῦς (naûs), from Proto-Indo-European *(s)neh₂-. Its surface etymology is nausea (queasiness, uneasiness, sickness) + -ate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "nauseate (third-person singular simple present nauseates, present participle nauseating, simple past and past participle nauseated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause nausea in.",
                  "examples": [
                    "[…]  this room, where misfortune seems to ooze, where speculation lurks in corners, and of which Madame Vauquer inhales the warm, fetid air without being nauseated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To disgust.",
                  "examples": [
                    "[…]  I have not treated you as a Wise man would have done in silence, but it is time to put an end to this tittle tattle which has nauseated you for three days together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become squeamish; to feel nausea; to turn away with disgust.",
                  "examples": [
                    "As one of Woodward’s Patients, sick and sore,",
                    "I puke, I nauseate,—yet he thrusts in more;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive) To reject or spit (something) out because it causes a feeling of nausea.",
                  "examples": [
                    "In Children and delicate Persons, who are apt to nauseate this Remedy, I have with Success given it mix’d up with thin Chocolate; which, if sufficiently sweetened, disguises it better than any thing I know of."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, transitive, figurative) To be disgusted by (something).",
                  "examples": [
                    "Old Age, with silent pace, comes creeping on,",
                    "Nauseates the Praise, which in her Youth she won,",
                    "And hates the Muse by which she was undone."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}