{
  "word": "cute",
  "etymologies": [
    {
      "description": [
        "Aphetic form of acute, originally “keenly perceptive or discerning, shrewd” (1731). Meaning transferred to “pretty, fetching” by US students (slang) c.1834. Meaning drifted further to describe the pleasing attraction to features usually possessed by the young."
      ],
      "adjectives": [
        {
          "description": "cute (comparative cuter, superlative cutest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Possessing physical features, behaviors, personality traits or other properties that are mainly attributed to infants and small or cuddly animals; e.g. fair, dainty, round, and soft physical features, disproportionately large eyes and head, playfulness, fragility, helplessness, curiosity or shyness, innocence, affectionate behavior.",
                  "examples": [
                    "Our reaction to cute attributes is understood as the way nature ensures mammals care for their young."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lovable, charming, attractive or pleasing, especially in a youthful, dainty, quaint or fun-spirited way.",
                  "examples": [
                    "Let's go to the mall and look for cute girls."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sexually attractive or pleasing; gorgeous.",
                  "examples": [
                    "He's got such  cute buns."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Affected or contrived to charm; mincingly clever; precious; cutesy.",
                  "examples": [
                    "The actor's performance was too cute for me. All that mugging to the audience killed the humor.",
                    "Don't get cute with me, boy!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Mentally keen or discerning (See also acute)",
                  "examples": [
                    "Synonyms: clever, shrewd"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially mathematics) Evincing cleverness; surprising in its elegance or unconventionality (but of limited importance).",
                  "examples": [
                    "There's a cute alternative proof of this using lambda calculus."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}