{
  "word": "orange",
  "etymologies": [
    {
      "description": [
        "From Middle English orenge, orange, from Old French pome orenge (“fruit orange”), influenced by Old Occitan auranja and calqued from Old Italian melarancio, melarancia, compound of mela (“apple”) and un'arancia (“an orange”), from Arabic نَارَنْج‎ (nāranj), from Persian نارنگ‎ (nârang), from Sanskrit नारङ्ग (nāraṅga, “orange tree”), from Dravidian (compare Tamil நார்த்தங்காய் (nārttaṅkāy), compound of நரந்தம் (narantam, “fragrance”) and காய் (kāy, “fruit”); also Telugu నారంగము (nāraṅgamu), Malayalam നാരങ്ങ (nāraṅṅa), Kannada ನಾರಂಗಿ (nāraṅgi)).",
        "Originally borrowed as the surname in the 13th century, before the sense of the fruit was imported in the late 14th century and the color in 1510. In the color sense, largely replaced Old English ġeolurēad, English yellow-red (compare English blue-green).",
        "For other similar cases of the incorrect division (or, elision/rebracketing) of the above Italian word, but in English, see Category:English rebracketings."
      ],
      "adjectives": [
        {
          "description": "orange (comparative oranger or more orange, superlative orangest or most orange)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Having the colour of the fruit of an orange tree; yellowred; reddish-yellow.",
                  "examples": [
                    "Antonym: nonorange"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "orange (countable and uncountable, plural oranges)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An evergreen tree of the genus Citrus such as Citrus sinensis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) The fruit of the orange tree; a citrus fruit with a slightly sour flavour.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The colour of a ripe fruit of an orange tree, midway between red and yellow.",
                  "examples": [
                    "orange:",
                    "bright orange:",
                    "Synonym: yellow-red"
                  ]
                }
              ]
            },
            {
              "group": "Various drinks:",
              "entries": [
                {
                  "meaning": "(uncountable) Orange juice.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) An orange-coloured and orange-flavoured cordial.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable) An orange-coloured and orange-flavoured soft drink.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "orange (third-person singular simple present oranges, present participle oranging, simple past and past participle oranged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To color orange.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To become orange.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}