{
  "word": "scheme",
  "etymologies": [
    {
      "description": [
        "Borrowed from Medieval Latin schēma (“figure, form”), from Ancient Greek σχῆμα (skhêma, “form, shape”), from ἔχω (ékhō, “I hold”). Doublet of schema. Compare sketch."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "scheme (plural schemes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rhetoric, obsolete) An artful deviation from the ordinary arrangement of words. [16th–17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(astrology) A representation of the aspects of the celestial bodies for any moment or at a given event. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A systematic plan of future action. [from 18th c.]",
                  "examples": [
                    "The stoical scheme of supplying our wants by lopping off our desires, is like cutting off our feet when we want shoes."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plot or secret, devious plan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An orderly combination of related parts.",
                  "examples": [
                    "such a scheme of things as shall at once take in time and eternity"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A chart or diagram of a system or object.",
                  "examples": [
                    "to draw an exact scheme of Constantinople, or a map of France"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) A mathematical structure that enlarges the notion of algebraic variety in several ways, such as taking account of multiplicities and allowing \"varieties\" defined over any commutative ring (e.g. Fermat curves over the integers).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, chiefly Scotland, colloquial) A council housing estate. [from 20th c.]",
                  "examples": [
                    "It was all too dear. They all just put their prices up because it was out in the scheme."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) Part of a uniform resource identifier indicating the protocol or other purpose, such as http: or news:.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, pensions) A portfolio of pension plans with related benefits comprising multiple independent members.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "scheme (third-person singular simple present schemes, present participle scheming, simple past and past participle schemed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To plot, or contrive a plan.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To plan; to contrive.",
                  "examples": [
                    "He schemed a plot. He made use of the hotel's stationery to write a letter."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}