{
  "word": "vein",
  "etymologies": [
    {
      "description": [
        "From Middle English veyne, borrowed from Anglo-Norman veine, from Latin vēna (“a blood-vessel; vein; artery”) of uncertain origin. See vēna for more. Doublet of vena. Displaced native edre, from ǣdre (whence edder)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vein (plural veins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(anatomy) A blood vessel that transports blood from the capillaries back to the heart.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) The entrails of a shrimp.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany) In leaves, a thickened portion of the leaf containing the vascular bundle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The nervure of an insect’s wing.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A stripe or streak of a different colour or composition in materials such as wood, cheese, marble or other rocks.",
              "entries": [
                {
                  "meaning": "(geology) A sheetlike body of crystallized minerals within a rock.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A topic of discussion; a train of association, thoughts, emotions, etc.",
                  "examples": [
                    "in the same vein"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) A style, tendency, or quality.",
                  "examples": [
                    "The play is in a satirical vein."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fissure, cleft, or cavity, as in the earth or other substance.",
                  "examples": [
                    "I took another Prism therefore which was free from Veins"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vein (third-person singular simple present veins, present participle veining, simple past and past participle veined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To mark with veins or a vein-like pattern.",
                  "examples": [
                    "[…]  as he ceased from that wild imprecation, a faint flash of lightning veined the remote horizon, and a low clap of thunder rumbled afar off, echoing among the hills  […]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}