{
  "word": "plat",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English plat, platte (“flat part of a sword; flat piece of ground, plot of ground”), probably a variant of Middle English plot, (modern English plot) and influenced by Middle English plat, plate (modern English plate) and Anglo-Norman, Middle French and Old French plat. See platy-, plaice, flat.",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plat (plural plats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A plot of land; a lot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A map showing the boundaries of real properties (delineating one or more plots of land), especially one that forms part of a legal document.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A plot, a scheme.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plat (third-person singular simple present plats, present participle platting, simple past and past participle platted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To create a plat; to lay out property lots and streets; to map.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "The noun is a variant of plait.",
        "The verb is from Middle English platte, English plat, respectively archaic past and past participle forms of English pleat (a variant of plait), Middle English platten (“to braid, weave; plait; to fold”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plat (countable and uncountable, plural plats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A braid; a plait (of hair, straw, etc.).",
                  "examples": [
                    "they also wear a cap or cup on the head formed of beargrass and cedar bark. the men also frequently attatch[sic] some small ornament to a small plat of hair on the center of the crown of their heads."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Material produced by braiding or interweaving, especially a material of interwoven straw from which straw hats are made.",
                  "examples": [
                    "The large silver medal and twenty guineas, were this Session given to Miss Sophia Woodhouse, (Mrs. Wells,) of Weathersfield, in Connecticut, United States, for a new Material for Straw Plat."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plat (third-person singular simple present plats, present participle platting, simple past and past participle platted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated except regional England) To braid, to plait.",
                  "examples": [
                    "A customer hailed him; he placed the stool on the ground, and the customer seated himself upon it, while the barber shaved his face, platted his hair, and washed his hands [...]"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English plat, plate, platte (“flat; smooth; blunt, plain”), from Anglo-Norman, Middle French, and Old French plat (“(adjective) flat, level; calm; blunt, plain; (adverb) in a flat position; directly, straight; bluntly, plainly”), from Vulgar Latin *plattus (“flat; smooth”); further etymology uncertain, but possibly from Ancient Greek πλατύς (platús, “flat; wide”), ultimately from Proto-Indo-European *pleth₂- (“flat”).",
        "The English word is cognate with French plat, Italian piatto, Middle Dutch plat (modern Dutch plat (“flat”)), Middle High German blat, plat, Middle Low German plat (modern German platt (“flat”)), Old Danish plat (modern Danish plat), Old Occitan plat (modern Occitan plat), Old Swedish plat (modern Swedish platt); and is a doublet of flat."
      ],
      "adjectives": [
        {
          "description": "plat (comparative more plat, superlative most plat)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except Scotland) Flat; level; (by extension) frank, on the level.",
                  "examples": [
                    "But else, hold alway[sic] your tail fast between your legs that he catch you not thereby; and hold down your ears lying plat after your head that he hold you not thereby; and see wisely to yourself."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "plat (comparative more plat, superlative most plat)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete except Scotland) Flatly, plainly.",
                  "examples": [
                    "Synonyms: bluntly, directly, straightforwardly"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": []
    }
  ]
}