{
  "word": "sermonize",
  "etymologies": [
    {
      "description": [
        "sermon +‎ -ize"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "sermonize (third-person singular simple present sermonizes, present participle sermonizing, simple past and past participle sermonized)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak in the manner of a sermon; to preach; to propagate one's morality or opinions with speech.",
                  "examples": [
                    "And doe not our Prelates thus, when  […]  they disgrace and traduce Preaching, calling it in scorne, Sermonizing?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To preach a sermon to (somebody); to give (somebody) instruction or admonishment on the basis of one's morality or opinions.",
                  "examples": [
                    "He wishes, I suppose, to sermonize me: but I shall not give him an opportunity—"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say in the manner of a sermon or lecture.",
                  "examples": [
                    "“Children, children! Woe, how you do sin!” Mrs. Kavarsky sermonized. “Come now, obey an older person  […] ”"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To inculcate rigid rules.",
                  "examples": [
                    "If you consider my letters in their true light as conveying to you the advice of a Friend, who sincerely wishes you happiness, and desires to promote your pleasures, you will both read and attend them; but, if you consider them in their opposite, and very false light, as the dictates of a morose and sermonizing Father, I am sure they will be not only unattended to, but unread."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}