{
  "word": "subjective",
  "etymologies": [
    {
      "description": [
        "subject +‎ -ive"
      ],
      "adjectives": [
        {
          "description": "subjective (comparative more subjective, superlative most subjective)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Formed, as in opinions, based upon a person's feelings or intuition, not upon observation or reasoning; coming more from within the observer than from observations of the external environment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pertaining to subjects as opposed to objects (A subject is one who perceives or is aware; an object is the thing perceived or the thing that the subject is aware of.)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Resulting from or pertaining to personal mindsets or experience, arising from perceptive mental conditions within the brain and not necessarily or directly from external stimuli.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lacking in reality or substance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "As used by Carl Jung, the innate worldview orientation of the introverted personality types.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(philosophy, psychology) Experienced by a person mentally and not directly verifiable by others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics, grammar) Describing conjugation of a verb that indicates only the subject (agent), not indicating the object (patient) of the action. (In linguistic descriptions of Tundra Nenets, among others.)",
                  "examples": [
                    "The general finite stem is the verbal stem which serves as the basis of inflection in the indicative present and past in the subjective conjugation and the objective conjugation with the singular and dual object."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}