{
  "word": "honour",
  "etymologies": [
    {
      "description": [
        "From Middle English honour, honor, honur, from Anglo-Norman honour, honur, from Old French honor, from Latin honor.",
        "Displaced Middle English menske (“honor, dignity among men”), from Old Norse menskr (“honor”) (see mensk).",
        "The verb is from Middle English honouren, honuren (“to honor”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "honour (countable and uncountable, plural honours)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Recognition of importance or value; respect; veneration (of someone, usually for being morally upright or successful).",
                  "examples": [
                    "The crowds gave the returning general much honour and praise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The state of being morally upright, honest, noble, virtuous, and magnanimous; excellence of character; the perception of such a state; favourable reputation; dignity.",
                  "examples": [
                    "He was a most perfect knight, for he had great honour and chivalry.",
                    "His honour was unstained."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A token of praise or respect; something that represents praiseworthiness or respect, such as a prize or award given by the state to a citizen.",
                  "examples": [
                    "Honours are normally awarded twice a year: on The Queen's Birthday in June and at the New Year.",
                    "He wore an honour on his breast.",
                    "military honours; civil honours",
                    "Audie Murphy received many honours, such as the Distinguished Service Cross."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A privilege.",
                  "examples": [
                    "I had the honour of dining with the ambassador."
                  ]
                }
              ]
            },
            {
              "group": "(in the plural) The privilege of going first.",
              "entries": [
                {
                  "meaning": "(golf) The right to play one's ball before one's opponent.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cause of respect and fame; a glory; an excellency; an ornament.",
                  "examples": [
                    "He is an honour to his nation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(feudal law) A seigniory or lordship held of the king, on which other lordships and manors depended.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry, countable) The center point of the upper half of an armorial escutcheon (compare honour point).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, card games) In bridge, an ace, king, queen, jack, or ten especially of the trump suit. In some other games, an ace, king, queen or jack.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) (Courses for) an honours degree: a university qualification of the highest rank.",
                  "examples": [
                    "At university I took honours in modern history."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "honour (third-person singular simple present honours, present participle honouring, simple past and past participle honoured)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "British spelling, Canadian spelling, Commonwealth, and Ireland standard spelling of honor.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}