{
  "word": "cane",
  "etymologies": [
    {
      "description": [
        "From Middle English cane, canne, from Old French cane (“sugar cane”), from Latin canna (“reed”), from Ancient Greek κάννα (kánna), from Akkadian 𒄀 (qanû, “reed”), from Sumerian 𒄀𒈾 (gi.na). Related to channel and canal."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cane (countable and uncountable, plural canes)",
          "definitionGroups": [
            {
              "group": "A plant with simple stems, like bamboo or sugar cane, or the stem thereof",
              "entries": [
                {
                  "meaning": "(uncountable) The slender, flexible main stem of a plant such as bamboo, including many species in the grass family Gramineae",
                  "examples": [
                    "Synonyms: stem, stalk, (of a tree) trunk"
                  ]
                },
                {
                  "meaning": "(uncountable) The plant itself, including many species in the grass family Gramineae; a reed",
                  "examples": [
                    "Synonym: reed"
                  ]
                },
                {
                  "meaning": "(uncountable) Sugar cane",
                  "examples": [
                    "Synonym: molasses cane"
                  ]
                },
                {
                  "meaning": "(US, Southern) Maize or, rarely, sorghum, when such plants are processed to make molasses (treacle) or sugar",
                  "examples": []
                }
              ]
            },
            {
              "group": "The stem of such a plant adapted for use as a tool",
              "entries": [
                {
                  "meaning": "(countable) A short rod or stick, traditionally of wood or bamboo, used for corporal punishment.",
                  "examples": [
                    "Synonyms: rod, switch"
                  ]
                },
                {
                  "meaning": "(with \"the\") Corporal punishment by beating with a cane.",
                  "examples": [
                    "The teacher gave his student the cane for throwing paper.",
                    "Synonyms: a caning, six of the best, whipping, cuts"
                  ]
                },
                {
                  "meaning": "A lance or dart made of cane",
                  "examples": [
                    "Judgelike thou sitt'st, to praise or to arraign / The flying skirmish of the darted cane."
                  ]
                }
              ]
            },
            {
              "group": "a rod-shaped tool or device, somewhat like a cane",
              "entries": [
                {
                  "meaning": "(countable) A strong short staff used for support or decoration during walking; a walking stick",
                  "examples": [
                    "After breaking his leg, he needed a cane to walk."
                  ]
                },
                {
                  "meaning": "(countable, glassblowing) A length of colored and/or patterned glass rod, used in the specific glassblowing technique called caneworking",
                  "examples": []
                },
                {
                  "meaning": "(countable) A long rod often collapsible and commonly white (for visibility to other persons), used by vision impaired persons for guidance in determining their course and for probing for obstacles in their path",
                  "examples": [
                    "Synonyms: blind man's cane, white cane"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Split rattan, as used in wickerwork, basketry and the like",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A local European measure of length; the canna.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cane (third-person singular simple present canes, present participle caning, simple past and past participle caned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to strike or beat with a cane or similar implement",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, New Zealand, slang) to destroy; to comprehensively defeat",
                  "examples": [
                    "Mudchester Rovers were caned 10-0."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, New Zealand, slang) to do something well, in a competent fashion",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, slang, intransitive) to produce extreme pain",
                  "examples": [
                    "Don't hit me with that. It really canes!",
                    "Mate, my legs cane!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make or furnish with cane or rattan.",
                  "examples": [
                    "to cane chairs"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}