{
  "word": "hit",
  "etymologies": [
    {
      "description": [
        "From Middle English hitten (“to hit, strike, make contact with”), from Old English hittan (“to meet with, come upon, fall in with”), from Old Norse hitta (“to strike, meet”), from Proto-Germanic *hittijaną (“to come upon, find”), from Proto-Indo-European *kh₂eyd- (“to fall; fall upon; hit; cut; hew”).",
        "Cognate with Icelandic hitta (“to meet”), Danish hitte (“to find”), Latin caedō (“to kill”), Albanian qit (“to hit, throw, pull out, release”)."
      ],
      "adjectives": [
        {
          "description": "hit (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very successful.",
                  "examples": [
                    "The band played their hit song to the delight of the fans."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "hit (plural hits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A blow; a punch; a striking against; the collision of one body against another; the stroke that touches anything.",
                  "examples": [
                    "The hit was very slight."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something very successful, such as a song, film, or video game, that receives widespread recognition and acclaim.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attack on a location, person or people.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A collision of a projectile with the target.",
              "entries": [
                {
                  "meaning": "In the game of Battleship, a correct guess at where one's opponent ship is.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing, Internet) A match found by searching a computer system or search engine",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A measured visit to a web site, a request for a single file from a web server.",
                  "examples": [
                    "My site received twice as many hits after being listed in a search engine."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An approximately correct answer in a test set.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) The complete play, when the batter reaches base without the benefit of a walk, error, or fielder’s choice.",
                  "examples": [
                    "The catcher got a hit to lead off the fifth."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A dose of an illegal or addictive drug.",
                  "examples": [
                    "Where am I going to get my next hit?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A premeditated murder done for criminal or political purposes.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) A peculiarly apt expression or turn of thought; a phrase which hits the mark.",
                  "examples": [
                    "a happy hit"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(backgammon) A move that throws one of the opponent's men back to the entering point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(backgammon) A game won after the adversary has removed some of his men. It counts for less than a gammon.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hit (third-person singular simple present hits, present participle hitting, simple past hit or (dialectal, obsolete) hat or (rare, dialectal) het, past participle hit or (archaic, rare, dialectal) hitten)",
          "definitionGroups": [
            {
              "group": "(heading, physical) To strike.",
              "entries": [
                {
                  "meaning": "(transitive) To administer a blow to, directly or with a weapon or missile.",
                  "examples": [
                    "One boy hit the other."
                  ]
                },
                {
                  "meaning": "(transitive) To come into contact with forcefully and suddenly.",
                  "examples": [
                    "The ball hit the fence."
                  ]
                },
                {
                  "meaning": "(intransitive) To strike against something.",
                  "examples": [
                    "If bodies be extension alone,  […] how can they move and hit one against another?"
                  ]
                },
                {
                  "meaning": "(transitive) To activate a button or key by pressing and releasing it.",
                  "examples": [
                    "Hit the Enter key to continue."
                  ]
                },
                {
                  "meaning": "(transitive, slang) To kill a person, usually on the instructions of a third party.",
                  "examples": [
                    "Hit him tonight and throw the body in the river."
                  ]
                },
                {
                  "meaning": "(transitive, military) To attack, especially amphibiously.",
                  "examples": [
                    "If intelligence had been what it should have been, I don't think we'd ever have hit that island."
                  ]
                },
                {
                  "meaning": "(figurative, transitive, intransitive) To affect someone, as if dealing a blow to that person.",
                  "examples": [
                    "Their coffee really hits the spot.",
                    "I used to listen to that song all the time, but it hits different(ly) now."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To manage to touch (a target) in the right place.",
                  "examples": [
                    "I hit the jackpot.",
                    "Antonym: miss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To switch on.",
                  "examples": [
                    "Antonyms: cut, kill",
                    "Somebody's been here! Hit the lights!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, colloquial) To briefly visit.",
                  "examples": [
                    "We hit the grocery store on the way to the park."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To encounter an obstacle or other difficulty.",
                  "examples": [
                    "You'll hit some nasty thunderstorms if you descend too late.",
                    "We hit a lot of traffic coming back from the movies."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To attain, to achieve.",
              "entries": [
                {
                  "meaning": "(transitive, informal) To reach or achieve.",
                  "examples": [
                    "The movie hits theaters in December.",
                    "The temperature could hit 110°F tomorrow.",
                    "We hit Detroit at one in the morning but kept driving through the night."
                  ]
                },
                {
                  "meaning": "(intransitive) To meet or reach what was aimed at or desired; to succeed, often by luck.",
                  "examples": []
                },
                {
                  "meaning": "To guess; to light upon or discover.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To affect negatively.",
                  "examples": [
                    "The economy was hit by a recession.  The hurricane hit his fishing business hard."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) To attack.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(heading, games) To make a play.",
              "entries": [
                {
                  "meaning": "(transitive, card games) In blackjack, to deal a card to.",
                  "examples": [
                    "Hit me."
                  ]
                },
                {
                  "meaning": "(intransitive, baseball) To come up to bat.",
                  "examples": [
                    "Jones hit for the pitcher."
                  ]
                },
                {
                  "meaning": "(backgammon) To take up, or replace by a piece belonging to the opposing player; said of a single unprotected piece on a point.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, computing, programming) To use; to connect to.",
                  "examples": [
                    "The external web servers hit DBSRV7, but the internal web server hits DBSRV3."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, slang) To have sex with.",
                  "examples": [
                    "I'd hit that!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, US, slang) To inhale an amount of smoke from a narcotic substance, particularly marijuana.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, bodybuilding) (of an exercise) to affect, to work a body part.",
                  "examples": [
                    "This is another great exercise which hits the long head."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, bodybuilding) to work out",
                  "examples": [
                    "With that said, the group hitting their legs just once a week still made gains."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hit (“it”), from Old English hit (“it”), from Proto-Germanic *hit (“this, this one”), from Proto-Indo-European *ḱe-, *ḱey- (“this, here”). Cognate with Dutch het (“it”). More at it. Note 'it."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}