{
  "word": "cringe",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English crengen (“to bend in a haughty manner; to condescend”) [and other forms], from Old English *crenċan, *crenċġan, *crenġan (“to cause to fall or turn”), the causative of crinċġan (“to yield; to cringe; to fall; to die, perish”), from Proto-Germanic *krangijaną (“to cause to fall; to cause to turn”), from Proto-Germanic *kringaną, *krinkaną (“to fall; to turn; to yield”) (from Proto-Indo-European *grenǵʰ- (“to turn”)) + *-janą (suffix forming causatives with the sense ‘to cause to do (the action of the verb)’ from strong verbs). The English word is cognate with Danish krænge (“to turn inside out, evert”), Dutch krengen (“to careen, veer”), Scots crenge, creenge, creinge, crienge (“to cringe; to shrug”), Swedish kränga (“to careen; to heel, lurch; to toss”), and West Frisian kringe (“to pinch; to poke; to push; to insist, urge”); and is a doublet of crinkle.",
        "The noun and adjective are derived from the verb via zero derivation."
      ],
      "adjectives": [
        {
          "description": "cringe (comparative more cringe, superlative most cringe)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Inducing awkwardness, embarrassment, or secondhand embarrassment; cringemaking, cringeworthy, cringy.",
                  "examples": [
                    "Antonym: (Internet slang) based"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "cringe (countable and uncountable, plural cringes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A gesture or posture of cringing (recoiling or shrinking).",
                  "examples": [
                    "He glanced with a cringe at the mess on his desk."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, figuratively) An act or disposition of servile obeisance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Britain, dialectal) A crick (“painful muscular cramp or spasm of some part of the body”).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, slang) Awkwardness or embarrassment which causes an onlooker to cringe; cringeworthiness.",
                  "examples": [
                    "There was so much cringe in that episode!"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cringe (third-person singular simple present cringes, present participle cringing, simple past and past participle cringed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To cower, flinch, recoil, shrink, or tense, as in disgust, embarrassment, or fear.",
                  "examples": [
                    "He cringed as the bird collided with the window."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To experience an inward feeling of disgust, embarrassment, or fear; (by extension) to feel very embarrassed.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bow or crouch in servility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figuratively) To act in an obsequious or servile manner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To draw (a body part) close to the body; also, to distort or wrinkle (the face, etc.).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To bow or crouch to (someone) in servility; to escort (someone) in a cringing manner.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}