{
  "word": "shoe",
  "etymologies": [
    {
      "description": [
        "From Middle English scho, sho, from Old English sċōh (“shoe”), from Proto-West Germanic *skōh, from Proto-Germanic *skōhaz (“shoe”), of unclear etymology; possibly a derivation from *skehaną (“to move quickly”), from Proto-Indo-European *skek- (“to move quickly, jump”).",
        "Eclipsed non-native Middle English sabatine, sabatoun (“shoe”) from Medieval Latin sabatēnum, sabatum (“shoe, slipper”) (compare Old Occitan sabatō, Spanish zapato (“shoe”), French sabot (“wooden shoe, clog”), Italian ciabatta).",
        "The archaic plural shoon is from Middle English shon, from Old English scōn, scōum (“shoes”, dative plural) and scōna (“shoes'”, genitive plural); it is cognate with Scots shuin (“shoes”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "shoe (plural shoes or (obsolete) shoon or (obsolete) shoen)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protective covering for the foot, with a bottom part composed of thick leather or plastic sole and often a thicker heel, and a softer upper part made of leather or synthetic material. Shoes generally do not extend above the ankle, as opposed to boots, which do.",
                  "examples": [
                    "Get your shoes on now, or you'll be late for school."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A piece of metal designed to be attached to a horse's foot as a means of protection; a horseshoe.",
                  "examples": [
                    "Throw the shoe from behind the line, and try to get it to land circling (a ringer) or touching the far stake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games) A device for holding multiple decks of playing cards, allowing more games to be played by reducing the time between shuffles.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something resembling a shoe in form, position, or function, such as a brake shoe.",
              "entries": [
                {
                  "meaning": "A band of iron or steel, or a ship of wood, fastened to the bottom of the runner of a sleigh, or any vehicle which slides on the snow.",
                  "examples": []
                },
                {
                  "meaning": "A drag, or sliding piece of wood or iron, placed under the wheel of a loaded vehicle, to retard its motion in going down a hill.",
                  "examples": []
                },
                {
                  "meaning": "The part of a railroad car brake which presses upon the wheel to retard its motion.",
                  "examples": []
                },
                {
                  "meaning": "(architecture) A trough-shaped or spout-shaped member, put at the bottom of the water leader coming from the eaves gutter, so as to throw the water off from the building.",
                  "examples": []
                },
                {
                  "meaning": "A trough or spout for conveying grain from the hopper to the eye of the millstone.",
                  "examples": []
                },
                {
                  "meaning": "An inclined trough in an ore-crushing mill.",
                  "examples": []
                },
                {
                  "meaning": "An iron socket or plate to take the thrust of a strut or rafter.",
                  "examples": []
                },
                {
                  "meaning": "An iron socket to protect the point of a wooden pile.",
                  "examples": []
                },
                {
                  "meaning": "(engineering) A plate, or notched piece, interposed between a moving part and the stationary part on which it bears, to take the wear and afford means of adjustment; called also slipper and gib.",
                  "examples": []
                },
                {
                  "meaning": "Part of a current collector on electric trains which provides contact either with a live rail or an overhead wire (fitted to a pantograph in the latter case).",
                  "examples": []
                },
                {
                  "meaning": "(historical) An ingot of gold or silver shaped somewhat like a traditional Chinese shoe, formerly used in trade in the Far East.",
                  "examples": [
                    "Synonyms: (uncountable) boat money, (uncountable) shoe money"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The outer cover or tread of a pneumatic tire, especially for an automobile.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, slang) A pneumatic tire, especially for an automobile.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "shoe (third-person singular simple present shoes, present participle shoeing, simple past shod or shoed, past participle shodden or shod or shoed) (\"shodden\" is obsolete)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put shoes on one's feet.",
                  "examples": [
                    "Men and women clothed and shod for the ascent."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put horseshoes on a horse.",
                  "examples": [
                    "\"Old Jimmy Harris only shoed her last week, and I'd swear to his make among ten thousand.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To equip an object with a protection against wear.",
                  "examples": [
                    "The billiard cue stick was shod in silver."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}