{
  "word": "visitor",
  "etymologies": [
    {
      "description": [
        "Partly from Middle English visiter, visitere, equivalent to visit +‎ -er; and partly from Middle English visitour, from Anglo-Norman visitour, from Old French visetëor."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "visitor (plural visitors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who visits someone else; someone staying as a guest.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Someone who pays a visit to a specific place or event; a sightseer or tourist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports, usually in the plural) Someone, or a team, that is playing away from home.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person authorized to visit an institution to see that it is being managed properly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(ufology) An extraterrestrial being on Earth for any reason.",
                  "examples": [
                    "5: Of course there is always the remote (I hope) possibility that instant panic will prompt us to send a hailstorm of nuclear warheads out upon the visitor."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An object which lands or passes by Earth or its orbit.",
                  "examples": [
                    "Within a few months, another small meteoric mass has been added to the list of those extra-terrestrial bodies which have fallen within the limits of Tennessee. This recent visitor is a stone, weighing, when first obtained, three pounds."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A head or overseer of an institution such as a college (in which case, equivalent to the university's chancellor) or cathedral or hospital, who resolves disputes, gives ceremonial speeches, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software engineering) The object in the visitor pattern that performs an operation on the elements of a structure one by one.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}