{
  "word": "dangle",
  "etymologies": [
    {
      "description": [
        "Uncertain, but likely of North Germanic origin, akin to Danish dingle, dangle, Swedish dangla (“to swing about”), Norwegian dangla, perhaps via North Frisian dangeln."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "dangle (plural dangles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An agent of one intelligence agency or group who pretends to be interested in defecting or turning to another intelligence agency or group.",
                  "examples": [
                    "The example of Oswald will show how the different operations of a dangle and a barium meal would work more efficiently together."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, ice hockey, lacrosse) The action of dangling; a series of complex stick tricks and fakes in order to defeat the defender in style.",
                  "examples": [
                    "That was a sick dangle for a great goal!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dangling ornament or decoration.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "dangle (third-person singular simple present dangles, present participle dangling, simple past and past participle dangled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hang loosely with the ability to swing.",
                  "examples": [
                    "He'd rather on a gibbet dangle / Than miss his dear delight, to wrangle."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, slang, ice hockey, lacrosse) The action of performing a move or deke with the puck in order to get past a defender or goalie; perhaps because of the resemblance to dangling the puck on a string.",
                  "examples": [
                    "He dangled around three players and the goalie to score."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To hang or trail something loosely.",
                  "examples": [
                    "I like to sit on the edge and dangle my feet in the water."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative, by extension) To put forth as a possibility.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated) To trail or follow around.",
                  "examples": [
                    "To dangle at the elbow of a wench who can't make up her mind to accept the common title of wife, till she has been courted a certain number of weeks — so the old blinker, her father, says."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, intransitive) Of a patient: to be positioned with the legs hanging over the edge of the bed.",
                  "examples": [
                    "Record the time and duration of dangling, patient's pulse and respirations and patient's general tolerance of the procedure.  […]  The next step usually in getting the patient out of bed is sitting  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(medicine, transitive) To position (a patient) in this way.",
                  "examples": [
                    "Using proper body mechanics for dangling a patient at the side of the bed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}