{
  "word": "fascism",
  "etymologies": [
    {
      "description": [
        "From Italian fascismo, from fascio (“fasces, bundle, group”) + -ismo (“-ism”) with direct reference to Benito Mussolini's fasci di combattimento (\"fight clubs\"), from Latin fasces, bundles of axes and rods carried before the magistrates of the ancient Roman Republic as representative of their power of life and death. Originally with exclusive reference to Fascist Italy which used the fasces as an emblem, later broadened to describe all of the Axis Powers of World War II, and subsequently used as a general term of opprobrium in English and international political discourse."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fascism (usually uncountable, plural fascisms)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any right-wing, authoritarian, nationalist ideology characterized by centralized, totalitarian governance, strong regimentation of the economy and society, and repression of criticism or opposition. [1922]",
                  "examples": [
                    "Fascism, at any rate the German version, is a form of capitalism that borrows from Socialism just such features as will make it efficient for war purposes... Ownership has never been abolished, there are still capitalists and workers, and—this is the important point, and the real reason why rich men all over the world tend to sympathize with Fascism—generally speaking the same people are capitalists and the same people workers as before the Nazi revolution. But at the same time the State, which is simply the Nazi Party, is in control of everything... The mere efficiency of such a system, the elimination of waste and obstruction, is obvious. In seven years it has built up the most powerful war machine the world has ever seen."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, derogatory) Any system of strong autocracy or oligarchy usually to the extent of bending and breaking the law, race-baiting, and/or violence against largely unarmed populations.",
                  "examples": [
                    "...even the people who recklessly fling the word ‘Fascist’ in every direction attach at any rate an emotional significance to it. By ‘Fascism’ they mean, roughly speaking, something cruel, unscrupulous, arrogant, obscurantist, anti-liberal and anti-working-class. Except for the relatively small number of Fascist sympathizers, almost any English person would accept ‘bully’ as a synonym for ‘Fascist’. That is about as near to a definition as this much-abused word has come."
                  ]
                }
              ]
            },
            {
              "group": "(figurative, derogatory) Any extreme reliance on or enforcement of rules and regulations.",
              "entries": [
                {
                  "meaning": "Synonym: sticklerism",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}