{
  "word": "croft",
  "etymologies": [
    {
      "description": [
        "The noun is derived from Middle English croft, crofft, croffte, croofte, crofte (“croft”), from Old English croft (“enclosed field”); further etymology uncertain, but possibly from Proto-Germanic *kruftaz (“a hill; a curve”), from Proto-Indo-European *grewb- (“to bend; arch, crook, curve”); see also crop. The English word is cognate with Middle Dutch kroft, krocht, crocht (“high and dry land; a field on the downs”), Middle Low German kroch (“enclosed piece of farmland or pasture”), Scots croft, craft (“croft”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "croft (plural crofts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An enclosed piece of land, usually small and arable and used for small-scale food production, and often with a dwelling next to it; in particular, such a piece of land rented to a farmer (a crofter), especially in Scotland, together with a right to use separate pastureland shared by other crofters.",
                  "examples": [
                    "Synonym: quillet"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "croft (third-person singular simple present crofts, present participle crofting, simple past and past participle crofted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To do agricultural work on one or more crofts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To place (cloth, etc.) on the ground in the open air in order to sun and bleach it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English croft, crofte, croufte, crufte (“crypt; vault”), from Old English cruft, from Latin crupta, crypta (“crypt; vault”), from Ancient Greek κρυπτή (kruptḗ), feminine form of κρῠπτός (kruptós, “concealed, hidden; secret”), from κρύπτω (krúptō, “to conceal, hide; to obscure”) (further etymology unknown) + -ος (-os). The English word is cognate with Middle Dutch croft, crocht, crochte, crogt, cruft, crufte (modern Dutch krocht (“underground cavity, cave; underground vault, crypt”)), Middle Low German krucht, kruft (“crypt”), Old High German cruft (Middle High German kruft (“cave; crypt”)). Doublet of grotto and crypt."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "croft (plural crofts) (archaic)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underground chamber; a crypt, an undercroft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A cave or cavern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "A variant of carafe."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "croft (plural crofts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) A carafe.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}