{
  "word": "denounce",
  "etymologies": [
    {
      "description": [
        "From Old French denuncier, from Latin dēnūntiō (“to announce, to denounce, to threaten”), from de + nūntiō (“to announce, to report, to denounce”), from nūntius (“messenger, message”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "denounce (third-person singular simple present denounces, present participle denouncing, simple past and past participle denounced)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To make known in a formal manner; to proclaim; to announce; to declare.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To criticize or speak out against (someone or something); to point out as deserving of reprehension, etc.; to openly accuse or condemn in a threatening manner; to invoke censure upon; to stigmatize; to blame.",
                  "examples": [
                    "to denounce someone as a swindler, or as a coward"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To make a formal or public accusation against; to inform against; to accuse.",
                  "examples": [
                    "to denounce a confederate in crime",
                    "to denounce someone to the authorities"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To proclaim in a threatening manner; to threaten by some outward sign or expression; make a menace of.",
                  "examples": [
                    "to denounce war; to denounce punishment"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To announce the termination of; especially a treaty or armistice.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, historical) To claim the right of working a mine that is abandoned or insufficiently worked.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}