{
  "word": "flurry",
  "etymologies": [
    {
      "description": [
        "Perhaps an American English blend of flutter and hurry. Alternatively, perhaps from an obsolete term flurr (“scatter”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "flurry (plural flurries)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light, brief snowfall.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden and brief blast or gust; a light, temporary breeze.",
                  "examples": [
                    "a flurry of wind"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shower of dust, leaves etc. brought on by a sudden gust of wind.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative) Any sudden activity; a stir.",
                  "examples": [
                    "These [argument structure] modifications are important because they have provoked a flurry of investigation into argument structure operations of merger, demotion etc."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snack consisting of soft ice cream mixed with small pieces of fruit, cookie crumbs, etc.",
                  "examples": [
                    "Does your \"Forbidden Foods\" list include banana splits, ice cream sundaes, slurpies, popsicles, frozen yogurts, milk shakes, and ice cream flurries? These foods taste great but have a reputation for being bad for your health."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The violent spasms of a dying whale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An occurrence of something (countable instances) in large numbers, happening suddenly or in a short period of time.",
                  "examples": [
                    "Synonyms: volley, barrage",
                    "The fencer landed a flurry of hits on her opponent.",
                    "The think piece provoked a flurry of media responses for the remainder of the week."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "flurry (third-person singular simple present flurries, present participle flurrying, simple past and past participle flurried)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To agitate, bewilder, fluster.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move or fall in a flurry.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}