{
  "word": "snap",
  "etymologies": [
    {
      "description": [
        "From Dutch snappen (“to bite; seize”) or Low German snappen (“to bite; seize”), ultimately from Proto-West Germanic *snappōn, from Proto-Germanic *snappōną (“to snap; snatch; chatter”), intensive form of *snapāną (”to snap; grab”, whence Old Norse snapa (“to get; scrounge”)), from Proto-Indo-European *snop-; compare Lithuanian snãpas (“beak, bill”). (One alternative hypothesis links the Germanic words to *snu-, an expressive root deriving words meaning “nose”, “snout”, “sniff” etc., but this is phonetically unsound.) Cognate with West Frisian snappe (“to get; catch; snap”), German schnappen (“to grab”), Swedish snappa (“to snatch”). In any case influenced by onomatopoeia; note expressions such as snip-snap, containing the formally unrelated snip.",
        "The verb is derived from the noun."
      ],
      "adjectives": [
        {
          "description": "snap (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal, attributive) Done, made, performed, etc., quickly and unexpectedly, or without deliberation.",
                  "examples": [
                    "a snap judgment or decision",
                    "a snap political convention"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "snap (countable and uncountable, plural snaps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quick breaking or cracking sound or the action of producing such a sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sudden break.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An attempt to seize, bite, attack, or grab.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of snapping the fingers; making a sound by pressing a finger against the thumb and suddenly releasing to strike the hand.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fastening device that makes a snapping sound when used.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A photograph; a snapshot.",
                  "examples": [
                    "We took a few snaps of the old church before moving on."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sudden release of something held under pressure or tension.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin circular cookie or similar baked good.",
                  "examples": [
                    "a ginger snap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A brief, sudden period of a certain weather; used primarily in the phrase cold snap.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A very short period of time (figuratively, the time taken to snap one's fingers), or a task that can be accomplished in such a period.",
                  "examples": [
                    "It'll be a snap to get that finished.",
                    "I can fix most vacuum cleaners in a snap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snap bean such as Phaseolus vulgaris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) A backward pass or handoff of a football from its position on the ground that puts the ball in play; a hike.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) A rivet: a scrapbooking embellishment.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fishing) A small device resembling a safety pin, used to attach the bait or lure to the line.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, regional) A small meal, a snack; lunch.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A card game, primarily for children, in which players cry \"snap\" to claim pairs of matching cards as they are turned up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A greedy fellow.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which is, or may be, snapped up; something bitten off, seized, or obtained by a single quick movement; hence, a bite, morsel, or fragment; a scrap.",
                  "examples": [
                    "He's a nimble fellow, / And alike skill'd in every liberal science, / As having certain snaps of all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "briskness; vigour; energy; decision",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, archaic) Any circumstance out of which money may be made or an advantage gained. used primarily in the phrase soft snap.",
                  "examples": [
                    "A Sea Soldier is certaine of victuals and wages, where the Land Soldiers pay will hardly find him sustenance. A Sea Soldier may now and than chaunce to haue a snapp at a bootie or a price, which may in an instant make him a fortune  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) Something that is easy or effortless.",
                  "examples": [
                    "I’m afraid my course is regarded as a ‘snap.’ Everybody, it seems, can grasp English literature (and produce it)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A snapper, or snap beetle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(physics, humorous) jounce (the fourth derivative of the position vector with respect to time), followed by crackle and pop",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quick offhand shot with a firearm; a snap shot.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) Something of no value.",
                  "examples": [
                    "not worth a snap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social media) A visual message sent through the Snapchat application.",
                  "examples": [
                    "By April 2014, over 700 million snaps are shared per day on Snapchat — more than Facebook, WhatsApp, and other social networks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Linux) A package provided for the application sandboxing system snapd developed by Canonical.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A crisp or pithy quality; epigrammatic point or force.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used by riveters.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A tool used by glass-moulders.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A brief theatrical engagement.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, dated) A cheat or sharper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A newsflash.",
                  "examples": [
                    "A 'snap' usually becomes a 'newsflash' on air. Keep snaps short, only run them when news is really 'hot', and try not to break a story within a few minutes of the bulletin unless it is top priority."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "snap (third-person singular simple present snaps, present participle snapping, simple past and past participle snapped or (obsolete) snapt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive) To fracture or break apart suddenly.",
                  "examples": [
                    "He snapped his stick in anger.",
                    "If you bend it too much, it will snap."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give forth or produce a sharp cracking noise; to crack.",
                  "examples": [
                    "Blazing firewood snaps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To attempt to seize or bite with the teeth, beak, etc.",
                  "examples": [
                    "A dog snaps at a passenger. A fish snaps at the bait."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To attempt to seize with eagerness.",
                  "examples": [
                    "She snapped at the chance to appear on television."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To speak abruptly or sharply.",
                  "examples": [
                    "He snapped at me for the slightest mistake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To give way abruptly and loudly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To suffer a mental breakdown, usually while under tension.",
                  "examples": [
                    "She should take a break before she snaps."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flash or appear to flash as with light.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To fit or fasten together with a snapping sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, computing, graphical user interface) To jump to a fixed position relative to another element.",
                  "examples": [
                    "The floating toolbar will snap to the edge of the screen when dragged towards it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To snatch with or as if with the teeth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pull apart with a snapping sound; to pop loose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To say abruptly or sharply.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, dated) To speak to abruptly or sharply; to treat snappishly; usually with up.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause something to emit a snapping sound, especially by closing it rapidly.",
                  "examples": [
                    "to snap a fastener",
                    "to snap a whip"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To close something using a snap as a fastener.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) A video of a person snapping their fingers.Alternative snapping techniqueTo snap one's fingers: to make a snapping sound, often by pressing the thumb and an opposing finger of the same hand together and suddenly releasing the grip so that the finger hits against the palm; alternatively, by bringing the index finger quickly down onto the middle finger and thumb.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause to move suddenly and smartly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To take a photograph; to release a camera's shutter (which may make a snapping sound).",
                  "examples": [
                    "He snapped a picture of me with my mouth open and my eyes closed."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(social media, transitive) To send a visual message through the Snapchat application.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, American football) To put (a football) in play by a backward pass or handoff from its position on the ground; to hike (a football).",
                  "examples": [
                    "He can snap the ball to a back twenty yards behind him."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To misfire.",
                  "examples": [
                    "The gun snapped."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket, transitive) To catch out sharply (a batsman who has just snicked a bowled ball).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}