{
  "word": "lisp",
  "etymologies": [
    {
      "description": [
        "From Middle English lispen, lipsen, wlispen, from Old English *wlispian (attested in āwlyspian (“to lisp”)), from Old English wlisp, wlips (“stammering, lisping”, adj), from Proto-Germanic *wlispaz (“lisping”), from Proto-Indo-European *wlis-, *wleys- (“rod”), from *wel- (“to turn, roll”). Cognate with Middle Low German wlispen (“to lisp”), Dutch lispen (“to lisp”), German lispeln (“to lisp”), Danish læspe (“to lisp”), Swedish läspa (“to lisp”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "lisp (plural lisps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The habit or an act of lisping.",
                  "examples": [
                    "He used to have a terrible lisp before going to a speech therapist.",
                    "It's common for children to speak with a lisp."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "lisp (third-person singular simple present lisps, present participle lisping, simple past and past participle lisped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To pronounce the consonant ‘s’ imperfectly; to give ‘s’ and ‘z’ the sounds of ‘th’ (/θ/, /ð/). This is a speech impediment common among children.",
                  "examples": [
                    "Until the age of 10, Dominic would lisp, but this was fixed by a speech therapist."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To speak with imperfect articulation; to mispronounce, such as a child learning to talk.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To speak hesitatingly and with a low voice, as if afraid.",
                  "examples": [
                    "Lest when my lisping, guilty tongue should halt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) to express by the use of simple, childlike language.",
                  "examples": [
                    "to speak unto them after their own capacity, and to lisp the words unto them , according as the babes and children of that age might sound them againagain"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To speak with reserve or concealment; to utter timidly or confidentially.",
                  "examples": [
                    "to lisp treason"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}