{
  "word": "principate",
  "etymologies": [
    {
      "description": [
        "From Latin princeps (“first”), referring to the titles princeps senatus (“first among senators”) and princeps civitatis (“first among citizens”), adopted by Octavian Caesar Augustus in order to preserve the illusion of formal continuance of some aspects of the Roman Republic.",
        "Compare prince."
      ],
      "adjectives": [
        {
          "description": "principate (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Primary; principal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "principate (countable and uncountable, plural principates)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical) The early period of the Roman Empire, during which some characteristics of the government of the Roman Republic were retained; the reign of any particular emperor during said period.",
                  "examples": [
                    "The history of the courts and of judicial procedure during the principate is closely parallel to that of the government as a whole."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The office of one who is principal or preeminent (such as a prince); the quality or status of being principal; preeminence.",
                  "examples": [
                    "From all this we may draw the conclusion that papal principate was instituted for the utility and advantage of its subjects and not for the honour and glory or the utility and temporal advantage of the holder of the principate, in such a way as that such principate deserves to be be called 'of service' and not of 'lordship'."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A state ruled by a prince; a principality.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}