{
  "word": "rhubarb",
  "etymologies": [
    {
      "description": [
        "From Middle English rubarbe, from Anglo-Norman reubarbe (modern French rhubarbe), from Late Latin reubarbarum, rheubarbarum, rubarbera, rybarba, probably from Koine Greek ῥῆον βάρβαρον (rhêon bárbaron), from ῥῆον (rhêon, “rhubarb”) + Ancient Greek βάρβαρον (bárbaron), neuter of βάρβαρος (bárbaros, “foreign; barbaric”) (English barbarian).",
        "There is also a Medieval Latin variant rabarbarum, which appears to be influenced by Ancient Greek ῥᾶ (rhâ, “rhubarb”), and gave rise to some of the forms in modern languages. The Ancient Greek variant term appears to have been folk-etymologically influenced by Ancient Greek Ῥᾶ (Rhâ, “the River Volga”), which is in the region from which the plant came to the Mediterranean. The ultimate origin of the Ancient Greek terms is, however, Proto-Iranian *(h)rabā́š (“rhubarb, fennel”).",
        "The word is cognate with Catalan ruibarbre, Italian rabarbaro, Dutch rabarber, German Rhabarber, Old Occitan reubarbe, Portuguese ruibarbo, Spanish ruibarbo."
      ],
      "adjectives": [
        {
          "description": "rhubarb (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of the colour of rhubarb: either brownish-yellow (the colour of rhubarb rhizomes and roots used for medicinal purposes), or pale red (often the colour of the leafstalks of common rhubarb).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "rhubarb (countable and uncountable, plural rhubarb or rhubarbs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any plant of the genus Rheum, especially Rheum rhabarbarum, having large leaves and long green or reddish acidic leafstalks that are edible, in particular when cooked (although the leaves are mildly poisonous).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often attributive) The leafstalks of common rhubarb or garden rhubarb (usually known as Rheum × hybridum), which are long, fleshy, often pale red, and with a tart taste, used as a food ingredient; they are frequently stewed with sugar and made into jam or used in crumbles, pies, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The dried rhizome and roots of Rheum palmatum (Chinese rhubarb) or Rheum officinale (Tibetan rhubarb), from China, used as a laxative and purgative.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, military, aviation, historical) A Royal Air Force World War II code name for operations by aircraft (fighters and fighter-bombers) involving low-level flight to seek opportunistic targets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Saskatchewan) A ditch alongside a road or highway.",
                  "examples": [
                    "Driving home yesterday, I almost hit the rhubarb."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rhubarb (third-person singular simple present rhubarbs, present participle rhubarbing, simple past and past participle rhubarbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, military, aviation) Of fighter aircraft: to fire at a target opportunistically.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Attributed to the circa 1852 practice by the theatre company of English actor Charles Kean (1811–1868) at the Princess’s Theatre, London, of actors saying the word rhubarb repetitively to mimic the sound of indistinct conversation, the word having been chosen because it does not have harsh-sounding consonants or clear vowels.",
        "The baseball senses are said to have been coined by the American sports writer Garry Schumacher and popularized by the American baseball commentator Red Barber (1908–1992). Barber also claimed to have started using the word in the 1940s, based on the practice in “early radio dramas” (presumably in the US, circa 1930) of actors repetitively voicing rhubarb. However, unlike the UK usage, he felt the practice applied to muttering by an angry mob, and so applied the word to arguments on the baseball field where he could not distinguish the words."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rhubarb (countable and uncountable, plural rhubarbs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally theater, uncountable) General background noise caused by several simultaneous indecipherable conversations, which is created in films, stage plays, etc., by actors repeating the word rhubarb; hence, such noise in other settings.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, uncountable, by extension) Nonsense; false utterance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, originally baseball, countable) An excited, angry exchange of words, especially at a sporting event.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, originally baseball, by extension, countable) A brawl.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rhubarb (third-person singular simple present rhubarbs, present participle rhubarbing, simple past and past participle rhubarbed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, originally theater) Of an actor in a film, stage play, etc.: to repeat the word rhubarb to create the sound of indistinct conversation; hence, to converse indistinctly, to mumble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To articulate indistinctly or mumble (words or phrases); to say inconsequential or vague things because one does not know what to say, or to stall for time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}