{
  "word": "plastron",
  "etymologies": [
    {
      "description": [
        "From French plastron, from Italian piastrone, augmentive of piastra (“breastplate”), from Latin emplastrum (“plaster”), from Ancient Greek ἔμπλαστρον (émplastron), from ἔμπλαστος (émplastos, “daubed, plastered”), from ἔμπλασσειν (émplassein, “to mould, form”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plastron (plural plastrons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The nearly flat part of the shell structure of a tortoise or other animal, similar in composition to the carapace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(fencing) A half-jacket worn under the jacket for padding or for safety.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A man's shirt-bosom.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An ornamental front panel on a woman's bodice.",
                  "examples": [
                    "I bought here a wedding dress perhaps twenty or thirty years old [...] a sequin plastron to be worn over the womb as a feminine equivalent to a cod-piece, and a gauze veil embroidered in purple and gold."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A breastplate.",
                  "examples": [
                    "\"Why, compared to what thou wast, Hugo, thou art as a deerskin coat to a steel plastron.-- Art thou not in love, man? Answer me!\" \"Something like, I fear me, beau sire,” replied the squire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A film of air trapped by specialized hairs against the body of an aquatic insect, and which acts as an external gill.",
                  "examples": [
                    "The plastron of a diving beetle is not directly a source of oxygen, but acts as a gill, acquiring oxygen from the surrounding water."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}