{
  "word": "parole",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French parole (“word, formal promise”), from Old French parole, from Late Latin parabola (“speech”), from Ancient Greek παραβολή (parabolḗ). Doublet of parabola, parable, and palaver."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "parole (usually uncountable, plural paroles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(with on) Originally, one's oath or word of honour, given as a condition of release from custody; now specifically, describing the release of a former prisoner under certain conditions, especially the promise of good behaviour. [from 17th c.]",
                  "examples": [
                    "He will be on parole for nearly two more years.",
                    "He was released on parole."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Conditional release of a prisoner (now especially before the end of a custodial sentence), or the term or state of such release; the system governing such releases. [from 17th c.]",
                  "examples": [
                    "The defendant shall be sentenced to life without the possibility of parole."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now historical) A word of honor, especially given by a prisoner of war, to not engage in combat if released. [from 17th c.]",
                  "examples": [
                    "In hospital he gave his parole, and was enlarged after paying for the torn blanket."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A watchword or code phrase; (military) a password given only to officers, distinguished from the countersign, which is given to all guards. [from 18th c.]",
                  "examples": [
                    "‘Classical quotation is the parole of literary men all over the world.’"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linguistics) Language in use, as opposed to language as a system. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, immigration law) The permission for a foreigner who does not meet the technical requirements for a visa to be allowed to enter the U.S. on humanitarian grounds.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) Alternative form of parol",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "parole (third-person singular simple present paroles, present participle paroling, simple past and past participle paroled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, law) To release (a prisoner) on the understanding that s/he checks in regularly and obeys the law.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}