{
  "word": "vomit",
  "etymologies": [
    {
      "description": [
        "From Middle English vomiten, from Latin vomitāre, present active infinitive of vomitō (“vomit repeatedly”), frequentative form of vomō (“be sick, vomit”), from Proto-Indo-European *wemh₁- (“to spew, vomit”). Cognate with Old Norse váma (“nausea, malaise”), Old English wemman (“to defile”). More at wem."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "vomit (usually uncountable, plural vomits)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The regurgitated former contents of a stomach; vomitus.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of regurgitating.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of vomiting",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) That which causes vomiting; an emetic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "vomit (third-person singular simple present vomits, present participle vomiting, simple past and past participle vomited)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To regurgitate or eject the contents of the stomach through the mouth; puke.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To regurgitate and discharge (something swallowed); to spew.",
                  "examples": [
                    "It is the illicit Christmas pudding an incorrigible servant cooks for the little boy one Christmas Day that sparks Oscar's first crisis of belief, for his father, opposed to Christmas pudding on theological grounds, makes the child vomit his helping."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To eject from any hollow place; to belch forth; to emit.",
                  "examples": [
                    "\"Hullo!\" said the athlete, and vomited with this greeting a cloud of tobacco-smoke. It must have been imprisoned in his mouth some time, for no pipe was visible."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}