{
  "word": "wick",
  "etymologies": [
    {
      "description": [
        "From Middle English weke, wicke (“wick”), from Old English wēoce (“wick”), from Proto-West Germanic *weukā (“flax bundle, wick”), from Proto-Indo-European *weg- (“to weave”).",
        "Compare West Frisian wjok, wjuk (“wing”), Dutch wiek (“wing; propeller, blade; wick”), German Wieche (“wisp; wick”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wick (plural wicks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A bundle, twist, braid, or woven strip of cord, fabric, fibre/fiber, or other porous material in a candle, oil lamp, kerosene heater, or the like, that draws up liquid fuel, such as melted tallow, wax, or the oil, delivering it to the base of the flame for conversion to gases and burning; any other length of material burned for illumination in small successive portions.",
                  "examples": [
                    "Trim the wick fairly short, so that the flame does not smoke."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any piece of porous material that conveys liquid by capillary action, such as a strip of gauze placed in a wound to serve as a drain.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A narrow opening in the field, flanked by other players' stones.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) A shot where the played stone touches a stationary stone just enough that the played stone changes direction.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, euphemistic) The penis.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "wick (third-person singular simple present wicks, present participle wicking, simple past and past participle wicked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To convey or draw off (liquid) by capillary action.",
                  "examples": [
                    "The fabric wicks perspiration away from the body."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, of a liquid) To traverse (i.e. be conveyed by capillary action) through a wick or other porous material, as water through a sponge. Usually followed by through.",
                  "examples": [
                    "The moisture slowly wicked through the wood."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(curling) To strike (a stone) obliquely; to strike (a stationary stone) just enough that the played stone changes direction.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From earlier Middle English wik, wich (“village, hamlet, town”); from Old English wīc (“dwelling place, abode”); Germanic borrowing from Latin vīcus (“village, estate”) (see vicinity).",
        "It came to mean “dairy farm” around the 13th or 14th century; for instance, Gatwick (“Goat-farm”). Cognates include Old High German wîch, wih (“village”), German Weichbild (“municipal area”), Dutch wijk (“quarter, district”), Old Frisian wik, Old Saxon wic (“village”), as well as Ancient Greek οἶκος (oîkos, “house”), whence English eco-. Doublet of vicus and -wich."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wick (plural wicks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, chiefly East Anglia and Essex) A farm, especially a dairy farm.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Inherited from Northern Middle English whyk (southern quyk), from Old English cwic (“alive”); similar to an archaic meaning of quick (“endowed with life; having a high degree of vigor, energy, or activity”), and quicken (“come to life”), to which it is related."
      ],
      "adjectives": [
        {
          "description": "wick (comparative wicker or more wick, superlative wickest or most wick)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, derogatory, chiefly Yorkshire) Alive; lively; full of life; active; bustling; nimble; quick.",
                  "examples": [
                    "as wick as an eel",
                    "T' wickest young chap at ivver Ah seen.",
                    "He's a strange wick bairn alus runnin' aboot.",
                    "I'll skin ye wick! (skin you alive)",
                    "I thowt they was dead last back end but they're wick enif noo.",
                    "\"Are you afraid of going across the churchyard in the dark?\" \"Lor' bless yer noä miss! It isn't dead uns I'm scar'd on, it's wick uns.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, derogatory, chiefly Yorkshire, of inanimate objects) resistant to being put to use, stiff, stubborn (as for example a rope or a screw).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "wick",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, obsolete, dialect, chiefly Yorkshire) Liveliness; life.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, chiefly Yorkshire) The growing part of a plant nearest to the roots.",
                  "examples": [
                    "Fed close? Why, it's eaten into t' hard wick. (spoken of a pasture which has been fed very close)"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, chiefly Yorkshire, horticulture)  (Usually plural) The parts of weed roots that remain viable in the ground after inadequate digging prior to cultivation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, dialect, chiefly Yorkshire) A maggot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Old Norse vik, from víkja (“to move, bend, curve”), from Proto-Germanic *wīkwaną."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wick (plural wicks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now dialectal) A corner of the mouth or eye.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}