{
  "word": "advance",
  "etymologies": [
    {
      "description": [
        "From Middle English avauncen, avancen, borrowed from Anglo-Norman avauncier, from Vulgar Latin *abanteāre, from Late Latin ab ante, from Latin ab + ante (“before”). ⟨d⟩ added in analogy to Latin ad- (cf. Middle French advancer). Compare avaunt."
      ],
      "adjectives": [
        {
          "description": "advance (comparative more advance, superlative most advance)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Completed before necessary or a milestone event.",
                  "examples": [
                    "He made an advance payment on the prior shipment to show good faith."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Preceding.",
                  "examples": [
                    "The advance man came a month before the candidate."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Forward.",
                  "examples": [
                    "The scouts found a site for an advance base."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "advance (plural advances)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A forward move; improvement or progression.",
                  "examples": [
                    "an advance in health or knowledge",
                    "an advance in rank or office"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An amount of money or credit, especially given as a loan, or paid before it is due; an advancement.",
                  "examples": [
                    "I shall, with pleasure, make the necessary advances."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An addition to the price; rise in price or value.",
                  "examples": [
                    "an advance on the prime cost of goods"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) An opening approach or overture, now especially of an unwelcome or sexual nature.",
                  "examples": [
                    "For, if it were of any use to recall matters of fact, what is more notorious, than that prince's applying himself first to the church of England? and upon their refusal to fall in with his measures, making the like advances to the dissenters of all kinds, who readily and almost universally complied with him"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "advance (third-person singular simple present advances, present participle advancing, simple past and past participle advanced)",
          "definitionGroups": [
            {
              "group": "To promote or advantage.",
              "entries": [
                {
                  "meaning": "To help the progress of (something); to further. [from 12th c.]",
                  "examples": [
                    "Some see it as in effect the end of the Syrian uprising that began with peaceful protests against Assad’s police state in 2011, with opposition fighters working to advance Turkey’s interests at the expense of the revolution’s goals."
                  ]
                },
                {
                  "meaning": "To raise (someone) in rank or office; to prefer, to promote. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "To move forward in space or time.",
              "entries": [
                {
                  "meaning": "To move or push (something) forwards, especially forcefully. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To make (something) happen at an earlier time or date; to bring forward, to hasten. [form 15th c.]",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To move forwards; to approach. [from 16th c.]",
                  "examples": [
                    "I advanced towards him step by step, stopping sometimes for fear of waking him."
                  ]
                },
                {
                  "meaning": "To provide (money or other value) before it is due, or in expectation of some work; to lend. [from 16th c.]",
                  "examples": [
                    "“I had intended to ask you to advance me a hundred pounds,” said Phineas."
                  ]
                },
                {
                  "meaning": "To put forward (an idea, argument etc.); to propose. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To make progress; to do well, to succeed. [from 16th c.]",
                  "examples": [
                    "Earlier the caller said men were more likely to be in senior positions. Clegg says that's partly because the current maternity leave arrangements make it difficult for women to advance in the workplace."
                  ]
                },
                {
                  "meaning": "(intransitive) To move forward in time; to progress towards completion. [from 16th c.]",
                  "examples": [
                    "I can promise you that you will feel even less humorous as the evening advances."
                  ]
                }
              ]
            },
            {
              "group": "To raise, be raised.",
              "entries": [
                {
                  "meaning": "(transitive, now archaic) To raise; to lift or elevate. [from 14th c.]",
                  "examples": []
                },
                {
                  "meaning": "To raise or increase (a price, rate). [from 14th c.]",
                  "examples": [
                    "In February last […] bakers advanced the price of bread sold over the counter in London from 8d. to 8½d. per quartern loaf."
                  ]
                },
                {
                  "meaning": "To increase (a number or amount). [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) To make a higher bid at an auction. [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}