{
  "word": "rake",
  "etymologies": [
    {
      "description": [
        "From Middle English rake [and other forms], from Old English raca, racu, ræce (“tool with a row of pointed teeth, rake”), from Proto-Germanic *rakō, *rekô (“tool with a row of pointed teeth, rake”), from Proto-Indo-European *h₃reǵ- (“to straighten, right oneself”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, horticulture) A garden tool with a row of pointed teeth fixed to a long handle, used for collecting debris, grass, etc., for flattening the ground, or for loosening soil; also, a similar wheel-mounted tool drawn by a horse or a tractor.",
                  "examples": [
                    "Synonym: (horse-drawn rake) horserake"
                  ]
                }
              ]
            },
            {
              "group": "(by extension) A similarly shaped tool used for other purposes.",
              "entries": [
                {
                  "meaning": "(gambling) A tool with a straight edge at the end used by a croupier to move chips or money across a gaming table.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is partly derived from rake (“tool with a row of pointed teeth”) (see etymology 1) and from Middle English raken (“to rake; to gather by raking; to rake away (debris); to cover with something; (figurative) to conceal, hide; to destroy”) [and other forms], from Old Norse raka (“to scrape”), from Proto-Germanic *raką, probably ultimately from Proto-Indo-European *h₃reǵ- (“to straighten, right oneself”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of raking.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Something that is raked.",
              "entries": [
                {
                  "meaning": "A share of profits, takings, etc., especially if obtained illegally; specifically (gambling) the scaled commission fee taken by a cardroom operating a poker game.",
                  "examples": []
                },
                {
                  "meaning": "(chiefly Ireland, Scotland, slang) A lot, plenty.",
                  "examples": [
                    "Jim has had a rake of trouble with his new car."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rake (third-person singular simple present rakes, present participle raking, simple past and past participle raked)",
          "definitionGroups": [
            {
              "group": "To act upon with a rake, or as if with a rake.",
              "entries": [
                {
                  "meaning": "(transitive, also figurative) Often followed by in: to gather (things which are apart) together, especially quickly.",
                  "examples": [
                    "The casino is just raking in the cash; it’s like a licence to print money."
                  ]
                },
                {
                  "meaning": "(transitive) Often followed by an adverb or preposition such as away, off, out, etc.: to drag or pull in a certain direction.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, intransitive, figurative) To claw at; to scrape, to scratch; followed by away: to erase, to obliterate.",
                  "examples": [
                    "The cat’s sharp claws raked the side of my face."
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, figurative) Followed by up: to bring up or uncover (something), as embarrassing information, past misdeeds, etc.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, intransitive, figurative) To search through (thoroughly).",
                  "examples": [
                    "Synonyms: comb, comb through, go over or through with a fine-tooth comb, scour"
                  ]
                },
                {
                  "meaning": "(transitive, intransitive, also figurative) To move (a beam of light, a glance with the eyes, etc.) across (something) with a long side-to-side motion; specifically (often military) to use a weapon to fire at (something) with a side-to-side motion; to spray with gunfire.",
                  "examples": [
                    "The enemy machine guns raked the roadway."
                  ]
                },
                {
                  "meaning": "(military, nautical) To fire upon an enemy vessel from a position in line with its bow or stern, causing one's fire to travel through the length of the enemy vessel for maximum damage.",
                  "examples": []
                },
                {
                  "meaning": "(transitive, chiefly Ireland, Northern England, Scotland, also figurative) To cover (something) by or as if by raking things over it.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English rake, rakke (“pass, path, track; type of fencing thrust; pasture land (?)”), and then partly:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Northern England and climbing, also figurative) A course, a path, especially a narrow and steep path or route up a hillside.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A fissure or mineral vein of ore traversing the strata vertically, or nearly so.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, originally Northern England, Scotland) A series, a succession; specifically (rail transport) a set of coupled rail vehicles, normally coaches or wagons.",
                  "examples": [
                    "Synonym: consist",
                    "The train was formed of a locomotive and a rake of six coaches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(systems theory) In cellular automata: a puffer that emits a stream of spaceships rather than a trail of debris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Midlands, Northern England) Alternative spelling of raik (“a course, a way; pastureland over which animals graze; a journey to transport something between two places; a run; also, the quantity of items so transported”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rake (third-person singular simple present rakes, present participle raking, simple past and past participle raked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative spelling of raik (“(intransitive, Midlands, Northern England, Scotland) to walk; to roam, to wander; of animals (especially sheep): to graze; (transitive, chiefly Scotland) to roam or wander through (somewhere)”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The verb is derived from Middle English raken (“to go, proceed; to move quickly, hasten, rush; to roam, wander”) [and other forms], from Old English racian (“to go forward, move, run; to hasten; to take a course or direction; to control, direct, govern, rule”), from Proto-West Germanic *rakōn (“to take a course or direction; to run”), from Proto-Indo-European *h₃reǵ- (“to straighten; to direct oneself”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Scotland) Rate of progress; pace, speed.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rake (third-person singular simple present rakes, present participle raking, simple past and past participle raked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, chiefly Midlands, Northern England, Scotland) To move swiftly; to proceed rapidly.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, falconry) Of a bird of prey: to fly after a quarry; also, to fly away from the falconer, to go wide of the quarry being pursued.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The origin of the verb is uncertain. The noun is probably derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A divergence from the horizontal or perpendicular; a slant, a slope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(specifically) In full, angle of rake or rake angle: the angle between the edge or face of a tool (especially a cutting tool) and a plane (usually one perpendicular to the object that the tool is being applied to).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geology) The direction of slip during the movement of a fault, measured within the fault plane.",
                  "examples": []
                }
              ]
            },
            {
              "group": "(nautical) Senses relating to watercraft.",
              "entries": [
                {
                  "meaning": "A slant that causes the bow or stern of a watercraft to extend beyond the keel; also, the upper part of the bow or stern that extends beyond the keel.",
                  "examples": []
                },
                {
                  "meaning": "A slant of some other part of a watercraft (such as a funnel or mast) away from the perpendicular, usually towards the stern.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(roofing) The sloped edge of a roof at or adjacent to the first or last rafter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rake (third-person singular simple present rakes, present participle raking, simple past and past participle raked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, intransitive) To incline (something) from a perpendicular direction.",
                  "examples": [
                    "Synonym: slope",
                    "A mast rakes aft."
                  ]
                }
              ]
            },
            {
              "group": "(nautical) Senses relating to watercraft.",
              "entries": [
                {
                  "meaning": "(transitive) To provide (the bow or stern of a watercraft) with a rake (“a slant that causes it to extend beyond the keel”).",
                  "examples": []
                },
                {
                  "meaning": "(intransitive, rare) Of a watercraft: to have a rake at its bow or stern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "The noun is a clipping of rakehell (“(archaic) lewd or wanton person, debauchee, rake”), from to rake (out) hell (“to search through hell thoroughly”), in the sense of a person so evil or immoral that they cannot be found in hell even after an extensive search: see rake (“to search through (thoroughly)”).",
        "The verb is derived from the noun."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "rake (plural rakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person (usually a man) who is stylish but habituated to hedonistic and immoral conduct.",
                  "examples": [
                    "Synonym: roué"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "rake (third-person singular simple present rakes, present participle raking, simple past and past participle raked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, dated, rare) To behave as a rake; to lead a hedonistic and immoral life.",
                  "examples": [
                    "Synonyms: see Thesaurus:harlotize"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}