{
  "word": "basis",
  "etymologies": [
    {
      "description": [
        "From Latin basis, from Ancient Greek βάσις (básis), from Proto-Indo-European *gʷémtis, derived from Proto-Indo-European *gʷem- (whence also come). Doublet of base."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "basis (plural bases or (rare) baseis or (nonstandard) basises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A physical base or foundation.",
                  "examples": [
                    "Beholding rocks from their firm basis rent;Mountain on mountain thrown,With threatening hurl, that shook th' aerial firmament!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A starting point, base or foundation for an argument or hypothesis.",
                  "examples": [
                    "Audio (US)(file)",
                    "I wonder if the South Korean side has any basis that its smog is from China."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An underlying condition or circumstance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A regular frequency.",
                  "examples": [
                    "You should brush your teeth on a daily basis at minimum.",
                    "The flights to Fiji leave on a weekly basis.",
                    "Cars must be checked on a yearly basis."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(agriculture, trading) The difference between the cash price a dealer pays to a farmer for his produce and an agreed reference price, which is usually the futures price at which the given crop is trading at a commodity exchange.",
                  "examples": [
                    "Included in the basis could be elevation, cleaning, freight by truck and/or rail, government inspection fees, administration fees, interest and storage charges as well as allowance for risk and profit for the grain dealer.https://www.alberta.ca/wheat-basis-levels.aspx"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(linear algebra) In a vector space, a linearly independent set of vectors spanning the whole vector space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(accounting) Amount paid for an investment, including commissions and other expenses.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(topology) A collection of subsets (\"basis elements\") of a set, such that this collection covers the set, and for any two basis elements which both contain an element of the set, there is a third basis element contained in the intersection of the first two, which also contains that element.",
                  "examples": [
                    "The collection of all possible unions of basis elements of a basis is said to be the topology generated by that basis."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}