{
  "word": "train",
  "etymologies": [
    {
      "description": [
        "From Middle English trayne (“train”), from Old French train (“a delay, a drawing out”), from traïner (“to pull out, to draw”), from Vulgar Latin *traginō, from *tragō, from Latin trahō (“to pull, to draw”), ultimately from Proto-Indo-European *tregʰ- (“to pull, draw, drag”). The verb was derived from the noun in Middle English."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "train (plural trains)",
          "definitionGroups": [
            {
              "group": "Elongated or trailing portion.",
              "entries": [
                {
                  "meaning": "The elongated back portion of a dress or skirt (or an ornamental piece of material added to similar effect), which drags along the ground. [from 14th c.]",
                  "examples": [
                    "Unfortunately, the leading bridesmaid stepped on the bride's train as they were walking down the aisle."
                  ]
                },
                {
                  "meaning": "A trail or line of something, especially gunpowder. [from 15th c.]",
                  "examples": [
                    "[E]mancipation is put into such a train that in a few years there will be no slaves Northward of Maryland."
                  ]
                },
                {
                  "meaning": "The tail of a bird.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The tail of an animal in general.",
                  "examples": []
                },
                {
                  "meaning": "(poetic) The elongated body or form of something narrow and winding, such as the course of a river or the body of a snake.",
                  "examples": []
                },
                {
                  "meaning": "(astronomy) A transient trail of glowing ions behind a large meteor as it falls through the atmosphere or accompanying a comet as it nears the sun; tail.",
                  "examples": []
                },
                {
                  "meaning": "(now rare) An animal's trail or track. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "(obsolete, hunting) Something dragged or laid along the ground to form a trail of scent or food along which to lure an animal.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Gait or manner of running of a horse.",
                  "examples": []
                }
              ]
            },
            {
              "group": "Connected sequence of people or things.",
              "entries": [
                {
                  "meaning": "A group of people following an important figure such as a king or noble; a retinue, a group of retainers. [from 14th c.]",
                  "examples": [
                    "Grace was glad the citizenry did not know Katherine Gordon was in the king’s train, but she was beginning to understand Henry’s motive for including the pretender’s wife."
                  ]
                },
                {
                  "meaning": "A group of animals, vehicles, or people that follow one another in a line, such as a wagon train; a caravan or procession. [from 15th c.]",
                  "examples": [
                    "Our party formed a train at the funeral parlor before departing for the burial."
                  ]
                },
                {
                  "meaning": "(figuratively, poetic) A group or class of people.",
                  "examples": []
                },
                {
                  "meaning": "(military) The men and vehicles following an army, which carry artillery and other equipment for battle or siege. [from 16th c.]",
                  "examples": []
                },
                {
                  "meaning": "A sequence of events or ideas which are interconnected; a course or procedure of something. [from 15th c.]",
                  "examples": [
                    "A man may be absorbed in the deepest thought, and his brow will remain smooth until he encounters some obstacle in his train of reasoning, or is interrupted by some disturbance, and then a frown passes like a shadow over his brow."
                  ]
                },
                {
                  "meaning": "A set of things, events, or circumstances that follow after or as a consequence; aftermath, wake.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) State of progress, status, situation (in phrases introduced by in a + adjective); also proper order or situation (introduced by in or in a alone). [18th–19th c.]",
                  "examples": [
                    "in a fair / better / worse train"
                  ]
                },
                {
                  "meaning": "A set of interconnected mechanical parts which operate each other in sequence. [from 18th c.]",
                  "examples": []
                },
                {
                  "meaning": "A series of electrical pulses. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A series of specified vehicles (originally tramcars in a mine as usual, later especially railway carriages) coupled together. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "A mechanical (traditionally steam-powered, now typically diesel or electrical) vehicle carrying a large number of passengers and freight along a designated track or path; a line of connected cars or carriages considered overall as a mode of transport; (as uncountable noun) rail or road travel. [from 19th c.]",
                  "examples": [
                    "The train will pull in at midday."
                  ]
                },
                {
                  "meaning": "A long, heavy sleigh used in Canada for the transportation of merchandise, wood, etc.",
                  "examples": []
                },
                {
                  "meaning": "(computing) A software release schedule.",
                  "examples": [
                    "What steps do development engineers follow when adding new feature code? How do they support different software versions or release trains?"
                  ]
                },
                {
                  "meaning": "(sex, slang) An act wherein series of men line up and then penetrate a person, especially as a form of gang rape. [from 20th c.]",
                  "examples": [
                    "“You want us to run a train on you?”"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "train (third-person singular simple present trains, present participle training, simple past and past participle trained)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To practice an ability.",
                  "examples": [
                    "She trained seven hours a day to prepare for the Olympics."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To teach and form (someone) by practice; to educate (someone).",
                  "examples": [
                    "You can't train a pig to write poetry."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To improve one's fitness.",
                  "examples": [
                    "I trained with weights all winter."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To proceed in sequence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (a gun) laterally so that it points in a different direction.",
                  "examples": [
                    "The assassin had trained his gun on the minister."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, horticulture) To encourage (a plant or branch) to grow in a particular direction or shape, usually by pruning and bending.",
                  "examples": [
                    "The vine had been trained over the pergola."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, mining) To trace (a lode or any mineral appearance) to its head.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, video games) To create a trainer for; to apply cheats to (a game).",
                  "examples": [
                    "I got a twix on the 128 version being fixed and trained by Mad Max at M2K BBS 208-587-7636 in Mountain Home Idaho. He fixes many games and puts them on his board. One of my sources for games and utils."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To draw (something) along; to trail, to drag (something).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete, of clothing) To trail down or along the ground.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To draw by persuasion, artifice, or the like; to attract by stratagem; to entice; to allure.",
                  "examples": [
                    "Thou hast been trained from thy post by some deep guile — some well-devised stratagem — the cry of some distressed maiden has caught thine ear, or the laughful look of some merry one has taken thine eye."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English trayne (“treachery”), from Anglo-Norman traine, Middle French traïne, from traïr (“to betray”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "train (countable and uncountable, plural trains)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, obsolete) Treachery; deceit. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A trick or stratagem. [14th–19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A trap for animals, a snare; (figuratively) a trap in general. [14th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete) A lure; a decoy. [15th–18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, obsolete, falconry) A live bird, handicapped or disabled in some way, provided for a young hawk to kill as training or enticement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Dutch traan (“tear, drop”), from Middle Dutch trâen, from Old Dutch trān, from Proto-Germanic *trahnuz. Compare German Träne (“tear”), Tran (“train oil”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "train (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) train oil, whale oil.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}