{
  "word": "issue",
  "etymologies": [
    {
      "description": [
        "From Middle English issue, from Old French issue (“an exit, a way out”), feminine past participle of issir (“to exit”), from Latin exeō (“go out, exit”), from prefix ex- (“out”) + eō (“go”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "issue (plural issues)",
          "definitionGroups": [
            {
              "group": "The action or an instance of flowing or coming out, an outflow, particularly:",
              "entries": [
                {
                  "meaning": "(military, obsolete) A movement of soldiers towards an enemy, a sortie.",
                  "examples": []
                },
                {
                  "meaning": "(medicine) The outflow of a bodily fluid, particularly (now rare) in abnormal amounts.",
                  "examples": [
                    "The technique minimizes the issue of blood from the incision."
                  ]
                }
              ]
            },
            {
              "group": "Someone or something that flows out or comes out, particularly:",
              "entries": [
                {
                  "meaning": "(medicine, now rare) The bodily fluid drained through a natural or artificial issue.",
                  "examples": []
                },
                {
                  "meaning": "(now usually historical or law) Offspring: one's natural child or children.",
                  "examples": [
                    "He died intestate and without issue, so the extended family have all lawyered up."
                  ]
                },
                {
                  "meaning": "(figuratively) Progeny: all one's lineal descendants.",
                  "examples": [
                    "Although his own kingdom disappeared, his issue went on to rule a quarter of Europe."
                  ]
                },
                {
                  "meaning": "(figuratively, obsolete) A race of people considered as the descendants of some common ancestor.",
                  "examples": []
                },
                {
                  "meaning": "(now rare) The produce or income derived from farmland or rental properties.",
                  "examples": [
                    "3. A conveys to B all right to the real property aforementioned for a term of _____ years, with all said real property's attendant issues, rents, and profits."
                  ]
                },
                {
                  "meaning": "(historical or rare law) Income derived from fines levied by a court or law-enforcement officer; the fines themselves.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The entrails of a slaughtered animal.",
                  "examples": []
                },
                {
                  "meaning": "(rare and obsolete) Any action or deed performed by a person.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) Luck considered as the favor or disfavor of nature, the gods, or God.",
                  "examples": []
                },
                {
                  "meaning": "(publishing) A single edition of a newspaper or other periodical publication.",
                  "examples": [
                    "Yeah, I just got the June issue of Wombatboy."
                  ]
                },
                {
                  "meaning": "The entire set of some item printed and disseminated during a certain period, particularly (publishing) a single printing of a particular edition of a work when contrasted with other print runs.",
                  "examples": [
                    "The May 1918 issue of US 24-cent stamps became famous when a printer's error inverted its depiction of an airmail plane."
                  ]
                },
                {
                  "meaning": "(figuratively, originally World War I military slang, usually with definite article) The entire set of something; all of something.",
                  "examples": [
                    "The bloody sergeant snaffled our whole issue of booze, dammit."
                  ]
                },
                {
                  "meaning": "(finance) Any financial instrument issued by a company.",
                  "examples": [
                    "The company's issues have included bonds, stocks, and other securities."
                  ]
                },
                {
                  "meaning": "The loan of a book etc. from a library to a patron; all such loans by a given library during a given period.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The means or opportunity by which something flows or comes out, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete) A sewer.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The place where something flows or comes out, an outlet, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete) An exit from a room or building.",
                  "examples": [
                    "How if there were no centre at all, but just one alley after another, and the whole world a labyrinth without end or issue?"
                  ]
                },
                {
                  "meaning": "(now rare) A confluence: the mouth of a river; the outlet of a lake or other body of water.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The action or an instance of sending something out, particularly:",
              "entries": [
                {
                  "meaning": "(historical medicine) A small incision, tear, or artificial ulcer, used to drain fluid and usually held open with a pea or other small object.",
                  "examples": [
                    "Issues and fontanels were supposed remedies for joint diseases, pulmonary tuberculosis, and other chronic conditions."
                  ]
                },
                {
                  "meaning": "The production or distribution of something for general use.",
                  "examples": [
                    "Congress delegated the issue of US currency to the Federal Reserve in 1913."
                  ]
                },
                {
                  "meaning": "The distribution of something (particularly rations or standardized provisions) to someone or some group.",
                  "examples": [
                    "The uniform was standard prison issue."
                  ]
                },
                {
                  "meaning": "(finance) The action or an instance of a company selling bonds, stock, or other securities.",
                  "examples": [
                    "The company's stock issue diluted his ownership."
                  ]
                }
              ]
            },
            {
              "group": "Any question or situation to be resolved, particularly:",
              "entries": [
                {
                  "meaning": "(law) A point of law or fact in dispute or question in a legal action presented for resolution by the court.",
                  "examples": [
                    "The issue before the court is whether participation in a group blog makes the plaintiff a public figure under the relevant statute."
                  ]
                },
                {
                  "meaning": "(figuratively) Anything in dispute, an area of disagreement whose resolution is being debated or decided.",
                  "examples": [
                    "For chrissakes, John, don't make an issue out of it. Just sleep on the floor if you want."
                  ]
                },
                {
                  "meaning": "(rare and obsolete) A dispute between two alternatives, a dilemma.",
                  "examples": []
                },
                {
                  "meaning": "(US, originally psychology, usually in the plural) A psychological or emotional difficulty, (now informal, figurative and usually euphemistic) any problem or concern considered as a vague and intractable difficulty.",
                  "examples": [
                    "She has daddy issues, mommy issues, drug issues, money issues, trust issues, printer issues... I'm just sayin', girl's got issues."
                  ]
                }
              ]
            },
            {
              "group": "The action or an instance of concluding something, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete) The end of any action or process.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The end of any period of time.",
                  "examples": []
                }
              ]
            },
            {
              "group": "The end result of an event or events, any result or outcome, particularly:",
              "entries": [
                {
                  "meaning": "(now rare) The result of a discussion or negotiation, an agreement.",
                  "examples": []
                },
                {
                  "meaning": "(obsolete) The result of an investigation or consideration, a conclusion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, now rare) The action or an instance of feeling some emotion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, now rare) The action or an instance of leaving any state or condition.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "issue (third-person singular simple present issues, present participle issuing, simple past and past participle issued)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To flow out, to proceed from, to come out or from.",
                  "examples": [
                    "The water issued forth from the spring.",
                    "The rents issuing from the land permitted him to live as a man of independent means."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To rush out, to sally forth.",
                  "examples": [
                    "The men issued from the town and attacked the besiegers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To extend into, to open onto.",
                  "examples": [
                    "The road issues into the highway."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To turn out in a certain way, to result in.",
                  "examples": [
                    "But, for Livy, Roman patriotism is overriding, and this issues, of course, in an antiquarian attention to the city's origins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To end up as, to turn out being, to become as a result.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) To come to a point in fact or law on which the parties join issue.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To send out; to put into circulation.",
                  "examples": [
                    "The Federal Reserve issues US dollars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deliver for use.",
                  "examples": [
                    "The prison issued new uniforms for the inmates."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To deliver by authority.",
                  "examples": [
                    "The court issued a writ of mandamus."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}