{
  "word": "cabin",
  "etymologies": [
    {
      "description": [
        "From Middle English caban, cabane, from Old French cabane, from Medieval Latin capanna (“a cabin”); see further etymology there. Doublet of cabana."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cabin (plural cabins)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A small dwelling characteristic of the frontier, especially when built from logs with simple tools and not constructed by professional builders, but by those who meant to live in it.",
                  "examples": [
                    "Abraham Lincoln was born in a log cabin."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A chalet or lodge, especially one that can hold large groups of people.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A private room on a ship.",
                  "examples": [
                    "the captain's cabin:  Passengers shall remain in their cabins."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The interior of a boat, enclosed to create a small room, particularly for sleeping.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The passenger area of an airplane.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(travel, aviation) The section of a passenger plane having the same class of service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rail transport, informal) A signal box.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A small room; an enclosed place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(India) A private office; particularly of a doctor, businessman, lawyer, or other professional.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cabin (third-person singular simple present cabins, present participle cabining, simple past and past participle cabined)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To place in a cabin or other small space.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) To limit the scope of.",
                  "examples": [
                    "There was a time when this Court’s precedents may have portended the kind of First Amendment liability for purely private property owners that the majority spends so much time rejecting.  […]  But the Court soon stanched that trend. See Lloyd Corp. v. Tanner, 407 U. S. 551, 561–567 (1972) (cabining Marsh and refusing to extend Logan Valley); Hudgens v. NLRB, 424 U. S. 507, 518 (1976) (making clear that “the rationale of Logan Valley did not survive” Lloyd)."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To live in, or as if in, a cabin; to lodge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}