{
  "word": "tweak",
  "etymologies": [
    {
      "description": [
        "From Middle English twikken, from Old English twiccian (“to pluck”), from Proto-West Germanic *twekkōn (“to fasten; clamp; pinch”). Related to twitch. The drug-related sense may be a blend of twitch and freak."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tweak (plural tweaks)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A sharp pinch or jerk; a twist or twitch.",
                  "examples": [
                    "a tweak of the nose"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A slight adjustment or modification.",
                  "examples": [
                    "He is running so many tweaks it is hard to remember how it looked originally."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Trouble; distress; tweag.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete, slang) A prostitute.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cryptography) An additional input to a block cipher, used in conjunction with the key to select the permutation computed by the cipher.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tweak (third-person singular simple present tweaks, present participle tweaking, simple past and past participle tweaked)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pinch and pull with a sudden jerk and twist; to twitch.",
                  "examples": [
                    "to tweak the nose."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, informal) To adjust slightly; to fine-tune.",
                  "examples": [
                    "If we tweak the colors towards blue, it will look more natural."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To tease, to annoy; to get under the skin of (someone, typically so as to irritate them, or by extension to enamor, frighten, etc).",
                  "examples": [
                    "Oh, he loved to tweak people and say things like \"Hiya sweetums\" to me because that was not exactly de rigueur in front of a bunch of strong feminists. He had this enormous sense of humor. I never knew what he was going to say."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, slang) To abuse methamphetamines, especially crystal meth.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, US, slang) To exhibit extreme nervousness, evasiveness when confronted by authorities, compulsiveness, erratic motion, excitability, etc, due to or mimicking the symptoms of methamphetamine abuse.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}