{
  "word": "plight",
  "etymologies": [
    {
      "description": [
        "From Middle English plit (“fold, wrinkle, bad situation”), conflation of Middle English pliht, plight (“risky promise, peril”) (from Old English pliht \"danger, risk\") and Anglo-Norman plit, plyte (“fold, condition”), from Old French pleit (“condition, manner of folding”) (from Vulgar Latin *plictum, from Latin plicitum (“fold”))."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plight (plural plights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A dire or unfortunate situation. [from 14th c.]",
                  "examples": [
                    "Though we say we are quite clear about it and understand when someone uses the expression, unlike that other expression, maybe we're in the same plight with regard to them both."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare) A (neutral) condition or state. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Good health. [14th–19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "From Middle English plight (“risk, danger”), from Old English pliht (“peril, risk, danger, damage, plight”), from Proto-West Germanic *plihti (“care, responsibility, duty”). A suffixed form of the root represented by Old English pleoh (“risk, danger, hurt, peril\"; also \"responsibility”) and plēon (“to endanger, risk”). Akin to Old English plihtan (“to endanger, compromise”). Cognate with Scots plicht (“responsibility, plight”), Dutch plicht, Low German plicht (“duty”), German Pflicht (“duty”), Danish pligt (“duty”), Yiddish פֿליכט‎ (flikht). More at pledge."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plight (plural plights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) Responsibility for ensuing consequences; risk; danger; peril.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) An instance of danger or peril; a dangerous moment or situation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) Blame; culpability; fault; wrong-doing; sin; crime.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now chiefly dialectal) One's office; duty; charge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) That which is exposed to risk; that which is plighted or pledged; security; a gage; a pledge.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "plight (third-person singular simple present plights, present participle plighting, simple past and past participle plighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, now rare) To expose to risk; to pledge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Specifically, to pledge (one's troth etc.) as part of a marriage ceremony.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To promise (oneself) to someone, or to do something.",
                  "examples": [
                    "I ask what I have done to deserve it, one daughter hobnobbing with radicals and the other planning to plight herself to a criminal."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English plyghten, plyȝten, pleyȝten, pleiten, pliten, from the noun (see below)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "plight (third-person singular simple present plights, present participle plighting, simple past and past participle plighted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To weave; to braid; to fold; to plait.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English pliȝt, plight, plyt, pleit, from Anglo-Norman pleit (“pleat, fold”). More at plait."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "plight (plural plights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A network; a plait; a fold; rarely a garment.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}