{
  "word": "nether",
  "etymologies": [
    {
      "description": [
        "From Middle English nether, nethere, nithere, from Old English niþera (“lower, under, lowest”, adjective), from niþer, niþor (“below, beneath, down, downwards, lower, in an inferior position”, adverb), from Proto-West Germanic [Term?], from Proto-Germanic *niþer, *niþra (“down”), from Proto-Indo-European *ni-, *nei- (“in, down”). Cognates include Dutch neder, German nieder, Luxembourgish nidder, Danish, Norwegian and Swedish ned, Faroese and Icelandic niður."
      ],
      "adjectives": [
        {
          "description": "nether (comparative nethermore, superlative nethermost)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lower; under.",
                  "examples": [
                    "The disappointed child’s nether lip quivered."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lying beneath, or conceived as lying beneath, the Earth’s surface.",
                  "examples": [
                    "the nether regions"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [
        {
          "description": "nether (comparative more nether, superlative most nether)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Down; downward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Low; low down.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Alteration of earlier nither, from Middle English nitheren, from Old English niþerian (“to depress, abase, bring low, humiliate, oppress, accuse, condemn”), from niþer (“below, beneath, down, downwards, lower, in an inferior position”). See above."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "nether (plural nethers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK dialectal, Scotland) Oppression; stress; a withering or stunting influence.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A trouble; a fault or dislocation in a seam of coal.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "nether (third-person singular simple present nethers, present participle nethering, simple past and past participle nethered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To bring or thrust down; bring or make low; lower; abase; humble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Northern England, Scotland) To constrict; straiten; confine; restrict; suppress; lay low; keep under; press in upon; vex; harass; oppress.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Scotland) To pinch or stunt with cold or hunger; check in growth; shrivel; straiten.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Scotland) To shrink or huddle, as with cold; be shivery; tremble.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, UK dialectal, Scotland) To depreciate; disparage; undervalue.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}