{
  "word": "sorry",
  "etymologies": [
    {
      "description": [
        "From Middle English sory, from Old English sāriġ (“feeling or expressing grief, sorry, grieved, sorrowful, sad, mournful, bitter”), from Proto-West Germanic *sairag, from Proto-Germanic *sairagaz (“sad”), from Proto-Indo-European *sayǝw- (“hard, rough, painful”). Cognate with Scots sairie (“sad, grieved”), Saterland Frisian seerich (“sore, inflamed”), West Frisian searich (“sad, sorry”), Low German serig (“sick, scabby”), German dialectal sehrig (“sore, sad, painful”), Swedish sårig. Despite the similarity in form and meaning, not related to sorrow. More at sore."
      ],
      "adjectives": [
        {
          "description": "sorry (comparative sorrier, superlative sorriest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Regretful or apologetic for one's actions.",
                  "examples": [
                    "I am sorry I stepped on your toes. It was an accident.",
                    "Synonyms: apologetic, compunctious, contrite, penitent, regretful, remorseful, repentant"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(of a person) Grieved or saddened, especially by the loss of something or someone.",
                  "examples": [
                    "I am sorry for your loss.",
                    "The President was sorry to hear that the Ambassador was leaving.",
                    "Synonyms: heavy-hearted, melancholy, mournful"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Poor, pitifully sad or regrettable.",
                  "examples": [
                    "The storm left his garden in a sorry state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pathetic; contemptibly inadequate.",
                  "examples": [
                    "Bob is a sorry excuse for a football player."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "sorry (plural sorries or sorrys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of saying sorry; an apology.",
                  "examples": [
                    "The British would do it standing stock still, Latinos would dance their sorries, and Canadians would find a way to apologize on ice."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}