{
  "word": "remit",
  "etymologies": [
    {
      "description": [
        "From Middle English remitten, from Latin remittere (“to send, send back”), present active infinitive of remittō. Compare Old French remettre, remetre, remitter."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly Britain) Terms of reference; set of responsibilities; scope.",
                  "examples": [
                    "WHO/TDR should prepare a volume containing ... important issues in the performance of studies that fall outside of the GLP remit."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law) A communication from a superior court to a subordinate court.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To transmit or send (e.g. money in payment); to supply.",
                  "examples": [
                    "Such a Step as this would raise a Succession of able Seamen, and in a few Years would come to remit a thousand, or perhaps two or three thousand sturdy Youths every Year into the general Class of English Seamen;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To forgive, pardon (a wrong, offence, etc.).",
                  "examples": [
                    "So he said that there was no sin to remit in baptism: ‘sin is not born with a man, it is subsequently committed by the man; for it is shown to be a fault, not of nature, but of the human will’."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To refrain from exacting or enforcing.",
                  "examples": [
                    "to remit the performance of an obligation"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To give up; omit; cease doing.",
                  "examples": [
                    "Among our own sex, there is no race of men more apt to indulge a spirit of acrimony, and to remit their natural Good Humour, than authors."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To allow (something) to slacken, to relax (one's attention etc.).",
                  "examples": [
                    "The wind at sea generally blows with an even steady gale; the wind at land puffs by intervals, encreasing its strength, and remitting it, without any apparent cause."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To show a lessening or abatement (of a specified quality).",
                  "examples": [
                    "Great Alexander in the midst of all his prosperity […], when he saw one of his wounds bleed, remembered that he was but a man, and remitted of his pride."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To diminish, abate.",
                  "examples": [
                    "[The water] sustains these Particles, and carries them on together with it ’till such time as its Motion begins to remit and be less rapid than it was at, and near its Source;"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To refer (something or someone) for deliberation, judgment, etc. (to a particular body or person).",
                  "examples": [
                    "[...] in grieuous and inhumane crimes, in such as ouerthrow the foundation of state, in such as shake the surety of humane society, I conceiue it more fit that offenders should be remitted to their Prince to be punished in the place where they haue offended."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To send back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To give or deliver up; surrender; resign.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To restore or replace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To postpone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To refer (someone to something), direct someone's attention to something.",
                  "examples": [
                    "These are the things I thought fit to premise to my Discourse, to which now I remit your Eyes, without adding more [...]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}