{
  "word": "concrete",
  "etymologies": [
    {
      "description": [
        "From Latin concrētus, past participle of concernō (con- + cernō)."
      ],
      "adjectives": [
        {
          "description": "concrete (comparative concreter, superlative concretest)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Real, actual, tangible.",
                  "examples": [
                    "Fuzzy videotapes and distorted sound recordings are not concrete evidence that Bigfoot exists.",
                    "Once arrested, I realized that handcuffs are concrete, even if my concept of what is legal wasn’t."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being or applying to actual things, not abstract qualities or categories.",
                  "examples": [
                    "The names of individuals are concrete, those of classes abstract."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Particular, specific, rather than general.",
                  "examples": [
                    "While everyone else offered thoughts and prayers, she made a concrete proposal to help.",
                    "concrete ideas"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "United by coalescence of separate particles, or liquid, into one mass or solid.",
                  "examples": [
                    "The first concrete state, or consistent surface, of the chaos must be of the same figure as the last liquid state."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(modifying a noun, not comparable) Made of concrete, a building material.",
                  "examples": [
                    "The office building had concrete flower boxes out front."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "concrete (countable and uncountable, plural concretes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A solid mass formed by the coalescence of separate particles; a compound substance, a concretion.",
                  "examples": [
                    "\"...upon the suppos’d Analysis made by the fire, of the former sort of Concretes, there are wont to emerge Bodies resembling those which they take for the Elements..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Specifically, a building material created by mixing cement, water, and aggregate such as gravel and sand.",
                  "examples": [
                    "The road was made of concrete that had been poured in large slabs."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(logic) A term designating both a quality and the subject in which it exists; a concrete term.",
                  "examples": [
                    "The concretes \"father\" and \"son\" have, or might have, the abstracts \"paternity\" and \"filiety\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sugar boiled down from cane juice to a solid mass.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US) A dessert of frozen custard with various toppings.",
                  "examples": [
                    "Besides cones, Curley's serves sundaes, and concretes—custard with all sorts of yummy goodness blended in, like pecans, caramel, almonds,  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry) An extract of herbal materials that has a semi-solid consistency, especially when such materials are partly aromatic.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "concrete (third-person singular simple present concretes, present participle concreting, simple past and past participle concreted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually transitive) To cover with or encase in concrete (building material).",
                  "examples": [
                    "I hate grass, so I concreted over my lawn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually transitive) To solidify: to change from being abstract to being concrete (actual, real).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To unite or coalesce into a mass or a solid body.",
                  "examples": [
                    "The blood of some who died of the plague could not be made to concrete."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}