{
  "word": "tattle",
  "etymologies": [
    {
      "description": [
        "From Middle Dutch tatelen, tateren (“to babble, chatter”) (modern Dutch tatelen, tateren (“to talk, chatter”)), originally imitative. The word is cognate with Saterland Frisian tätelje (“to talk nonsense, babble”), Middle Low German tāteren, tadderen (“to babble, chatter”) (whence modern German Low German tatern (“to chatter”)), Low German tateln, täteln (“to cackle, gabble”). Compare also Middle English dadel, dadull (“tattling, gossip”), and its alteration twaddle."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "tattle (countable and uncountable, plural tattles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) A tattletale.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, Canada, US, derogatory) Often said of children: a piece of incriminating information or an account of wrongdoing that is said about another person.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Idle talk; gossip; (countable) an instance of such talk or gossip.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "tattle (third-person singular simple present tattles, present participle tattling, simple past and past participle tattled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To chatter; to gossip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, Canada, US, derogatory) Often said of children: to report incriminating information about another person, or a person's wrongdoing; to tell on somebody. [from late 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To speak like a baby or young child; to babble, to prattle; to speak haltingly; to stutter.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}