{
  "word": "maggot",
  "etymologies": [
    {
      "description": [
        "From Middle English magot, magotte, probably Anglo-Norman metathetic alteration of maddock (“worm\", \"maggot”), originally a diminutive form of a base represented by Old English maþa (Scots mathe), from Frankish *maþō, from common Proto-Germanic *maþô, from the Proto-Indo-European root *mat, which was used in insect names, equivalent to made +‎ -ock. Near-cognates include Dutch made, German Made and Swedish mask.",
        "The use of maggot to mean a fanciful or whimsical thing derives from the folk belief that a whimsical or crotchety person had maggots in their brain."
      ],
      "adjectives": [
        {
          "description": "maggot (comparative more maggot, superlative most maggot)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, Australia) Alternative form of maggoted (“drunk; intoxicated”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "maggot (plural maggots)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A soft, legless larva of a fly or other dipterous insect, that often eats decomposing organic matter. [from 15th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(derogatory) A worthless person. [from 17th c.]",
                  "examples": [
                    "Drop and give me fifty, maggot."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now archaic, regional) A whimsy or fancy. [from 17th c.]",
                  "examples": [
                    "Are you not mad, my friend? What time o' th' moon is't? / Have not you maggots in your brain?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A fan of the American metal band Slipknot.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "maggot (third-person singular simple present maggots, present participle maggoting, simple past and past participle maggoted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rid (an animal) of maggots.",
                  "examples": [
                    "In the summer I had to get the sheep penned twice a day to maggot them and I needed a good dog."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}