{
  "word": "apron",
  "etymologies": [
    {
      "description": [
        "Rebracketing of napron (a napron → an apron), from Middle English naperoun, napron, apron, from Old French napperon, diminutive of nappe (“tablecloth”), from Latin mappa (“napkin”). For other similar cases of rebracketing, see adder, daffodil, newt, nickname, orange, trickle, umpire."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "apron (plural aprons)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An article of clothing worn over the front of the torso and/or legs for protection from spills; also historically worn by Freemasons and as part of women's fashion.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The short cassock ordinarily worn by English bishops.",
                  "examples": []
                }
              ]
            },
            {
              "group": "A hard surface bordering a structure or area.",
              "entries": [
                {
                  "meaning": "(aviation) The paved area of an airport, especially the area where aircraft park away from a terminal",
                  "examples": []
                },
                {
                  "meaning": "The spreading end of a driveway.",
                  "examples": []
                },
                {
                  "meaning": "The paved area below the yellow line on a race track.",
                  "examples": []
                },
                {
                  "meaning": "The loading, parking or roadway area immediately beside a railway station",
                  "examples": []
                },
                {
                  "meaning": "The portion of a stage extending towards the audience beyond the proscenium arch in a theatre.",
                  "examples": []
                },
                {
                  "meaning": "(pinball) A large decal toward the bottom of a pinball table.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sides of a tree's canopy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The cap of a cannon; a piece of lead laid over the vent to keep the priming dry.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A removable cover for the passengers' feet and legs in an open horse carriage.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "apron (third-person singular simple present aprons, present participle aproning, simple past and past participle aproned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cover with, or as if with, an apron.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}