{
  "word": "incumbent",
  "etymologies": [
    {
      "description": [
        "From Middle English, from stem incumbent-, of Medieval Latin incumbēns (“holder of a church position”), from Latin present participle of incumbō (“I lie down upon”)."
      ],
      "adjectives": [
        {
          "description": "incumbent (comparative more incumbent, superlative most incumbent)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Used with \"on\" or \"upon\") Imposed on someone as an obligation, especially due to one's office.",
                  "examples": [
                    "Proper behavior is incumbent on all holders of positions of trust."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lying; resting; reclining; recumbent.",
                  "examples": [
                    "to move the incumbent load they try"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Prevalent, prevailing, predominant.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(botany, geology) Resting on something else; in botany, said of anthers when lying on the inner side of the filament, or of cotyledons when the radicle lies against the back of one of them",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) Bent downwards so that the ends touch, or rest on, something else.",
                  "examples": [
                    "the incumbent toe of a bird"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Being the current holder of an office or a title.",
                  "examples": [
                    "If the incumbent senator dies, he is replaced by a person appointed by the governor."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "incumbent (plural incumbents)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The current holder of an office, such as ecclesiastical benefice or an elected office.",
                  "examples": [
                    "Mr Obama’s problems were partly structural. An incumbent must defend the realities and compromises of government, while a challenger is freer to promise the earth, details to follow. Mr Obama’s odd solution was to play both incumbent and challenger, jumping from a defence of his record to indignation at such ills as over-crowded classrooms and tax breaks for big oil companies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business) A holder of a position as supplier to a market or market segment that allows the holder to earn above-normal profits.",
                  "examples": [
                    "American capitalism is becoming like its European cousin: established firms with the scale and scope to deal with a growing thicket of regulations are doing well, but new companies are withering on the vine or selling themselves to incumbents."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}