{
  "word": "right",
  "etymologies": [
    {
      "description": [
        "From Middle English right, from Old English riht (“right,” also the word for “straight” and “direct”), from Proto-Germanic *rehtaz, from Proto-Indo-European *h₃reǵtós (“having moved in a straight line”), from *h₃reǵ- (“to straighten, direct”). An Indo-European past participle, it became a Germanic adjective which has been used also as a noun since the common Germanic period. Cognate with West Frisian rjocht, Dutch recht, German recht and Recht, Swedish rätt and rät, Danish ret, Norwegian Bokmål rett, Norwegian Nynorsk rett, and Icelandic rétt. The Indo-European root is also the source of Ancient Greek ὀρεκτός (orektós) and Latin rēctus; Albanian drejt was borrowed from Latin."
      ],
      "adjectives": [
        {
          "description": "right (comparative righter or more right, superlative rightest or rightmost)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Straight, not bent.",
                  "examples": [
                    "a right line..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) Of an angle, having a size of 90 degrees, or one quarter of a complete rotation; the angle between two perpendicular lines.",
                  "examples": [
                    "The kitchen counter formed a right angle with the back wall."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geometry) Of a geometric figure, incorporating a right angle between edges, faces, axes, etc.",
                  "examples": [
                    "a right triangle... a right prism... a right cone..."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Complying with justice, correctness, or reason; correct, just, true.",
                  "examples": [
                    "If there be no prospect beyond the grave, the inference is certainly right, \"Let us eat and drink, for to-morrow we die.\""
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Appropriate, perfectly suitable; fit for purpose.",
                  "examples": [
                    "Is this the right software for my computer?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Healthy, sane, competent.",
                  "examples": [
                    "I'm afraid my father is no longer in his right mind."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Real; veritable (used emphatically).",
                  "examples": [
                    "You've made a right mess of the kitchen!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Australia) All right; not requiring assistance.",
                  "examples": [
                    "Kirsty: I suppose you're hungry. Would you like something to eat?Ken: No. I'm right, thanks."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated) Most favourable or convenient; fortunate.",
                  "examples": [
                    "The lady has been disappointed on the right side."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designating the side of the body which is positioned to the east if one is facing north, the side on which the heart is not located in most humans. This arrow points to the reader's right: →",
                  "examples": [
                    "After the accident, her right leg was slightly shorter than her left."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(geography) Designating the bank of a river (etc.) on one's right when facing downstream (i.e. facing forward while floating with the current); that is, the south bank of a river that flows eastward. If this arrow: ⥴ shows the direction of the current, the tilde is on the right side of the river.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Designed to be placed or worn outward.",
                  "examples": [
                    "the right side of a piece of cloth"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) Pertaining to the political right; conservative.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English right, righte, from Old English rihte, rehte (“right; rightly; due; directly; straight”), from Proto-Germanic *rehta, from *rehtaz (“right; straight”)."
      ],
      "adjectives": [],
      "adverbs": [
        {
          "description": "right (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "On the right side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Towards the right side.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exactly, precisely.",
                  "examples": [
                    "The arrow landed right in the middle of the target.",
                    "Luckily we arrived right at the start of the film."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Immediately, directly.",
                  "examples": [
                    "Can't you see it? It's right beside you!",
                    "Tom was standing right in front of the TV, blocking everyone's view."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, US, dialect) Very, extremely, quite.",
                  "examples": [
                    "I made a right stupid mistake there, didn't I?",
                    "I stubbed my toe a week ago and it still hurts right much."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "According to fact or truth; actually; truly; really.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In a correct manner.",
                  "examples": [
                    "Do it right or don't do it at all."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dated, still used in some titles) To a great extent or degree.",
                  "examples": [
                    "Sir, I am right glad to meet you …",
                    "Members of the Queen's Privy Council are styled The Right Honourable for life.",
                    "The Right Reverend Monsignor Guido Sarducci."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English right, righte, reght, reghte, riȝt, riȝte, from Old English riht, reht, ġeriht (“that which is right, just, or proper; a right; due; law; canon; rule; direction; justice; equity; standard”), from Proto-West Germanic *reht, from Proto-Germanic *rehtą (“a right”), from Proto-Indo-European *h₃reǵtom, from Proto-Indo-European *h₃reǵt- (“to straighten; direct”). Cognate with Dutch recht (“a right; privilege”), German Recht (“a right”), Danish ret (“a right”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "right (plural rights)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That which complies with justice, law or reason.",
                  "examples": [
                    "We're on the side of right in this contest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A legal, just or moral entitlement.",
                  "examples": [
                    "You have no right to go through my personal diary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right side or direction.",
                  "examples": [
                    "The pharmacy is just on the right past the bookshop."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The right hand or fist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The authority to perform, publish, film, or televise a particular work, event, etc.; a copyright.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(politics) The ensemble of right-wing political parties; political conservatives as a group.",
                  "examples": [
                    "The political right holds too much power."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The outward or most finished surface, as of a coin, piece of cloth, a carpet, etc.",
                  "examples": [
                    "Synonym: (of fabric) right side"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(surfing) A wave breaking from right to left (viewed from the shore).",
                  "examples": [
                    "Antonym: left"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English righten, reghten, riȝten, from Old English rihtan, ġerihtan (“to straighten, judge, set upright, set right”), from Proto-West Germanic *rihtijan, from Proto-Germanic *rihtijaną (“to straighten; rectify; judge”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "right (third-person singular simple present rights, present participle righting, simple past and past participle righted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To correct.",
                  "examples": [
                    "Righting all the wrongs of the war immediately will be impossible."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To set upright.",
                  "examples": [
                    "The tow-truck righted what was left of the automobile."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To return to normal upright position.",
                  "examples": [
                    "When the wind died down, the ship righted."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To do justice to; to relieve from wrong; to restore rights to; to assert or regain the rights of.",
                  "examples": [
                    "to right the oppressed"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}