{
  "word": "purdah",
  "etymologies": [
    {
      "description": [
        "Urdu پردہ‎ and Hindi पर्दा (pardah, “curtain; veil; modesty”), and its etymon Classical Persian پرده‎ (pardah, “curtain; screen; (archaic) veil”), ultimately from Proto-Indo-European *pleh₂- (“flat”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "purdah (countable and uncountable, plural purdahs)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable, chiefly South Asia, also figuratively) A curtain, especially one used in some Hindu or Muslim traditions to conceal women from the gaze of people, particularly men and strangers. [from early 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "(by extension)",
              "entries": [
                {
                  "meaning": "(countable) A long veil or other attire covering most of the body, worn by women in some Muslim societies. [from 20th c.]",
                  "examples": [
                    "Hyponym: burka"
                  ]
                },
                {
                  "meaning": "(uncountable) The situation or system of secluding women from the gaze of people, particularly men and strangers, in some Muslim and Hindu traditions, by using a curtain or screen, and/or wearing a face veil or attire covering most of the body. [from 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, figuratively) Keeping apart; isolation, seclusion; also, concealment, secrecy. [from 20th c.]",
                  "examples": []
                },
                {
                  "meaning": "(countable, UK politics, potentially offensive) The period between the announcement of an election or referendum and its conclusion, during which civil servants refrain from making policy announcements or taking actions that could be seen as advantageous to certain candidates in the election.",
                  "examples": []
                },
                {
                  "meaning": "(uncountable, obsolete, rare) A striped cotton cloth which is used to make curtains. [19th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}