{
  "word": "bible",
  "etymologies": [
    {
      "description": [
        "From Middle English bible, from Middle Latin biblia (“book”) (misinterpreted as a feminine from earlier Latin neuter plural biblia (“books”)), from Ancient Greek βιβλία (biblía, “books”), plural of βιβλίον (biblíon, “small book”), originally a diminutive of βίβλος (bíblos, “book”), from βύβλος (búblos, “papyrus”) (from the ancient Phoenician city of Byblos which exported this writing material).",
        "Old English used biblioþēce (from βιβλιοθήκη) and ġewritu (> English writs) for \"the Scriptures\"."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bible (plural bibles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Bible (“a specific version, edition, translation, or copy of the Christian religious text”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Bible (“the analogous holy book of another religion”)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A comprehensive manual that describes something, or a publication with a loyal readership.",
                  "examples": [
                    "handyman’s bible"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) Synonym of holystone: a piece of sandstone  used for scouring wooden decks on ships.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(at certain US universities) A compilation of problems and solutions from previous years of a given course, used by some students to cheat on tests or assignments.",
                  "examples": [
                    "My friend’s a genius, he will give me problems one through nine. The bible of a sophomore will have the needed lines."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Omasum, the third compartment of the stomach of ruminants",
                  "examples": [
                    "Synonyms: psalterium, omasum, manyplies, fardel"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(locksmithing) The upper part of a pin-tumbler lock, containing the driver pins and springs.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}