{
  "word": "moat",
  "etymologies": [
    {
      "description": [
        "From Middle English mote, from Old French mote (“mound, embankment”); compare also Old French motte (“hillock, lump, clod, turf”), from Medieval Latin mota (“a mound, hill”), of Germanic origin, perhaps via Frankish *mot, *motta (“mud, peat, bog, turf”), from Proto-Germanic *mutô, *mudraz, *muþraz (“dirt, filth, mud, swamp”), from Proto-Indo-European *(s)mut- (“dark, dirty”). Cognate with Alemannic German Mott, Mutte (“peat, turf”), Bavarian Mott (“peat, turf”), dialectal Dutch mot (“dust, fine sand”), Saterland Frisian mut (“grit, litter, humus”), Swedish muta (“to drizzle”), Old English mot (“speck, particle”). More at mote, mud, smut.",
        "As term for a business strategy, popularized by American investor Warren Buffett."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "moat (plural moats)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A deep, wide defensive ditch, normally filled with water, surrounding a fortified habitation.",
                  "examples": [
                    "Synonym: fosse"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(business, figurative) An aspect of a business which makes it more \"defensible\" from competitors, because of the nature of its products, services or franchise or for some other reason.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A circular lowland between a resurgent dome and the walls of the caldera surrounding it.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(meteorology) A clear ring outside the eyewall of a tropical cyclone.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A hill or mound.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "moat (third-person singular simple present moats, present participle moating, simple past and past participle moated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To surround with a moat.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}