{
  "word": "bump",
  "etymologies": [
    {
      "description": [
        "From Early Modern English bump (“a shock, blow from a collision\"”), probably of North Germanic origin. Compare Danish bump (“a thump”), Danish bumpe (“to thump”), Old Danish bumpe (“to strike with a clenched fist”). Apparently related to Middle English bumben, bummen (“to make a hollow noise”), Dutch bommen (“to hum, buzz”), German bummen (“to hum, buzz”), Icelandic bumba (“drum”), probably of imitative origin. More at bum, bumble. Compare also bomb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bump (countable and uncountable, plural bumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A light blow or jolting collision.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The sound of such a collision.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A protuberance on a level surface.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A swelling on the skin caused by illness or injury.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) One of the protuberances on the cranium which, in phrenology, are associated with distinct faculties or affections of the mind. Also (dated, metonymically) the faculty itself",
                  "examples": [
                    "the bump of veneration; the bump of acquisitiveness"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rowing) The point, in a race in which boats are spaced apart at the start, at which a boat begins to overtake the boat ahead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The swollen abdomen of a pregnant woman.",
                  "examples": [
                    "Synonym: baby bump"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) A post in an Internet forum thread made in order to raise the thread's profile by returning it to the top of the list of active threads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A temporary increase in a quantity, as shown in a graph.",
                  "examples": [
                    "US presidential nominees get a post-convention bump in survey ratings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) A dose of a drug such as ketamine or cocaine, when snorted recreationally.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(preceded by definite article) A disco dance in which partners rhythmically bump each other's hips together.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In skipping, a single jump over two consecutive turns of the rope.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) A coarse cotton fabric.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A training match for a fighting dog.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(snooker, slang) The jaw of either of the middle pockets.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(US, slang, uncountable) Music, especially played over speakers at loud volume with strong bass frequency response.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(industrial relations) A reassignment of jobs within an organization (for example, when an existing employee leaves) on the basis of seniority.",
                  "examples": [
                    "For example, chain bumping, in which a bump by one employee initiates a series of consecutive bumps down a progression line before a layoff results, produces the greatest average number of reassignments per redundant employee."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bump (third-person singular simple present bumps, present participle bumping, simple past and past participle bumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To knock against or run into with a jolt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To move up or down by a step; displace.",
                  "examples": [
                    "I bumped the font size up to make my document easier to read."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet) To post in an Internet forum thread in order to raise the thread's profile by returning it to the top of the list of active threads.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, of a superheated liquid) To suddenly boil, causing movement of the vessel and loss of liquid.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move (a booked passenger) to a later flight because of earlier delays or cancellations.",
                  "examples": [
                    "Easyjet said the compensation package for passengers bumped off flights was 'probably the most flawed piece of European legislation in recent years'  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move the time of (a scheduled event).",
                  "examples": [
                    "A colleague emails with news that her 4:30 meeting got bumped to 3:30."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To pick (a lock) with a repeated striking motion that dislodges the pins.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, archaic) To make a loud, heavy, or hollow noise; to boom.",
                  "examples": [
                    "as a bittern bumps within a reed"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, dated) To spread out material so as to fill any desired number of pages.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, transitive) To assassinate; to bump off.",
                  "examples": [
                    "You know about the night the kid bumped Brody?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(industrial relations, transitive) To displace (another employee in an organization) on the basis of seniority.",
                  "examples": [
                    "Employees with 2 years or more, and less than 8 years plant seniority, may bump a probationary employee."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Early Modern English; onomatopoeic."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bump (countable and uncountable, plural bumps)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The breeding call made by the bittern; a boom.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bump (third-person singular simple present bumps, present participle bumping, simple past and past participle bumped)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Of a bittern, to make its characteristic breeding call.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}