{
  "word": "recognize",
  "etymologies": [
    {
      "description": [
        "Borrowed from Middle French reconoistre, from Old French reconoistre, from Latin recognoscere, first attested in the 16th century. Displaced native English acknow (“to recognize, perceive as”), compare German erkennen and Swedish erkänna."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "recognize (third-person singular simple present recognizes, present participle recognizing, simple past and past participle recognized) (American spelling, Oxford British English)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To match (something or someone which one currently perceives) to a memory of some previous encounter with the same person or thing.",
                  "examples": [
                    "I recognised his face immediately, although his voice was different."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To acknowledge the existence or legality of; to treat as valid or worthy of consideration.",
                  "examples": [
                    "The US and a number of EU countries are expected to recognize Kosovo on Monday."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, or with clause) To acknowledge or consider (as being a certain thing or having a certain quality or property).",
                  "examples": [
                    "Slavery is widely recognized as immoral.",
                    "I recognize that my behaviour has been unacceptable."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To realize or discover the nature of something; apprehend quality in.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To show formal appreciation of, as with an award, commendation etc.",
                  "examples": [
                    "His services were recognized in a testimonial.",
                    "The soldier was recognized in dispatches."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To review; to examine again.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To reconnoiter.",
                  "examples": [
                    "before the siege was layd to the Towne, of minde to recognize, he fell unawares amongst an Ambushcade"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(immunology) To have the property to bind to specific antigens.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From re- +‎ cognize."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "recognize (third-person singular simple present recognizes, present participle recognizing, simple past and past participle recognized) (North American and Oxford British spelling)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to cognize again",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}