{
  "word": "hypothesis",
  "etymologies": [
    {
      "description": [
        "Recorded since 1596, from Middle French hypothese, from Late Latin hypothesis, from Ancient Greek ὑπόθεσις (hupóthesis, “base, basis of an argument, supposition”, literally “a placing under”), itself from ὑποτίθημι (hupotíthēmi, “I set before, suggest”), from ὑπό (hupó, “below”) + τίθημι (títhēmi, “I put, place”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hypothesis (plural hypotheses)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sciences) Used loosely, a tentative conjecture explaining an observation, phenomenon or scientific problem that can be tested by further observation, investigation and/or experimentation. As a scientific term of art, see the attached quotation. Compare to theory, and quotation given there.",
                  "examples": [
                    "Far too many of us have been taught in school that a scientist, in the course of trying to figure something out, will first come up with a \"hypothesis\" (a guess or surmise—not necessarily even an \"educated\" guess). ... [But t]he word \"hypothesis\" should be used, in science, exclusively for a reasoned, sensible, knowledge-informed explanation for why some phenomenon exists or occurs. An hypothesis can be as yet untested; can have already been tested; may have been falsified; may have not yet been falsified, although tested; or may have been tested in a myriad of ways countless times without being falsified; and it may come to be universally accepted by the scientific community. An understanding of the word \"hypothesis,\" as used in science, requires a grasp of the principles underlying Occam's Razor and Karl Popper's thought in regard to \"falsifiability\"—including the notion that any respectable scientific hypothesis must, in principle, be \"capable of\" being proven wrong (if it should, in fact, just happen to be wrong), but none can ever be proved to be true. One aspect of a proper understanding of the word \"hypothesis,\" as used in science, is that only a vanishingly small percentage of hypotheses could ever potentially become a theory."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(general) An assumption taken to be true for the purpose of argument or investigation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(grammar) The antecedent of a conditional statement.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}