{
  "word": "banner",
  "etymologies": [
    {
      "description": [
        "From Middle English baner, from Old French baniere (Modern bannière), of Germanic origin. More at band."
      ],
      "adjectives": [
        {
          "description": "banner (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Exceptional; very good.",
                  "examples": [
                    "The Zenger decision was a banner achievement for freedom of the press. It pointed the way to the kind of open public discussion required by the diverse society that colonial New York already was and that all America was to become."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "banner (plural banners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flag or standard used by a military commander, monarch or nation.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The military unit under such a flag or standard.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) A military or administrative subdivision.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any large sign, especially when made of soft material or fabric.",
                  "examples": [
                    "The mayor hung a banner across Main Street to commemorate the town's 100th anniversary."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large piece of cloth with a slogan, motto, or emblem carried in a demonstration or other procession or suspended in some conspicuous place.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension, figurative) A cause or purpose; a campaign or movement.",
                  "examples": [
                    "They usually make their case under the banner of environmentalism."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(journalism) The title of a newspaper as printed on its front page; the nameplate; masthead.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet, television) A type of advertisement on a web page or on television, usually taking the form of a graphic or animation above or alongside the content.",
                  "examples": [
                    "Coordinate terms: interstitial, popup"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) The principal standard of a knight.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of administrative division in Inner Mongolia and Tuva, made during the Qing dynasty; at that time, Outer Mongolia and part of Xinjiang were also divided into banners.",
                  "examples": [
                    "Hanggin Rear Banner, Bayannur, Inner Mongolia, China"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "banner (third-person singular simple present banners, present participle bannering, simple past and past participle bannered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To adorn with a banner.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, journalism) To display as a banner headline.",
                  "examples": [
                    "At 8:11, bannering the headline “Cheney in Charge?” the Drudge Report runs a story speculating that the president may be incapacitated."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "ban +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "banner (plural banners)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who bans something.",
                  "examples": [
                    "How ridiculous the banners of some of the books at present on the list will appear in the future."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}