{
  "word": "blustering",
  "etymologies": [
    {
      "description": [],
      "adjectives": [
        {
          "description": "blustering (comparative more blustering, superlative most blustering)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Engaged in or involving the process of blustering, speaking or protesting loudly.",
                  "examples": [
                    "But when we began to renue our old acquaintance, and to shake the handes of discontinued familiaritie, alas, good Gentleman, his mandillion was ouercropped, his witt paunched like his wiues spindle, his art shanked like a lath, his conceit as lank as a shotten herring, and that same blustering eloquence as bleake and wan as the Picture of a forlorne Loouer."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Pompous or arrogant in one's speech or bearing.",
                  "examples": [
                    "Hermann Göring was a dominating and blustering host. His unresting ego did not permit him to permit his guests to do what they pleased; he told them how to entertain themselves, and he told them what to think. When he was with them, he took charge of the conversation; when he chose to be funny, they all laughed, and he laughed loudest."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Very windy; (of wind) blowing very strongly, blustery.",
                  "examples": [
                    "A blustering night, a fair day."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "blustering (countable and uncountable, plural blusterings)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A noisy blowing, as of a blast of wind.",
                  "examples": [
                    "He will soon disregard the roaring of your eloquence, as the bold sailor contemns the blustering of the winds  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Swaggering; braggartry; noisy pretension.",
                  "examples": [
                    "Boasting and blustering are as objectionable among nations as among individuals, and the public men of a great nation owe it to their sense of national self-respect to speak courteously of foreign powers just as a brave and self-respecting man treats all around him courteously."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "blustering",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "present participle of bluster",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}