{
  "word": "galley",
  "etymologies": [
    {
      "description": [
        "From Middle English galeie, from Old French galee, from Latin galea, from Byzantine Greek γαλέα (galéa) of unknown origin, probably from Ancient Greek γαλέη (galéē), a kind of a small fish, from γαλεός (galeós, “dog-fish or small shark”). Doublet of galea."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "galley (plural galleys)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, historical) A long, slender ship propelled primarily by oars, whether having masts and sails or not; usually referring to rowed warships used in the Mediterranean from the 16th century until the modern era.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain) A light, open boat used on the Thames by customhouse officers, press gangs, and also for pleasure.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) One of the small boats carried by a man-of-war.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The cookroom or kitchen and cooking apparatus of a vessel or aircraft; sometimes on merchant vessels called the caboose.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An oblong oven or muffle with a battery of retorts; a gallery furnace.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) An oblong tray of wood or brass, with upright sides, for holding type which has been set, or is to be made up, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing) A proof sheet taken from type while on a galley; a galley proof.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(heraldry) A representation of a single masted ship propelled by oars, with three flags and a basket.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}