{
  "word": "fetch",
  "etymologies": [
    {
      "description": [
        "The verb is derived from Middle English fecchen (“to get and bring back, fetch; to come for, get and take away; to steal; to carry away to kill; to search for; to obtain, procure”)  [and other forms], from Old English feċċan, fæċċan, feccean (“to fetch, bring; to draw; to gain, take; to seek”), a variant of fetian, fatian (“to bring near, fetch; to acquire, obtain; to bring on, induce; to fetch a wife, marry”) and possibly related to Old English facian, fācian (“to acquire, obtain; to try to obtain; to get; to get to, reach”), both from Proto-Germanic *fatōną, *fatjaną (“to hold, seize; to fetch”), from Proto-Indo-European *ped- (“to step, walk; to fall, stumble”). The English word is cognate with Dutch vatten (“to apprehend, catch; to grasp; to understand”), German fassen (“to catch, grasp; to capture, seize”), English fet (“(obsolete) to fetch”), Faroese fata (“to grasp, understand”), Danish fatte (“to grasp, understand”), Swedish fatta (“to grasp, understand”), Icelandic feta (“to go, step”), West Frisian fetsje (“to grasp”).",
        "The noun is derived from the verb."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fetch (plural fetches)",
          "definitionGroups": [
            {
              "group": "(also figuratively) An act of fetching, of bringing something from a distance.",
              "entries": [
                {
                  "meaning": "(computing, specifically) An act of fetching data.",
                  "examples": [
                    "a fetch from a cache"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The object of fetching; the source of an attraction; a force, propensity, or quality which attracts.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An area over which wind is blowing (over water) and generating waves.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The length of such an area; the distance a wave can travel across a body of water (without obstruction).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A stratagem or trick; an artifice.",
                  "examples": [
                    "Synonyms: contrivance, dodge"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "fetch (third-person singular simple present fetches, present participle fetching, simple past and past participle fetched)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To retrieve; to bear towards; to go and get.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To obtain as price or equivalent; to sell for.",
                  "examples": [
                    "If you put some new tyres on it, and clean it up a bit, the car should fetch about $5,000"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) To bring or get within reach by going; to reach; to arrive at; to attain; to reach by sailing.",
                  "examples": [
                    "to fetch headway or sternway"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To bring oneself; to make headway; to veer; as, to fetch about; to fetch to windward.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(rare, literary) To take (a breath), to heave (a sigh)",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To cause to come; to bring to a particular state.",
                  "examples": [
                    "They couldn't fetch the butter in the churn."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To recall from a swoon; to revive; sometimes with to.",
                  "examples": [
                    "to fetch a man to"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To reduce; to throw.",
                  "examples": [
                    "The sudden trip in wrestling that fetches a man to the ground."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To accomplish; to achieve; to perform, with certain objects or actions.",
                  "examples": [
                    "to fetch a compass;  to fetch a leap"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, transitive) To make (a pump) draw water by pouring water into the top and working the handle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Uncertain; the following possibilities have been suggested:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fetch (plural fetches)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(originally Ireland, dialectal) The apparition of a living person; a person's double, the sight of which is supposedly a sign that they are fated to die soon, a doppelganger; a wraith (“a person's likeness seen just after their death; a ghost, a spectre”). [from 18th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}