{
  "word": "outland",
  "etymologies": [
    {
      "description": [
        "From Middle English outland, outlond, from Old English ūtland (“foreign land, land abroad”), from Proto-Germanic *ūtlandą (“outland”), equivalent to out- +‎ land. Cognate to Dutch uitland, Afrikaans uitland, German Ausland, Danish udland.\nThe use in the phrase \"outland German\" is influenced by (or is a calque of) the German cognate of the same meaning, Auslandsdeutsche (see Ausland). The use in the phrase \"outland Chinese\" is influenced by (or is a calque of) the Chinese term of the same meaning, 華僑 / 华侨 (huáqiáo)."
      ],
      "adjectives": [
        {
          "description": "outland (not comparable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Provincial: from a province (of the same land).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Foreign: from abroad, from a foreign land.",
                  "examples": [
                    "These outland Romans will not kill us all If you permit them to do their governing, Which is so dear to them, over you and us."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(used with ethnic nationalities) Living abroad, living in a foreign land, expatriate.",
                  "examples": [
                    "Whatever dependence the Pan-German chauvinist had placed on outland Germans proved to be a broken reed."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "outland (plural outlands)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(especially in the plural) Any outlying area of a country; the provinces.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "out- +‎ land"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "outland (third-person singular simple present outlands, present participle outlanding, simple past and past participle outlanded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(martial arts) To land more (punches, kicks etc.) than.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}