{
  "word": "dandle",
  "etymologies": [
    {
      "description": [
        "Compare Scots dandill (“to dander; go about idly; move uncertainly; trifle”), English dialectal dander (“to wander about; talk incoherently; rave”), Middle Dutch dantinnen (“to trifle”) (from French dandiner (“to swing; waddle”)), German dändeln, tändeln (“to trifle, dandle”), Middle Dutch and Provincial German danten (“to do foolish things; trifle”), German Tand (“trifle, prattle”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "dandle (third-person singular simple present dandles, present participle dandling, simple past and past participle dandled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To move up and down on one's knee or in one's arms, in affectionate play, usually said of a child.",
                  "examples": [
                    "You will nurse and be carried on her arm and dandled on her knees."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To treat with fondness or affection, as if a child; to pet.",
                  "examples": [
                    "[T]hey have put me in a silk night-gown and gaudy fool's cap, and make me now and then stand in the window with it. I am ashamed to be dandled thus, and cannot look in the glass without blushing to see myself turned into such a pretty little master."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To play with; to wheedle.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}