{
  "word": "receipt",
  "etymologies": [
    {
      "description": [
        "From Middle English receipt, receyt, receite, recorded since c. 1386 as \"statement of ingredients in a potion or medicine,\" from Anglo-Norman or Old Northern French receite (“receipt, recipe”) (1304), altered (by influence of receit (“he receives”), from Latin recipit) from Old French recete, from Latin receptus, perfect passive participle of recipiō, itself from re- (“back”) + capiō (“I take”). The unpronounced p was later inserted to make the word appear closer to its Latin root.  Doublet of recept."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "receipt (countable and uncountable, plural receipts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The act of receiving, or the fact of having been received.",
                  "examples": [
                    "A balance payable on receipt of the goods."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) The fact of having received a blow, injury etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(in the plural) A quantity or amount received; takings.",
                  "examples": [
                    "This weekend's receipts alone cover our costs to mount the production!"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A written acknowledgment that a specified article or sum of money has been received.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(usually in the plural) (A piece of) evidence, documentation, etc. to prove one's past actions, accomplishments, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Internet slang, usually in the plural, by extension) (A piece of) evidence (e.g. documentation or screen captures) of past wrongdoing.",
                  "examples": [
                    "\"Oh yes, the Internet trolls went there, and we've got the receipts\"."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic in New England and rural US since end of 20th century, elsewhere since middle of 20th century) A recipe, instructions, prescription.",
                  "examples": [
                    "Nor were we without guests: sometimes farmer Flamborough, our talkative neighbour, and often the blind piper, would pay us a visit, and taste our gooseberry wine; for the making of which we had lost neither the receipt nor the reputation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A receptacle.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A revenue office.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Reception, as an act of hospitality.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Capability of receiving; capacity.",
                  "examples": [
                    "It has become a place of great receipt."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) A recess; a retired place.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "receipt (third-person singular simple present receipts, present participle receipting, simple past and past participle receipted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To give or write a receipt (for something).",
                  "examples": [
                    "to receipt delivered goods"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put a receipt on, as by writing or stamping; to mark a bill as having been paid.",
                  "examples": [
                    "to receipt a bill"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}