{
  "word": "keeper",
  "etymologies": [
    {
      "description": [
        "From Middle English kepere, equivalent to keep +‎ -er."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "keeper (plural keepers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who keeps (retains) something.",
                  "examples": [
                    "Finders keepers; losers weepers."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who remains or keeps in a place or position.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fruit or vegetable that keeps (remains good) for some time without spoiling.",
                  "examples": [
                    "Roxbury Russet: Market and keeper."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A person or thing worth keeping.",
                  "examples": [
                    "\"Okay, that's a keeper,\" Harold said as he netted the 3-pounder and put him on a stringer over the side of the boat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person charged with guarding or caring for, storing, or maintaining something; a custodian, a guard; sometimes a gamekeeper.",
                  "examples": [
                    "And the Lord said unto Cain, Where is Abel thy brother? And he said, I know not: Am I my brother's keeper?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) The player charged with guarding a goal or wicket. Short form of goalkeeper, wicketkeeper.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A part of a mechanism that catches or retains another part, for example the part of a door lock that fits in the frame and receives the bolt.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A thin, flexible tress or tongue of material (e.g. leather) at the end of a crop opposite the handle, which is broad enough to prevent the horse's skin from being marked as it might be by a whip.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(American football) An offensive play in which the quarterback runs toward the goal with the ball after it is snapped.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Synonym of armature (“piece of metal connecting the poles of a magnet to preserve its strength by forming a circuit”)",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}