{
  "word": "chicane",
  "etymologies": [
    {
      "description": [
        "Borrowed from French chicane."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "chicane (countable and uncountable, plural chicanes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A quibble, a pedantic or dishonest objection; an act of deception. [from 17th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The use of dishonest means or subterfuge to achieve one's (especially political) goals; chicanery, trickery. [from 17th c.]",
                  "examples": [
                    "In this character of the Americans, a love of freedom is the predominating feature which marks and distinguishes the whole; and as an ardent is always a jealous affection, your Colonies become suspicious, restive, and untractable whenever they see the least attempt to wrest from them by force, or shuffle from them by chicane, what they think the only advantage worth living for."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(card games, chiefly bridge) The holding of a hand without trumps, or the hand itself. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(motor racing) A sharp double bend on a racecourse, designed to prevent unsafe speeds; an obstacle creating a curve. [from 20th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(road transport) A raised area or other obstacle around which vehicles must drive, especially designed to reduce speed. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "chicane (third-person singular simple present chicanes, present participle chicaning, simple past and past participle chicaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To use chicanery, tricks, or subterfuge.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To deceive.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}