{
  "word": "undercutter",
  "etymologies": [
    {
      "description": [
        "undercut +‎ -er"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "undercutter (plural undercutters)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "One who, or that which, undercuts.",
                  "examples": [
                    "It is thus clear that adding an undercutter of this sort to the story changes the total evidence with respect to the claim in question. That is, in the case of typical undercutters, a metalevel claim filters down into the body of evidence in question precisely because an undercutter is a defeater and hence alters the total evidence with respect to the claim in question. There are two important differences between typical undercutters and the role of reflective ascent in the face of disagreement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A type of plough.",
                  "examples": [
                    "The undercutter plow is a farm implement currently used for weed control on many farms in the winter wheat/fallow region of the Great Plains States and the Intermountain West. Undercutters are large (3 to 7 feet wide) V- shaped blades or sweeps that are pulled by tractors through a field 3 to 6 inches under the soil surface. Using an undercutter instead of a disc can control weeds, retain soil moisture, and save many bird nests and flightless birds present in the stubble"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(engineering) A type of bit.",
                  "examples": [
                    "The undercutter produces a rabbetlike recess on the back of the panel. This allows you to use W'-thick stock for panels without having to cut excessively deep with the panel-raising bit. An undercut panel ends up being flush with both the face and the back of a standard frame. An undercutter can be purchased as a separate bit. After raising the panels, use the undercutter to relieve that panel back as necessary to size the tongue."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A device for excavation, used on railways.",
                  "examples": [
                    "[…]  train of dump cars hauled behind undercutter machine loads rear car first, then ones ahead of it. Using undercutter avoids need for removing track."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mining) A device for cutting into rock walls from below.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}