{
  "word": "spell",
  "etymologies": [
    {
      "description": [
        "From Middle English spell, spel, from Old English spell (“news, story”), from Proto-Germanic *spellą (“speech, account, tale”), from Proto-Indo-European *spel- (“to tell”) or from Proto-Indo-European *bʰel- (“to speak, to sound”) with the s-mobile prefix. Cognate with dialectal German Spill, Icelandic spjall (“discussion, talk”), spjalla (“to discuss, to talk”), guðspjall (“gospel”) and Albanian fjalë (“word”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spell (plural spells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Words or a formula supposed to have magical powers. [from 16th c.]",
                  "examples": [
                    "Synonyms: cantrip, incantation",
                    "He cast a spell to cure warts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A magical effect or influence induced by an incantation or formula. [from 16th c.]",
                  "examples": [
                    "Synonym: cantrip",
                    "under a spell"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Speech, discourse. [8th–15th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spell (third-person singular simple present spells, present participle spelling, simple past and past participle spelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To put under the influence of a spell; to affect by a spell; to bewitch; to fascinate; to charm.",
                  "examples": [
                    "[…]  although the Kings Jealousie was thus particular to her, his Affection was as general to others  […]  Above all, for a time he was much speld with Elianor Talbot  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English spellen, from Anglo-Norman espeler, espeleir, Old French espeller, espeler (compare Modern French épeler), from Frankish *spelōn, merged with native Old English spellian (“to tell, speak”), both eventually from Proto-Germanic *spellōną (“to speak”). Related with etymology 1. The sense “indicate a future event” probably in part a backformation from forespell (literally “to tell in advance”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "spell (third-person singular simple present spells, present participle spelling, simple past and past participle spelled or (mostly UK) spelt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, transitive, sometimes with “out”) To write or say the letters that form a word or part of a word. [from 16th c.]",
                  "examples": [
                    "I find it difficult to spell because I'm dyslexic."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To read (something) as though letter by letter; to peruse slowly or with effort. [from 14th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Of letters: to compose (a word). [from 19th c.]",
                  "examples": [
                    "The letters “a”, “n” and “d” spell “and”."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figuratively, with “out”) To clarify; to explain in detail. [from 20th c.]",
                  "examples": [
                    "Please spell it out for me."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To indicate that (some event) will occur; typically followed by a single-word noun. [from 19th c.]",
                  "examples": [
                    "This spells trouble."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To constitute; to measure.",
                  "examples": [
                    "the Saxon heptarchy, when seven kings put together did spell but one in effect"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To speak, to declaim. [9th–16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To tell; to relate; to teach.",
                  "examples": [
                    "As thro’ the caverns dim I wind,",
                    "Might I that legend find,",
                    "By fairies spelt in mystic rhymes,"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English spelen, from Old English spelian (“to represent, take or stand in the place of another, act as a representative of another”), akin to Middle English spale (“a rest or break”), Old English spala (“representative, substitute”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spell (plural spells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A shift (of work); (rare) a set of workers responsible for a specific turn of labour. [from 16th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) A definite period (of work or other activity). [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial) An indefinite period of time (usually with a qualifier); by extension, a relatively short distance. [from 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period of rest; time off. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(colloquial, US) A period of illness, or sudden interval of bad spirits, disease etc. [from 19th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(cricket) An uninterrupted series of alternate overs bowled by a single bowler. [from 20th c.]",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "spell (third-person singular simple present spells, present participle spelling, simple past and past participle spelled or spelt)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To work in place of (someone).",
                  "examples": [
                    "to spell the helmsman"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To rest (someone or something), to give someone or something a rest or break.",
                  "examples": [
                    "They spelled the horses and rested in the shade of some trees near a brook."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, colloquial) To rest from work for a time.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Origin uncertain; perhaps a form of speld."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "spell (plural spells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dialectal) A splinter, usually of wood; a spelk.",
                  "examples": [
                    "To swadle a bowe much about wyth bandes, verye seldome dothe anye good, excepte it be to kepe downe a spel in the backe."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The wooden bat in the game of trap ball, or knurr and spell.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}