{
  "word": "average",
  "etymologies": [
    {
      "description": [
        "From Middle French avarie, from Old French avarie, from Old Italian avaria (which is possibly from Arabic عَوَارِيَّة‎ (ʕawāriyya, “damaged goods”), from عَوَار‎ (ʕawār, “fault, blemish, defect, flaw”), from عَوِرَ‎ (ʕawira, “to lose an eye”)) + English suffix -age."
      ],
      "adjectives": [
        {
          "description": "average (comparative more average, superlative most average)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(not comparable) Constituting or relating to the average.",
                  "examples": [
                    "The average age of the participants was 18.5."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Neither very good nor very bad; rated somewhere in the middle of all others in the same category.",
                  "examples": [
                    "I soon found I was only an average chess player."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Typical.",
                  "examples": [
                    "We tend to think that exceptionally attractive men and women are outstanding but the fact is that they are more average than most."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Not outstanding, not good, banal; bad or poor.",
                  "examples": [
                    "The graphics, sound, and most everything else are all very average. However, the main thing that brings this game down are the controls - they feel very clumsy and awkward at times."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [
        {
          "description": "average (plural averages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(mathematics) The arithmetic mean.",
                  "examples": [
                    "The average of 10, 20 and 24 is (10 + 20 + 24)/3 = 18."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) Any measure of central tendency, especially any mean, the median, or the mode. [from c. 1735]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(law, marine) Financial loss due to damage to transported goods; compensation for damage or loss. [from 15th c.]",
                  "examples": [
                    "Historically, the courts have allowed a general average claim only where the loss occurred as a result of the ship being in immediate peril. […] The court awarded the carrier the general average claim. It noted that “a ship′s master should not be discouraged from taking timely action to avert a disaster,” and need not be in actual peril to claim general average."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Customs duty or similar charge payable on transported goods.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Proportional or equitable distribution of financial expense.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(sports) An indication of a player's ability calculated from his scoring record, etc.",
                  "examples": [
                    "batting average"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "average (third-person singular simple present averages, present participle averaging, simple past and past participle averaged)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To compute the average of, especially the arithmetic mean.",
                  "examples": [
                    "If you average 10, 20 and 24, you get 18."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) Over a period of time or across members of a population, to have or generate a mean value of.",
                  "examples": [
                    "The daily high temperature last month averaged 15°C.",
                    "I averaged 75% in my examinations this year."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To divide among a number, according to a given proportion.",
                  "examples": [
                    "to average a loss"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To be, generally or on average.",
                  "examples": [
                    "Gulls average much larger than terns, with stouter build  […]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English average, from Medieval Latin averagium, from aver (“horse or other beast of burden, service required from the same”) from Old English eafor (“obligation to carry goods and convey messages for one's lord”) from aferian (“to remove, take away”); + -age."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "average (plural averages)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(UK, law, obsolete) The service that a tenant owed his lord, to be done by the animals of the tenant, such as the transportation of wheat, turf, etc.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}