{
  "word": "emperor",
  "etymologies": [
    {
      "description": [
        "From Middle English emperour, borrowed from Anglo-Norman emperour and Old French empereor (Modern French empereur), from Latin imperātor (“emperor; commander”), from imperāre (“to command”). Doublet of imperator."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "emperor (plural emperors)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The male monarch or ruler of an empire.",
                  "examples": [
                    "They asked Julius Caesar, the valiant Roman emperor, what was the best death. He answered, that which is unexpected, which comes suddenly and unforeseen"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any monarch ruling an empire, irrespective of gender, with \"empress\" contrasting to mean the consort of an emperor.",
                  "examples": [
                    "In 690 Wu usurped the throne and became Emperor herself, which proved a unique event in the history of China."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(political theory) Specifically, the ruler of the Holy Roman Empire; the world-monarch.",
                  "examples": [
                    "The Investiture Controversy was a conflict between the Emperor and the Pope."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tarot) The fourth trump or major arcana card of the tarot deck.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A large, relatively valuable marble in children's games.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any fish of the family Lethrinidae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various butterflies of the subfamily Charaxinae.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(entomology) Any of various large dragonflies of the cosmopolitan genus Anax.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An emperor penguin.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}