{
  "word": "pride",
  "etymologies": [
    {
      "description": [
        "From Middle English pride, from Old English prȳde, prȳte (“pride”) (compare Old Norse prýði (“bravery, pomp”)), derivative of Old English prūd (“proud”). More at proud. The verb derives from the noun, at least since the 12th century."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pride (countable and uncountable, plural prides)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The quality or state of being proud; an unreasonable overestimation of one's own superiority in terms of talents, looks, wealth, importance etc., which manifests itself in lofty airs, distance, reserve and often contempt of others.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(having a positive sense, often with of or in) A sense of one's own worth, and scorn for what is beneath or unworthy of oneself; lofty self-respect; noble self-esteem; elevation of character; dignified bearing; rejection of shame",
                  "examples": [
                    "He took pride in his work.",
                    "He had pride of ownership in his department."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Proud or disdainful behavior or treatment; insolence or arrogance of demeanor; haughty bearing and conduct; insolent exultation.",
                  "examples": [
                    "Synonyms: disdain, hubris"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "That of which one is proud; that which excites boasting or self-congratulation; the occasion or ground of self-esteem, or of arrogant and presumptuous confidence, as beauty, ornament, noble character, children, etc.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Show; ostentation; glory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Highest pitch; elevation reached; loftiness; prime; glory.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Consciousness of power; fullness of animal spirits; mettle; wantonness.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Lust; sexual desire; especially, excitement of sexual appetite in a female animal.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, collective) A company of lions or other large felines.",
                  "examples": [
                    "A pride of lions often consists of a dominant male, his harem and their offspring, but young adult males 'leave home' to roam about as bachelors pride until able to seize/establish a family pride of their own."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology) The small European lamprey species Petromyzon branchialis.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Alternative letter-case form of Pride (“festival for LGBT people”).",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "pride (third-person singular simple present prides, present participle priding, simple past and past participle prided)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(reflexive) To take or experience pride in something; to be proud of it.",
                  "examples": [
                    "I pride myself on being a good judge of character."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}