{
  "word": "pell",
  "etymologies": [
    {
      "description": [
        "From Latin pellis (“animal skin, pelt”), from Proto-Italic *pelnis, from Proto-Indo-European *pel-ni-. Distantly related to fell and film."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "pell (plural pells)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fur or hide.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A lined cloak or its lining.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A roll of parchment; a record kept on parchment.",
                  "examples": [
                    "The clerk of the pell (whose office is in the Lord Treasurer′s gift) keepeth the Pells in parchment, called Pelles Receptæ, wherein every teller′s bill, with his name on it, is to be entred; and under every such bill when it is entred, recordatur to be written in open court, for a controlment to charge the teller with so much money as in the said bill is set downe.",
                    "He also anciently kept another pell, called Pellis Exitus, wherein every dayes issuing of any the moneys paid into the receipt, was to be entered, and by whom and by what warrant, privy seale, or bill, it was paid."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Sussex) A body of water somewhere between a pond and a lake in size.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An upright post, often padded and covered in hide, used to practice strikes with bladed weapons such as swords or glaives.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "pell (third-person singular simple present pells, present participle pelling, simple past and past participle pelled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To pelt; to knock about.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}