{
  "word": "grame",
  "etymologies": [
    {
      "description": [
        "From Middle English grame, gram, grome, from Old English grama (“rage, anger, trouble, devil, demon”), from Proto-Germanic *gramô (“anger”), *gramaz (“fiend, enemy”), from Proto-Indo-European *gʰrem- (“to rub, grind, scrape”). Cognate with Middle Low German gram (“anger”), German Gram (“grief, sorrow”), Old Danish gram (“devil”), Icelandic gramir, gröm (“fiends, demons”). Related to gram (“angry”, adj), grim."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "grame (uncountable)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Anger; wrath; scorn; bitterness; repugnance.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Sorrow; grief; misery.",
                  "examples": [
                    "to save the from the Blameof all my greffe & grame"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English gramen, gramien, from Old English gramian, gremian (“to anger, enrage”), from Proto-Germanic *gramjaną (“to grill, vex, irritate, grieve”), from Proto-Indo-European *gʰrem- (“to rub, grind, scrape”). Cognate with German grämen (“to grieve”), Danish græmme (“to grieve”), Swedish gräma (“to grieve, mortify, vex”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "grame (third-person singular simple present grames, present participle graming, simple past and past participle gramed)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, obsolete) To vex; grill; make angry or sorry.",
                  "examples": [
                    "Men may leave all games, / That sailën to St James; / For many a man it grames / When they begin to sail.",
                    "For when they have take the sea, / At Sandwich, or at Winchelsea, / At Bristol, or where that it may be, / Their hearts begin to fail."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, obsolete) To grieve; to be sorry; to fret; to be vexed or displeased.",
                  "examples": [
                    "The crane and the curlewe thereat gan to grame."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}