{
  "word": "minister",
  "etymologies": [
    {
      "description": [
        "From Middle English ministre, from Old French ministre, from Latin minister (“an attendant, servant, assistant, a priest's assistant or other under official”), from minor (“less”) + -ter; see minor. Doublet of Minorite."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "minister (plural ministers)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A person who is trained to preach, to perform religious ceremonies, and to afford pastoral care at a Protestant church.",
                  "examples": [
                    "The minister said a prayer on behalf of the entire congregation."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A politician who heads a ministry (national or regional government department for public service).",
                  "examples": [
                    "He was newly appointed to be Minister of the Interior.",
                    "Synonyms: see Thesaurus:government minister"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "In diplomacy, the rank of diplomat directly below ambassador.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A servant; a subordinate; an officer or assistant of inferior rank; hence, an agent, an instrument.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Inherited from Middle English mynystren, from Middle French ministrer, from Old French menistrer, ministrer and Latin ministrō, from minister."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "minister (third-person singular simple present ministers, present participle ministering, simple past and past participle ministered)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To attend to (the needs of); to tend; to take care (of); to give aid; to give service.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "to function as a clergyman or as the officiant in church worship",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, archaic) To afford, to give, to supply.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}