{
  "word": "bead",
  "etymologies": [
    {
      "description": [
        "From Middle English bede (“a prayer”), also “a bead for counting prayers” in a peire of bedes (literally “a pair of beads”), from Old English bedu, bed, ġebed (“a request, entreaty, prayer”), from Proto-West Germanic *bedu, *bed, *gabed, from Proto-Germanic *bedō, *bedą.",
        "Cognate with Dutch gebed and bede, German Gebet."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bead (plural beads)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) Prayer, later especially with a rosary. [from 9thc.]",
                  "examples": [
                    "That he must believe in the Pope;—go to Mass;—cross himself;—tell his beads;—be a good Catholick, and that this, in all conscience, was enough to carry him to heaven."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Each in a string of small balls making up the rosary or paternoster. [from 14thc.]",
                  "examples": []
                }
              ]
            },
            {
              "group": "A small, round object.",
              "entries": [
                {
                  "meaning": "A small, round object with a hole to allow it to be threaded on a cord or wire, particularly for decorative purposes. [from 15thc.]",
                  "examples": []
                },
                {
                  "meaning": "Various small, round solid objects.",
                  "examples": []
                },
                {
                  "meaning": "A small drop of water or other liquid. [from 16thc.]",
                  "examples": [
                    "beads of sweat"
                  ]
                },
                {
                  "meaning": "A bubble, in spirits.",
                  "examples": []
                },
                {
                  "meaning": "A small, round ball at the end of a barrel of a gun used for aiming.",
                  "examples": [
                    "She drew a bead on the target and fired."
                  ]
                },
                {
                  "meaning": "(by extension) Knowledge sufficient to direct one's activities to a purpose.",
                  "examples": [
                    "We now have a bead on the main technical issues for the project"
                  ]
                }
              ]
            },
            {
              "group": "(heading) A ridge, band, or molding.",
              "entries": [
                {
                  "meaning": "A rigid edge of a tire that mounts it on a wheel; tire bead. [from 20thc.]",
                  "examples": []
                },
                {
                  "meaning": "(architecture) A narrow molding with semicircular section.",
                  "examples": [
                    "Synonym: beading"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chemistry, dated) A glassy drop of molten flux, as borax or microcosmic salt, used as a solvent and color test for several mineral earths and oxides, as of iron, manganese, etc., before the blowpipe.",
                  "examples": [
                    "the borax bead;  the iron bead, etc."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bead (third-person singular simple present beads, present participle beading, simple past and past participle beaded)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To form into a bead.",
                  "examples": [
                    "The raindrops beaded on the car's waxed finish."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To apply beads to.",
                  "examples": [
                    "She spent the morning beading the gown."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To form into a bead.",
                  "examples": [
                    "He beaded some solder for the ends of the wire."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To cause beads to form on (something).",
                  "examples": [
                    "Only the hum of the miserable creatures stirred the heavy murk that beaded our foreheads with sweat as we pushed our way through it."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}