{
  "word": "cohort",
  "etymologies": [
    {
      "description": [
        "From Latin cohors (stem cohort-); borrowed into Old English as coorta, but reintroduced into Middle English as cōhort and chōors via Old French cohorte. Doublet of court."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "cohort (plural cohorts)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A group of people supporting the same thing or person.",
                  "examples": [
                    "Coyness and caprice have in consequence become a heritage of the sex, together with a cohort of allied weaknesses and petty deceits, that men have come to think venial, and even amiable, in women, but which they would not tolerate among themselves."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(statistics) A demographic grouping of people, especially those in a defined age group, or having a common characteristic.",
                  "examples": [
                    "The 18-24 cohort shows a sharp increase in automobile fatalities over the proximate age groupings."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Ancient Rome, military) Any division of a Roman legion, normally of about 500 or 600 men (equalling about six centuries).",
                  "examples": [
                    "Three cohorts of men were assigned to the region.",
                    "Holonym: legion",
                    "Meronyms: maniple, century"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An accomplice; abettor; associate.",
                  "examples": [
                    "He was able to plea down his sentence by revealing the names of three of his cohorts, as well as the source of the information."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any band or body of warriors.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(taxonomy) A natural group of orders of organisms, less comprehensive than a class.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A colleague.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A set of individuals in a program, especially when compared to previous sets of individuals within the same program.",
                  "examples": [
                    "The students in my cohort for my organic chemistry class this year are not up to snuff. Last year's cohort scored much higher averages on the mid-term."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "cohort (third-person singular simple present cohorts, present participle cohorting, simple past and past participle cohorted)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To associate with such a group",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}