{
  "word": "mastic",
  "etymologies": [
    {
      "description": [
        "From Middle English mastik, from Old French mastic, from Latin mastiche, from Ancient Greek μαστίχη (mastíkhē), from μαστιχάω (mastikháō, “I chew”) (note the chewing gum sense). Related to masticate."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "mastic (countable and uncountable, plural mastics)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An evergreen shrub or small tree, Pistacia lentiscus (mastic tree), native to the Mediterranean.",
                  "examples": [
                    "The island of Scio is now called by the Greeks Kio [Χιο], the antient Greek name of it was Chios [Χιος]; it was first called Ætalia in very antient times, and also Mastic, on account of the great number of mastic trees that were in this island."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A hard, brittle, aromatic and transparent resin produced by this tree and used to make varnishes and chewing gum, and as a flavouring.",
                  "examples": [
                    "The mastic, of which the people of Scio gather every year an incredible quantity, is a very rich gum, made use of in medicines, which distils from a shrub called, in Latin, Lentiscus."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An alcoholic liquor flavoured with this resin.",
                  "examples": [
                    "He took a list from the desk and read aloud Fatima’s offerings:—  […]  four bottles of rare mastic from Scio."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A flexible, waterproof cement used as an adhesive, sealant or filler.",
                  "examples": [
                    "‘They have a few holes here and there. A few. Tiny tiny.’ ‘We could fix those up easy. Mastic cement. Not expensive, boss.’"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}