{
  "word": "fantasia",
  "etymologies": [
    {
      "description": [
        "Borrowed from Italian fantasia (“imagination, fancy, fantasy; musical composition with improvisational characteristics”), from Latin phantasia (“fancy, fantasy; imagination”), borrowed from Ancient Greek φᾰντᾰσῐ́ᾱ (phantasíā, “appearance, look; display, presentation; pageantry, pomp; impression, perception; image”), from φᾰ́ντᾰσῐς (phántasis) + -ῐ́ᾱ (-íā, suffix forming feminine abstract nouns). Φᾰ́ντᾰσῐς (Phántasis) is derived from φᾰντᾰ́ζω (phantázō, “to make visible, show; to become visible, appear; to imagine”), from φαίνω (phaínō, “to appear; to reveal; to shine”), ultimately from Proto-Indo-European *bʰeh₂- (“to shine”). The English word is a doublet of fancy, fantasy, phantasia, and phantasy."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "fantasia (plural fantasias)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music, also figurative) A form of instrumental composition with a free structure and improvisational characteristics; specifically, one combining a number of well-known musical pieces. [from early 18th c.]",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly art, by extension) Any work which is unstructured or comprises other works of different genres or styles.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A traditional festival of the inhabitants of the Maghreb (in northwest Africa) featuring exhibitions of horsemanship.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}