{
  "word": "unseat",
  "etymologies": [
    {
      "description": [
        "From un- +‎ seat (“to provide with a place to sit”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "unseat (third-person singular simple present unseats, present participle unseating, simple past and past participle unseated)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To remove or dislodge from a seat (especially referring to horse riding).",
                  "examples": [
                    "Hyponym: unhorse",
                    "The frightened horse reared up and unseated its rider.",
                    "I was unseated from my bike after hitting an unexpected pothole."
                  ]
                }
              ]
            },
            {
              "group": "(transitive, figuratively)",
              "entries": [
                {
                  "meaning": "To remove from some (especially political) position or office; to dethrone.",
                  "examples": [
                    "Synonyms: oust, depose, overthrow",
                    "Antonyms: install, appoint, enthrone, empower",
                    "After having lost her seat to a Tory, she succeeded in unseating him in the next general election.",
                    "India has recently unseated China as the world's most populous country."
                  ]
                },
                {
                  "meaning": "To cause something to be removed or replaced in its role; to displace, overturn.",
                  "examples": [
                    "Synonyms: oust, supplant, supersede",
                    "Antonyms: confirm, preserve",
                    "The Michelson-Morley experiment prompted scientists to unseat their belief in the luminiferous aether.",
                    "Printed newspapers are gradually being unseated by digital publications."
                  ]
                },
                {
                  "meaning": "To upset the composure of (in various ways); to astound, shock, or unsettle.",
                  "examples": [
                    "Hyponyms: confound, vex, unnerve, disturb, discompose",
                    "The Matrix (1999) utterly unseated audiences around the world with its mind-blowing plot twist.",
                    "I was somewhat unseated by the strange noises outside my window."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, technical) To come out or off of a seat.",
                  "examples": [
                    "We replaced the screws, since the old ones unseated too easily."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}