{
  "word": "turtle",
  "etymologies": [
    {
      "description": [
        "Modification of Middle English tortou, tortu, from Old French tortüe (under the influence of Middle English turtel, turtur (“turtledove”), see Etymology 2 below), from Medieval Latin tortuca (compare Spanish tortuga), the same source of tortoise (see there for more). Displaced native Old English byrdling."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turtle (plural turtles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, US, Canada) Any land or marine reptile of the order Testudines, characterised by a protective shell enclosing its body. See also tortoise.",
                  "examples": [
                    "Synonyms: (obsolete) shellpad, (archaic) shield-toad"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(zoology, Australia, Britain, specifically) A marine reptile of that order.",
                  "examples": [
                    "Synonym: sea turtle"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(military, historical) An Ancient Roman attack method, where the shields held by the soldiers hide them, not only left, right, front and back, but also from above.",
                  "examples": [
                    "Synonym: testudo"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) A type of robot having a domed case (and so resembling the reptile), used in education, especially for making line drawings by means of a computer program.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing) An on-screen cursor that serves the same function as a turtle for drawing.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(printing, historical) The curved plate in which the form is held in a type-revolving cylinder press.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(computing theory) A small element towards the end of a list of items to be bubble sorted, and thus tending to take a long time to be swapped into its correct position. Compare rabbit.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(dance) A breakdancing move consisting of a float during which the dancer's weight shifts from one hand to the other, producing rotation or a circular \"walk\".",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(television) A low stand for a lamp etc.",
                  "examples": [
                    "Using an appropriate turtle allows the full range of pan and tilt adjustments on the luminaire and avoids possible heat damage to floor coverings."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "turtle (third-person singular simple present turtles, present participle turtling, simple past and past participle turtled)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To flip over onto the back or top; to turn upside down.",
                  "examples": [
                    "Were speeding when car turtled  […] Auto crashed into curb and turtled."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To move along slowly.",
                  "examples": [
                    "We turtled along in Manitoba, back into the heart of the prairies."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To turn and swim upside down.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To hunt turtles, especially in the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, board games) To build up a large defense force and strike only occasionally, rather than going for an offensive strategy.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English turtle, tortle, turtel, turtul, from Old English turtle, turtla (“turtledove”), ultimately from Latin turtur (“turtledove”), of imitative origin."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "turtle (plural turtles)",
          "definitionGroups": [
            {
              "group": null,
              "entries": []
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(now rare, archaic) A turtle dove.",
                  "examples": [
                    "As the turtle, every day has been a black day with her since her husband died, and what should we unruly members make here?"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}