{
  "word": "supposititious",
  "etymologies": [
    {
      "description": [
        "Borrowed from Latin suppositīcius, from the participle stem of suppono."
      ],
      "adjectives": [
        {
          "description": "supposititious (comparative more supposititious, superlative most supposititious)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Spurious; substituted for the genuine, counterfeit; fake.",
                  "examples": [
                    "[...] the said pretended Testament was supposititious, & contriued by such as meant to defraud both the heires female of the said king Henrie the 8. as well as these of his eldest sister [...]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Imaginary; fictitious, pretended to exist.",
                  "examples": [
                    "His good sense had pointed out to him the artifices of the monks, and the gross absurdity of their miracles, wonders, and supposititious reliques."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Supposed or hypothetical.",
                  "examples": [
                    "England produces practically no food, but great quantities of coal, steel and manufactured goods. Isolate her absolutely, and she will not only starve, but will stop producing manufactured goods, steel and coal, because those who usually produce these things will be getting nothing for their labor except money which they will be unable to use to buy dinners, because there will be no dinners to buy. That supposititious case is a precise parallel to what has happened in Russia. [Note: The UK edition reads “that suppositious case.”]"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}