{
  "word": "bean",
  "etymologies": [
    {
      "description": [
        "From Middle English bene, from Old English bēan, from Proto-West Germanic *baunu, from Proto-Germanic *baunō (“bean”), from Proto-Indo-European *bʰabʰ- (“bean”). Cognate with Scots bene, bein (“bean”), West Frisian bean (“bean”), Dutch boon (“bean”), German Bohne (“bean”), Danish bønne (“bean”), Norwegian bønne (“bean”), Icelandic baun (“bean”), Latin faba (“bean”), Russian боб (bob, “bean”), Serbo-Croatian бо̏б/bȍb. Doublet of fava."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "bean (plural beans)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any plant of several genera of the taxonomic family Fabaceae that produces large edible seeds or edible seedpods.",
                  "examples": [
                    "Beans are a large group of leguminous vegetables that serve as a main source of proteins in human diet. This group comprises several species and some of them are Adzuki bean (Vigna angularis); Broad bean (Vicia faba); Cluster bean (Cyamposis tetragonoloba); French bean (Phaseolus vulgaris); […] ."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The large edible seed of such a plant (for example, a broad bean, navy bean, or garbanzo bean).",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The edible seedpod of such a plant.",
                  "examples": [
                    "Green beans, also called French beans, can be pickled and made into pickled beans."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) The bean-like seed of certain other plants, such a a vanilla bean or (especially) a coffee bean.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(by extension) An object resembling a pea or bean in shape, often made from plastic or styrofoam and used in large numbers as packing material or as stuffing for beanbags and similar items.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The head or brain.",
                  "examples": [
                    "Now, there was a perfectly sound forecast for you. Certainly a case of using the old bean. The surmise was perfectly logical."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang) The clitoris.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, often endearing) A person.",
                  "examples": [
                    "Sparky is a good bean, even if he is a carpet-bagging bean at that."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, archaic) A guinea coin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(Britain, slang, chiefly in the negative) Money.",
                  "examples": [
                    "I haven't got a bean."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(software) Clipping of JavaBean.",
                  "examples": [
                    "„AppletInitializer Methods in this interface are used to initialize Beans that are also applets.“"
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "bean (third-person singular simple present beans, present participle beaning, simple past and past participle beaned)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(chiefly baseball) To hit deliberately with a projectile, especially in the head.",
                  "examples": [
                    "The pitcher beaned the batter, rather than letting him hit another home run."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}