{
  "word": "enclosure",
  "etymologies": [
    {
      "description": [
        "From Middle English enclosure, from Old French enclosure, from enclore, from Latin inclūdere, inclūdō, from in- (“in”) + claudō (“to shut”), ultimately from Proto-Indo-European *kleh₂u- (“key, hook, nail”). Alike to inclusion."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "enclosure (countable and uncountable, plural enclosures)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) Something enclosed, i.e. inserted into a letter or similar package.",
                  "examples": [
                    "There was an enclosure with the letter — a photo."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of enclosing, i.e. the insertion or inclusion of an item in a letter or package.",
                  "examples": [
                    "The enclosure of a photo with your letter is appreciated."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(countable) An area, domain, or amount of something partially or entirely enclosed by barriers.",
                  "examples": [
                    "He faced punishment for creating the fenced enclosure in a public park.",
                    "The glass enclosure holds the mercury vapor.",
                    "The winning horse was first into the unsaddling enclosure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) The act of separating and surrounding an area, domain, or amount of something with a barrier.",
                  "examples": [
                    "The enclosure of public land is against the law.",
                    "The experiment requires the enclosure of mercury vapor in a glass tube.",
                    "At first, untrained horses resist enclosure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, by extension) The act of restricting access to ideas, works of art or technologies using patents or intellectual property laws.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable, British History) The post-feudal process of subdivision of common lands for individual ownership.",
                  "examples": [
                    "Strip-farming disappeared after enclosure."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(religion) The area of a convent, monastery, etc where access is restricted to community members.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}