{
  "word": "specialize",
  "etymologies": [
    {
      "description": [
        "special +‎ -ize"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "specialize (third-person singular simple present specializes, present participle specializing, simple past and past participle specialized) (American spelling, Oxford British English)",
          "definitionGroups": [
            {
              "group": "To make distinct or separate from what is what is common, particularly:",
              "entries": [
                {
                  "meaning": "(obsolete, intransitive) To go into specific details.",
                  "examples": []
                },
                {
                  "meaning": "(rare, transitive) To specify: to mention specifically.",
                  "examples": [
                    "Our Sauiour specialising and nominating the places in which these false prophets should teach his presence to be."
                  ]
                },
                {
                  "meaning": "(uncommon, transitive) To narrow in scope.",
                  "examples": []
                },
                {
                  "meaning": "(biology, transitive) To make distinct or separate due to form or function.",
                  "examples": [
                    "In the lowest orders of being, we find these functions very much blended together, and several of them apparently performed by one simple apparatus ; but in proportion as we rise in the scale, we perceive that they are specialized, or separated from each other, and that a complicated set of organs is appropriated to each of them."
                  ]
                }
              ]
            },
            {
              "group": "(intransitive) To become distinct or separate from what is common, particularly:",
              "entries": [
                {
                  "meaning": "To focus one's study upon a particular skill, field, topic, or genre. [from late 19th c.]",
                  "examples": []
                },
                {
                  "meaning": "To focus one's business upon a particular item or service.",
                  "examples": [
                    "Firms... which have specialised in the manufacture of ‘heavies’..."
                  ]
                },
                {
                  "meaning": "(usually derogatory) To be known or notorious for some specialty.",
                  "examples": [
                    "Watson specializes in adiposeness; none of his chorus beauties may be considered featherweights."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    }
  ]
}