{
  "word": "hold",
  "etymologies": [
    {
      "description": [
        "From Middle English holden, from Old English healdan, from Proto-West Germanic *haldan, from Proto-Germanic *haldaną (“to tend, herd”), maybe from Proto-Indo-European *kel- (“to drive”).",
        "Compare Latin celer (“quick”), Tocharian B käl- (“to goad, drive”), Ancient Greek κέλλω (kéllō, “to drive”), Sanskrit कलयति (kalayati, “to impel”). Cognate to West Frisian hâlde, Low German holden, holen, Dutch houden, German halten, Danish and Norwegian Bokmål holde, Norwegian Nynorsk halda."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hold (plural holds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A grasp or grip.",
                  "examples": [
                    "Keep a firm hold on the handlebars."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An act or instance of holding.",
                  "examples": [
                    "Can I have a hold of the baby?"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A place where animals are held for safety",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "An order that something is to be reserved or delayed, limiting or preventing how it can be dealt with.",
                  "examples": [
                    "Senator X placed a hold on the bill, then went to the library and placed a hold on a book."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Something reserved or kept.",
                  "examples": [
                    "We have a hold here for you."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Power over someone or something.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The ability to persist.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The property of maintaining the shape of styled hair.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(wrestling) A position or grip used to control the opponent.",
                  "examples": [
                    "He got him in a tight hold and pinned him to the mat."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(exercise) An exercise involving holding a position for a set time",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) The percentage the house wins on a gamble, the house or bookmaker's hold.",
                  "examples": [
                    "The House Hold on the game is 10,000, this is the amount of decision or risk the house wishes to assume."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(gambling) The wager amount, the total hold.",
                  "examples": [
                    "As of Monday night the total Melbourne Cup hold was $848,015"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis) An instance of holding one's service game, as opposed to being broken.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The part of an object one is intended to grasp, or anything one can use for grasping with hands or feet.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A fruit machine feature allowing one or more of the reels to remain fixed while the others spin.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(video games, dated) A pause facility.",
                  "examples": [
                    "A hold facility is available; H holds, and S restarts."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The queueing system on telephones and similar communication systems which maintains a connection when all lines are busy.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(baseball) A statistic awarded to a relief pitcher who is not still pitching at the end of the game and who records at least one out and maintains a lead for his team.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) A region of airspace reserved for aircraft being kept in a holding pattern.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "hold (third-person singular simple present holds, present participle holding, simple past held, past participle held or (archaic) holden)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To grasp or grip.",
                  "examples": [
                    "Hold the pencil like this."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To contain or store.",
                  "examples": [
                    "This package holds six bottles."
                  ]
                }
              ]
            },
            {
              "group": "(heading) To maintain or keep to a position or state.",
              "entries": [
                {
                  "meaning": "(transitive) To have and keep possession of something.",
                  "examples": [
                    "Hold my coat for me.  The general ordered the colonel to hold his position at all costs."
                  ]
                },
                {
                  "meaning": "(transitive) To reserve.",
                  "examples": [
                    "Hold a table for us at 7:00."
                  ]
                },
                {
                  "meaning": "(transitive) To cause to wait or delay.",
                  "examples": [
                    "Hold the elevator."
                  ]
                },
                {
                  "meaning": "(transitive) To detain.",
                  "examples": [
                    "Hold the suspect in this cell."
                  ]
                },
                {
                  "meaning": "(intransitive, copulative) To be or remain valid; to apply (usually in the third person).",
                  "examples": [
                    "to hold true;  The proposition holds."
                  ]
                },
                {
                  "meaning": "(intransitive, copulative) To keep oneself in a particular state.",
                  "examples": [
                    "to hold firm"
                  ]
                },
                {
                  "meaning": "(transitive) To impose restraint upon; to limit in motion or action; to bind legally or morally; to confine; to restrain.",
                  "examples": [
                    "Death! what do'st? O, hold thy blow."
                  ]
                },
                {
                  "meaning": "(transitive) To bear, carry, or manage.",
                  "examples": [
                    "He holds himself proudly erect.  Hold your head high."
                  ]
                },
                {
                  "meaning": "(intransitive, chiefly imperative) Not to move; to halt; to stop.",
                  "examples": []
                },
                {
                  "meaning": "(intransitive) Not to give way; not to part or become separated; to remain unbroken or unsubdued.",
                  "examples": []
                },
                {
                  "meaning": "To remain continent; to control an excretory bodily function.",
                  "examples": [
                    "to hold one's bladder;  to hold one's breath"
                  ]
                }
              ]
            },
            {
              "group": "(heading) To maintain or keep to particular opinions, promises, actions.",
              "entries": [
                {
                  "meaning": "(transitive) To maintain, to consider, to opine.",
                  "examples": [
                    "We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness."
                  ]
                },
                {
                  "meaning": "(transitive) To bind (someone) to a consequence of his or her actions.",
                  "examples": [
                    "He was held responsible for the actions of those under his command.  I'll hold him to that promise."
                  ]
                },
                {
                  "meaning": "To maintain in being or action; to carry on; to prosecute, as a course of conduct or an argument; to continue; to sustain.",
                  "examples": []
                },
                {
                  "meaning": "To accept, as an opinion; to be the adherent of, openly or privately; to persist in, as a purpose; to maintain; to sustain.",
                  "examples": [
                    "Stand fast and hold the traditions which ye have been taught."
                  ]
                },
                {
                  "meaning": "(archaic) To restrain oneself; to refrain; to hold back.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(tennis, transitive, intransitive) To win one's own service game.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To take place, to occur.",
                  "examples": [
                    "He came into the hall where the wedding-festival had held […]."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To organise an event or meeting (usually in passive voice).",
                  "examples": [
                    "Elections will be held on the first Sunday of next month."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(archaic) To derive right or title.",
                  "examples": [
                    "His imagination holds immediately from nature."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(imperative) In a food or drink order at an informal restaurant etc., requesting that a component normally included in that order be omitted.",
                  "examples": [
                    "One ham-and-cheese sandwich; hold the mustard.",
                    "A martini, please, and hold the olive."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(slang, intransitive) To be in possession of illicit drugs for sale.",
                  "examples": [
                    "[…]  first thing clients would say to me would be 'Are you holding?' I'd say yes if we had our supply and no if it was dangerous."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "Alteration (due to hold) of hole. Cognate with Dutch hol (“hole, cave, den, cavity, cargo hold”), Dutch holte (“cavity, hollow, den”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "hold (plural holds)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical, aviation) The cargo area of a ship or aircraft (often holds or cargo hold).",
                  "examples": [
                    "We watched our luggage being loaded into the hold of the plane."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    },
    {
      "description": [
        "From Middle English hold, holde, from Old English hold (“gracious, friendly, kind, favorable, true, faithful, loyal, devout, acceptable, pleasant”), from Proto-Germanic *hulþaz (“favourable, gracious, loyal”), from Proto-Indo-European *kel- (“to tend, incline, bend, tip”).",
        "Cognate with German hold (“gracious, friendly, sympathetic, grateful”), Danish and Swedish huld (“fair, kindly, gracious”), Icelandic hollur (“faithful, dedicated, loyal”), German Huld (“grace, favour”)."
      ],
      "adjectives": [
        {
          "description": "hold (comparative more hold, superlative most hold)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Gracious; friendly; faithful; true.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [],
      "letter": [],
      "number": []
    }
  ]
}