{
  "word": "noise",
  "etymologies": [
    {
      "description": [
        "From Middle English noyse, noise, from Old French noise (“a dispute, wrangle, strife, noise”), of uncertain origin. According to some, from Latin nausia, nausea (“disgust, nausea”); according to others, from Latin noxia (“hurt, harm, damage, injury”); but neither explanation is satisfactory in regard to either form or sense."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "noise (countable and uncountable, plural noises)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(uncountable) Various sounds, usually unwanted or unpleasant.",
                  "examples": [
                    "He knew that it was trash day, when the garbage collectors made all the noise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Any sound.",
                  "examples": [
                    "The sudden noise made everyone jump.",
                    "She crept up behind him not making a noise."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Sound or signal generated by random fluctuations.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(technology) Any part of a signal or data that reduces the clarity, precision, or quality of the desired output.",
                  "examples": [
                    "signal-to-noise ratio"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figurative, by extension) Unwanted fuss or bustle; useless activity.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(genetics) The measured level of variation in gene expression among cells, regardless of source, within a supposedly identical population.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "Rumour or complaint.",
                  "examples": [
                    "The problems with the new computer system are causing a lot of noise at Head Office."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(informal) Speech that is suggestive of an attitude or opinion.",
                  "examples": [
                    "Despite encouraging noises made by politicians from time to time, the two sides there have never been further from an agreement."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) Music, in general; a concert; also, a company of musicians; a band.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(music) A genre of rock music that uses static and other non-musical sounds, also influenced by art rock.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": [
        {
          "description": "noise (third-person singular simple present noises, present participle noising, simple past and past participle noised)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) To make a noise; to sound.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) To spread news of; to spread as rumor or gossip.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}