{
  "word": "wake",
  "etymologies": [
    {
      "description": [
        "A merger of two verbs of similar form and meaning:"
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [],
      "prepositions": [],
      "verbs": [
        {
          "description": "wake (third-person singular simple present wakes, present participle waking, simple past woke or waked, past participle woken or waked or (now colloquial) woke)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive) (often followed by up) To stop sleeping.",
                  "examples": [
                    "I woke up at four o'clock this morning."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive) (often followed by up) To make somebody stop sleeping; to rouse from sleep.",
                  "examples": [
                    "The neighbour's car alarm woke me from a strange dream."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(transitive, figurative) To put in motion or action; to arouse; to excite.",
                  "examples": [
                    "Even Richard's crusade woke little interest in his island realm."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(intransitive, figurative) To be excited or roused up; to be stirred up from a dormant, torpid, or inactive state; to be active.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To watch, or sit up with, at night, as a dead body.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "To be or remain awake; not to sleep.",
                  "examples": [
                    "I cannot think any time, waking or sleeping, without being sensible of it."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To be alert; to keep watch",
                  "examples": [
                    "Command unto the guards that they diligently wake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(obsolete) To sit up late for festive purposes; to hold a night revel.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "description": [
        "From Middle English wake, from Old English wacu, from Proto-Germanic *wakō."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wake (plural wakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(often obsolete or poetic) The act of waking, or state of being awake.",
                  "examples": [
                    "Singing her flatteries to my morning wake."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The state of forbearing sleep, especially for solemn or festive purposes; a vigil.",
                  "examples": [
                    "The warlike wakes continued all the night,  And funeral games played at new returning light."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A period after a person's death before or after the body is buried, cremated, etc.; in some cultures accompanied by a party and/or collectively sorting through the deceased's personal effects.",
                  "examples": [
                    "Where any person has died whilst being, or suspected of being, a case or carrier or contact of an infectious disease, the Director may by order prohibit the conduct of a wake over the body of that person or impose such conditions as he thinks fit on the conduct of such wake  […]"
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(historical, Church of England) A yearly parish festival formerly held in commemoration of the dedication of a church. Originally, prayers were said on the evening preceding, and hymns were sung during the night, in the church; subsequently, these vigils were discontinued, and the day itself, often with succeeding days, was occupied in rural pastimes and exercises, attended by eating and drinking.",
                  "examples": [
                    "Great solemnities were made in all churches, and great fairs and wakes throughout all England."
                  ]
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "A number of vultures assembled together.",
                  "examples": []
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    },
    {
      "description": [
        "Probably from Middle Low German or Middle Dutch wake, from or akin to Old Norse vǫk (“a hole in the ice”) ( > Danish våge, Icelandic vök), from Proto-Germanic *wakwō (“wetness”), from Proto-Indo-European *wegʷ- (“moist, wet”)."
      ],
      "adjectives": [],
      "adverbs": [],
      "nouns": [
        {
          "description": "wake (plural wakes)",
          "definitionGroups": [
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(nautical) The path left behind a ship on the surface of the water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "The movement of water created when an animal or a person moves through water.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(aviation) The turbulent air left behind a flying aircraft.",
                  "examples": []
                }
              ]
            },
            {
              "group": null,
              "entries": [
                {
                  "meaning": "(figuratively) The area behind something, typically a rapidly-moving object.",
                  "examples": [
                    "This effect followed immediately in the wake of his earliest exertions."
                  ]
                }
              ]
            }
          ]
        }
      ],
      "prepositions": [],
      "verbs": []
    }
  ]
}